{
  "book": "genesis",
  "chapter": 10,
  "verses": [
    {
      "reference": "Genesis 10:1",
      "book": "Genesis",
      "chapter": 10,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "This is the account of Shem, Ham and Japheth, Noah’s sons, who themselves had sons after the flood."
        },
        {
          "version": "NLT",
          "text": "This is the account of the families of Shem, Ham, and Japheth, the three sons of Noah. Many children were born to them after the great flood."
        },
        {
          "version": "ESV",
          "text": "These are the generations of the sons of Noah, Shem, Ham, and Japheth. Sons were born to them after the flood."
        },
        {
          "version": "NKJV",
          "text": "Now this is the genealogy of the sons of Noah: Shem, Ham, and Japheth. And sons were born to them after the flood."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:4-28",
          "text": "The sons of Noah: Shem, Ham, and Japheth. / The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras. / The sons of Gomer: Ashkenaz, Riphath, and Togarmah. ..."
        },
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Genesis 9:18-19",
          "text": "The sons of Noah who came out of the ark were Shem, Ham, and Japheth. And Ham was the father of Canaan. / These three were the sons of Noah, and from them the whole earth was populated."
        },
        {
          "reference": "Genesis 11:10-32",
          "text": "This is the account of Shem. Two years after the flood, when Shem was 100 years old, he became the father of Arphaxad. / And after he had become the father of Arphaxad, Shem lived 500 years and had other sons and daughters. / When Arphaxad was 35 years old, he became the father of Shelah. ..."
        },
        {
          "reference": "Luke 3:23-38",
          "text": "Jesus Himself was about thirty years old when He began His ministry. He was regarded as the son of Joseph, the son of Heli, / the son of Matthat, the son of Levi, the son of Melchi, the son of Jannai, the son of Joseph, / the son of Mattathias, the son of Amos, the son of Nahum, the son of Esli, the son of Naggai, ..."
        },
        {
          "reference": "1 Chronicles 1:1-3",
          "text": "Adam, Seth, Enosh, / Kenan, Mahalalel, Jared, / Enoch, Methuselah, Lamech, Noah."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "Romans 1:3",
          "text": "regarding His Son, who was a descendant of David according to the flesh,"
        },
        {
          "reference": "Genesis 5:32",
          "text": "After Noah was 500 years old, he became the father of Shem, Ham, and Japheth."
        },
        {
          "reference": "Genesis 6:10",
          "text": "And Noah had three sons: Shem, Ham, and Japheth."
        },
        {
          "reference": "Genesis 9:1",
          "text": "And God blessed Noah and his sons and said to them, “Be fruitful and multiply and fill the earth."
        },
        {
          "reference": "Genesis 9:7",
          "text": "But as for you, be fruitful and multiply; spread out across the earth and multiply upon it.”"
        },
        {
          "reference": "Genesis 11:1-9",
          "text": "Now the whole world had one language and a common form of speech. / And as people journeyed eastward, they found a plain in the land of Shinar and settled there. / And they said to one another, “Come, let us make bricks and bake them thoroughly.” So they used brick instead of stone, and tar instead of mortar. ..."
        },
        {
          "reference": "1 Chronicles 1:34",
          "text": "Abraham was the father of Isaac. The sons of Isaac: Esau and Israel."
        },
        {
          "reference": "1 Chronicles 1:5-7",
          "text": "The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras. / The sons of Gomer: Ashkenaz, Riphath, and Togarmah. / And the sons of Javan: Elishah, Tarshish, the Kittites, and the Rodanites."
        }
      ]
    },
    {
      "reference": "Genesis 10:2",
      "book": "Genesis",
      "chapter": 10,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshek and Tiras."
        },
        {
          "version": "NLT",
          "text": "The descendants of Japheth were Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras."
        },
        {
          "version": "ESV",
          "text": "The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras."
        },
        {
          "version": "NKJV",
          "text": "The sons of Japheth were Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:5-7",
          "text": "The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras. / The sons of Gomer: Ashkenaz, Riphath, and Togarmah. / And the sons of Javan: Elishah, Tarshish, the Kittites, and the Rodanites."
        },
        {
          "reference": "Ezekiel 27:13",
          "text": "Javan, Tubal, and Meshech were your merchants. They exchanged slaves and bronze utensils for your merchandise."
        },
        {
          "reference": "Ezekiel 38:2-3",
          "text": "“Son of man, set your face against Gog of the land of Magog, the chief prince of Meshech and Tubal. Prophesy against him / and declare that this is what the Lord GOD says: Behold, I am against you, O Gog, chief prince of Meshech and Tubal."
        },
        {
          "reference": "Ezekiel 39:6",
          "text": "I will send fire on Magog and on those who dwell securely in the coastlands, and they will know that I am the LORD."
        },
        {
          "reference": "Isaiah 66:19",
          "text": "I will establish a sign among them, and I will send survivors from among them to the nations—to Tarshish, Put, and the archers of Lud; to Tubal, Javan, and the islands far away who have not heard of My fame or seen My glory. So they will proclaim My glory among the nations."
        },
        {
          "reference": "Jeremiah 51:27",
          "text": "“Raise a banner in the land! Blow the ram’s horn among the nations! Prepare the nations against her. Summon the kingdoms against her—Ararat, Minni, and Ashkenaz. Appoint a captain against her; bring up horses like swarming locusts."
        },
        {
          "reference": "Acts 2:9-11",
          "text": "Parthians, Medes, and Elamites; residents of Mesopotamia, Judea and Cappadocia, Pontus and Asia, / Phrygia and Pamphylia, Egypt and the parts of Libya near Cyrene; visitors from Rome, / both Jews and converts to Judaism; Cretans and Arabs—we hear them declaring the wonders of God in our own tongues!”"
        },
        {
          "reference": "Revelation 20:8",
          "text": "and will go out to deceive the nations in the four corners of the earth—Gog and Magog—to assemble them for battle. Their number is like the sand of the seashore."
        },
        {
          "reference": "Isaiah 60:9",
          "text": "Surely the islands will wait for Me, with the ships of Tarshish in the lead, to bring your children from afar, with their silver and gold, to the honor of the LORD your God, the Holy One of Israel, for He has glorified you."
        },
        {
          "reference": "Isaiah 23:1",
          "text": "This is the burden against Tyre: Wail, O ships of Tarshish, for Tyre is laid waste, without house or harbor. Word has reached them from the land of Cyprus."
        },
        {
          "reference": "Isaiah 23:6",
          "text": "Cross over to Tarshish; wail, O inhabitants of the coastland!"
        },
        {
          "reference": "Isaiah 23:10",
          "text": "Cultivate your land like the Nile, O Daughter of Tarshish; there is no longer a harbor."
        },
        {
          "reference": "Isaiah 23:13",
          "text": "Look at the land of the Chaldeans—a people now of no account. The Assyrians destined it for the desert creatures; they set up their siege towers and stripped its palaces. They brought it to ruin."
        },
        {
          "reference": "1 Kings 10:22",
          "text": "For the king had the ships of Tarshish at sea with Hiram’s fleet, and once every three years the ships of Tarshish would arrive bearing gold, silver, ivory, apes, and peacocks."
        },
        {
          "reference": "Jonah 1:3",
          "text": "Jonah, however, got up to flee to Tarshish, away from the presence of the LORD. He went down to Joppa and found a ship bound for Tarshish. So he paid the fare and went aboard to sail for Tarshish, away from the presence of the LORD."
        }
      ]
    },
    {
      "reference": "Genesis 10:3",
      "book": "Genesis",
      "chapter": 10,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Gomer: Ashkenaz, Riphath and Togarmah."
        },
        {
          "version": "NLT",
          "text": "The descendants of Gomer were Ashkenaz, Riphath, and Togarmah."
        },
        {
          "version": "ESV",
          "text": "The sons of Gomer: Ashkenaz, Riphath, and Togarmah."
        },
        {
          "version": "NKJV",
          "text": "The sons of Gomer were Ashkenaz, Riphath, and Togarmah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:6",
          "text": "The sons of Gomer: Ashkenaz, Riphath, and Togarmah."
        },
        {
          "reference": "Ezekiel 38:6",
          "text": "as well as Gomer with all its troops, and Beth-togarmah from the far north with all its troops—the many nations with you."
        },
        {
          "reference": "Ezekiel 27:14",
          "text": "The men of Beth-togarmah exchanged horses, war horses, and mules for your wares."
        },
        {
          "reference": "Ezekiel 32:26",
          "text": "Meshech and Tubal are there with all their multitudes, with their graves all around them. All of them are uncircumcised, slain by the sword, because they spread their terror in the land of the living."
        },
        {
          "reference": "Isaiah 66:19",
          "text": "I will establish a sign among them, and I will send survivors from among them to the nations—to Tarshish, Put, and the archers of Lud; to Tubal, Javan, and the islands far away who have not heard of My fame or seen My glory. So they will proclaim My glory among the nations."
        },
        {
          "reference": "Jeremiah 51:27",
          "text": "“Raise a banner in the land! Blow the ram’s horn among the nations! Prepare the nations against her. Summon the kingdoms against her—Ararat, Minni, and Ashkenaz. Appoint a captain against her; bring up horses like swarming locusts."
        },
        {
          "reference": "Zechariah 9:13",
          "text": "For I will bend Judah as My bow and fit it with Ephraim. I will rouse your sons, O Zion, against the sons of Greece. I will make you like the sword of a mighty man."
        },
        {
          "reference": "Acts 2:9",
          "text": "Parthians, Medes, and Elamites; residents of Mesopotamia, Judea and Cappadocia, Pontus and Asia,"
        },
        {
          "reference": "Colossians 3:11",
          "text": "Here there is no Greek or Jew, circumcised or uncircumcised, barbarian, Scythian, slave, or free, but Christ is all and is in all."
        },
        {
          "reference": "Revelation 20:8",
          "text": "and will go out to deceive the nations in the four corners of the earth—Gog and Magog—to assemble them for battle. Their number is like the sand of the seashore."
        },
        {
          "reference": "1 Peter 1:1",
          "text": "Peter, an apostle of Jesus Christ, To the elect who are exiles of the Dispersion throughout Pontus, Galatia, Cappadocia, Asia, and Bithynia, chosen"
        },
        {
          "reference": "Romans 1:14",
          "text": "I am obligated both to Greeks and non-Greeks, both to the wise and the foolish."
        },
        {
          "reference": "Galatians 3:28",
          "text": "There is neither Jew nor Greek, slave nor free, male nor female, for you are all one in Christ Jesus."
        },
        {
          "reference": "Ephesians 2:11-13",
          "text": "Therefore remember that formerly you who are Gentiles in the flesh and called uncircumcised by the so-called circumcision (that done in the body by human hands)— / remember that at that time you were separate from Christ, alienated from the commonwealth of Israel, and strangers to the covenants of the promise, without hope and without God in the world. / But now in Christ Jesus you who once were far away have been brought near through the blood of Christ."
        },
        {
          "reference": "Acts 16:6",
          "text": "After the Holy Spirit had prevented them from speaking the word in the province of Asia, they traveled through the region of Phrygia and Galatia."
        }
      ]
    },
    {
      "reference": "Genesis 10:4",
      "book": "Genesis",
      "chapter": 10,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Javan: Elishah, Tarshish, the Kittites and the Rodanites."
        },
        {
          "version": "NLT",
          "text": "The descendants of Javan were Elishah, Tarshish, Kittim, and Rodanim."
        },
        {
          "version": "ESV",
          "text": "The sons of Javan: Elishah, Tarshish, Kittim, and Dodanim."
        },
        {
          "version": "NKJV",
          "text": "The sons of Javan were Elishah, Tarshish, Kittim, and Dodanim."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:7",
          "text": "And the sons of Javan: Elishah, Tarshish, the Kittites, and the Rodanites."
        },
        {
          "reference": "Ezekiel 27:12",
          "text": "Tarshish was your merchant because of your great wealth of goods; they exchanged silver, iron, tin, and lead for your wares."
        },
        {
          "reference": "Ezekiel 27:25",
          "text": "The ships of Tarshish carried your merchandise. And you were filled with heavy cargo in the heart of the sea."
        },
        {
          "reference": "Isaiah 23:1",
          "text": "This is the burden against Tyre: Wail, O ships of Tarshish, for Tyre is laid waste, without house or harbor. Word has reached them from the land of Cyprus."
        },
        {
          "reference": "Isaiah 23:6",
          "text": "Cross over to Tarshish; wail, O inhabitants of the coastland!"
        },
        {
          "reference": "Isaiah 23:10",
          "text": "Cultivate your land like the Nile, O Daughter of Tarshish; there is no longer a harbor."
        },
        {
          "reference": "Jeremiah 2:10",
          "text": "Cross over to the coasts of Cyprus and take a look; send to Kedar and consider carefully; see if there has ever been anything like this:"
        },
        {
          "reference": "Jeremiah 25:22",
          "text": "all the kings of Tyre and Sidon; the kings of the coastlands across the sea;"
        },
        {
          "reference": "Jeremiah 47:4",
          "text": "For the day has come to destroy all the Philistines, to cut off from Tyre and Sidon every remaining ally. Indeed, the LORD is about to destroy the Philistines, the remnant from the coasts of Caphtor."
        },
        {
          "reference": "Amos 1:9",
          "text": "This is what the LORD says: “For three transgressions of Tyre, even four, I will not revoke My judgment, because they delivered up a whole congregation of exiles to Edom and broke a covenant of brotherhood."
        },
        {
          "reference": "Amos 1:10",
          "text": "So I will send fire upon the walls of Tyre to consume its citadels.”"
        },
        {
          "reference": "Zechariah 9:2",
          "text": "and also against Hamath, which borders it, as well as Tyre and Sidon, though they are very shrewd."
        },
        {
          "reference": "Matthew 11:21-22",
          "text": "“Woe to you, Chorazin! Woe to you, Bethsaida! For if the miracles that were performed in you had been performed in Tyre and Sidon, they would have repented long ago in sackcloth and ashes. / But I tell you, it will be more bearable for Tyre and Sidon on the day of judgment than for you."
        },
        {
          "reference": "Matthew 15:21",
          "text": "Leaving that place, Jesus withdrew to the district of Tyre and Sidon."
        },
        {
          "reference": "Mark 3:8",
          "text": "Jerusalem, Idumea, the region beyond the Jordan, and the vicinity of Tyre and Sidon. The large crowd came to Him when they heard what great things He was doing."
        }
      ]
    },
    {
      "reference": "Genesis 10:5",
      "book": "Genesis",
      "chapter": 10,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "(From these the maritime peoples spread out into their territories by their clans within their nations, each with its own language.)"
        },
        {
          "version": "NLT",
          "text": "Their descendants became the seafaring peoples that spread out to various lands, each identified by its own language, clan, and national identity."
        },
        {
          "version": "ESV",
          "text": "From these the coastland peoples spread in their lands, each with his own language, by their clans, in their nations."
        },
        {
          "version": "NKJV",
          "text": "From these the coastland peoples of the Gentiles were separated into their lands, everyone according to his language, according to their families, into their nations."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "Revelation 17:15",
          "text": "Then the angel said to me, “The waters you saw, where the prostitute was seated, are peoples and multitudes and nations and tongues."
        },
        {
          "reference": "Isaiah 66:18",
          "text": "“And I, knowing their deeds and thoughts, am coming to gather all nations and tongues, and they will come and see My glory."
        },
        {
          "reference": "Ezekiel 27:8-9",
          "text": "The men of Sidon and Arvad were your oarsmen. Your men of skill, O Tyre, were there as your captains. / The elders of Gebal were aboard as shipwrights, repairing your leaks. All the ships of the sea and their sailors came alongside to barter for your merchandise."
        },
        {
          "reference": "Psalm 72:10",
          "text": "May the kings of Tarshish and distant shores bring tribute; may the kings of Sheba and Seba offer gifts."
        },
        {
          "reference": "Jeremiah 25:22",
          "text": "all the kings of Tyre and Sidon; the kings of the coastlands across the sea;"
        },
        {
          "reference": "1 Chronicles 1:5-7",
          "text": "The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras. / The sons of Gomer: Ashkenaz, Riphath, and Togarmah. / And the sons of Javan: Elishah, Tarshish, the Kittites, and the Rodanites."
        },
        {
          "reference": "Isaiah 11:10-12",
          "text": "On that day the Root of Jesse will stand as a banner for the peoples. The nations will seek Him, and His place of rest will be glorious. / On that day the Lord will extend His hand a second time to recover the remnant of His people from Assyria, from Egypt, from Pathros, from Cush, from Elam, from Shinar, from Hamath, and from the islands of the sea. / He will raise a banner for the nations and gather the exiles of Israel; He will collect the scattered of Judah from the four corners of the earth."
        },
        {
          "reference": "Zephaniah 2:11",
          "text": "The LORD will be terrifying to them when He starves all the gods of the earth. Then the nations of every shore will bow in worship to Him, each in its own place."
        },
        {
          "reference": "Isaiah 42:4",
          "text": "He will not grow weak or discouraged before He has established justice on the earth. In His law the islands will put their hope.”"
        },
        {
          "reference": "Isaiah 49:6",
          "text": "He says: “It is not enough for You to be My Servant, to raise up the tribes of Jacob, and to restore the protected ones of Israel. I will also make You a light for the nations, to bring My salvation to the ends of the earth.”"
        },
        {
          "reference": "Matthew 28:19",
          "text": "Therefore go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit,"
        },
        {
          "reference": "Romans 15:12",
          "text": "And once more, Isaiah says: “The Root of Jesse will appear, One who will arise to rule over the Gentiles; in Him the Gentiles will put their hope.”"
        },
        {
          "reference": "Acts 2:5-11",
          "text": "Now there were dwelling in Jerusalem God-fearing Jews from every nation under heaven. / And when this sound rang out, a crowd came together in bewilderment, because each one heard them speaking his own language. / Astounded and amazed, they asked, “Are not all these who are speaking Galileans? ..."
        }
      ]
    },
    {
      "reference": "Genesis 10:6",
      "book": "Genesis",
      "chapter": 10,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Ham: Cush, Egypt, Put and Canaan."
        },
        {
          "version": "NLT",
          "text": "The descendants of Ham were Cush, Mizraim, Put, and Canaan."
        },
        {
          "version": "ESV",
          "text": "The sons of Ham: Cush, Egypt, Put, and Canaan."
        },
        {
          "version": "NKJV",
          "text": "The sons of Ham were Cush, Mizraim, Put, and Canaan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:8-10",
          "text": "The sons of Ham: Cush, Mizraim, Put, and Canaan. / The sons of Cush: Seba, Havilah, Sabta, Raamah, and Sabteca. The sons of Raamah: Sheba and Dedan. / Cush was the father of Nimrod, who began to be a mighty one on the earth."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Numbers 26:58-59",
          "text": "These were the families of the Levites: The Libnite clan, the Hebronite clan, the Mahlite clan, the Mushite clan, and the Korahite clan. Now Kohath was the father of Amram, / and Amram’s wife was named Jochebed. She was also a daughter of Levi, born to Levi in Egypt. To Amram she bore Aaron, Moses, and their sister Miriam."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "Psalm 78:51",
          "text": "He struck all the firstborn of Egypt, the virility in the tents of Ham."
        },
        {
          "reference": "Psalm 105:23",
          "text": "Then Israel entered Egypt; Jacob dwelt in the land of Ham."
        },
        {
          "reference": "Isaiah 11:11",
          "text": "On that day the Lord will extend His hand a second time to recover the remnant of His people from Assyria, from Egypt, from Pathros, from Cush, from Elam, from Shinar, from Hamath, and from the islands of the sea."
        },
        {
          "reference": "Jeremiah 46:9",
          "text": "Advance, O horses! Race furiously, O chariots! Let the warriors come forth—Cush and Put carrying their shields, men of Lydia drawing the bow."
        },
        {
          "reference": "Ezekiel 30:4-5",
          "text": "A sword will come against Egypt, and there will be anguish in Cush when the slain fall in Egypt, its wealth is taken away, and its foundations are torn down. / Cush, Put, and Lud, and all the various peoples, as well as Libya and the men of the covenant land, will fall with Egypt by the sword."
        },
        {
          "reference": "Amos 9:7",
          "text": "“Are you not like the Cushites to Me, O children of Israel?” declares the LORD. “Did I not bring Israel up from the land of Egypt, the Philistines from Caphtor, and the Arameans from Kir?"
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Romans 9:17",
          "text": "For the Scripture says to Pharaoh: “I raised you up for this very purpose, that I might display My power in you, and that My name might be proclaimed in all the earth.”"
        },
        {
          "reference": "1 Corinthians 10:1-2",
          "text": "I do not want you to be unaware, brothers, that our forefathers were all under the cloud, and that they all passed through the sea. / They were all baptized into Moses in the cloud and in the sea."
        },
        {
          "reference": "Galatians 4:24-25",
          "text": "These things serve as illustrations, for the women represent two covenants. One covenant is from Mount Sinai and bears children into slavery: This is Hagar. / Now Hagar stands for Mount Sinai in Arabia and corresponds to the present-day Jerusalem, because she is in slavery with her children."
        },
        {
          "reference": "Ephesians 2:11-12",
          "text": "Therefore remember that formerly you who are Gentiles in the flesh and called uncircumcised by the so-called circumcision (that done in the body by human hands)— / remember that at that time you were separate from Christ, alienated from the commonwealth of Israel, and strangers to the covenants of the promise, without hope and without God in the world."
        }
      ]
    },
    {
      "reference": "Genesis 10:7",
      "book": "Genesis",
      "chapter": 10,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Cush: Seba, Havilah, Sabtah, Raamah and Sabteka. The sons of Raamah: Sheba and Dedan."
        },
        {
          "version": "NLT",
          "text": "The descendants of Cush were Seba, Havilah, Sabtah, Raamah, and Sabteca. The descendants of Raamah were Sheba and Dedan."
        },
        {
          "version": "ESV",
          "text": "The sons of Cush: Seba, Havilah, Sabtah, Raamah, and Sabteca. The sons of Raamah: Sheba and Dedan."
        },
        {
          "version": "NKJV",
          "text": "The sons of Cush were Seba, Havilah, Sabtah, Raamah, and Sabtechah; and the sons of Raamah were Sheba and Dedan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:9",
          "text": "The sons of Cush: Seba, Havilah, Sabta, Raamah, and Sabteca. The sons of Raamah: Sheba and Dedan."
        },
        {
          "reference": "Isaiah 43:3",
          "text": "For I am the LORD your God, the Holy One of Israel, your Savior; I give Egypt for your ransom, Cush and Seba in your place."
        },
        {
          "reference": "Ezekiel 30:4-5",
          "text": "A sword will come against Egypt, and there will be anguish in Cush when the slain fall in Egypt, its wealth is taken away, and its foundations are torn down. / Cush, Put, and Lud, and all the various peoples, as well as Libya and the men of the covenant land, will fall with Egypt by the sword."
        },
        {
          "reference": "Ezekiel 27:22",
          "text": "The merchants of Sheba and Raamah traded with you; for your wares they exchanged gold, the finest of all spices, and precious stones."
        },
        {
          "reference": "Ezekiel 38:5",
          "text": "Persia, Cush, and Put will accompany them, all with shields and helmets,"
        },
        {
          "reference": "Jeremiah 46:9",
          "text": "Advance, O horses! Race furiously, O chariots! Let the warriors come forth—Cush and Put carrying their shields, men of Lydia drawing the bow."
        },
        {
          "reference": "Psalm 72:10",
          "text": "May the kings of Tarshish and distant shores bring tribute; may the kings of Sheba and Seba offer gifts."
        },
        {
          "reference": "Isaiah 60:6",
          "text": "Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD."
        },
        {
          "reference": "Isaiah 45:14",
          "text": "This is what the LORD says: “The products of Egypt and the merchandise of Cush, along with the Sabeans, men of stature, will come over to you and will be yours; they will trudge behind you; they will come over in chains and bow down to you. They will confess to you: ‘God is indeed with you, and there is no other; there is no other God.’”"
        },
        {
          "reference": "Isaiah 18:1-2",
          "text": "Woe to the land of whirring wings, along the rivers of Cush, / which sends couriers by sea, in papyrus vessels on the waters. Go, swift messengers, to a people tall and smooth-skinned, to a people widely feared, to a powerful nation of strange speech, whose land is divided by rivers."
        },
        {
          "reference": "Acts 8:27",
          "text": "So he started out, and on his way he met an Ethiopian eunuch, a court official in charge of the entire treasury of Candace, queen of the Ethiopians. He had gone to Jerusalem to worship,"
        },
        {
          "reference": "Matthew 12:42",
          "text": "The Queen of the South will rise at the judgment with this generation and condemn it; for she came from the ends of the earth to hear the wisdom of Solomon, and now One greater than Solomon is here."
        },
        {
          "reference": "Acts 2:10",
          "text": "Phrygia and Pamphylia, Egypt and the parts of Libya near Cyrene; visitors from Rome,"
        },
        {
          "reference": "Acts 13:1",
          "text": "Now in the church at Antioch there were prophets and teachers: Barnabas, Simeon called Niger, Lucius of Cyrene, Manaen (who had been brought up with Herod the tetrarch), and Saul."
        },
        {
          "reference": "Revelation 18:13",
          "text": "of cinnamon, spice, incense, myrrh, and frankincense; of wine, olive oil, fine flour, and wheat; of cattle, sheep, horses, and carriages; of bodies and souls of slaves."
        }
      ]
    },
    {
      "reference": "Genesis 10:8",
      "book": "Genesis",
      "chapter": 10,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "Cush was the father of Nimrod, who became a mighty warrior on the earth."
        },
        {
          "version": "NLT",
          "text": "Cush was also the ancestor of Nimrod, who was the first heroic warrior on earth."
        },
        {
          "version": "ESV",
          "text": "Cush fathered Nimrod; he was the first on earth to be a mighty man."
        },
        {
          "version": "NKJV",
          "text": "Cush begot Nimrod; he began to be a mighty one on the earth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 11:1-9",
          "text": "Now the whole world had one language and a common form of speech. / And as people journeyed eastward, they found a plain in the land of Shinar and settled there. / And they said to one another, “Come, let us make bricks and bake them thoroughly.” So they used brick instead of stone, and tar instead of mortar. ..."
        },
        {
          "reference": "Micah 5:6",
          "text": "And they will rule the land of Assyria with the sword, and the land of Nimrod with the blade drawn. So He will deliver us when Assyria invades our land and marches into our borders."
        },
        {
          "reference": "1 Chronicles 1:10",
          "text": "Cush was the father of Nimrod, who began to be a mighty one on the earth."
        },
        {
          "reference": "Isaiah 10:9",
          "text": "“Is not Calno like Carchemish? Is not Hamath like Arpad? Is not Samaria like Damascus?"
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Jeremiah 50:23",
          "text": "How the hammer of the whole earth lies broken and shattered! What a horror Babylon has become among the nations!"
        },
        {
          "reference": "Jeremiah 51:58",
          "text": "This is what the LORD of Hosts says: “Babylon’s thick walls will be leveled, and her high gates consumed by fire. So the labor of the people will be for nothing; the nations will exhaust themselves to fuel the flames.”"
        },
        {
          "reference": "Nahum 3:1-4",
          "text": "Woe to the city of blood, full of lies, full of plunder, never without prey. / The crack of the whip, the rumble of the wheel, galloping horse and bounding chariot! / Charging horseman, flashing sword, shining spear; heaps of slain, mounds of corpses, dead bodies without end—they stumble over their dead— ..."
        },
        {
          "reference": "Zechariah 5:11",
          "text": "“To build a house for it in the land of Shinar,” he told me. “And when it is ready, the basket will be set there on its pedestal.”"
        },
        {
          "reference": "Revelation 18:2",
          "text": "And he cried out in a mighty voice: “Fallen, fallen is Babylon the great! She has become a lair for demons and a haunt for every unclean spirit, every unclean bird, and every detestable beast."
        },
        {
          "reference": "Revelation 17:5",
          "text": "And on her forehead a mysterious name was written: BABYLON THE GREAT, THE MOTHER OF PROSTITUTES AND OF THE ABOMINATIONS OF THE EARTH."
        },
        {
          "reference": "Revelation 14:8",
          "text": "Then a second angel followed, saying, “Fallen, fallen is Babylon the great, who has made all the nations drink the wine of the passion of her immorality.”"
        },
        {
          "reference": "Revelation 18:10",
          "text": "In fear of her torment, they will stand at a distance and cry out: “Woe, woe to the great city, the mighty city of Babylon! For in a single hour your judgment has come.”"
        },
        {
          "reference": "Revelation 18:21",
          "text": "Then a mighty angel picked up a stone the size of a great millstone and cast it into the sea, saying: “With such violence the great city of Babylon will be cast down, never to be seen again."
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        }
      ]
    },
    {
      "reference": "Genesis 10:9",
      "book": "Genesis",
      "chapter": 10,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "He was a mighty hunter before the LORD; that is why it is said, “Like Nimrod, a mighty hunter before the LORD.”"
        },
        {
          "version": "NLT",
          "text": "Since he was the greatest hunter in the world, his name became proverbial. People would say, “This man is like Nimrod, the greatest hunter in the world.”"
        },
        {
          "version": "ESV",
          "text": "He was a mighty hunter before the LORD. Therefore it is said, “Like Nimrod a mighty hunter before the LORD.”"
        },
        {
          "version": "NKJV",
          "text": "He was a mighty hunter before the LORD; therefore it is said, “Like Nimrod the mighty hunter before the LORD.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 10:8",
          "text": "Cush was the father of Nimrod, who began to be a mighty one on the earth."
        },
        {
          "reference": "Genesis 11:1-9",
          "text": "Now the whole world had one language and a common form of speech. / And as people journeyed eastward, they found a plain in the land of Shinar and settled there. / And they said to one another, “Come, let us make bricks and bake them thoroughly.” So they used brick instead of stone, and tar instead of mortar. ..."
        },
        {
          "reference": "1 Chronicles 1:10",
          "text": "Cush was the father of Nimrod, who began to be a mighty one on the earth."
        },
        {
          "reference": "Micah 5:6",
          "text": "And they will rule the land of Assyria with the sword, and the land of Nimrod with the blade drawn. So He will deliver us when Assyria invades our land and marches into our borders."
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Isaiah 14:4-6",
          "text": "you will sing this song of contempt against the king of Babylon: How the oppressor has ceased, and how his fury has ended! / The LORD has broken the staff of the wicked, the scepter of the rulers. / It struck the peoples in anger with unceasing blows; it subdued the nations in rage with relentless persecution."
        },
        {
          "reference": "Isaiah 14:12-15",
          "text": "How you have fallen from heaven, O day star, son of the dawn! You have been cut down to the ground, O destroyer of nations. / You said in your heart: “I will ascend to the heavens; I will raise my throne above the stars of God. I will sit on the mount of assembly, in the far reaches of the north. / I will ascend above the tops of the clouds; I will make myself like the Most High.” ..."
        },
        {
          "reference": "Jeremiah 50:23",
          "text": "How the hammer of the whole earth lies broken and shattered! What a horror Babylon has become among the nations!"
        },
        {
          "reference": "Jeremiah 51:20-23",
          "text": "“You are My war club, My weapon for battle. With you I shatter nations; with you I bring kingdoms to ruin. / With you I shatter the horse and rider; with you I shatter the chariot and driver. / With you I shatter man and woman; with you I shatter the old man and the youth; with you I shatter the young man and the maiden. ..."
        },
        {
          "reference": "Ezekiel 31:3-9",
          "text": "Look at Assyria, a cedar in Lebanon, with beautiful branches that shaded the forest. It towered on high; its top was among the clouds. / The waters made it grow; the deep springs made it tall, directing their streams all around its base and sending their channels to all the trees of the field. / Therefore it towered higher than all the trees of the field. Its branches multiplied, and its boughs grew long as it spread them out because of the abundant waters. ..."
        },
        {
          "reference": "Ezekiel 32:11-12",
          "text": "For this is what the Lord GOD says: ‘The sword of the king of Babylon will come against you! / I will make your hordes fall by the swords of the mighty, the most ruthless of all nations. They will ravage the pride of Egypt and all her multitudes will be destroyed."
        },
        {
          "reference": "Revelation 18:2",
          "text": "And he cried out in a mighty voice: “Fallen, fallen is Babylon the great! She has become a lair for demons and a haunt for every unclean spirit, every unclean bird, and every detestable beast."
        },
        {
          "reference": "Revelation 18:10",
          "text": "In fear of her torment, they will stand at a distance and cry out: “Woe, woe to the great city, the mighty city of Babylon! For in a single hour your judgment has come.”"
        },
        {
          "reference": "Revelation 18:21",
          "text": "Then a mighty angel picked up a stone the size of a great millstone and cast it into the sea, saying: “With such violence the great city of Babylon will be cast down, never to be seen again."
        },
        {
          "reference": "Revelation 17:5",
          "text": "And on her forehead a mysterious name was written: BABYLON THE GREAT, THE MOTHER OF PROSTITUTES AND OF THE ABOMINATIONS OF THE EARTH."
        }
      ]
    },
    {
      "reference": "Genesis 10:10",
      "book": "Genesis",
      "chapter": 10,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "The first centers of his kingdom were Babylon, Uruk, Akkad and Kalneh, in Shinar."
        },
        {
          "version": "NLT",
          "text": "He built his kingdom in the land of Babylonia, with the cities of Babylon, Erech, Akkad, and Calneh."
        },
        {
          "version": "ESV",
          "text": "The beginning of his kingdom was Babel, Erech, Accad, and Calneh, in the land of Shinar."
        },
        {
          "version": "NKJV",
          "text": "And the beginning of his kingdom was Babel, Erech, Accad, and Calneh, in the land of Shinar."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 17:5",
          "text": "And on her forehead a mysterious name was written: BABYLON THE GREAT, THE MOTHER OF PROSTITUTES AND OF THE ABOMINATIONS OF THE EARTH."
        },
        {
          "reference": "Micah 5:6",
          "text": "And they will rule the land of Assyria with the sword, and the land of Nimrod with the blade drawn. So He will deliver us when Assyria invades our land and marches into our borders."
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Jeremiah 50:21",
          "text": "Go up against the land of Merathaim, and against the residents of Pekod. Kill them and devote them to destruction. Do all that I have commanded you,” declares the LORD."
        },
        {
          "reference": "Jeremiah 51:58",
          "text": "This is what the LORD of Hosts says: “Babylon’s thick walls will be leveled, and her high gates consumed by fire. So the labor of the people will be for nothing; the nations will exhaust themselves to fuel the flames.”"
        },
        {
          "reference": "Zechariah 5:11",
          "text": "“To build a house for it in the land of Shinar,” he told me. “And when it is ready, the basket will be set there on its pedestal.”"
        },
        {
          "reference": "Isaiah 47:1",
          "text": "“Go down and sit in the dust, O Virgin Daughter of Babylon. Sit on the ground without a throne, O Daughter of the Chaldeans! For you will no longer be called tender or delicate."
        },
        {
          "reference": "Jeremiah 51:41",
          "text": "How Sheshach has been captured! The praise of all the earth has been seized. What a horror Babylon has become among the nations!"
        },
        {
          "reference": "Daniel 1:2",
          "text": "And the Lord delivered into his hand Jehoiakim king of Judah, along with some of the articles from the house of God. He carried these off to the land of Shinar, to the house of his god, where he put them in the treasury of his god."
        },
        {
          "reference": "Isaiah 14:4",
          "text": "you will sing this song of contempt against the king of Babylon: How the oppressor has ceased, and how his fury has ended!"
        },
        {
          "reference": "Jeremiah 50:2",
          "text": "“Announce and declare to the nations; lift up a banner and proclaim it; hold nothing back when you say, ‘Babylon is captured; Bel is put to shame; Marduk is shattered, her images are disgraced, her idols are broken in pieces.’"
        },
        {
          "reference": "Revelation 18:2",
          "text": "And he cried out in a mighty voice: “Fallen, fallen is Babylon the great! She has become a lair for demons and a haunt for every unclean spirit, every unclean bird, and every detestable beast."
        },
        {
          "reference": "Isaiah 21:9",
          "text": "Look, here come the riders, horsemen in pairs.” And one answered, saying: “Fallen, fallen is Babylon! All the images of her gods lie shattered on the ground!”"
        },
        {
          "reference": "Jeremiah 51:7",
          "text": "Babylon was a gold cup in the hand of the LORD, making the whole earth drunk. The nations drank her wine; therefore the nations have gone mad."
        },
        {
          "reference": "Revelation 14:8",
          "text": "Then a second angel followed, saying, “Fallen, fallen is Babylon the great, who has made all the nations drink the wine of the passion of her immorality.”"
        }
      ]
    },
    {
      "reference": "Genesis 10:11",
      "book": "Genesis",
      "chapter": 10,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "From that land he went to Assyria, where he built Nineveh, Rehoboth Ir, Calah"
        },
        {
          "version": "NLT",
          "text": "From there he expanded his territory to Assyria, building the cities of Nineveh, Rehoboth-ir, Calah,"
        },
        {
          "version": "ESV",
          "text": "From that land he went into Assyria and built Nineveh, Rehoboth-Ir, Calah, and"
        },
        {
          "version": "NKJV",
          "text": "From that land he went to Assyria and built Nineveh, Rehoboth Ir, Calah,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Micah 5:6",
          "text": "And they will rule the land of Assyria with the sword, and the land of Nimrod with the blade drawn. So He will deliver us when Assyria invades our land and marches into our borders."
        },
        {
          "reference": "Isaiah 10:9",
          "text": "“Is not Calno like Carchemish? Is not Hamath like Arpad? Is not Samaria like Damascus?"
        },
        {
          "reference": "Nahum 1:1",
          "text": "This is the burden against Nineveh, the book of the vision of Nahum the Elkoshite:"
        },
        {
          "reference": "Nahum 3:1-7",
          "text": "Woe to the city of blood, full of lies, full of plunder, never without prey. / The crack of the whip, the rumble of the wheel, galloping horse and bounding chariot! / Charging horseman, flashing sword, shining spear; heaps of slain, mounds of corpses, dead bodies without end—they stumble over their dead— ..."
        },
        {
          "reference": "Zephaniah 2:13",
          "text": "And He will stretch out His hand against the north and destroy Assyria; He will make Nineveh a desolation, as dry as a desert."
        },
        {
          "reference": "2 Kings 19:36-37",
          "text": "So Sennacherib king of Assyria broke camp and withdrew. He returned to Nineveh and stayed there. / One day, while he was worshiping in the temple of his god Nisroch, his sons Adrammelech and Sharezer put him to the sword and escaped to the land of Ararat. And his son Esar-haddon reigned in his place."
        },
        {
          "reference": "Isaiah 37:37-38",
          "text": "So Sennacherib king of Assyria broke camp and withdrew. He returned to Nineveh and stayed there. / One day, while he was worshiping in the temple of his god Nisroch, his sons Adrammelech and Sharezer put him to the sword and escaped to the land of Ararat. And his son Esar-haddon reigned in his place."
        },
        {
          "reference": "Jonah 1:1-2",
          "text": "Now the word of the LORD came to Jonah son of Amittai, saying, / “Get up! Go to the great city of Nineveh and preach against it, because its wickedness has come up before Me.”"
        },
        {
          "reference": "Jonah 3:1-4",
          "text": "Then the word of the LORD came to Jonah a second time: / “Get up! Go to the great city of Nineveh and proclaim to it the message that I give you.” / This time Jonah got up and went to Nineveh, in accordance with the word of the LORD. Now Nineveh was an exceedingly great city, requiring a three-day journey. ..."
        },
        {
          "reference": "Ezekiel 31:3-9",
          "text": "Look at Assyria, a cedar in Lebanon, with beautiful branches that shaded the forest. It towered on high; its top was among the clouds. / The waters made it grow; the deep springs made it tall, directing their streams all around its base and sending their channels to all the trees of the field. / Therefore it towered higher than all the trees of the field. Its branches multiplied, and its boughs grew long as it spread them out because of the abundant waters. ..."
        },
        {
          "reference": "Isaiah 14:24-27",
          "text": "The LORD of Hosts has sworn: “Surely, as I have planned, so will it be; as I have purposed, so will it stand. / I will break Assyria in My land; I will trample him on My mountain. His yoke will be taken off My people, and his burden removed from their shoulders.” / This is the plan devised for the whole earth, and this is the hand stretched out over all the nations. ..."
        },
        {
          "reference": "Isaiah 36:18-20",
          "text": "Do not let Hezekiah mislead you when he says, ‘The LORD will deliver us.’ Has the god of any nation ever delivered his land from the hand of the king of Assyria? / Where are the gods of Hamath and Arpad? Where are the gods of Sepharvaim? Have they delivered Samaria from my hand? / Who among all the gods of these lands has delivered his land from my hand? How then can the LORD deliver Jerusalem from my hand?”"
        },
        {
          "reference": "Isaiah 37:11-13",
          "text": "Surely you have heard what the kings of Assyria have done to all the other countries, devoting them to destruction. Will you then be spared? / Did the gods of the nations destroyed by my fathers rescue those nations—the gods of Gozan, Haran, and Rezeph, and of the people of Eden in Telassar? / Where are the kings of Hamath, Arpad, Sepharvaim, Hena, and Ivvah?’”"
        },
        {
          "reference": "2 Kings 18:33-35",
          "text": "Has the god of any nation ever delivered his land from the hand of the king of Assyria? / Where are the gods of Hamath and Arpad? Where are the gods of Sepharvaim, Hena, and Ivvah? Have they delivered Samaria from my hand? / Who among all the gods of these lands has delivered his land from my hand? How then can the LORD deliver Jerusalem from my hand?”"
        },
        {
          "reference": "2 Kings 19:11-13",
          "text": "Surely you have heard what the kings of Assyria have done to all the other countries, devoting them to destruction. Will you then be spared? / Did the gods of the nations destroyed by my fathers rescue those nations—the gods of Gozan, Haran, and Rezeph, and of the people of Eden in Telassar? / Where are the kings of Hamath, Arpad, Sepharvaim, Hena, and Ivvah?’”"
        }
      ]
    },
    {
      "reference": "Genesis 10:12",
      "book": "Genesis",
      "chapter": 10,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "and Resen, which is between Nineveh and Calah—which is the great city."
        },
        {
          "version": "NLT",
          "text": "and Resen (the great city located between Nineveh and Calah)."
        },
        {
          "version": "ESV",
          "text": "Resen between Nineveh and Calah; that is the great city."
        },
        {
          "version": "NKJV",
          "text": "and Resen between Nineveh and Calah (that is the principal city)."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Micah 5:6",
          "text": "And they will rule the land of Assyria with the sword, and the land of Nimrod with the blade drawn. So He will deliver us when Assyria invades our land and marches into our borders."
        },
        {
          "reference": "Isaiah 11:11",
          "text": "On that day the Lord will extend His hand a second time to recover the remnant of His people from Assyria, from Egypt, from Pathros, from Cush, from Elam, from Shinar, from Hamath, and from the islands of the sea."
        },
        {
          "reference": "Zephaniah 2:13",
          "text": "And He will stretch out His hand against the north and destroy Assyria; He will make Nineveh a desolation, as dry as a desert."
        },
        {
          "reference": "Nahum 3:1-7",
          "text": "Woe to the city of blood, full of lies, full of plunder, never without prey. / The crack of the whip, the rumble of the wheel, galloping horse and bounding chariot! / Charging horseman, flashing sword, shining spear; heaps of slain, mounds of corpses, dead bodies without end—they stumble over their dead— ..."
        },
        {
          "reference": "Isaiah 10:9",
          "text": "“Is not Calno like Carchemish? Is not Hamath like Arpad? Is not Samaria like Damascus?"
        },
        {
          "reference": "2 Kings 19:36-37",
          "text": "So Sennacherib king of Assyria broke camp and withdrew. He returned to Nineveh and stayed there. / One day, while he was worshiping in the temple of his god Nisroch, his sons Adrammelech and Sharezer put him to the sword and escaped to the land of Ararat. And his son Esar-haddon reigned in his place."
        },
        {
          "reference": "Isaiah 37:37-38",
          "text": "So Sennacherib king of Assyria broke camp and withdrew. He returned to Nineveh and stayed there. / One day, while he was worshiping in the temple of his god Nisroch, his sons Adrammelech and Sharezer put him to the sword and escaped to the land of Ararat. And his son Esar-haddon reigned in his place."
        },
        {
          "reference": "Jeremiah 50:18",
          "text": "Therefore this is what the LORD of Hosts, the God of Israel, says: “I will punish the king of Babylon and his land as I punished the king of Assyria."
        },
        {
          "reference": "Ezekiel 31:3-9",
          "text": "Look at Assyria, a cedar in Lebanon, with beautiful branches that shaded the forest. It towered on high; its top was among the clouds. / The waters made it grow; the deep springs made it tall, directing their streams all around its base and sending their channels to all the trees of the field. / Therefore it towered higher than all the trees of the field. Its branches multiplied, and its boughs grew long as it spread them out because of the abundant waters. ..."
        },
        {
          "reference": "Amos 6:2",
          "text": "Cross over to Calneh and see; go from there to the great Hamath; then go down to Gath of the Philistines. Are you better than these kingdoms? Is their territory larger than yours?"
        },
        {
          "reference": "Matthew 12:41",
          "text": "The men of Nineveh will stand at the judgment with this generation and condemn it; for they repented at the preaching of Jonah, and now One greater than Jonah is here."
        },
        {
          "reference": "Luke 11:32",
          "text": "The men of Nineveh will stand at the judgment with this generation and condemn it; for they repented at the preaching of Jonah, and now One greater than Jonah is here."
        },
        {
          "reference": "Acts 2:9-11",
          "text": "Parthians, Medes, and Elamites; residents of Mesopotamia, Judea and Cappadocia, Pontus and Asia, / Phrygia and Pamphylia, Egypt and the parts of Libya near Cyrene; visitors from Rome, / both Jews and converts to Judaism; Cretans and Arabs—we hear them declaring the wonders of God in our own tongues!”"
        },
        {
          "reference": "Revelation 18:2",
          "text": "And he cried out in a mighty voice: “Fallen, fallen is Babylon the great! She has become a lair for demons and a haunt for every unclean spirit, every unclean bird, and every detestable beast."
        },
        {
          "reference": "Revelation 17:5",
          "text": "And on her forehead a mysterious name was written: BABYLON THE GREAT, THE MOTHER OF PROSTITUTES AND OF THE ABOMINATIONS OF THE EARTH."
        }
      ]
    },
    {
      "reference": "Genesis 10:13",
      "book": "Genesis",
      "chapter": 10,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "Egypt was the father of the Ludites, Anamites, Lehabites, Naphtuhites,"
        },
        {
          "version": "NLT",
          "text": "Mizraim was the ancestor of the Ludites, Anamites, Lehabites, Naphtuhites,"
        },
        {
          "version": "ESV",
          "text": "Egypt fathered Ludim, Anamim, Lehabim, Naphtuhim,"
        },
        {
          "version": "NKJV",
          "text": "Mizraim begot Ludim, Anamim, Lehabim, Naphtuhim,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "1 Chronicles 1:11-12",
          "text": "Mizraim was the father of the Ludites, the Anamites, the Lehabites, the Naphtuhites, / the Pathrusites, the Casluhites (from whom the Philistines came), and the Caphtorites."
        },
        {
          "reference": "Isaiah 19:11-13",
          "text": "The princes of Zoan are mere fools; Pharaoh’s wise counselors give senseless advice. How can you say to Pharaoh, “I am one of the wise, a son of eastern kings”? / Where are your wise men now? Let them tell you and reveal what the LORD of Hosts has planned against Egypt. / The princes of Zoan have become fools; the princes of Memphis are deceived. The cornerstones of her tribes have led Egypt astray."
        },
        {
          "reference": "Ezekiel 30:14-16",
          "text": "I will lay waste Pathros, set fire to Zoan, and execute judgment on Thebes. / I will pour out My wrath on Pelusium, the stronghold of Egypt, and cut off the crowds of Thebes. / I will set fire to Egypt, Pelusium will writhe in anguish, Thebes will be split open, and Memphis will face daily distress."
        },
        {
          "reference": "Nahum 3:9",
          "text": "Cush and Egypt were her boundless strength; Put and Libya were her allies."
        },
        {
          "reference": "Jeremiah 46:9",
          "text": "Advance, O horses! Race furiously, O chariots! Let the warriors come forth—Cush and Put carrying their shields, men of Lydia drawing the bow."
        },
        {
          "reference": "Acts 7:22",
          "text": "So Moses was educated in all the wisdom of the Egyptians and was powerful in speech and action."
        },
        {
          "reference": "Isaiah 11:11",
          "text": "On that day the Lord will extend His hand a second time to recover the remnant of His people from Assyria, from Egypt, from Pathros, from Cush, from Elam, from Shinar, from Hamath, and from the islands of the sea."
        },
        {
          "reference": "Ezekiel 29:14",
          "text": "I will restore Egypt from captivity and bring them back to the land of Pathros, the land of their origin. There they will be a lowly kingdom."
        },
        {
          "reference": "Isaiah 19:1-4",
          "text": "This is the burden against Egypt: Behold, the LORD rides on a swift cloud; He is coming to Egypt. The idols of Egypt will tremble before Him, and the hearts of the Egyptians will melt within them. / “So I will incite Egyptian against Egyptian; brother will fight against brother, neighbor against neighbor, city against city, and kingdom against kingdom. / Then the spirit of the Egyptians will be emptied out from among them, and I will frustrate their plans, so that they will resort to idols and spirits of the dead, to mediums and spiritists. ..."
        },
        {
          "reference": "Jeremiah 44:1",
          "text": "This is the word that came to Jeremiah concerning all the Jews living in the land of Egypt—in Migdol, Tahpanhes, and Memphis—and in the land of Pathros:"
        },
        {
          "reference": "Ezekiel 30:4-5",
          "text": "A sword will come against Egypt, and there will be anguish in Cush when the slain fall in Egypt, its wealth is taken away, and its foundations are torn down. / Cush, Put, and Lud, and all the various peoples, as well as Libya and the men of the covenant land, will fall with Egypt by the sword."
        },
        {
          "reference": "Isaiah 20:4",
          "text": "so the king of Assyria will lead away the captives of Egypt and the exiles of Cush, young and old alike, naked and barefoot, with bared buttocks—to Egypt’s shame."
        },
        {
          "reference": "Ezekiel 31:2-6",
          "text": "“Son of man, say to Pharaoh king of Egypt and to his multitude: ‘Who can be compared to your greatness? / Look at Assyria, a cedar in Lebanon, with beautiful branches that shaded the forest. It towered on high; its top was among the clouds. / The waters made it grow; the deep springs made it tall, directing their streams all around its base and sending their channels to all the trees of the field. ..."
        },
        {
          "reference": "Isaiah 19:18",
          "text": "In that day five cities in the land of Egypt will speak the language of Canaan and swear allegiance to the LORD of Hosts. One of them will be called the City of the Sun."
        }
      ]
    },
    {
      "reference": "Genesis 10:14",
      "book": "Genesis",
      "chapter": 10,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Pathrusites, Kasluhites (from whom the Philistines came) and Caphtorites."
        },
        {
          "version": "NLT",
          "text": "Pathrusites, Casluhites, and the Caphtorites, from whom the Philistines came."
        },
        {
          "version": "ESV",
          "text": "Pathrusim, Casluhim (from whom the Philistines came), and Caphtorim."
        },
        {
          "version": "NKJV",
          "text": "Pathrusim, and Casluhim (from whom came the Philistines and Caphtorim)."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:12",
          "text": "the Pathrusites, the Casluhites (from whom the Philistines came), and the Caphtorites."
        },
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Isaiah 11:11",
          "text": "On that day the Lord will extend His hand a second time to recover the remnant of His people from Assyria, from Egypt, from Pathros, from Cush, from Elam, from Shinar, from Hamath, and from the islands of the sea."
        },
        {
          "reference": "Jeremiah 46:9",
          "text": "Advance, O horses! Race furiously, O chariots! Let the warriors come forth—Cush and Put carrying their shields, men of Lydia drawing the bow."
        },
        {
          "reference": "Ezekiel 30:5",
          "text": "Cush, Put, and Lud, and all the various peoples, as well as Libya and the men of the covenant land, will fall with Egypt by the sword."
        },
        {
          "reference": "Ezekiel 29:10",
          "text": "therefore I am against you and against your rivers. I will turn the land of Egypt into a ruin, a desolate wasteland from Migdol to Syene, and as far as the border of Cush."
        },
        {
          "reference": "Ezekiel 30:4-6",
          "text": "A sword will come against Egypt, and there will be anguish in Cush when the slain fall in Egypt, its wealth is taken away, and its foundations are torn down. / Cush, Put, and Lud, and all the various peoples, as well as Libya and the men of the covenant land, will fall with Egypt by the sword. / For this is what the LORD says: The allies of Egypt will fall, and her proud strength will collapse. From Migdol to Syene they will fall by the sword within her, declares the Lord GOD."
        },
        {
          "reference": "Isaiah 19:6",
          "text": "The canals will stink; the streams of Egypt will trickle and dry up; the reeds and rushes will wither."
        },
        {
          "reference": "Isaiah 20:4",
          "text": "so the king of Assyria will lead away the captives of Egypt and the exiles of Cush, young and old alike, naked and barefoot, with bared buttocks—to Egypt’s shame."
        },
        {
          "reference": "Isaiah 43:3",
          "text": "For I am the LORD your God, the Holy One of Israel, your Savior; I give Egypt for your ransom, Cush and Seba in your place."
        },
        {
          "reference": "Isaiah 45:14",
          "text": "This is what the LORD says: “The products of Egypt and the merchandise of Cush, along with the Sabeans, men of stature, will come over to you and will be yours; they will trudge behind you; they will come over in chains and bow down to you. They will confess to you: ‘God is indeed with you, and there is no other; there is no other God.’”"
        },
        {
          "reference": "Acts 2:10",
          "text": "Phrygia and Pamphylia, Egypt and the parts of Libya near Cyrene; visitors from Rome,"
        },
        {
          "reference": "Acts 7:22",
          "text": "So Moses was educated in all the wisdom of the Egyptians and was powerful in speech and action."
        },
        {
          "reference": "Acts 13:1",
          "text": "Now in the church at Antioch there were prophets and teachers: Barnabas, Simeon called Niger, Lucius of Cyrene, Manaen (who had been brought up with Herod the tetrarch), and Saul."
        },
        {
          "reference": "Romans 15:19",
          "text": "by the power of signs and wonders, and by the power of the Spirit of God. So from Jerusalem all the way around to Illyricum, I have fully proclaimed the gospel of Christ."
        }
      ]
    },
    {
      "reference": "Genesis 10:15",
      "book": "Genesis",
      "chapter": 10,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "Canaan was the father of Sidon his firstborn, and of the Hittites,"
        },
        {
          "version": "NLT",
          "text": "Canaan’s oldest son was Sidon, the ancestor of the Sidonians. Canaan was also the ancestor of the Hittites,"
        },
        {
          "version": "ESV",
          "text": "Canaan fathered Sidon his firstborn and Heth,"
        },
        {
          "version": "NKJV",
          "text": "Canaan begot Sidon his firstborn, and Heth;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 11:3",
          "text": "to the Canaanites in the east and west; to the Amorites, Hittites, Perizzites, and Jebusites in the hill country; and to the Hivites at the foot of Hermon in the land of Mizpah."
        },
        {
          "reference": "Judges 3:3",
          "text": "the five rulers of the Philistines, all the Canaanites, the Sidonians, and the Hivites who lived in the mountains of Lebanon from Mount Baal-hermon to Lebo-hamath."
        },
        {
          "reference": "1 Chronicles 1:13",
          "text": "And Canaan was the father of Sidon his firstborn, and of the Hittites,"
        },
        {
          "reference": "Ezekiel 28:21-22",
          "text": "“Son of man, set your face against Sidon and prophesy against her. / And you are to declare that this is what the Lord GOD says: ‘Behold, I am against you, O Sidon, and I will be glorified within you. They will know that I am the LORD when I execute judgments against her and demonstrate My holiness through her."
        },
        {
          "reference": "Isaiah 23:1-4",
          "text": "This is the burden against Tyre: Wail, O ships of Tarshish, for Tyre is laid waste, without house or harbor. Word has reached them from the land of Cyprus. / Be silent, O dwellers of the coastland, you merchants of Sidon, whose traders have crossed the sea. / On the great waters came the grain of Shihor; the harvest of the Nile was the revenue of Tyre; she was the merchant of the nations. ..."
        },
        {
          "reference": "Jeremiah 47:4",
          "text": "For the day has come to destroy all the Philistines, to cut off from Tyre and Sidon every remaining ally. Indeed, the LORD is about to destroy the Philistines, the remnant from the coasts of Caphtor."
        },
        {
          "reference": "Zechariah 9:2-4",
          "text": "and also against Hamath, which borders it, as well as Tyre and Sidon, though they are very shrewd. / Tyre has built herself a fortress; she has heaped up silver like dust, and gold like the dirt of the streets. / Behold, the Lord will impoverish her and cast her wealth into the sea, and she will be consumed by fire."
        },
        {
          "reference": "Matthew 15:21-22",
          "text": "Leaving that place, Jesus withdrew to the district of Tyre and Sidon. / And a Canaanite woman from that region came to Him, crying out, “Lord, Son of David, have mercy on me! My daughter is miserably possessed by a demon.”"
        },
        {
          "reference": "Mark 7:24-26",
          "text": "Jesus left that place and went to the region of Tyre. Not wanting anyone to know He was there, He entered a house, but was unable to escape their notice. / Instead, a woman whose little daughter had an unclean spirit soon heard about Jesus, and she came and fell at His feet. / Now she was a Greek woman of Syrophoenician origin, and she kept asking Jesus to drive the demon out of her daughter."
        },
        {
          "reference": "Luke 6:17",
          "text": "Then Jesus came down with them and stood on a level place. A large crowd of His disciples was there, along with a great number of people from all over Judea, Jerusalem, and the seacoast of Tyre and Sidon."
        },
        {
          "reference": "Acts 21:3",
          "text": "After sighting Cyprus and passing south of it, we sailed on to Syria and landed at Tyre, where the ship was to unload its cargo."
        },
        {
          "reference": "Acts 27:3",
          "text": "The next day we landed at Sidon, and Julius treated Paul with consideration, allowing him to visit his friends and receive their care."
        },
        {
          "reference": "1 Kings 5:6",
          "text": "Now therefore, order that cedars of Lebanon be cut down for me. My servants will be with your servants, and I will pay your servants whatever wages you set, for you know that there are none among us as skilled in logging as the Sidonians.”"
        },
        {
          "reference": "2 Samuel 5:11",
          "text": "Now Hiram king of Tyre sent envoys to David, along with cedar logs, carpenters, and stonemasons, and they built a palace for David."
        },
        {
          "reference": "1 Kings 9:11-13",
          "text": "King Solomon gave twenty towns in the land of Galilee to Hiram king of Tyre, who had supplied him with cedar and cypress logs and gold for his every desire. / So Hiram went out from Tyre to inspect the towns that Solomon had given him, but he was not pleased with them. / “What are these towns you have given me, my brother?” asked Hiram, and he called them the Land of Cabul, as they are called to this day."
        }
      ]
    },
    {
      "reference": "Genesis 10:16",
      "book": "Genesis",
      "chapter": 10,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "Jebusites, Amorites, Girgashites,"
        },
        {
          "version": "NLT",
          "text": "Jebusites, Amorites, Girgashites,"
        },
        {
          "version": "ESV",
          "text": "and the Jebusites, the Amorites, the Girgashites,"
        },
        {
          "version": "NKJV",
          "text": "the Jebusite, the Amorite, and the Girgashite;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 7:1",
          "text": "When the LORD your God brings you into the land that you are entering to possess, and He drives out before you many nations—the Hittites, Girgashites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites, seven nations larger and stronger than you—"
        },
        {
          "reference": "Joshua 3:10",
          "text": "He continued, “This is how you will know that the living God is among you and that He will surely drive out before you the Canaanites, Hittites, Hivites, Perizzites, Girgashites, Amorites, and Jebusites."
        },
        {
          "reference": "Judges 3:5",
          "text": "Thus the Israelites continued to live among the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites."
        },
        {
          "reference": "1 Kings 9:20-21",
          "text": "As for all the people who remained of the Amorites, Hittites, Perizzites, Hivites, and Jebusites (the people who were not Israelites)— / their descendants who remained in the land, those whom the Israelites were unable to devote to destruction—Solomon conscripted these people to be forced laborers, as they are to this day."
        },
        {
          "reference": "2 Chronicles 8:7-8",
          "text": "As for all the people who remained of the Hittites, Amorites, Perizzites, Hivites, and Jebusites (these people were not Israelites)— / their descendants who remained in the land, those whom the Israelites had not destroyed—Solomon conscripted these people to be forced laborers, as they are to this day."
        },
        {
          "reference": "Ezra 9:1",
          "text": "After these things had been accomplished, the leaders approached me and said, “The people of Israel, including the priests and Levites, have not kept themselves separate from the surrounding peoples whose abominations are like those of the Canaanites, Hittites, Perizzites, Jebusites, Ammonites, Moabites, Egyptians, and Amorites."
        },
        {
          "reference": "Nehemiah 9:8",
          "text": "You found his heart faithful before You, and made a covenant with him to give the land of the Canaanites and Hittites, of the Amorites and Perizzites, of the Jebusites and Girgashites—to give it to his descendants. You have kept Your promise, because You are righteous."
        },
        {
          "reference": "Psalm 106:34-35",
          "text": "They did not destroy the peoples as the LORD had commanded them, / but they mingled with the nations and adopted their customs."
        },
        {
          "reference": "Isaiah 11:14",
          "text": "They will swoop down on the slopes of the Philistines to the west; together they will plunder the sons of the east. They will lay their hands on Edom and Moab, and the Ammonites will be subject to them."
        },
        {
          "reference": "Jeremiah 47:4",
          "text": "For the day has come to destroy all the Philistines, to cut off from Tyre and Sidon every remaining ally. Indeed, the LORD is about to destroy the Philistines, the remnant from the coasts of Caphtor."
        },
        {
          "reference": "Ezekiel 16:3",
          "text": "and tell her that this is what the Lord GOD says to Jerusalem: Your origin and your birth were in the land of the Canaanites. Your father was an Amorite and your mother a Hittite."
        },
        {
          "reference": "Matthew 15:22",
          "text": "And a Canaanite woman from that region came to Him, crying out, “Lord, Son of David, have mercy on me! My daughter is miserably possessed by a demon.”"
        },
        {
          "reference": "Mark 7:26",
          "text": "Now she was a Greek woman of Syrophoenician origin, and she kept asking Jesus to drive the demon out of her daughter."
        },
        {
          "reference": "Acts 13:19",
          "text": "And having vanquished seven nations in Canaan, He gave their land to His people as an inheritance."
        },
        {
          "reference": "Romans 9:25-26",
          "text": "As He says in Hosea: “I will call them ‘My People’ who are not My people, and I will call her ‘My Beloved’ who is not My beloved,” / and, “It will happen that in the very place where it was said to them, ‘You are not My people,’ they will be called ‘sons of the living God.’”"
        }
      ]
    },
    {
      "reference": "Genesis 10:17",
      "book": "Genesis",
      "chapter": 10,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Hivites, Arkites, Sinites,"
        },
        {
          "version": "NLT",
          "text": "Hivites, Arkites, Sinites,"
        },
        {
          "version": "ESV",
          "text": "the Hivites, the Arkites, the Sinites,"
        },
        {
          "version": "NKJV",
          "text": "the Hivite, the Arkite, and the Sinite;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:15",
          "text": "the Hivites, the Arkites, the Sinites,"
        },
        {
          "reference": "Joshua 13:3",
          "text": "from the Shihor east of Egypt to the territory of Ekron on the north (considered to be Canaanite territory)—that of the five Philistine rulers of Gaza, Ashdod, Ashkelon, Gath, and Ekron, as well as that of the Avvites;"
        },
        {
          "reference": "Ezekiel 27:8-11",
          "text": "The men of Sidon and Arvad were your oarsmen. Your men of skill, O Tyre, were there as your captains. / The elders of Gebal were aboard as shipwrights, repairing your leaks. All the ships of the sea and their sailors came alongside to barter for your merchandise. / Men of Persia, Lydia, and Put served as warriors in your army. They hung their shields and helmets on your walls; they gave you splendor. ..."
        },
        {
          "reference": "Zechariah 9:6-7",
          "text": "A mixed race will occupy Ashdod, and I will cut off the pride of the Philistines. / I will remove the blood from their mouths and the abominations from between their teeth. Then they too will become a remnant for our God; they will become like a clan in Judah, and Ekron will be like the Jebusites."
        },
        {
          "reference": "Isaiah 23:1-18",
          "text": "This is the burden against Tyre: Wail, O ships of Tarshish, for Tyre is laid waste, without house or harbor. Word has reached them from the land of Cyprus. / Be silent, O dwellers of the coastland, you merchants of Sidon, whose traders have crossed the sea. / On the great waters came the grain of Shihor; the harvest of the Nile was the revenue of Tyre; she was the merchant of the nations. ..."
        },
        {
          "reference": "Jeremiah 47:4",
          "text": "For the day has come to destroy all the Philistines, to cut off from Tyre and Sidon every remaining ally. Indeed, the LORD is about to destroy the Philistines, the remnant from the coasts of Caphtor."
        },
        {
          "reference": "Amos 1:9-10",
          "text": "This is what the LORD says: “For three transgressions of Tyre, even four, I will not revoke My judgment, because they delivered up a whole congregation of exiles to Edom and broke a covenant of brotherhood. / So I will send fire upon the walls of Tyre to consume its citadels.”"
        },
        {
          "reference": "Obadiah 1:20",
          "text": "And the exiles of this host of the Israelites will possess the land of the Canaanites as far as Zarephath; and the exiles from Jerusalem who are in Sepharad will possess the cities of the Negev."
        },
        {
          "reference": "Deuteronomy 2:23",
          "text": "And the Avvim, who lived in villages as far as Gaza, were destroyed by the Caphtorites, who came out of Caphtor and settled in their place.)"
        },
        {
          "reference": "Judges 3:3",
          "text": "the five rulers of the Philistines, all the Canaanites, the Sidonians, and the Hivites who lived in the mountains of Lebanon from Mount Baal-hermon to Lebo-hamath."
        },
        {
          "reference": "1 Samuel 6:4",
          "text": "“What guilt offering should we send back to Him?” asked the Philistines. “Five gold tumors and five gold rats,” they said, “according to the number of rulers of the Philistines, since the same plague has struck both you and your rulers."
        },
        {
          "reference": "2 Samuel 8:18",
          "text": "Benaiah son of Jehoiada was over the Cherethites and Pelethites; and David’s sons were priestly leaders."
        },
        {
          "reference": "1 Kings 4:31",
          "text": "He was wiser than all men—wiser than Ethan the Ezrahite, and wiser than Heman, Calcol, and Darda, the sons of Mahol. And his fame spread throughout the surrounding nations."
        },
        {
          "reference": "2 Kings 18:34",
          "text": "Where are the gods of Hamath and Arpad? Where are the gods of Sepharvaim, Hena, and Ivvah? Have they delivered Samaria from my hand?"
        },
        {
          "reference": "Nehemiah 13:23-24",
          "text": "In those days I also saw Jews who had married women from Ashdod, Ammon, and Moab. / Half of their children spoke the language of Ashdod or of the other peoples, but could not speak the language of Judah."
        }
      ]
    },
    {
      "reference": "Genesis 10:18",
      "book": "Genesis",
      "chapter": 10,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "Arvadites, Zemarites and Hamathites. Later the Canaanite clans scattered"
        },
        {
          "version": "NLT",
          "text": "Arvadites, Zemarites, and Hamathites. The Canaanite clans eventually spread out,"
        },
        {
          "version": "ESV",
          "text": "the Arvadites, the Zemarites, and the Hamathites. Afterward the clans of the Canaanites dispersed."
        },
        {
          "version": "NKJV",
          "text": "the Arvadite, the Zemarite, and the Hamathite. Afterward the families of the Canaanites were dispersed."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 2:23",
          "text": "And the Avvim, who lived in villages as far as Gaza, were destroyed by the Caphtorites, who came out of Caphtor and settled in their place.)"
        },
        {
          "reference": "Joshua 13:3",
          "text": "from the Shihor east of Egypt to the territory of Ekron on the north (considered to be Canaanite territory)—that of the five Philistine rulers of Gaza, Ashdod, Ashkelon, Gath, and Ekron, as well as that of the Avvites;"
        },
        {
          "reference": "1 Chronicles 1:16",
          "text": "the Arvadites, the Zemarites, and the Hamathites."
        },
        {
          "reference": "Jeremiah 47:4",
          "text": "For the day has come to destroy all the Philistines, to cut off from Tyre and Sidon every remaining ally. Indeed, the LORD is about to destroy the Philistines, the remnant from the coasts of Caphtor."
        },
        {
          "reference": "Ezekiel 25:16",
          "text": "therefore this is what the Lord GOD says: Behold, I will stretch out My hand against the Philistines, and I will cut off the Cherethites and destroy the remnant along the coast."
        },
        {
          "reference": "Zephaniah 2:5",
          "text": "Woe to the dwellers of the seacoast, O nation of the Cherethites! The word of the LORD is against you, O Canaan, land of the Philistines: “I will destroy you, and no one will be left.”"
        },
        {
          "reference": "Amos 9:7",
          "text": "“Are you not like the Cushites to Me, O children of Israel?” declares the LORD. “Did I not bring Israel up from the land of Egypt, the Philistines from Caphtor, and the Arameans from Kir?"
        },
        {
          "reference": "Isaiah 23:1-18",
          "text": "This is the burden against Tyre: Wail, O ships of Tarshish, for Tyre is laid waste, without house or harbor. Word has reached them from the land of Cyprus. / Be silent, O dwellers of the coastland, you merchants of Sidon, whose traders have crossed the sea. / On the great waters came the grain of Shihor; the harvest of the Nile was the revenue of Tyre; she was the merchant of the nations. ..."
        },
        {
          "reference": "Obadiah 1:20",
          "text": "And the exiles of this host of the Israelites will possess the land of the Canaanites as far as Zarephath; and the exiles from Jerusalem who are in Sepharad will possess the cities of the Negev."
        },
        {
          "reference": "Zechariah 9:5-7",
          "text": "Ashkelon will see and fear; Gaza will writhe in agony, as will Ekron, for her hope will wither. There will cease to be a king in Gaza, and Ashkelon will be uninhabited. / A mixed race will occupy Ashdod, and I will cut off the pride of the Philistines. / I will remove the blood from their mouths and the abominations from between their teeth. Then they too will become a remnant for our God; they will become like a clan in Judah, and Ekron will be like the Jebusites."
        },
        {
          "reference": "Matthew 15:21-28",
          "text": "Leaving that place, Jesus withdrew to the district of Tyre and Sidon. / And a Canaanite woman from that region came to Him, crying out, “Lord, Son of David, have mercy on me! My daughter is miserably possessed by a demon.” / But Jesus did not answer a word. So His disciples came and urged Him, “Send her away, for she keeps crying out after us.” ..."
        },
        {
          "reference": "Mark 7:24-30",
          "text": "Jesus left that place and went to the region of Tyre. Not wanting anyone to know He was there, He entered a house, but was unable to escape their notice. / Instead, a woman whose little daughter had an unclean spirit soon heard about Jesus, and she came and fell at His feet. / Now she was a Greek woman of Syrophoenician origin, and she kept asking Jesus to drive the demon out of her daughter. ..."
        },
        {
          "reference": "Acts 8:26-40",
          "text": "Now an angel of the Lord said to Philip, “Get up and go south to the desert road that goes down from Jerusalem to Gaza.” / So he started out, and on his way he met an Ethiopian eunuch, a court official in charge of the entire treasury of Candace, queen of the Ethiopians. He had gone to Jerusalem to worship, / and on his return was sitting in his chariot reading Isaiah the prophet. ..."
        },
        {
          "reference": "Acts 10:34-35",
          "text": "Then Peter began to speak: “I now truly understand that God does not show favoritism, / but welcomes those from every nation who fear Him and do what is right."
        },
        {
          "reference": "Romans 15:9-12",
          "text": "so that the Gentiles may glorify God for His mercy. As it is written: “Therefore I will praise You among the Gentiles; I will sing hymns to Your name.” / Again, it says: “Rejoice, O Gentiles, with His people.” / And again: “Praise the Lord, all you Gentiles, and extol Him, all you peoples.” ..."
        }
      ]
    },
    {
      "reference": "Genesis 10:19",
      "book": "Genesis",
      "chapter": 10,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "and the borders of Canaan reached from Sidon toward Gerar as far as Gaza, and then toward Sodom, Gomorrah, Admah and Zeboyim, as far as Lasha."
        },
        {
          "version": "NLT",
          "text": "and the territory of Canaan extended from Sidon in the north to Gerar and Gaza in the south, and east as far as Sodom, Gomorrah, Admah, and Zeboiim, near Lasha."
        },
        {
          "version": "ESV",
          "text": "And the territory of the Canaanites extended from Sidon in the direction of Gerar as far as Gaza, and in the direction of Sodom, Gomorrah, Admah, and Zeboiim, as far as Lasha."
        },
        {
          "version": "NKJV",
          "text": "And the border of the Canaanites was from Sidon as you go toward Gerar, as far as Gaza; then as you go toward Sodom, Gomorrah, Admah, and Zeboiim, as far as Lasha."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 2:23",
          "text": "And the Avvim, who lived in villages as far as Gaza, were destroyed by the Caphtorites, who came out of Caphtor and settled in their place.)"
        },
        {
          "reference": "Joshua 13:3-5",
          "text": "from the Shihor east of Egypt to the territory of Ekron on the north (considered to be Canaanite territory)—that of the five Philistine rulers of Gaza, Ashdod, Ashkelon, Gath, and Ekron, as well as that of the Avvites; / to the south, all the land of the Canaanites, from Mearah of the Sidonians to Aphek, as far as the border of the Amorites; / the land of the Gebalites; and all Lebanon to the east, from Baal-gad below Mount Hermon to Lebo-hamath."
        },
        {
          "reference": "Judges 1:18-19",
          "text": "And Judah also captured Gaza, Ashkelon, and Ekron—each with its territory. / The LORD was with Judah, and they took possession of the hill country; but they could not drive out the inhabitants of the plains because they had chariots of iron."
        },
        {
          "reference": "1 Kings 4:21",
          "text": "And Solomon reigned over all the kingdoms from the Euphrates to the land of the Philistines, as far as the border of Egypt. These kingdoms offered tribute and served Solomon all the days of his life."
        },
        {
          "reference": "1 Chronicles 1:13-16",
          "text": "And Canaan was the father of Sidon his firstborn, and of the Hittites, / the Jebusites, the Amorites, the Girgashites, / the Hivites, the Arkites, the Sinites, ..."
        },
        {
          "reference": "Ezekiel 16:3",
          "text": "and tell her that this is what the Lord GOD says to Jerusalem: Your origin and your birth were in the land of the Canaanites. Your father was an Amorite and your mother a Hittite."
        },
        {
          "reference": "Ezekiel 16:45-46",
          "text": "You are the daughter of your mother, who despised her husband and children. You are the sister of your sisters, who despised their husbands and children. Your mother was a Hittite and your father an Amorite. / Your older sister was Samaria, who lived with her daughters to your north; and your younger sister was Sodom, who lived with her daughters to your south."
        },
        {
          "reference": "Zephaniah 2:5",
          "text": "Woe to the dwellers of the seacoast, O nation of the Cherethites! The word of the LORD is against you, O Canaan, land of the Philistines: “I will destroy you, and no one will be left.”"
        },
        {
          "reference": "Zechariah 9:5-7",
          "text": "Ashkelon will see and fear; Gaza will writhe in agony, as will Ekron, for her hope will wither. There will cease to be a king in Gaza, and Ashkelon will be uninhabited. / A mixed race will occupy Ashdod, and I will cut off the pride of the Philistines. / I will remove the blood from their mouths and the abominations from between their teeth. Then they too will become a remnant for our God; they will become like a clan in Judah, and Ekron will be like the Jebusites."
        },
        {
          "reference": "Matthew 11:21-22",
          "text": "“Woe to you, Chorazin! Woe to you, Bethsaida! For if the miracles that were performed in you had been performed in Tyre and Sidon, they would have repented long ago in sackcloth and ashes. / But I tell you, it will be more bearable for Tyre and Sidon on the day of judgment than for you."
        },
        {
          "reference": "Matthew 15:21-28",
          "text": "Leaving that place, Jesus withdrew to the district of Tyre and Sidon. / And a Canaanite woman from that region came to Him, crying out, “Lord, Son of David, have mercy on me! My daughter is miserably possessed by a demon.” / But Jesus did not answer a word. So His disciples came and urged Him, “Send her away, for she keeps crying out after us.” ..."
        },
        {
          "reference": "Mark 7:24-30",
          "text": "Jesus left that place and went to the region of Tyre. Not wanting anyone to know He was there, He entered a house, but was unable to escape their notice. / Instead, a woman whose little daughter had an unclean spirit soon heard about Jesus, and she came and fell at His feet. / Now she was a Greek woman of Syrophoenician origin, and she kept asking Jesus to drive the demon out of her daughter. ..."
        },
        {
          "reference": "Luke 10:13-14",
          "text": "Woe to you, Chorazin! Woe to you, Bethsaida! For if the miracles that were performed in you had been performed in Tyre and Sidon, they would have repented long ago, sitting in sackcloth and ashes. / But it will be more bearable for Tyre and Sidon at the judgment than for you."
        },
        {
          "reference": "Acts 8:26-40",
          "text": "Now an angel of the Lord said to Philip, “Get up and go south to the desert road that goes down from Jerusalem to Gaza.” / So he started out, and on his way he met an Ethiopian eunuch, a court official in charge of the entire treasury of Candace, queen of the Ethiopians. He had gone to Jerusalem to worship, / and on his return was sitting in his chariot reading Isaiah the prophet. ..."
        },
        {
          "reference": "Acts 10:1-48",
          "text": "At Caesarea there was a man named Cornelius, a centurion in what was called the Italian Regiment. / He and all his household were devout and God-fearing. He gave generously to the people and prayed to God regularly. / One day at about the ninth hour, he had a clear vision of an angel of God who came to him and said, “Cornelius!” ..."
        }
      ]
    },
    {
      "reference": "Genesis 10:20",
      "book": "Genesis",
      "chapter": 10,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "These are the sons of Ham by their clans and languages, in their territories and nations."
        },
        {
          "version": "NLT",
          "text": "These were the descendants of Ham, identified by clan, language, territory, and national identity."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Ham, by their clans, their languages, their lands, and their nations."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Ham, according to their families, according to their languages, in their lands and in their nations."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 11:1-9",
          "text": "Now the whole world had one language and a common form of speech. / And as people journeyed eastward, they found a plain in the land of Shinar and settled there. / And they said to one another, “Come, let us make bricks and bake them thoroughly.” So they used brick instead of stone, and tar instead of mortar. ..."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Revelation 7:9",
          "text": "After this I looked and saw a multitude too large to count, from every nation and tribe and people and tongue, standing before the throne and before the Lamb. They were wearing white robes and holding palm branches in their hands."
        },
        {
          "reference": "1 Chronicles 1:8-16",
          "text": "The sons of Ham: Cush, Mizraim, Put, and Canaan. / The sons of Cush: Seba, Havilah, Sabta, Raamah, and Sabteca. The sons of Raamah: Sheba and Dedan. / Cush was the father of Nimrod, who began to be a mighty one on the earth. ..."
        },
        {
          "reference": "Isaiah 66:18",
          "text": "“And I, knowing their deeds and thoughts, am coming to gather all nations and tongues, and they will come and see My glory."
        },
        {
          "reference": "Zephaniah 3:9",
          "text": "For then I will restore pure lips to the peoples, that all may call upon the name of the LORD and serve Him shoulder to shoulder."
        },
        {
          "reference": "Luke 10:1",
          "text": "After this, the Lord appointed seventy-two others and sent them two by two ahead of Him to every town and place He was about to visit."
        },
        {
          "reference": "Matthew 28:19",
          "text": "Therefore go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit,"
        },
        {
          "reference": "Romans 15:12",
          "text": "And once more, Isaiah says: “The Root of Jesse will appear, One who will arise to rule over the Gentiles; in Him the Gentiles will put their hope.”"
        },
        {
          "reference": "Isaiah 11:10",
          "text": "On that day the Root of Jesse will stand as a banner for the peoples. The nations will seek Him, and His place of rest will be glorious."
        },
        {
          "reference": "Ezekiel 38:2-6",
          "text": "“Son of man, set your face against Gog of the land of Magog, the chief prince of Meshech and Tubal. Prophesy against him / and declare that this is what the Lord GOD says: Behold, I am against you, O Gog, chief prince of Meshech and Tubal. / I will turn you around, put hooks in your jaws, and bring you out with all your army—your horses, your horsemen in full armor, and a great company armed with shields and bucklers, all brandishing their swords. ..."
        },
        {
          "reference": "Jeremiah 46:9",
          "text": "Advance, O horses! Race furiously, O chariots! Let the warriors come forth—Cush and Put carrying their shields, men of Lydia drawing the bow."
        },
        {
          "reference": "Psalm 72:17",
          "text": "May his name endure forever; may his name continue as long as the sun shines. In him may all nations be blessed; may they call him blessed."
        },
        {
          "reference": "Acts 2:5-11",
          "text": "Now there were dwelling in Jerusalem God-fearing Jews from every nation under heaven. / And when this sound rang out, a crowd came together in bewilderment, because each one heard them speaking his own language. / Astounded and amazed, they asked, “Are not all these who are speaking Galileans? ..."
        }
      ]
    },
    {
      "reference": "Genesis 10:21",
      "book": "Genesis",
      "chapter": 10,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "Sons were also born to Shem, whose older brother was Japheth; Shem was the ancestor of all the sons of Eber."
        },
        {
          "version": "NLT",
          "text": "Sons were also born to Shem, the older brother of Japheth. Shem was the ancestor of all the descendants of Eber."
        },
        {
          "version": "ESV",
          "text": "To Shem also, the father of all the children of Eber, the elder brother of Japheth, children were born."
        },
        {
          "version": "NKJV",
          "text": "And children were born also to Shem, the father of all the children of Eber, the brother of Japheth the elder."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 3:35-36",
          "text": "the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah, / the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,"
        },
        {
          "reference": "1 Chronicles 1:17-27",
          "text": "The sons of Shem: Elam, Asshur, Arphaxad, Lud, and Aram. The sons of Aram: Uz, Hul, Gether, and Meshech. / Arphaxad was the father of Shelah, and Shelah was the father of Eber. / Two sons were born to Eber: One was named Peleg, because in his days the earth was divided, and his brother was named Joktan. ..."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "Genesis 9:18-19",
          "text": "The sons of Noah who came out of the ark were Shem, Ham, and Japheth. And Ham was the father of Canaan. / These three were the sons of Noah, and from them the whole earth was populated."
        },
        {
          "reference": "Genesis 11:10-26",
          "text": "This is the account of Shem. Two years after the flood, when Shem was 100 years old, he became the father of Arphaxad. / And after he had become the father of Arphaxad, Shem lived 500 years and had other sons and daughters. / When Arphaxad was 35 years old, he became the father of Shelah. ..."
        },
        {
          "reference": "Isaiah 66:19",
          "text": "I will establish a sign among them, and I will send survivors from among them to the nations—to Tarshish, Put, and the archers of Lud; to Tubal, Javan, and the islands far away who have not heard of My fame or seen My glory. So they will proclaim My glory among the nations."
        },
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Genesis 5:32",
          "text": "After Noah was 500 years old, he became the father of Shem, Ham, and Japheth."
        },
        {
          "reference": "Genesis 9:1",
          "text": "And God blessed Noah and his sons and said to them, “Be fruitful and multiply and fill the earth."
        },
        {
          "reference": "Genesis 11:1-9",
          "text": "Now the whole world had one language and a common form of speech. / And as people journeyed eastward, they found a plain in the land of Shinar and settled there. / And they said to one another, “Come, let us make bricks and bake them thoroughly.” So they used brick instead of stone, and tar instead of mortar. ..."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "Acts 7:26",
          "text": "The next day he came upon two Israelites who were fighting, and he tried to reconcile them, saying, ‘Men, you are brothers. Why are you mistreating each other?’"
        },
        {
          "reference": "Romans 5:12-14",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned. / For sin was in the world before the law was given; but sin is not taken into account when there is no law. / Nevertheless, death reigned from Adam until Moses, even over those who did not sin in the way that Adam transgressed. He is a pattern of the One to come."
        }
      ]
    },
    {
      "reference": "Genesis 10:22",
      "book": "Genesis",
      "chapter": 10,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Shem: Elam, Ashur, Arphaxad, Lud and Aram."
        },
        {
          "version": "NLT",
          "text": "The descendants of Shem were Elam, Asshur, Arphaxad, Lud, and Aram."
        },
        {
          "version": "ESV",
          "text": "The sons of Shem: Elam, Asshur, Arpachshad, Lud, and Aram."
        },
        {
          "version": "NKJV",
          "text": "The sons of Shem were Elam, Asshur, Arphaxad, Lud, and Aram."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:17",
          "text": "The sons of Shem: Elam, Asshur, Arphaxad, Lud, and Aram. The sons of Aram: Uz, Hul, Gether, and Meshech."
        },
        {
          "reference": "Isaiah 11:11",
          "text": "On that day the Lord will extend His hand a second time to recover the remnant of His people from Assyria, from Egypt, from Pathros, from Cush, from Elam, from Shinar, from Hamath, and from the islands of the sea."
        },
        {
          "reference": "Acts 2:9",
          "text": "Parthians, Medes, and Elamites; residents of Mesopotamia, Judea and Cappadocia, Pontus and Asia,"
        },
        {
          "reference": "Isaiah 66:19",
          "text": "I will establish a sign among them, and I will send survivors from among them to the nations—to Tarshish, Put, and the archers of Lud; to Tubal, Javan, and the islands far away who have not heard of My fame or seen My glory. So they will proclaim My glory among the nations."
        },
        {
          "reference": "Ezekiel 27:10",
          "text": "Men of Persia, Lydia, and Put served as warriors in your army. They hung their shields and helmets on your walls; they gave you splendor."
        },
        {
          "reference": "Daniel 10:1",
          "text": "In the third year of Cyrus king of Persia, a message was revealed to Daniel, who was called Belteshazzar. The message was true, and it concerned a great conflict. And the understanding of the message was given to him in a vision."
        },
        {
          "reference": "Hebrews 11:9",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Isaiah 21:2",
          "text": "A dire vision is declared to me: “The traitor still betrays, and the destroyer still destroys. Go up, O Elam! Lay siege, O Media! I will put an end to all her groaning.”"
        },
        {
          "reference": "Jeremiah 49:34-39",
          "text": "This is the word of the LORD that came to Jeremiah the prophet concerning Elam at the beginning of the reign of Zedekiah king of Judah. / This is what the LORD of Hosts says: “Behold, I will shatter Elam’s bow, the mainstay of their might. / I will bring the four winds against Elam from the four corners of the heavens, and I will scatter them to all these winds. There will not be a nation to which Elam’s exiles will not go. ..."
        },
        {
          "reference": "Acts 7:2-4",
          "text": "And Stephen declared: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Haran, / and told him, ‘Leave your country and your kindred and go to the land I will show you.’ / So Abraham left the land of the Chaldeans and settled in Haran. After his father died, God brought him out of that place and into this land where you are now living."
        },
        {
          "reference": "Isaiah 13:17",
          "text": "Behold, I will stir up against them the Medes, who have no regard for silver and no desire for gold."
        },
        {
          "reference": "Jeremiah 25:25",
          "text": "all the kings of Zimri, Elam, and Media;"
        },
        {
          "reference": "Ezekiel 32:24",
          "text": "Elam is there with all her multitudes around her grave. All of them are slain, fallen by the sword—those who went down uncircumcised to the earth below, who once spread their terror in the land of the living. They bear their disgrace with those who descend to the Pit."
        },
        {
          "reference": "Nehemiah 9:7",
          "text": "You are the LORD, the God who chose Abram, who brought him out of Ur of the Chaldeans and gave him the name Abraham."
        },
        {
          "reference": "Isaiah 45:1-4",
          "text": "This is what the LORD says to Cyrus His anointed, whose right hand I have grasped to subdue nations before him, to disarm kings, to open the doors before him, so that the gates will not be shut: / “I will go before you and level the mountains; I will break down the gates of bronze and cut through the bars of iron. / I will give you the treasures of darkness and the riches hidden in secret places, so that you may know that I am the LORD, the God of Israel, who calls you by name. ..."
        }
      ]
    },
    {
      "reference": "Genesis 10:23",
      "book": "Genesis",
      "chapter": 10,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Aram: Uz, Hul, Gether and Meshek."
        },
        {
          "version": "NLT",
          "text": "The descendants of Aram were Uz, Hul, Gether, and Mash."
        },
        {
          "version": "ESV",
          "text": "The sons of Aram: Uz, Hul, Gether, and Mash."
        },
        {
          "version": "NKJV",
          "text": "The sons of Aram were Uz, Hul, Gether, and Mash."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:17",
          "text": "The sons of Shem: Elam, Asshur, Arphaxad, Lud, and Aram. The sons of Aram: Uz, Hul, Gether, and Meshech."
        },
        {
          "reference": "Luke 3:36",
          "text": "the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,"
        },
        {
          "reference": "Isaiah 11:11",
          "text": "On that day the Lord will extend His hand a second time to recover the remnant of His people from Assyria, from Egypt, from Pathros, from Cush, from Elam, from Shinar, from Hamath, and from the islands of the sea."
        },
        {
          "reference": "1 Chronicles 1:19",
          "text": "Two sons were born to Eber: One was named Peleg, because in his days the earth was divided, and his brother was named Joktan."
        },
        {
          "reference": "Genesis 11:10-26",
          "text": "This is the account of Shem. Two years after the flood, when Shem was 100 years old, he became the father of Arphaxad. / And after he had become the father of Arphaxad, Shem lived 500 years and had other sons and daughters. / When Arphaxad was 35 years old, he became the father of Shelah. ..."
        },
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "Genesis 9:19",
          "text": "These three were the sons of Noah, and from them the whole earth was populated."
        },
        {
          "reference": "Genesis 11:8-9",
          "text": "So the LORD scattered them from there over the face of all the earth, and they stopped building the city. / That is why it is called Babel, for there the LORD confused the language of the whole world, and from that place the LORD scattered them over the face of all the earth."
        },
        {
          "reference": "Genesis 9:1",
          "text": "And God blessed Noah and his sons and said to them, “Be fruitful and multiply and fill the earth."
        },
        {
          "reference": "Genesis 11:1-2",
          "text": "Now the whole world had one language and a common form of speech. / And as people journeyed eastward, they found a plain in the land of Shinar and settled there."
        },
        {
          "reference": "Genesis 11:4",
          "text": "“Come,” they said, “let us build for ourselves a city with a tower that reaches to the heavens, that we may make a name for ourselves and not be scattered over the face of all the earth.”"
        },
        {
          "reference": "Genesis 11:6-7",
          "text": "And the LORD said, “If they have begun to do this as one people speaking the same language, then nothing they devise will be beyond them. / Come, let Us go down and confuse their language, so that they will not understand one another’s speech.”"
        },
        {
          "reference": "Genesis 11:32",
          "text": "Terah lived 205 years, and he died in Haran."
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        }
      ]
    },
    {
      "reference": "Genesis 10:24",
      "book": "Genesis",
      "chapter": 10,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "Arphaxad was the father of Shelah, and Shelah the father of Eber."
        },
        {
          "version": "NLT",
          "text": "Arphaxad was the father of Shelah, and Shelah was the father of Eber."
        },
        {
          "version": "ESV",
          "text": "Arpachshad fathered Shelah; and Shelah fathered Eber."
        },
        {
          "version": "NKJV",
          "text": "Arphaxad begot Salah, and Salah begot Eber."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 3:35-36",
          "text": "the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah, / the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,"
        },
        {
          "reference": "1 Chronicles 1:18",
          "text": "Arphaxad was the father of Shelah, and Shelah was the father of Eber."
        },
        {
          "reference": "1 Chronicles 1:24",
          "text": "So from Shem came Arphaxad, Shelah,"
        },
        {
          "reference": "Genesis 11:12-13",
          "text": "When Arphaxad was 35 years old, he became the father of Shelah. / And after he had become the father of Shelah, Arphaxad lived 403 years and had other sons and daughters."
        },
        {
          "reference": "Hebrews 11:10",
          "text": "For he was looking forward to the city with foundations, whose architect and builder is God."
        },
        {
          "reference": "Matthew 1:2-3",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers. / Judah was the father of Perez and Zerah by Tamar, Perez the father of Hezron, and Hezron the father of Ram."
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Acts 7:4",
          "text": "So Abraham left the land of the Chaldeans and settled in Haran. After his father died, God brought him out of that place and into this land where you are now living."
        },
        {
          "reference": "Galatians 3:16",
          "text": "The promises were spoken to Abraham and to his seed. The Scripture does not say, “and to seeds,” meaning many, but “and to your seed,” meaning One, who is Christ."
        },
        {
          "reference": "Exodus 6:16-20",
          "text": "These were the names of the sons of Levi according to their records: Gershon, Kohath, and Merari. Levi lived 137 years. / The sons of Gershon were Libni and Shimei, by their clans. / The sons of Kohath were Amram, Izhar, Hebron, and Uzziel. Kohath lived 133 years. ..."
        },
        {
          "reference": "Numbers 26:58-59",
          "text": "These were the families of the Levites: The Libnite clan, the Hebronite clan, the Mahlite clan, the Mushite clan, and the Korahite clan. Now Kohath was the father of Amram, / and Amram’s wife was named Jochebed. She was also a daughter of Levi, born to Levi in Egypt. To Amram she bore Aaron, Moses, and their sister Miriam."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "Isaiah 19:25",
          "text": "The LORD of Hosts will bless them, saying, “Blessed be Egypt My people, Assyria My handiwork, and Israel My inheritance.”"
        },
        {
          "reference": "Ezekiel 16:3",
          "text": "and tell her that this is what the Lord GOD says to Jerusalem: Your origin and your birth were in the land of the Canaanites. Your father was an Amorite and your mother a Hittite."
        },
        {
          "reference": "Hosea 11:1",
          "text": "When Israel was a child, I loved him, and out of Egypt I called My son."
        }
      ]
    },
    {
      "reference": "Genesis 10:25",
      "book": "Genesis",
      "chapter": 10,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "Two sons were born to Eber: One was named Peleg, because in his time the earth was divided; his brother was named Joktan."
        },
        {
          "version": "NLT",
          "text": "Eber had two sons. The first was named Peleg (which means “division”), for during his lifetime the people of the world were divided into different language groups. His brother’s name was Joktan."
        },
        {
          "version": "ESV",
          "text": "To Eber were born two sons: the name of the one was Peleg, for in his days the earth was divided, and his brother’s name was Joktan."
        },
        {
          "version": "NKJV",
          "text": "To Eber were born two sons: the name of one was Peleg, for in his days the earth was divided; and his brother’s name was Joktan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:19",
          "text": "Two sons were born to Eber: One was named Peleg, because in his days the earth was divided, and his brother was named Joktan."
        },
        {
          "reference": "Luke 3:35-36",
          "text": "the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah, / the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,"
        },
        {
          "reference": "1 Chronicles 1:1-4",
          "text": "Adam, Seth, Enosh, / Kenan, Mahalalel, Jared, / Enoch, Methuselah, Lamech, Noah. ..."
        },
        {
          "reference": "Genesis 11:16-19",
          "text": "When Eber was 34 years old, he became the father of Peleg. / And after he had become the father of Peleg, Eber lived 430 years and had other sons and daughters. / When Peleg was 30 years old, he became the father of Reu. ..."
        },
        {
          "reference": "Genesis 11:1-9",
          "text": "Now the whole world had one language and a common form of speech. / And as people journeyed eastward, they found a plain in the land of Shinar and settled there. / And they said to one another, “Come, let us make bricks and bake them thoroughly.” So they used brick instead of stone, and tar instead of mortar. ..."
        },
        {
          "reference": "Matthew 1:1-2",
          "text": "This is the record of the genealogy of Jesus Christ, the son of David, the son of Abraham: / Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Genesis 9:19",
          "text": "These three were the sons of Noah, and from them the whole earth was populated."
        },
        {
          "reference": "Genesis 11:10-11",
          "text": "This is the account of Shem. Two years after the flood, when Shem was 100 years old, he became the father of Arphaxad. / And after he had become the father of Arphaxad, Shem lived 500 years and had other sons and daughters."
        },
        {
          "reference": "Genesis 5:32",
          "text": "After Noah was 500 years old, he became the father of Shem, Ham, and Japheth."
        },
        {
          "reference": "Genesis 11:12-13",
          "text": "When Arphaxad was 35 years old, he became the father of Shelah. / And after he had become the father of Shelah, Arphaxad lived 403 years and had other sons and daughters."
        },
        {
          "reference": "Genesis 11:14-15",
          "text": "When Shelah was 30 years old, he became the father of Eber. / And after he had become the father of Eber, Shelah lived 403 years and had other sons and daughters."
        },
        {
          "reference": "Genesis 11:20-21",
          "text": "When Reu was 32 years old, he became the father of Serug. / And after he had become the father of Serug, Reu lived 207 years and had other sons and daughters."
        },
        {
          "reference": "Genesis 11:22-23",
          "text": "When Serug was 30 years old, he became the father of Nahor. / And after he had become the father of Nahor, Serug lived 200 years and had other sons and daughters."
        },
        {
          "reference": "Genesis 11:24-25",
          "text": "When Nahor was 29 years old, he became the father of Terah. / And after he had become the father of Terah, Nahor lived 119 years and had other sons and daughters."
        },
        {
          "reference": "Genesis 11:26-27",
          "text": "When Terah was 70 years old, he became the father of Abram, Nahor, and Haran. / This is the account of Terah. Terah became the father of Abram, Nahor, and Haran. And Haran became the father of Lot."
        }
      ]
    },
    {
      "reference": "Genesis 10:26",
      "book": "Genesis",
      "chapter": 10,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "Joktan was the father of Almodad, Sheleph, Hazarmaveth, Jerah,"
        },
        {
          "version": "NLT",
          "text": "Joktan was the ancestor of Almodad, Sheleph, Hazarmaveth, Jerah,"
        },
        {
          "version": "ESV",
          "text": "Joktan fathered Almodad, Sheleph, Hazarmaveth, Jerah,"
        },
        {
          "version": "NKJV",
          "text": "Joktan begot Almodad, Sheleph, Hazarmaveth, Jerah,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:20-23",
          "text": "And Joktan was the father of Almodad, Sheleph, Hazarmaveth, Jerah, / Hadoram, Uzal, Diklah, / Obal, Abimael, Sheba, ..."
        },
        {
          "reference": "Genesis 10:21-25",
          "text": "And sons were also born to Shem, the older brother of Japheth; Shem was the forefather of all the sons of Eber. / The sons of Shem: Elam, Asshur, Arphaxad, Lud, and Aram. / The sons of Aram: Uz, Hul, Gether, and Mash. ..."
        },
        {
          "reference": "Genesis 11:10-26",
          "text": "This is the account of Shem. Two years after the flood, when Shem was 100 years old, he became the father of Arphaxad. / And after he had become the father of Arphaxad, Shem lived 500 years and had other sons and daughters. / When Arphaxad was 35 years old, he became the father of Shelah. ..."
        },
        {
          "reference": "1 Chronicles 1:17-19",
          "text": "The sons of Shem: Elam, Asshur, Arphaxad, Lud, and Aram. The sons of Aram: Uz, Hul, Gether, and Meshech. / Arphaxad was the father of Shelah, and Shelah was the father of Eber. / Two sons were born to Eber: One was named Peleg, because in his days the earth was divided, and his brother was named Joktan."
        },
        {
          "reference": "Luke 3:35-36",
          "text": "the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah, / the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,"
        },
        {
          "reference": "Matthew 1:1-17",
          "text": "This is the record of the genealogy of Jesus Christ, the son of David, the son of Abraham: / Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers. / Judah was the father of Perez and Zerah by Tamar, Perez the father of Hezron, and Hezron the father of Ram. ..."
        },
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Romans 5:12-14",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned. / For sin was in the world before the law was given; but sin is not taken into account when there is no law. / Nevertheless, death reigned from Adam until Moses, even over those who did not sin in the way that Adam transgressed. He is a pattern of the One to come."
        },
        {
          "reference": "1 Corinthians 15:22",
          "text": "For as in Adam all die, so in Christ all will be made alive."
        },
        {
          "reference": "Hebrews 11:1-3",
          "text": "Now faith is the assurance of what we hope for and the certainty of what we do not see. / This is why the ancients were commended. / By faith we understand that the universe was formed at God’s command, so that what is seen was not made out of what was visible."
        },
        {
          "reference": "Isaiah 66:18-19",
          "text": "“And I, knowing their deeds and thoughts, am coming to gather all nations and tongues, and they will come and see My glory. / I will establish a sign among them, and I will send survivors from among them to the nations—to Tarshish, Put, and the archers of Lud; to Tubal, Javan, and the islands far away who have not heard of My fame or seen My glory. So they will proclaim My glory among the nations."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "Psalm 86:9",
          "text": "All the nations You have made will come and bow before You, O Lord, and they will glorify Your name."
        },
        {
          "reference": "Acts 14:16-17",
          "text": "In past generations, He let all nations go their own way. / Yet He has not left Himself without testimony to His goodness: He gives you rain from heaven and fruitful seasons, filling your hearts with food and gladness.”"
        },
        {
          "reference": "Romans 1:20",
          "text": "For since the creation of the world God’s invisible qualities, His eternal power and divine nature, have been clearly seen, being understood from His workmanship, so that men are without excuse."
        }
      ]
    },
    {
      "reference": "Genesis 10:27",
      "book": "Genesis",
      "chapter": 10,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "Hadoram, Uzal, Diklah,"
        },
        {
          "version": "NLT",
          "text": "Hadoram, Uzal, Diklah,"
        },
        {
          "version": "ESV",
          "text": "Hadoram, Uzal, Diklah,"
        },
        {
          "version": "NKJV",
          "text": "Hadoram, Uzal, Diklah,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:21",
          "text": "Hadoram, Uzal, Diklah,"
        },
        {
          "reference": "1 Chronicles 1:17-23",
          "text": "The sons of Shem: Elam, Asshur, Arphaxad, Lud, and Aram. The sons of Aram: Uz, Hul, Gether, and Meshech. / Arphaxad was the father of Shelah, and Shelah was the father of Eber. / Two sons were born to Eber: One was named Peleg, because in his days the earth was divided, and his brother was named Joktan. ..."
        },
        {
          "reference": "Isaiah 60:6",
          "text": "Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD."
        },
        {
          "reference": "Jeremiah 25:23",
          "text": "Dedan, Tema, Buz, and all who cut the corners of their hair;"
        },
        {
          "reference": "Ezekiel 27:21",
          "text": "Arabia and all the princes of Kedar were your customers, trading in lambs, rams, and goats."
        },
        {
          "reference": "Job 1:1",
          "text": "There was a man in the land of Uz whose name was Job. And this man was blameless and upright, fearing God and shunning evil."
        },
        {
          "reference": "Job 6:19",
          "text": "The caravans of Tema look for water; the travelers of Sheba hope to find it."
        },
        {
          "reference": "Jeremiah 49:28-29",
          "text": "Concerning Kedar and the kingdoms of Hazor, which Nebuchadnezzar king of Babylon defeated, this is what the LORD says: “Rise up, advance against Kedar, and destroy the people of the east! / They will take their tents and flocks, their tent curtains and all their goods. They will take their camels for themselves. They will shout to them: ‘Terror is on every side!’"
        },
        {
          "reference": "Isaiah 21:13-17",
          "text": "This is the burden against Arabia: In the thickets of Arabia you must lodge, O caravans of Dedanites. / Bring water for the thirsty, O dwellers of Tema; meet the refugees with food. / For they flee from the sword—the sword that is drawn—from the bow that is bent, and from the stress of battle. ..."
        },
        {
          "reference": "Psalm 72:10",
          "text": "May the kings of Tarshish and distant shores bring tribute; may the kings of Sheba and Seba offer gifts."
        },
        {
          "reference": "Matthew 2:1-2",
          "text": "After Jesus was born in Bethlehem in Judea, during the time of King Herod, Magi from the east arrived in Jerusalem, / asking, “Where is the One who has been born King of the Jews? We saw His star in the east and have come to worship Him.”"
        },
        {
          "reference": "Acts 2:9-11",
          "text": "Parthians, Medes, and Elamites; residents of Mesopotamia, Judea and Cappadocia, Pontus and Asia, / Phrygia and Pamphylia, Egypt and the parts of Libya near Cyrene; visitors from Rome, / both Jews and converts to Judaism; Cretans and Arabs—we hear them declaring the wonders of God in our own tongues!”"
        },
        {
          "reference": "Acts 8:27",
          "text": "So he started out, and on his way he met an Ethiopian eunuch, a court official in charge of the entire treasury of Candace, queen of the Ethiopians. He had gone to Jerusalem to worship,"
        },
        {
          "reference": "Romans 15:19-21",
          "text": "by the power of signs and wonders, and by the power of the Spirit of God. So from Jerusalem all the way around to Illyricum, I have fully proclaimed the gospel of Christ. / In this way I have aspired to preach the gospel where Christ was not known, so that I would not be building on someone else’s foundation. / Rather, as it is written: “Those who were not told about Him will see, and those who have not heard will understand.”"
        },
        {
          "reference": "Galatians 1:17",
          "text": "nor did I go up to Jerusalem to the apostles who came before me, but I went into Arabia and later returned to Damascus."
        }
      ]
    },
    {
      "reference": "Genesis 10:28",
      "book": "Genesis",
      "chapter": 10,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "Obal, Abimael, Sheba,"
        },
        {
          "version": "NLT",
          "text": "Obal, Abimael, Sheba,"
        },
        {
          "version": "ESV",
          "text": "Obal, Abimael, Sheba,"
        },
        {
          "version": "NKJV",
          "text": "Obal, Abimael, Sheba,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:21",
          "text": "Hadoram, Uzal, Diklah,"
        },
        {
          "reference": "Isaiah 23:1-18",
          "text": "This is the burden against Tyre: Wail, O ships of Tarshish, for Tyre is laid waste, without house or harbor. Word has reached them from the land of Cyprus. / Be silent, O dwellers of the coastland, you merchants of Sidon, whose traders have crossed the sea. / On the great waters came the grain of Shihor; the harvest of the Nile was the revenue of Tyre; she was the merchant of the nations. ..."
        },
        {
          "reference": "Ezekiel 27:1-36",
          "text": "Then the word of the LORD came to me, saying, / “Now you, son of man, take up a lament for Tyre. / Tell Tyre, who dwells at the gateway to the sea, merchant of the peoples on many coasts, that this is what the Lord GOD says: You have said, O Tyre, ‘I am perfect in beauty.’ ..."
        },
        {
          "reference": "Ezekiel 28:1-19",
          "text": "And the word of the LORD came to me, saying, / “Son of man, tell the ruler of Tyre that this is what the Lord GOD says: Your heart is proud, and you have said, ‘I am a god; I sit in the seat of gods in the heart of the sea.’ Yet you are a man and not a god, though you have regarded your heart as that of a god. / Behold, you are wiser than Daniel; no secret is hidden from you! ..."
        },
        {
          "reference": "Jeremiah 25:22",
          "text": "all the kings of Tyre and Sidon; the kings of the coastlands across the sea;"
        },
        {
          "reference": "Jeremiah 47:4",
          "text": "For the day has come to destroy all the Philistines, to cut off from Tyre and Sidon every remaining ally. Indeed, the LORD is about to destroy the Philistines, the remnant from the coasts of Caphtor."
        },
        {
          "reference": "Amos 1:9-10",
          "text": "This is what the LORD says: “For three transgressions of Tyre, even four, I will not revoke My judgment, because they delivered up a whole congregation of exiles to Edom and broke a covenant of brotherhood. / So I will send fire upon the walls of Tyre to consume its citadels.”"
        },
        {
          "reference": "Zechariah 9:2-4",
          "text": "and also against Hamath, which borders it, as well as Tyre and Sidon, though they are very shrewd. / Tyre has built herself a fortress; she has heaped up silver like dust, and gold like the dirt of the streets. / Behold, the Lord will impoverish her and cast her wealth into the sea, and she will be consumed by fire."
        },
        {
          "reference": "Matthew 11:21-22",
          "text": "“Woe to you, Chorazin! Woe to you, Bethsaida! For if the miracles that were performed in you had been performed in Tyre and Sidon, they would have repented long ago in sackcloth and ashes. / But I tell you, it will be more bearable for Tyre and Sidon on the day of judgment than for you."
        },
        {
          "reference": "Luke 10:13-14",
          "text": "Woe to you, Chorazin! Woe to you, Bethsaida! For if the miracles that were performed in you had been performed in Tyre and Sidon, they would have repented long ago, sitting in sackcloth and ashes. / But it will be more bearable for Tyre and Sidon at the judgment than for you."
        },
        {
          "reference": "Acts 12:20",
          "text": "Now Herod was in a furious dispute with the people of Tyre and Sidon, and they convened before him. Having secured the support of Blastus, the king’s chamberlain, they asked for peace, because their region depended on the king’s country for food."
        },
        {
          "reference": "Acts 21:3",
          "text": "After sighting Cyprus and passing south of it, we sailed on to Syria and landed at Tyre, where the ship was to unload its cargo."
        },
        {
          "reference": "Acts 27:3",
          "text": "The next day we landed at Sidon, and Julius treated Paul with consideration, allowing him to visit his friends and receive their care."
        },
        {
          "reference": "Acts 27:5-6",
          "text": "And when we had sailed across the open sea off the coast of Cilicia and Pamphylia, we came to Myra in Lycia. / There the centurion found an Alexandrian ship sailing for Italy and put us on board."
        },
        {
          "reference": "Revelation 18:11-13",
          "text": "And the merchants of the earth will weep and mourn over her, because there is no one left to buy their cargo— / cargo of gold, silver, precious stones, and pearls; of fine linen, purple, silk, and scarlet; of all kinds of citron wood and every article of ivory, precious wood, bronze, iron, and marble; / of cinnamon, spice, incense, myrrh, and frankincense; of wine, olive oil, fine flour, and wheat; of cattle, sheep, horses, and carriages; of bodies and souls of slaves."
        }
      ]
    },
    {
      "reference": "Genesis 10:29",
      "book": "Genesis",
      "chapter": 10,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "Ophir, Havilah and Jobab. All these were sons of Joktan."
        },
        {
          "version": "NLT",
          "text": "Ophir, Havilah, and Jobab. All these were descendants of Joktan."
        },
        {
          "version": "ESV",
          "text": "Ophir, Havilah, and Jobab; all these were the sons of Joktan."
        },
        {
          "version": "NKJV",
          "text": "Ophir, Havilah, and Jobab. All these were the sons of Joktan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:23",
          "text": "Ophir, Havilah, and Jobab. All these were sons of Joktan."
        },
        {
          "reference": "Genesis 25:3",
          "text": "Jokshan was the father of Sheba and Dedan. And the sons of Dedan were the Asshurites, the Letushites, and the Leummites."
        },
        {
          "reference": "Job 1:1",
          "text": "There was a man in the land of Uz whose name was Job. And this man was blameless and upright, fearing God and shunning evil."
        },
        {
          "reference": "1 Kings 10:1",
          "text": "Now when the queen of Sheba heard about the fame of Solomon concerning the name of the LORD, she came to test him with difficult questions."
        },
        {
          "reference": "Matthew 12:42",
          "text": "The Queen of the South will rise at the judgment with this generation and condemn it; for she came from the ends of the earth to hear the wisdom of Solomon, and now One greater than Solomon is here."
        },
        {
          "reference": "Luke 11:31",
          "text": "The Queen of the South will rise at the judgment with the men of this generation and condemn them; for she came from the ends of the earth to hear the wisdom of Solomon, and now One greater than Solomon is here."
        },
        {
          "reference": "Jeremiah 25:23",
          "text": "Dedan, Tema, Buz, and all who cut the corners of their hair;"
        },
        {
          "reference": "Ezekiel 27:22",
          "text": "The merchants of Sheba and Raamah traded with you; for your wares they exchanged gold, the finest of all spices, and precious stones."
        },
        {
          "reference": "Isaiah 60:6",
          "text": "Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD."
        },
        {
          "reference": "Psalm 72:10",
          "text": "May the kings of Tarshish and distant shores bring tribute; may the kings of Sheba and Seba offer gifts."
        },
        {
          "reference": "1 Kings 4:30",
          "text": "Solomon’s wisdom was greater than that of all the men of the East, greater than all the wisdom of Egypt."
        },
        {
          "reference": "1 Kings 9:28",
          "text": "They sailed to Ophir and imported gold from there—420 talents—and delivered it to Solomon."
        },
        {
          "reference": "2 Chronicles 9:14",
          "text": "not including the revenue from the merchants and traders. And all the Arabian kings and governors of the land also brought gold and silver to Solomon."
        },
        {
          "reference": "2 Chronicles 9:21",
          "text": "For the king had the ships of Tarshish that went with Hiram’s servants, and once every three years the ships of Tarshish would arrive bearing gold, silver, ivory, apes, and peacocks."
        },
        {
          "reference": "1 Kings 10:15",
          "text": "not including the revenue from the merchants, traders, and all the Arabian kings and governors of the land."
        }
      ]
    },
    {
      "reference": "Genesis 10:30",
      "book": "Genesis",
      "chapter": 10,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "The region where they lived stretched from Mesha toward Sephar, in the eastern hill country."
        },
        {
          "version": "NLT",
          "text": "The territory they occupied extended from Mesha all the way to Sephar in the eastern mountains."
        },
        {
          "version": "ESV",
          "text": "The territory in which they lived extended from Mesha in the direction of Sephar to the hill country of the east."
        },
        {
          "version": "NKJV",
          "text": "And their dwelling place was from Mesha as you go toward Sephar, the mountain of the east."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 11:2",
          "text": "And as people journeyed eastward, they found a plain in the land of Shinar and settled there."
        },
        {
          "reference": "1 Chronicles 1:19",
          "text": "Two sons were born to Eber: One was named Peleg, because in his days the earth was divided, and his brother was named Joktan."
        },
        {
          "reference": "1 Chronicles 1:23",
          "text": "Ophir, Havilah, and Jobab. All these were sons of Joktan."
        },
        {
          "reference": "Isaiah 11:11",
          "text": "On that day the Lord will extend His hand a second time to recover the remnant of His people from Assyria, from Egypt, from Pathros, from Cush, from Elam, from Shinar, from Hamath, and from the islands of the sea."
        },
        {
          "reference": "Isaiah 21:13",
          "text": "This is the burden against Arabia: In the thickets of Arabia you must lodge, O caravans of Dedanites."
        },
        {
          "reference": "Isaiah 60:6",
          "text": "Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD."
        },
        {
          "reference": "Jeremiah 25:23",
          "text": "Dedan, Tema, Buz, and all who cut the corners of their hair;"
        },
        {
          "reference": "Jeremiah 49:28",
          "text": "Concerning Kedar and the kingdoms of Hazor, which Nebuchadnezzar king of Babylon defeated, this is what the LORD says: “Rise up, advance against Kedar, and destroy the people of the east!"
        },
        {
          "reference": "Ezekiel 27:21",
          "text": "Arabia and all the princes of Kedar were your customers, trading in lambs, rams, and goats."
        },
        {
          "reference": "Job 6:19",
          "text": "The caravans of Tema look for water; the travelers of Sheba hope to find it."
        },
        {
          "reference": "Job 1:1",
          "text": "There was a man in the land of Uz whose name was Job. And this man was blameless and upright, fearing God and shunning evil."
        },
        {
          "reference": "Matthew 2:1",
          "text": "After Jesus was born in Bethlehem in Judea, during the time of King Herod, Magi from the east arrived in Jerusalem,"
        },
        {
          "reference": "Matthew 2:11",
          "text": "On coming to the house, they saw the Child with His mother Mary, and they fell down and worshiped Him. Then they opened their treasures and presented Him with gifts of gold and frankincense and myrrh."
        },
        {
          "reference": "Acts 2:9-11",
          "text": "Parthians, Medes, and Elamites; residents of Mesopotamia, Judea and Cappadocia, Pontus and Asia, / Phrygia and Pamphylia, Egypt and the parts of Libya near Cyrene; visitors from Rome, / both Jews and converts to Judaism; Cretans and Arabs—we hear them declaring the wonders of God in our own tongues!”"
        },
        {
          "reference": "Acts 7:2-4",
          "text": "And Stephen declared: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Haran, / and told him, ‘Leave your country and your kindred and go to the land I will show you.’ / So Abraham left the land of the Chaldeans and settled in Haran. After his father died, God brought him out of that place and into this land where you are now living."
        }
      ]
    },
    {
      "reference": "Genesis 10:31",
      "book": "Genesis",
      "chapter": 10,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "These are the sons of Shem by their clans and languages, in their territories and nations."
        },
        {
          "version": "NLT",
          "text": "These were the descendants of Shem, identified by clan, language, territory, and national identity."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Shem, by their clans, their languages, their lands, and their nations."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Shem, according to their families, according to their languages, in their lands, according to their nations."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 11:1-9",
          "text": "Now the whole world had one language and a common form of speech. / And as people journeyed eastward, they found a plain in the land of Shinar and settled there. / And they said to one another, “Come, let us make bricks and bake them thoroughly.” So they used brick instead of stone, and tar instead of mortar. ..."
        },
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "1 Chronicles 1:19",
          "text": "Two sons were born to Eber: One was named Peleg, because in his days the earth was divided, and his brother was named Joktan."
        },
        {
          "reference": "Luke 3:35-36",
          "text": "the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah, / the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,"
        },
        {
          "reference": "Isaiah 66:18",
          "text": "“And I, knowing their deeds and thoughts, am coming to gather all nations and tongues, and they will come and see My glory."
        },
        {
          "reference": "Acts 2:5-11",
          "text": "Now there were dwelling in Jerusalem God-fearing Jews from every nation under heaven. / And when this sound rang out, a crowd came together in bewilderment, because each one heard them speaking his own language. / Astounded and amazed, they asked, “Are not all these who are speaking Galileans? ..."
        },
        {
          "reference": "Romans 15:12",
          "text": "And once more, Isaiah says: “The Root of Jesse will appear, One who will arise to rule over the Gentiles; in Him the Gentiles will put their hope.”"
        },
        {
          "reference": "1 Chronicles 1:5-7",
          "text": "The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras. / The sons of Gomer: Ashkenaz, Riphath, and Togarmah. / And the sons of Javan: Elishah, Tarshish, the Kittites, and the Rodanites."
        },
        {
          "reference": "Matthew 28:19",
          "text": "Therefore go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit,"
        },
        {
          "reference": "Isaiah 11:10",
          "text": "On that day the Root of Jesse will stand as a banner for the peoples. The nations will seek Him, and His place of rest will be glorious."
        },
        {
          "reference": "Revelation 7:9",
          "text": "After this I looked and saw a multitude too large to count, from every nation and tribe and people and tongue, standing before the throne and before the Lamb. They were wearing white robes and holding palm branches in their hands."
        },
        {
          "reference": "Genesis 9:19",
          "text": "These three were the sons of Noah, and from them the whole earth was populated."
        },
        {
          "reference": "Ezekiel 38:6",
          "text": "as well as Gomer with all its troops, and Beth-togarmah from the far north with all its troops—the many nations with you."
        },
        {
          "reference": "Zephaniah 3:9",
          "text": "For then I will restore pure lips to the peoples, that all may call upon the name of the LORD and serve Him shoulder to shoulder."
        }
      ]
    },
    {
      "reference": "Genesis 10:32",
      "book": "Genesis",
      "chapter": 10,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "These are the clans of Noah’s sons, according to their lines of descent, within their nations. From these the nations spread out over the earth after the flood."
        },
        {
          "version": "NLT",
          "text": "These are the clans that descended from Noah’s sons, arranged by nation according to their lines of descent. All the nations of the earth descended from these clans after the great flood."
        },
        {
          "version": "ESV",
          "text": "These are the clans of the sons of Noah, according to their genealogies, in their nations, and from these the nations spread abroad on the earth after the flood."
        },
        {
          "version": "NKJV",
          "text": "These were the families of the sons of Noah, according to their generations, in their nations; and from these the nations were divided on the earth after the flood."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Deuteronomy 32:8",
          "text": "When the Most High gave the nations their inheritance, when He divided the sons of man, He set the boundaries of the peoples according to the number of the sons of God."
        },
        {
          "reference": "Genesis 9:19",
          "text": "These three were the sons of Noah, and from them the whole earth was populated."
        },
        {
          "reference": "1 Chronicles 1:5-23",
          "text": "The sons of Japheth: Gomer, Magog, Madai, Javan, Tubal, Meshech, and Tiras. / The sons of Gomer: Ashkenaz, Riphath, and Togarmah. / And the sons of Javan: Elishah, Tarshish, the Kittites, and the Rodanites. ..."
        },
        {
          "reference": "Genesis 11:8-9",
          "text": "So the LORD scattered them from there over the face of all the earth, and they stopped building the city. / That is why it is called Babel, for there the LORD confused the language of the whole world, and from that place the LORD scattered them over the face of all the earth."
        },
        {
          "reference": "Genesis 11:1-9",
          "text": "Now the whole world had one language and a common form of speech. / And as people journeyed eastward, they found a plain in the land of Shinar and settled there. / And they said to one another, “Come, let us make bricks and bake them thoroughly.” So they used brick instead of stone, and tar instead of mortar. ..."
        },
        {
          "reference": "Luke 3:35-36",
          "text": "the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah, / the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,"
        },
        {
          "reference": "Genesis 9:1",
          "text": "And God blessed Noah and his sons and said to them, “Be fruitful and multiply and fill the earth."
        },
        {
          "reference": "Genesis 11:10-32",
          "text": "This is the account of Shem. Two years after the flood, when Shem was 100 years old, he became the father of Arphaxad. / And after he had become the father of Arphaxad, Shem lived 500 years and had other sons and daughters. / When Arphaxad was 35 years old, he became the father of Shelah. ..."
        },
        {
          "reference": "Romans 5:12",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned."
        },
        {
          "reference": "Genesis 1:28",
          "text": "God blessed them and said to them, “Be fruitful and multiply, and fill the earth and subdue it; rule over the fish of the sea and the birds of the air and every creature that crawls upon the earth.”"
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Genesis 8:17",
          "text": "Bring out all the living creatures that are with you—birds, livestock, and everything that crawls upon the ground—so that they can spread out over the earth and be fruitful and multiply upon it.”"
        },
        {
          "reference": "Isaiah 66:18",
          "text": "“And I, knowing their deeds and thoughts, am coming to gather all nations and tongues, and they will come and see My glory."
        },
        {
          "reference": "Genesis 5:32",
          "text": "After Noah was 500 years old, he became the father of Shem, Ham, and Japheth."
        }
      ]
    }
  ]
}