{
  "book": "genesis",
  "chapter": 17,
  "verses": [
    {
      "reference": "Genesis 17:1",
      "book": "Genesis",
      "chapter": 17,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, “I am God Almighty; walk before me faithfully and be blameless."
        },
        {
          "version": "NLT",
          "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, “I am El-Shaddai—‘God Almighty.’ Serve me faithfully and live a blameless life."
        },
        {
          "version": "ESV",
          "text": "When Abram was ninety-nine years old the LORD appeared to Abram and said to him, “I am God Almighty; walk before me, and be blameless,"
        },
        {
          "version": "NKJV",
          "text": "When Abram was ninety-nine years old, the LORD appeared to Abram and said to him, “I am Almighty God; walk before Me and be blameless."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 6:3",
          "text": "I appeared to Abraham, to Isaac, and to Jacob as God Almighty, but by My name the LORD I did not make Myself known to them."
        },
        {
          "reference": "Genesis 35:11",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you."
        },
        {
          "reference": "Genesis 28:3",
          "text": "May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples."
        },
        {
          "reference": "Genesis 48:3",
          "text": "Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan, and there He blessed me"
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 15:1",
          "text": "After these events, the word of the LORD came to Abram in a vision: “Do not be afraid, Abram. I am your shield, your very great reward.”"
        },
        {
          "reference": "Genesis 18:14",
          "text": "Is anything too difficult for the LORD? At the appointed time I will return to you—in about a year—and Sarah will have a son.”"
        },
        {
          "reference": "Genesis 22:17",
          "text": "I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies."
        },
        {
          "reference": "Genesis 26:24",
          "text": "and that night the LORD appeared to him and said, “I am the God of your father Abraham. Do not be afraid, for I am with you. I will bless you and multiply your descendants for the sake of My servant Abraham.”"
        },
        {
          "reference": "Genesis 46:3",
          "text": "“I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there."
        },
        {
          "reference": "Leviticus 26:12",
          "text": "I will walk among you and be your God, and you will be My people."
        },
        {
          "reference": "Deuteronomy 18:13",
          "text": "You must be blameless before the LORD your God."
        },
        {
          "reference": "2 Samuel 22:31",
          "text": "As for God, His way is perfect; the word of the LORD is flawless. He is a shield to all who take refuge in Him."
        },
        {
          "reference": "Psalm 91:1",
          "text": "He who dwells in the shelter of the Most High will abide in the shadow of the Almighty."
        },
        {
          "reference": "Isaiah 9:6",
          "text": "For unto us a child is born, unto us a son is given, and the government will be upon His shoulders. And He will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace."
        }
      ]
    },
    {
      "reference": "Genesis 17:2",
      "book": "Genesis",
      "chapter": 17,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "Then I will make my covenant between me and you and will greatly increase your numbers.”"
        },
        {
          "version": "NLT",
          "text": "I will make a covenant with you, by which I will guarantee to give you countless descendants.”"
        },
        {
          "version": "ESV",
          "text": "that I may make my covenant between me and you, and may multiply you greatly.”"
        },
        {
          "version": "NKJV",
          "text": "And I will make My covenant between Me and you, and will multiply you exceedingly.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 15:5-6",
          "text": "And the LORD took him outside and said, “Now look to the heavens and count the stars, if you are able.” Then He told him, “So shall your offspring be.” / Abram believed the LORD, and it was credited to him as righteousness."
        },
        {
          "reference": "Genesis 22:17-18",
          "text": "I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies. / And through your offspring all nations of the earth will be blessed, because you have obeyed My voice.”"
        },
        {
          "reference": "Genesis 26:4",
          "text": "I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed,"
        },
        {
          "reference": "Genesis 28:14",
          "text": "Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring."
        },
        {
          "reference": "Exodus 6:7",
          "text": "I will take you as My own people, and I will be your God. Then you will know that I am the LORD your God, who brought you out from under the yoke of the Egyptians."
        },
        {
          "reference": "Leviticus 26:9",
          "text": "I will turn toward you and make you fruitful and multiply you, and I will establish My covenant with you."
        },
        {
          "reference": "Deuteronomy 7:9",
          "text": "Know therefore that the LORD your God is God, the faithful God who keeps His covenant of loving devotion for a thousand generations of those who love Him and keep His commandments."
        },
        {
          "reference": "2 Samuel 7:12-16",
          "text": "And when your days are fulfilled and you rest with your fathers, I will raise up your descendant after you, who will come from your own body, and I will establish his kingdom. / He will build a house for My Name, and I will establish the throne of his kingdom forever. / I will be his Father, and he will be My son. When he does wrong, I will discipline him with the rod of men and with the blows of the sons of men. ..."
        },
        {
          "reference": "Psalm 105:8-11",
          "text": "He remembers His covenant forever, the word He ordained for a thousand generations— / the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: ..."
        },
        {
          "reference": "Isaiah 51:2",
          "text": "Look to Abraham your father, and to Sarah who gave you birth. When I called him, he was but one; then I blessed him and multiplied him."
        },
        {
          "reference": "Jeremiah 31:31-33",
          "text": "Behold, the days are coming, declares the LORD, when I will make a new covenant with the house of Israel and with the house of Judah. / It will not be like the covenant I made with their fathers when I took them by the hand to lead them out of the land of Egypt—a covenant they broke, though I was a husband to them,” declares the LORD. / “But this is the covenant I will make with the house of Israel after those days, declares the LORD. I will put My law in their minds and inscribe it on their hearts. And I will be their God, and they will be My people."
        },
        {
          "reference": "Ezekiel 37:26",
          "text": "And I will make a covenant of peace with them; it will be an everlasting covenant. I will establish them and multiply them, and I will set My sanctuary among them forever."
        },
        {
          "reference": "Romans 4:11-13",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them. / And he is also the father of the circumcised who not only are circumcised, but who also walk in the footsteps of the faith that our father Abraham had before he was circumcised. / For the promise to Abraham and his offspring that he would be heir of the world was not given through the law, but through the righteousness that comes by faith."
        },
        {
          "reference": "Romans 9:8",
          "text": "So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        }
      ]
    },
    {
      "reference": "Genesis 17:3",
      "book": "Genesis",
      "chapter": 17,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Abram fell facedown, and God said to him,"
        },
        {
          "version": "NLT",
          "text": "At this, Abram fell face down on the ground. Then God said to him,"
        },
        {
          "version": "ESV",
          "text": "Then Abram fell on his face. And God said to him,"
        },
        {
          "version": "NKJV",
          "text": "Then Abram fell on his face, and God talked with him, saying:"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Exodus 34:8",
          "text": "Moses immediately bowed down to the ground and worshiped."
        },
        {
          "reference": "Numbers 16:22",
          "text": "But Moses and Aaron fell facedown and said, “O God, the God of the spirits of all flesh, when one man sins, will You be angry with the whole congregation?”"
        },
        {
          "reference": "Joshua 5:14",
          "text": "“Neither,” He replied. “I have now come as Commander of the LORD’s army.” Then Joshua fell facedown in reverence and asked Him, “What does my Lord have to say to His servant?”"
        },
        {
          "reference": "1 Kings 18:39",
          "text": "When all the people saw this, they fell facedown and said, “The LORD, He is God! The LORD, He is God!”"
        },
        {
          "reference": "1 Chronicles 21:16",
          "text": "When David lifted up his eyes and saw the angel of the LORD standing between heaven and earth, with a drawn sword in his hand stretched out over Jerusalem, David and the elders, clothed in sackcloth, fell facedown."
        },
        {
          "reference": "Nehemiah 8:6",
          "text": "Then Ezra blessed the LORD, the great God, and with their hands uplifted, all the people said, “Amen, Amen!” Then they bowed down and worshiped the LORD with their faces to the ground."
        },
        {
          "reference": "Job 1:20",
          "text": "Then Job stood up, tore his robe, and shaved his head. He fell to the ground and worshiped,"
        },
        {
          "reference": "Isaiah 6:5",
          "text": "Then I said: “Woe is me, for I am ruined, because I am a man of unclean lips dwelling among a people of unclean lips; for my eyes have seen the King, the LORD of Hosts.”"
        },
        {
          "reference": "Ezekiel 1:28",
          "text": "The appearance of the brilliant light all around Him was like that of a rainbow in a cloud on a rainy day. This was the appearance of the likeness of the glory of the LORD. And when I saw it, I fell facedown and heard a voice speaking."
        },
        {
          "reference": "Matthew 17:6",
          "text": "When the disciples heard this, they fell facedown in terror."
        },
        {
          "reference": "Matthew 28:9",
          "text": "Suddenly Jesus met them and said, “Greetings!” They came to Him, grasped His feet, and worshiped Him."
        },
        {
          "reference": "Mark 5:33",
          "text": "Then the woman, knowing what had happened to her, came and fell down before Him trembling in fear, and she told Him the whole truth."
        },
        {
          "reference": "Luke 5:8",
          "text": "When Simon Peter saw this, he fell at Jesus’ knees. “Go away from me, Lord,” he said, “for I am a sinful man.”"
        },
        {
          "reference": "Luke 17:16",
          "text": "He fell facedown at Jesus’ feet in thanksgiving to Him—and he was a Samaritan."
        }
      ]
    },
    {
      "reference": "Genesis 17:4",
      "book": "Genesis",
      "chapter": 17,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "&#8220As for me, this is my covenant with you: You will be the father of many nations."
        },
        {
          "version": "NLT",
          "text": "“This is my covenant with you: I will make you the father of a multitude of nations!"
        },
        {
          "version": "ESV",
          "text": "“Behold, my covenant is with you, and you shall be the father of a multitude of nations."
        },
        {
          "version": "NKJV",
          "text": "“As for Me, behold, My covenant is with you, and you shall be a father of many nations."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 17:5",
      "book": "Genesis",
      "chapter": 17,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "No longer will you be called Abram; your name will be Abraham, for I have made you a father of many nations."
        },
        {
          "version": "NLT",
          "text": "What’s more, I am changing your name. It will no longer be Abram. Instead, you will be called Abraham, for you will be the father of many nations."
        },
        {
          "version": "ESV",
          "text": "No longer shall your name be called Abram, but your name shall be Abraham, for I have made you the father of a multitude of nations."
        },
        {
          "version": "NKJV",
          "text": "No longer shall your name be called Abram, but your name shall be Abraham; for I have made you a father of many nations."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 4:17",
          "text": "As it is written: “I have made you a father of many nations.” He is our father in the presence of God, in whom he believed, the God who gives life to the dead and calls into being what does not yet exist."
        },
        {
          "reference": "Galatians 3:29",
          "text": "And if you belong to Christ, then you are Abraham’s seed and heirs according to the promise."
        },
        {
          "reference": "Hebrews 11:12",
          "text": "And so from one man, and he as good as dead, came descendants as numerous as the stars in the sky and as countless as the sand on the seashore."
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Galatians 3:7-9",
          "text": "Understand, then, that those who have faith are sons of Abraham. / The Scripture foresaw that God would justify the Gentiles by faith, and foretold the gospel to Abraham: “All nations will be blessed through you.” / So those who have faith are blessed along with Abraham, the man of faith."
        },
        {
          "reference": "Acts 3:25",
          "text": "And you are sons of the prophets and of the covenant God made with your fathers when He said to Abraham, ‘Through your offspring all the families of the earth will be blessed.’"
        },
        {
          "reference": "Romans 4:11-12",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them. / And he is also the father of the circumcised who not only are circumcised, but who also walk in the footsteps of the faith that our father Abraham had before he was circumcised."
        },
        {
          "reference": "Galatians 4:28",
          "text": "Now you, brothers, like Isaac, are children of promise."
        },
        {
          "reference": "John 8:39",
          "text": "“Abraham is our father,” they replied. “If you were children of Abraham,” said Jesus, “you would do the works of Abraham."
        },
        {
          "reference": "Matthew 3:9",
          "text": "And do not presume to say to yourselves, ‘We have Abraham as our father.’ For I tell you that out of these stones God can raise up children for Abraham."
        },
        {
          "reference": "Isaiah 51:2",
          "text": "Look to Abraham your father, and to Sarah who gave you birth. When I called him, he was but one; then I blessed him and multiplied him."
        },
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 15:5",
          "text": "And the LORD took him outside and said, “Now look to the heavens and count the stars, if you are able.” Then He told him, “So shall your offspring be.”"
        },
        {
          "reference": "Genesis 22:17-18",
          "text": "I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies. / And through your offspring all nations of the earth will be blessed, because you have obeyed My voice.”"
        },
        {
          "reference": "Genesis 26:4",
          "text": "I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed,"
        }
      ]
    },
    {
      "reference": "Genesis 17:6",
      "book": "Genesis",
      "chapter": 17,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "I will make you very fruitful; I will make nations of you, and kings will come from you."
        },
        {
          "version": "NLT",
          "text": "I will make you extremely fruitful. Your descendants will become many nations, and kings will be among them!"
        },
        {
          "version": "ESV",
          "text": "I will make you exceedingly fruitful, and I will make you into nations, and kings shall come from you."
        },
        {
          "version": "NKJV",
          "text": "I will make you exceedingly fruitful; and I will make nations of you, and kings shall come from you."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 35:11",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you."
        },
        {
          "reference": "Genesis 12:2",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing."
        },
        {
          "reference": "Genesis 28:3",
          "text": "May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples."
        },
        {
          "reference": "Genesis 48:19",
          "text": "But his father refused. “I know, my son, I know!” he said. “He too shall become a people, and he too shall be great; nevertheless, his younger brother shall be greater than he, and his offspring shall become a multitude of nations.”"
        },
        {
          "reference": "Genesis 49:10",
          "text": "The scepter will not depart from Judah, nor the staff from between his feet, until Shiloh comes and the allegiance of the nations is his."
        },
        {
          "reference": "1 Kings 8:25",
          "text": "Therefore now, O LORD, God of Israel, keep for Your servant, my father David, what You promised when You said: ‘You will never fail to have a man to sit before Me on the throne of Israel, if only your descendants guard their way to walk before Me as you have done.’"
        },
        {
          "reference": "2 Samuel 7:12-16",
          "text": "And when your days are fulfilled and you rest with your fathers, I will raise up your descendant after you, who will come from your own body, and I will establish his kingdom. / He will build a house for My Name, and I will establish the throne of his kingdom forever. / I will be his Father, and he will be My son. When he does wrong, I will discipline him with the rod of men and with the blows of the sons of men. ..."
        },
        {
          "reference": "Psalm 72:8-11",
          "text": "May he rule from sea to sea, and from the Euphrates to the ends of the earth. / May the nomads bow before him, and his enemies lick the dust. / May the kings of Tarshish and distant shores bring tribute; may the kings of Sheba and Seba offer gifts. ..."
        },
        {
          "reference": "Psalm 89:3-4",
          "text": "You said, “I have made a covenant with My chosen one, I have sworn to David My servant: / ‘I will establish your offspring forever and build up your throne for all generations.’” Selah"
        },
        {
          "reference": "Psalm 89:27-29",
          "text": "I will indeed appoint him as My firstborn, the highest of the kings of the earth. / I will forever preserve My loving devotion for him, and My covenant with him will stand fast. / I will establish his line forever, his throne as long as the heavens endure."
        },
        {
          "reference": "Isaiah 9:6-7",
          "text": "For unto us a child is born, unto us a son is given, and the government will be upon His shoulders. And He will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace. / Of the increase of His government and peace there will be no end. He will reign on the throne of David and over his kingdom, to establish and sustain it with justice and righteousness from that time and forevermore. The zeal of the LORD of Hosts will accomplish this."
        },
        {
          "reference": "Isaiah 49:23",
          "text": "Kings will be your foster fathers, and their queens your nursing mothers. They will bow to you facedown and lick the dust at your feet. Then you will know that I am the LORD; those who hope in Me will never be put to shame.”"
        },
        {
          "reference": "Jeremiah 33:17",
          "text": "For this is what the LORD says: David will never lack a man to sit on the throne of the house of Israel,"
        },
        {
          "reference": "Ezekiel 37:24-25",
          "text": "My servant David will be king over them, and there will be one shepherd for all of them. They will follow My ordinances and keep and observe My statutes. / They will live in the land that I gave to My servant Jacob, where your fathers lived. They will live there forever with their children and grandchildren, and My servant David will be their prince forever."
        },
        {
          "reference": "Romans 4:11-12",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them. / And he is also the father of the circumcised who not only are circumcised, but who also walk in the footsteps of the faith that our father Abraham had before he was circumcised."
        }
      ]
    },
    {
      "reference": "Genesis 17:7",
      "book": "Genesis",
      "chapter": 17,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "I will establish my covenant as an everlasting covenant between me and you and your descendants after you for the generations to come, to be your God and the God of your descendants after you."
        },
        {
          "version": "NLT",
          "text": "“I will confirm my covenant with you and your descendants after you, from generation to generation. This is the everlasting covenant: I will always be your God and the God of your descendants after you."
        },
        {
          "version": "ESV",
          "text": "And I will establish my covenant between me and you and your offspring after you throughout their generations for an everlasting covenant, to be God to you and to your offspring after you."
        },
        {
          "version": "NKJV",
          "text": "And I will establish My covenant between Me and you and your descendants after you in their generations, for an everlasting covenant, to be God to you and your descendants after you."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Galatians 3:29",
          "text": "And if you belong to Christ, then you are Abraham’s seed and heirs according to the promise."
        },
        {
          "reference": "Romans 4:11-12",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them. / And he is also the father of the circumcised who not only are circumcised, but who also walk in the footsteps of the faith that our father Abraham had before he was circumcised."
        },
        {
          "reference": "Romans 9:8",
          "text": "So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Galatians 3:16",
          "text": "The promises were spoken to Abraham and to his seed. The Scripture does not say, “and to seeds,” meaning many, but “and to your seed,” meaning One, who is Christ."
        },
        {
          "reference": "Acts 2:39",
          "text": "This promise belongs to you and your children and to all who are far off—to all whom the Lord our God will call to Himself.”"
        },
        {
          "reference": "Hebrews 8:10",
          "text": "For this is the covenant I will make with the house of Israel after those days, declares the Lord. I will put My laws in their minds and inscribe them on their hearts. And I will be their God, and they will be My people."
        },
        {
          "reference": "Romans 11:17-18",
          "text": "Now if some branches have been broken off, and you, a wild olive shoot, have been grafted in among the others to share in the nourishment of the olive root, / do not boast over those branches. If you do, remember this: You do not support the root, but the root supports you."
        },
        {
          "reference": "Ephesians 2:12",
          "text": "remember that at that time you were separate from Christ, alienated from the commonwealth of Israel, and strangers to the covenants of the promise, without hope and without God in the world."
        },
        {
          "reference": "Galatians 3:14",
          "text": "He redeemed us in order that the blessing promised to Abraham would come to the Gentiles in Christ Jesus, so that by faith we might receive the promise of the Spirit."
        },
        {
          "reference": "Hebrews 11:9",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Exodus 6:7",
          "text": "I will take you as My own people, and I will be your God. Then you will know that I am the LORD your God, who brought you out from under the yoke of the Egyptians."
        },
        {
          "reference": "Leviticus 26:12",
          "text": "I will walk among you and be your God, and you will be My people."
        },
        {
          "reference": "Deuteronomy 7:9",
          "text": "Know therefore that the LORD your God is God, the faithful God who keeps His covenant of loving devotion for a thousand generations of those who love Him and keep His commandments."
        },
        {
          "reference": "Jeremiah 31:33",
          "text": "“But this is the covenant I will make with the house of Israel after those days, declares the LORD. I will put My law in their minds and inscribe it on their hearts. And I will be their God, and they will be My people."
        },
        {
          "reference": "Ezekiel 37:26-27",
          "text": "And I will make a covenant of peace with them; it will be an everlasting covenant. I will establish them and multiply them, and I will set My sanctuary among them forever. / My dwelling place will be with them; I will be their God, and they will be My people."
        }
      ]
    },
    {
      "reference": "Genesis 17:8",
      "book": "Genesis",
      "chapter": 17,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "The whole land of Canaan, where you now reside as a foreigner, I will give as an everlasting possession to you and your descendants after you; and I will be their God.”"
        },
        {
          "version": "NLT",
          "text": "And I will give the entire land of Canaan, where you now live as a foreigner, to you and your descendants. It will be their possession forever, and I will be their God.”"
        },
        {
          "version": "ESV",
          "text": "And I will give to you and to your offspring after you the land of your sojournings, all the land of Canaan, for an everlasting possession, and I will be their God.”"
        },
        {
          "version": "NKJV",
          "text": "Also I give to you and your descendants after you the land in which you are a stranger, all the land of Canaan, as an everlasting possession; and I will be their God.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 13:15",
          "text": "for all the land that you see, I will give to you and your offspring forever."
        },
        {
          "reference": "Genesis 15:18",
          "text": "On that day the LORD made a covenant with Abram, saying, “To your descendants I have given this land—from the river of Egypt to the great River Euphrates—"
        },
        {
          "reference": "Exodus 6:8",
          "text": "And I will bring you into the land that I swore to give to Abraham, Isaac, and Jacob. I will give it to you as a possession. I am the LORD!’”"
        },
        {
          "reference": "Leviticus 26:42",
          "text": "then I will remember My covenant with Jacob and My covenant with Isaac and My covenant with Abraham, and I will remember the land."
        },
        {
          "reference": "Deuteronomy 1:8",
          "text": "See, I have placed the land before you. Enter and possess the land that the LORD swore He would give to your fathers Abraham, Isaac, and Jacob, and to their descendants after them.”"
        },
        {
          "reference": "Deuteronomy 34:4",
          "text": "And the LORD said to him, “This is the land that I swore to give Abraham, Isaac, and Jacob when I said, ‘I will give it to your descendants.’ I have let you see it with your own eyes, but you will not cross into it.”"
        },
        {
          "reference": "Joshua 1:6",
          "text": "Be strong and courageous, for you shall give these people the inheritance of the land that I swore to their fathers I would give them."
        },
        {
          "reference": "Nehemiah 9:8",
          "text": "You found his heart faithful before You, and made a covenant with him to give the land of the Canaanites and Hittites, of the Amorites and Perizzites, of the Jebusites and Girgashites—to give it to his descendants. You have kept Your promise, because You are righteous."
        },
        {
          "reference": "Psalm 105:9-11",
          "text": "the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: / “I will give you the land of Canaan as the portion of your inheritance.”"
        },
        {
          "reference": "Acts 7:5",
          "text": "He gave him no inheritance here, not even a foot of ground. But God promised to give possession of the land to Abraham and his descendants, even though he did not yet have a child."
        },
        {
          "reference": "Romans 4:13",
          "text": "For the promise to Abraham and his offspring that he would be heir of the world was not given through the law, but through the righteousness that comes by faith."
        },
        {
          "reference": "Galatians 3:16",
          "text": "The promises were spoken to Abraham and to his seed. The Scripture does not say, “and to seeds,” meaning many, but “and to your seed,” meaning One, who is Christ."
        },
        {
          "reference": "Hebrews 11:9",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Hebrews 11:13",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth."
        }
      ]
    },
    {
      "reference": "Genesis 17:9",
      "book": "Genesis",
      "chapter": 17,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "Then God said to Abraham, &#8220As for you, you must keep my covenant, you and your descendants after you for the generations to come."
        },
        {
          "version": "NLT",
          "text": "Then God said to Abraham, “Your responsibility is to obey the terms of the covenant. You and all your descendants have this continual responsibility."
        },
        {
          "version": "ESV",
          "text": "And God said to Abraham, “As for you, you shall keep my covenant, you and your offspring after you throughout their generations."
        },
        {
          "version": "NKJV",
          "text": "And God said to Abraham: “As for you, you shall keep My covenant, you and your descendants after you throughout their generations."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 17:10",
      "book": "Genesis",
      "chapter": 17,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "This is my covenant with you and your descendants after you, the covenant you are to keep: Every male among you shall be circumcised."
        },
        {
          "version": "NLT",
          "text": "This is the covenant that you and your descendants must keep: Each male among you must be circumcised."
        },
        {
          "version": "ESV",
          "text": "This is my covenant, which you shall keep, between me and you and your offspring after you: Every male among you shall be circumcised."
        },
        {
          "version": "NKJV",
          "text": "This is My covenant which you shall keep, between Me and you and your descendants after you: Every male child among you shall be circumcised;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Romans 4:11",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them."
        },
        {
          "reference": "Galatians 5:2-3",
          "text": "Take notice: I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all. / Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law."
        },
        {
          "reference": "Colossians 2:11",
          "text": "In Him you were also circumcised, in the putting off of your sinful nature, with the circumcision performed by Christ and not by human hands."
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Deuteronomy 10:16",
          "text": "Circumcise your hearts, therefore, and stiffen your necks no more."
        },
        {
          "reference": "Jeremiah 4:4",
          "text": "Circumcise yourselves to the LORD, and remove the foreskins of your hearts, O men of Judah and people of Jerusalem. Otherwise, My wrath will break out like fire and burn with no one to extinguish it, because of your evil deeds.”"
        },
        {
          "reference": "Romans 2:28-29",
          "text": "A man is not a Jew because he is one outwardly, nor is circumcision only outward and physical. / No, a man is a Jew because he is one inwardly, and circumcision is a matter of the heart, by the Spirit, not by the written code. Such a man’s praise does not come from men, but from God."
        },
        {
          "reference": "Galatians 6:15",
          "text": "For neither circumcision nor uncircumcision means anything. What counts is a new creation."
        },
        {
          "reference": "Philippians 3:3",
          "text": "For it is we who are the circumcision, we who worship by the Spirit of God, who glory in Christ Jesus, and who put no confidence in the flesh—"
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "Ezekiel 44:7",
          "text": "In addition to all your other abominations, you brought in foreigners uncircumcised in both heart and flesh to occupy My sanctuary; you defiled My temple when you offered My food—the fat and the blood; you broke My covenant."
        },
        {
          "reference": "1 Corinthians 7:18-19",
          "text": "Was a man already circumcised when he was called? He should not become uncircumcised. Was a man still uncircumcised when called? He should not be circumcised. / Circumcision is nothing and uncircumcision is nothing. Keeping God’s commandments is what counts."
        },
        {
          "reference": "Galatians 3:28",
          "text": "There is neither Jew nor Greek, slave nor free, male nor female, for you are all one in Christ Jesus."
        }
      ]
    },
    {
      "reference": "Genesis 17:11",
      "book": "Genesis",
      "chapter": 17,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "You are to undergo circumcision, and it will be the sign of the covenant between me and you."
        },
        {
          "version": "NLT",
          "text": "You must cut off the flesh of your foreskin as a sign of the covenant between me and you."
        },
        {
          "version": "ESV",
          "text": "You shall be circumcised in the flesh of your foreskins, and it shall be a sign of the covenant between me and you."
        },
        {
          "version": "NKJV",
          "text": "and you shall be circumcised in the flesh of your foreskins, and it shall be a sign of the covenant between Me and you."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 4:11",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them."
        },
        {
          "reference": "Galatians 5:2-3",
          "text": "Take notice: I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all. / Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law."
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Colossians 2:11-12",
          "text": "In Him you were also circumcised, in the putting off of your sinful nature, with the circumcision performed by Christ and not by human hands. / And having been buried with Him in baptism, you were raised with Him through your faith in the power of God, who raised Him from the dead."
        },
        {
          "reference": "Romans 2:28-29",
          "text": "A man is not a Jew because he is one outwardly, nor is circumcision only outward and physical. / No, a man is a Jew because he is one inwardly, and circumcision is a matter of the heart, by the Spirit, not by the written code. Such a man’s praise does not come from men, but from God."
        },
        {
          "reference": "Galatians 6:15",
          "text": "For neither circumcision nor uncircumcision means anything. What counts is a new creation."
        },
        {
          "reference": "Philippians 3:3",
          "text": "For it is we who are the circumcision, we who worship by the Spirit of God, who glory in Christ Jesus, and who put no confidence in the flesh—"
        },
        {
          "reference": "1 Corinthians 7:18-19",
          "text": "Was a man already circumcised when he was called? He should not become uncircumcised. Was a man still uncircumcised when called? He should not be circumcised. / Circumcision is nothing and uncircumcision is nothing. Keeping God’s commandments is what counts."
        },
        {
          "reference": "Ephesians 2:11-13",
          "text": "Therefore remember that formerly you who are Gentiles in the flesh and called uncircumcised by the so-called circumcision (that done in the body by human hands)— / remember that at that time you were separate from Christ, alienated from the commonwealth of Israel, and strangers to the covenants of the promise, without hope and without God in the world. / But now in Christ Jesus you who once were far away have been brought near through the blood of Christ."
        },
        {
          "reference": "John 7:22-23",
          "text": "But because Moses gave you circumcision, you circumcise a boy on the Sabbath (not that it is from Moses, but from the patriarchs.) / If a boy can be circumcised on the Sabbath so that the law of Moses will not be broken, why are you angry with Me for making the whole man well on the Sabbath?"
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Deuteronomy 10:16",
          "text": "Circumcise your hearts, therefore, and stiffen your necks no more."
        },
        {
          "reference": "Jeremiah 4:4",
          "text": "Circumcise yourselves to the LORD, and remove the foreskins of your hearts, O men of Judah and people of Jerusalem. Otherwise, My wrath will break out like fire and burn with no one to extinguish it, because of your evil deeds.”"
        },
        {
          "reference": "Exodus 4:24-26",
          "text": "Now at a lodging place along the way, the LORD met Moses and was about to kill him. / But Zipporah took a flint knife, cut off her son’s foreskin, and touched it to Moses’ feet. “Surely you are a bridegroom of blood to me,” she said. / So the LORD let him alone. (When she said, “bridegroom of blood,” she was referring to the circumcision.)"
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        }
      ]
    },
    {
      "reference": "Genesis 17:12",
      "book": "Genesis",
      "chapter": 17,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "For the generations to come every male among you who is eight days old must be circumcised, including those born in your household or bought with money from a foreigner—those who are not your offspring."
        },
        {
          "version": "NLT",
          "text": "From generation to generation, every male child must be circumcised on the eighth day after his birth. This applies not only to members of your family but also to the servants born in your household and the foreign-born servants whom you have purchased."
        },
        {
          "version": "ESV",
          "text": "He who is eight days old among you shall be circumcised. Every male throughout your generations, whether born in your house or bought with your money from any foreigner who is not of your offspring,"
        },
        {
          "version": "NKJV",
          "text": "He who is eight days old among you shall be circumcised, every male child in your generations, he who is born in your house or bought with money from any foreigner who is not your descendant."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Romans 4:11",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them."
        },
        {
          "reference": "Galatians 5:3",
          "text": "Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law."
        },
        {
          "reference": "Colossians 2:11-12",
          "text": "In Him you were also circumcised, in the putting off of your sinful nature, with the circumcision performed by Christ and not by human hands. / And having been buried with Him in baptism, you were raised with Him through your faith in the power of God, who raised Him from the dead."
        },
        {
          "reference": "Exodus 12:48-49",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it. / The same law shall apply to both the native and the foreigner who resides among you.”"
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "Luke 2:21",
          "text": "When the eight days before His circumcision had passed, He was named Jesus, the name the angel had given Him before He was conceived."
        },
        {
          "reference": "Philippians 3:3",
          "text": "For it is we who are the circumcision, we who worship by the Spirit of God, who glory in Christ Jesus, and who put no confidence in the flesh—"
        },
        {
          "reference": "John 7:22-23",
          "text": "But because Moses gave you circumcision, you circumcise a boy on the Sabbath (not that it is from Moses, but from the patriarchs.) / If a boy can be circumcised on the Sabbath so that the law of Moses will not be broken, why are you angry with Me for making the whole man well on the Sabbath?"
        },
        {
          "reference": "Deuteronomy 10:16",
          "text": "Circumcise your hearts, therefore, and stiffen your necks no more."
        },
        {
          "reference": "Jeremiah 4:4",
          "text": "Circumcise yourselves to the LORD, and remove the foreskins of your hearts, O men of Judah and people of Jerusalem. Otherwise, My wrath will break out like fire and burn with no one to extinguish it, because of your evil deeds.”"
        },
        {
          "reference": "Ezekiel 44:9",
          "text": "This is what the Lord GOD says: No foreigner uncircumcised in heart and flesh may enter My sanctuary—not even a foreigner who lives among the Israelites."
        },
        {
          "reference": "Acts 15:1",
          "text": "Then some men came down from Judea and were teaching the brothers, “Unless you are circumcised according to the custom of Moses, you cannot be saved.”"
        },
        {
          "reference": "Romans 2:28-29",
          "text": "A man is not a Jew because he is one outwardly, nor is circumcision only outward and physical. / No, a man is a Jew because he is one inwardly, and circumcision is a matter of the heart, by the Spirit, not by the written code. Such a man’s praise does not come from men, but from God."
        }
      ]
    },
    {
      "reference": "Genesis 17:13",
      "book": "Genesis",
      "chapter": 17,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "Whether born in your household or bought with your money, they must be circumcised. My covenant in your flesh is to be an everlasting covenant."
        },
        {
          "version": "NLT",
          "text": "All must be circumcised. Your bodies will bear the mark of my everlasting covenant."
        },
        {
          "version": "ESV",
          "text": "both he who is born in your house and he who is bought with your money, shall surely be circumcised. So shall my covenant be in your flesh an everlasting covenant."
        },
        {
          "version": "NKJV",
          "text": "He who is born in your house and he who is bought with your money must be circumcised, and My covenant shall be in your flesh for an everlasting covenant."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:10-12",
          "text": "This is My covenant with you and your descendants after you, which you are to keep: Every male among you must be circumcised. / You are to circumcise the flesh of your foreskin, and this will be a sign of the covenant between Me and you. / Generation after generation, every male must be circumcised when he is eight days old, including those born in your household and those purchased from a foreigner—even those who are not your offspring."
        },
        {
          "reference": "Genesis 21:4",
          "text": "When his son Isaac was eight days old, Abraham circumcised him, as God had commanded him."
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Deuteronomy 10:16",
          "text": "Circumcise your hearts, therefore, and stiffen your necks no more."
        },
        {
          "reference": "Deuteronomy 30:6",
          "text": "The LORD your God will circumcise your hearts and the hearts of your descendants, and you will love Him with all your heart and with all your soul, so that you may live."
        },
        {
          "reference": "Jeremiah 4:4",
          "text": "Circumcise yourselves to the LORD, and remove the foreskins of your hearts, O men of Judah and people of Jerusalem. Otherwise, My wrath will break out like fire and burn with no one to extinguish it, because of your evil deeds.”"
        },
        {
          "reference": "Ezekiel 44:9",
          "text": "This is what the Lord GOD says: No foreigner uncircumcised in heart and flesh may enter My sanctuary—not even a foreigner who lives among the Israelites."
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Romans 2:28-29",
          "text": "A man is not a Jew because he is one outwardly, nor is circumcision only outward and physical. / No, a man is a Jew because he is one inwardly, and circumcision is a matter of the heart, by the Spirit, not by the written code. Such a man’s praise does not come from men, but from God."
        },
        {
          "reference": "Romans 4:11",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them."
        },
        {
          "reference": "1 Corinthians 7:18-19",
          "text": "Was a man already circumcised when he was called? He should not become uncircumcised. Was a man still uncircumcised when called? He should not be circumcised. / Circumcision is nothing and uncircumcision is nothing. Keeping God’s commandments is what counts."
        },
        {
          "reference": "Galatians 5:2-3",
          "text": "Take notice: I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all. / Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law."
        },
        {
          "reference": "Galatians 6:15",
          "text": "For neither circumcision nor uncircumcision means anything. What counts is a new creation."
        },
        {
          "reference": "Philippians 3:3",
          "text": "For it is we who are the circumcision, we who worship by the Spirit of God, who glory in Christ Jesus, and who put no confidence in the flesh—"
        }
      ]
    },
    {
      "reference": "Genesis 17:14",
      "book": "Genesis",
      "chapter": 17,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Any uncircumcised male, who has not been circumcised in the flesh, will be cut off from his people; he has broken my covenant.”"
        },
        {
          "version": "NLT",
          "text": "Any male who fails to be circumcised will be cut off from the covenant family for breaking the covenant.”"
        },
        {
          "version": "ESV",
          "text": "Any uncircumcised male who is not circumcised in the flesh of his foreskin shall be cut off from his people; he has broken my covenant.”"
        },
        {
          "version": "NKJV",
          "text": "And the uncircumcised male child, who is not circumcised in the flesh of his foreskin, that person shall be cut off from his people; he has broken My covenant.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Exodus 4:24-26",
          "text": "Now at a lodging place along the way, the LORD met Moses and was about to kill him. / But Zipporah took a flint knife, cut off her son’s foreskin, and touched it to Moses’ feet. “Surely you are a bridegroom of blood to me,” she said. / So the LORD let him alone. (When she said, “bridegroom of blood,” she was referring to the circumcision.)"
        },
        {
          "reference": "Galatians 5:3",
          "text": "Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law."
        },
        {
          "reference": "Romans 2:25-29",
          "text": "Circumcision has value if you observe the law, but if you break the law, your circumcision has become uncircumcision. / If a man who is not circumcised keeps the requirements of the law, will not his uncircumcision be regarded as circumcision? / The one who is physically uncircumcised yet keeps the law will condemn you who, even though you have the written code and circumcision, are a lawbreaker. ..."
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Colossians 2:11-13",
          "text": "In Him you were also circumcised, in the putting off of your sinful nature, with the circumcision performed by Christ and not by human hands. / And having been buried with Him in baptism, you were raised with Him through your faith in the power of God, who raised Him from the dead. / When you were dead in your trespasses and in the uncircumcision of your sinful nature, God made you alive with Christ. He forgave us all our trespasses,"
        },
        {
          "reference": "Deuteronomy 10:16",
          "text": "Circumcise your hearts, therefore, and stiffen your necks no more."
        },
        {
          "reference": "Jeremiah 4:4",
          "text": "Circumcise yourselves to the LORD, and remove the foreskins of your hearts, O men of Judah and people of Jerusalem. Otherwise, My wrath will break out like fire and burn with no one to extinguish it, because of your evil deeds.”"
        },
        {
          "reference": "Philippians 3:3",
          "text": "For it is we who are the circumcision, we who worship by the Spirit of God, who glory in Christ Jesus, and who put no confidence in the flesh—"
        },
        {
          "reference": "1 Corinthians 7:18-19",
          "text": "Was a man already circumcised when he was called? He should not become uncircumcised. Was a man still uncircumcised when called? He should not be circumcised. / Circumcision is nothing and uncircumcision is nothing. Keeping God’s commandments is what counts."
        },
        {
          "reference": "Leviticus 26:41",
          "text": "and I acted with hostility toward them and brought them into the land of their enemies—and if their uncircumcised hearts will be humbled and they will make amends for their iniquity,"
        },
        {
          "reference": "Ezekiel 44:7-9",
          "text": "In addition to all your other abominations, you brought in foreigners uncircumcised in both heart and flesh to occupy My sanctuary; you defiled My temple when you offered My food—the fat and the blood; you broke My covenant. / And you have not kept charge of My holy things, but have appointed others to keep charge of My sanctuary for you.’ / This is what the Lord GOD says: No foreigner uncircumcised in heart and flesh may enter My sanctuary—not even a foreigner who lives among the Israelites."
        },
        {
          "reference": "Acts 15:1",
          "text": "Then some men came down from Judea and were teaching the brothers, “Unless you are circumcised according to the custom of Moses, you cannot be saved.”"
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "Romans 4:11-12",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them. / And he is also the father of the circumcised who not only are circumcised, but who also walk in the footsteps of the faith that our father Abraham had before he was circumcised."
        }
      ]
    },
    {
      "reference": "Genesis 17:15",
      "book": "Genesis",
      "chapter": 17,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "God also said to Abraham, &#8220As for Sarai your wife, you are no longer to call her Sarai; her name will be Sarah."
        },
        {
          "version": "NLT",
          "text": "Then God said to Abraham, “Regarding Sarai, your wife—her name will no longer be Sarai. From now on her name will be Sarah."
        },
        {
          "version": "ESV",
          "text": "And God said to Abraham, “As for Sarai your wife, you shall not call her name Sarai, but Sarah shall be her name."
        },
        {
          "version": "NKJV",
          "text": "Then God said to Abraham, “As for Sarai your wife, you shall not call her name Sarai, but Sarah shall be her name."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 17:16",
      "book": "Genesis",
      "chapter": 17,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "I will bless her and will surely give you a son by her. I will bless her so that she will be the mother of nations; kings of peoples will come from her.”"
        },
        {
          "version": "NLT",
          "text": "And I will bless her and give you a son from her! Yes, I will bless her richly, and she will become the mother of many nations. Kings of nations will be among her descendants.”"
        },
        {
          "version": "ESV",
          "text": "I will bless her, and moreover, I will give you a son by her. I will bless her, and she shall become nations; kings of peoples shall come from her.”"
        },
        {
          "version": "NKJV",
          "text": "And I will bless her and also give you a son by her; then I will bless her, and she shall be a mother of nations; kings of peoples shall be from her.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:10-14",
          "text": "Then the LORD said, “I will surely return to you at this time next year, and your wife Sarah will have a son!” Now Sarah was behind him, listening at the entrance to the tent. / And Abraham and Sarah were already old and well along in years; Sarah had passed the age of childbearing. / So she laughed to herself, saying, “After I am worn out and my master is old, will I now have this pleasure?” ..."
        },
        {
          "reference": "Genesis 21:1-3",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised. / And Abraham gave the name Isaac to the son Sarah bore to him."
        },
        {
          "reference": "Romans 4:19-21",
          "text": "Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. / Yet he did not waver through disbelief in the promise of God, but was strengthened in his faith and gave glory to God, / being fully persuaded that God was able to do what He had promised."
        },
        {
          "reference": "Hebrews 11:11-12",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised. / And so from one man, and he as good as dead, came descendants as numerous as the stars in the sky and as countless as the sand on the seashore."
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "Genesis 12:2",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing."
        },
        {
          "reference": "Genesis 15:4-6",
          "text": "Then the word of the LORD came to Abram, saying, “This one will not be your heir, but one who comes from your own body will be your heir.” / And the LORD took him outside and said, “Now look to the heavens and count the stars, if you are able.” Then He told him, “So shall your offspring be.” / Abram believed the LORD, and it was credited to him as righteousness."
        },
        {
          "reference": "Genesis 22:17-18",
          "text": "I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies. / And through your offspring all nations of the earth will be blessed, because you have obeyed My voice.”"
        },
        {
          "reference": "Genesis 24:60",
          "text": "And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.”"
        },
        {
          "reference": "Genesis 35:11",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you."
        },
        {
          "reference": "Genesis 49:10",
          "text": "The scepter will not depart from Judah, nor the staff from between his feet, until Shiloh comes and the allegiance of the nations is his."
        },
        {
          "reference": "Isaiah 51:2",
          "text": "Look to Abraham your father, and to Sarah who gave you birth. When I called him, he was but one; then I blessed him and multiplied him."
        },
        {
          "reference": "Romans 9:7-9",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Matthew 1:2",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Luke 1:31-33",
          "text": "Behold, you will conceive and give birth to a son, and you are to give Him the name Jesus. / He will be great and will be called the Son of the Most High. The Lord God will give Him the throne of His father David, / and He will reign over the house of Jacob forever. His kingdom will never end!”"
        }
      ]
    },
    {
      "reference": "Genesis 17:17",
      "book": "Genesis",
      "chapter": 17,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham fell facedown; he laughed and said to himself, “Will a son be born to a man a hundred years old? Will Sarah bear a child at the age of ninety?”"
        },
        {
          "version": "NLT",
          "text": "Then Abraham bowed down to the ground, but he laughed to himself in disbelief. “How could I become a father at the age of 100?” he thought. “And how can Sarah have a baby when she is ninety years old?”"
        },
        {
          "version": "ESV",
          "text": "Then Abraham fell on his face and laughed and said to himself, “Shall a child be born to a man who is a hundred years old? Shall Sarah, who is ninety years old, bear a child?”"
        },
        {
          "version": "NKJV",
          "text": "Then Abraham fell on his face and laughed, and said in his heart, “Shall a child be born to a man who is one hundred years old? And shall Sarah, who is ninety years old, bear a child? ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 4:19-20",
          "text": "Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. / Yet he did not waver through disbelief in the promise of God, but was strengthened in his faith and gave glory to God,"
        },
        {
          "reference": "Hebrews 11:11-12",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised. / And so from one man, and he as good as dead, came descendants as numerous as the stars in the sky and as countless as the sand on the seashore."
        },
        {
          "reference": "Luke 1:18",
          "text": "“How can I be sure of this?” Zechariah asked the angel. “I am an old man, and my wife is well along in years.”"
        },
        {
          "reference": "Genesis 18:12-14",
          "text": "So she laughed to herself, saying, “After I am worn out and my master is old, will I now have this pleasure?” / And the LORD asked Abraham, “Why did Sarah laugh and say, ‘Can I really bear a child when I am old?’ / Is anything too difficult for the LORD? At the appointed time I will return to you—in about a year—and Sarah will have a son.”"
        },
        {
          "reference": "Genesis 21:6-7",
          "text": "Then Sarah said, “God has made me laugh, and everyone who hears of this will laugh with me.” / She added, “Who would have told Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.”"
        },
        {
          "reference": "Romans 9:9",
          "text": "For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Luke 1:34-37",
          "text": "“How can this be,” Mary asked the angel, “since I am a virgin?” / The angel replied, “The Holy Spirit will come upon you, and the power of the Most High will overshadow you. So the Holy One to be born will be called the Son of God. / Look, even Elizabeth your relative has conceived a son in her old age, and she who was called barren is in her sixth month. ..."
        },
        {
          "reference": "Genesis 15:4-6",
          "text": "Then the word of the LORD came to Abram, saying, “This one will not be your heir, but one who comes from your own body will be your heir.” / And the LORD took him outside and said, “Now look to the heavens and count the stars, if you are able.” Then He told him, “So shall your offspring be.” / Abram believed the LORD, and it was credited to him as righteousness."
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Matthew 19:26",
          "text": "Jesus looked at them and said, “With man this is impossible, but with God all things are possible.”"
        },
        {
          "reference": "Numbers 11:21-23",
          "text": "But Moses replied, “Here I am among 600,000 men on foot, yet You say, ‘I will give them meat, and they will eat for a month.’ / If all our flocks and herds were slaughtered for them, would they have enough? Or if all the fish in the sea were caught for them, would they have enough?” / The LORD answered Moses, “Is the LORD’s arm too short? Now you will see whether or not My word will come to pass.”"
        },
        {
          "reference": "Job 42:2",
          "text": "“I know that You can do all things and that no plan of Yours can be thwarted."
        },
        {
          "reference": "Jeremiah 32:17",
          "text": "“Oh, Lord GOD! You have made the heavens and the earth by Your great power and outstretched arm. Nothing is too difficult for You!"
        },
        {
          "reference": "Isaiah 51:2",
          "text": "Look to Abraham your father, and to Sarah who gave you birth. When I called him, he was but one; then I blessed him and multiplied him."
        },
        {
          "reference": "1 Samuel 2:1-10",
          "text": "At that time Hannah prayed: “My heart rejoices in the LORD; my horn is exalted in the LORD. My mouth speaks boldly against my enemies, for I rejoice in Your salvation. / There is no one holy like the LORD. Indeed, there is no one besides You! And there is no Rock like our God. / Do not boast so proudly, or let arrogance come from your mouth, for the LORD is a God who knows, and by Him actions are weighed. ..."
        }
      ]
    },
    {
      "reference": "Genesis 17:18",
      "book": "Genesis",
      "chapter": 17,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "And Abraham said to God, “If only Ishmael might live under your blessing!”"
        },
        {
          "version": "NLT",
          "text": "So Abraham said to God, “May Ishmael live under your special blessing!”"
        },
        {
          "version": "ESV",
          "text": "And Abraham said to God, “Oh that Ishmael might live before you!”"
        },
        {
          "version": "NKJV",
          "text": "And Abraham said to God, “Oh, that Ishmael might live before You!”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:10-12",
          "text": "and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!” / Now this matter distressed Abraham greatly because it concerned his son Ishmael. / But God said to Abraham, “Do not be distressed about the boy and your maidservant. Listen to everything that Sarah tells you, for through Isaac your offspring will be reckoned."
        },
        {
          "reference": "Genesis 16:15-16",
          "text": "And Hagar bore Abram a son, and Abram gave the name Ishmael to the son she had borne. / Abram was eighty-six years old when Hagar bore Ishmael to him."
        },
        {
          "reference": "Genesis 21:1-3",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised. / And Abraham gave the name Isaac to the son Sarah bore to him."
        },
        {
          "reference": "Genesis 25:12-18",
          "text": "This is the account of Abraham’s son Ishmael, whom Hagar the Egyptian, Sarah’s maidservant, bore to Abraham. / These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, ..."
        },
        {
          "reference": "Romans 9:7-9",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Galatians 4:22-31",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise. / These things serve as illustrations, for the women represent two covenants. One covenant is from Mount Sinai and bears children into slavery: This is Hagar. ..."
        },
        {
          "reference": "Genesis 18:10-14",
          "text": "Then the LORD said, “I will surely return to you at this time next year, and your wife Sarah will have a son!” Now Sarah was behind him, listening at the entrance to the tent. / And Abraham and Sarah were already old and well along in years; Sarah had passed the age of childbearing. / So she laughed to herself, saying, “After I am worn out and my master is old, will I now have this pleasure?” ..."
        },
        {
          "reference": "Genesis 22:2",
          "text": "“Take your son,” God said, “your only son Isaac, whom you love, and go to the land of Moriah. Offer him there as a burnt offering on one of the mountains, which I will show you.”"
        },
        {
          "reference": "Hebrews 11:17-18",
          "text": "By faith Abraham, when he was tested, offered up Isaac on the altar. He who had received the promises was ready to offer his one and only son, / even though God had said to him, “Through Isaac your offspring will be reckoned.”"
        },
        {
          "reference": "Genesis 15:4-5",
          "text": "Then the word of the LORD came to Abram, saying, “This one will not be your heir, but one who comes from your own body will be your heir.” / And the LORD took him outside and said, “Now look to the heavens and count the stars, if you are able.” Then He told him, “So shall your offspring be.”"
        },
        {
          "reference": "Genesis 21:13",
          "text": "But I will also make a nation of the slave woman’s son, because he is your offspring.”"
        },
        {
          "reference": "Genesis 18:17-19",
          "text": "And the LORD said, “Shall I hide from Abraham what I am about to do? / Abraham will surely become a great and powerful nation, and through him all the nations of the earth will be blessed. / For I have chosen him, so that he will command his children and his household after him to keep the way of the LORD by doing what is right and just, in order that the LORD may bring upon Abraham what He has promised.”"
        },
        {
          "reference": "Genesis 26:2-5",
          "text": "The LORD appeared to Isaac and said, “Do not go down to Egypt. Settle in the land where I tell you. / Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed, ..."
        },
        {
          "reference": "Romans 4:18-21",
          "text": "Against all hope, Abraham in hope believed and so became the father of many nations, just as he had been told, “So shall your offspring be.” / Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. / Yet he did not waver through disbelief in the promise of God, but was strengthened in his faith and gave glory to God, ..."
        },
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        }
      ]
    },
    {
      "reference": "Genesis 17:19",
      "book": "Genesis",
      "chapter": 17,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "Then God said, “Yes, but your wife Sarah will bear you a son, and you will call him Isaac. I will establish my covenant with him as an everlasting covenant for his descendants after him."
        },
        {
          "version": "NLT",
          "text": "But God replied, “No—Sarah, your wife, will give birth to a son for you. You will name him Isaac, and I will confirm my covenant with him and his descendants as an everlasting covenant."
        },
        {
          "version": "ESV",
          "text": "God said, “No, but Sarah your wife shall bear you a son, and you shall call his name Isaac. I will establish my covenant with him as an everlasting covenant for his offspring after him."
        },
        {
          "version": "NKJV",
          "text": "Then God said: “No, Sarah your wife shall bear you a son, and you shall call his name Isaac; I will establish My covenant with him for an everlasting covenant, and with his descendants after him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:10",
          "text": "Then the LORD said, “I will surely return to you at this time next year, and your wife Sarah will have a son!” Now Sarah was behind him, listening at the entrance to the tent."
        },
        {
          "reference": "Genesis 21:2-3",
          "text": "So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised. / And Abraham gave the name Isaac to the son Sarah bore to him."
        },
        {
          "reference": "Romans 9:7-9",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Hebrews 11:11-12",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised. / And so from one man, and he as good as dead, came descendants as numerous as the stars in the sky and as countless as the sand on the seashore."
        },
        {
          "reference": "Galatians 4:28",
          "text": "Now you, brothers, like Isaac, are children of promise."
        },
        {
          "reference": "Genesis 26:3-4",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed,"
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 15:4-5",
          "text": "Then the word of the LORD came to Abram, saying, “This one will not be your heir, but one who comes from your own body will be your heir.” / And the LORD took him outside and said, “Now look to the heavens and count the stars, if you are able.” Then He told him, “So shall your offspring be.”"
        },
        {
          "reference": "Genesis 22:17-18",
          "text": "I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies. / And through your offspring all nations of the earth will be blessed, because you have obeyed My voice.”"
        },
        {
          "reference": "Genesis 28:13-14",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring."
        },
        {
          "reference": "Genesis 49:10",
          "text": "The scepter will not depart from Judah, nor the staff from between his feet, until Shiloh comes and the allegiance of the nations is his."
        },
        {
          "reference": "Exodus 2:24",
          "text": "So God heard their groaning, and He remembered His covenant with Abraham, Isaac, and Jacob."
        },
        {
          "reference": "2 Samuel 7:12-16",
          "text": "And when your days are fulfilled and you rest with your fathers, I will raise up your descendant after you, who will come from your own body, and I will establish his kingdom. / He will build a house for My Name, and I will establish the throne of his kingdom forever. / I will be his Father, and he will be My son. When he does wrong, I will discipline him with the rod of men and with the blows of the sons of men. ..."
        },
        {
          "reference": "Psalm 105:8-11",
          "text": "He remembers His covenant forever, the word He ordained for a thousand generations— / the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: ..."
        }
      ]
    },
    {
      "reference": "Genesis 17:20",
      "book": "Genesis",
      "chapter": 17,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "And as for Ishmael, I have heard you: I will surely bless him; I will make him fruitful and will greatly increase his numbers. He will be the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "version": "NLT",
          "text": "As for Ishmael, I will bless him also, just as you have asked. I will make him extremely fruitful and multiply his descendants. He will become the father of twelve princes, and I will make him a great nation."
        },
        {
          "version": "ESV",
          "text": "As for Ishmael, I have heard you; behold, I have blessed him and will make him fruitful and multiply him greatly. He shall father twelve princes, and I will make him into a great nation."
        },
        {
          "version": "NKJV",
          "text": "And as for Ishmael, I have heard you. Behold, I have blessed him, and will make him fruitful, and will multiply him exceedingly. He shall beget twelve princes, and I will make him a great nation."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 16:10-12",
          "text": "Then the angel added, “I will greatly multiply your offspring so that they will be too numerous to count.” / The angel of the LORD proceeded: “Behold, you have conceived and will bear a son. And you shall name him Ishmael, for the LORD has heard your cry of affliction. / He will be a wild donkey of a man, and his hand will be against everyone, and everyone’s hand against him; he will live in hostility toward all his brothers.”"
        },
        {
          "reference": "Genesis 21:13",
          "text": "But I will also make a nation of the slave woman’s son, because he is your offspring.”"
        },
        {
          "reference": "Genesis 25:12-18",
          "text": "This is the account of Abraham’s son Ishmael, whom Hagar the Egyptian, Sarah’s maidservant, bore to Abraham. / These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, ..."
        },
        {
          "reference": "Genesis 28:3-4",
          "text": "May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples. / And may He give the blessing of Abraham to you and your descendants, so that you may possess the land where you dwell as a foreigner, the land God gave to Abraham.”"
        },
        {
          "reference": "Genesis 35:11",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you."
        },
        {
          "reference": "Genesis 36:1-3",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 46:3",
          "text": "“I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there."
        },
        {
          "reference": "Genesis 48:4",
          "text": "and told me, ‘Behold, I will make you fruitful and multiply you; I will make you a multitude of peoples, and will give this land to your descendants after you as an everlasting possession.’"
        },
        {
          "reference": "Exodus 1:7",
          "text": "but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Deuteronomy 1:10-11",
          "text": "The LORD your God has multiplied you, so that today you are as numerous as the stars in the sky. / May the LORD, the God of your fathers, increase you a thousand times over and bless you as He has promised."
        },
        {
          "reference": "1 Chronicles 1:28-31",
          "text": "The sons of Abraham were Isaac and Ishmael. / These are their genealogies: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, Hadad, Tema, ..."
        },
        {
          "reference": "Psalm 105:8-11",
          "text": "He remembers His covenant forever, the word He ordained for a thousand generations— / the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: ..."
        },
        {
          "reference": "Isaiah 60:6-7",
          "text": "Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD. / All the flocks of Kedar will be gathered to you; the rams of Nebaioth will serve you and go up on My altar with acceptance; I will adorn My glorious house."
        },
        {
          "reference": "Romans 9:7-9",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Romans 4:11-13",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them. / And he is also the father of the circumcised who not only are circumcised, but who also walk in the footsteps of the faith that our father Abraham had before he was circumcised. / For the promise to Abraham and his offspring that he would be heir of the world was not given through the law, but through the righteousness that comes by faith."
        }
      ]
    },
    {
      "reference": "Genesis 17:21",
      "book": "Genesis",
      "chapter": 17,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "But my covenant I will establish with Isaac, whom Sarah will bear to you by this time next year.”"
        },
        {
          "version": "NLT",
          "text": "But my covenant will be confirmed with Isaac, who will be born to you and Sarah about this time next year.”"
        },
        {
          "version": "ESV",
          "text": "But I will establish my covenant with Isaac, whom Sarah shall bear to you at this time next year.”"
        },
        {
          "version": "NKJV",
          "text": "But My covenant I will establish with Isaac, whom Sarah shall bear to you at this set time next year.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:2",
          "text": "So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 18:10",
          "text": "Then the LORD said, “I will surely return to you at this time next year, and your wife Sarah will have a son!” Now Sarah was behind him, listening at the entrance to the tent."
        },
        {
          "reference": "Genesis 18:14",
          "text": "Is anything too difficult for the LORD? At the appointed time I will return to you—in about a year—and Sarah will have a son.”"
        },
        {
          "reference": "Genesis 21:12",
          "text": "But God said to Abraham, “Do not be distressed about the boy and your maidservant. Listen to everything that Sarah tells you, for through Isaac your offspring will be reckoned."
        },
        {
          "reference": "Romans 9:7-9",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Galatians 4:28",
          "text": "Now you, brothers, like Isaac, are children of promise."
        },
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        },
        {
          "reference": "Genesis 26:2-5",
          "text": "The LORD appeared to Isaac and said, “Do not go down to Egypt. Settle in the land where I tell you. / Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed, ..."
        },
        {
          "reference": "Genesis 15:4",
          "text": "Then the word of the LORD came to Abram, saying, “This one will not be your heir, but one who comes from your own body will be your heir.”"
        },
        {
          "reference": "Genesis 22:2",
          "text": "“Take your son,” God said, “your only son Isaac, whom you love, and go to the land of Moriah. Offer him there as a burnt offering on one of the mountains, which I will show you.”"
        },
        {
          "reference": "Genesis 25:12",
          "text": "This is the account of Abraham’s son Ishmael, whom Hagar the Egyptian, Sarah’s maidservant, bore to Abraham."
        },
        {
          "reference": "Genesis 28:13-14",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring."
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Genesis 48:3-4",
          "text": "Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan, and there He blessed me / and told me, ‘Behold, I will make you fruitful and multiply you; I will make you a multitude of peoples, and will give this land to your descendants after you as an everlasting possession.’"
        },
        {
          "reference": "Exodus 2:24",
          "text": "So God heard their groaning, and He remembered His covenant with Abraham, Isaac, and Jacob."
        }
      ]
    },
    {
      "reference": "Genesis 17:22",
      "book": "Genesis",
      "chapter": 17,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "When he had finished speaking with Abraham, God went up from him."
        },
        {
          "version": "NLT",
          "text": "When God had finished speaking, he left Abraham."
        },
        {
          "version": "ESV",
          "text": "When he had finished talking with him, God went up from Abraham."
        },
        {
          "version": "NKJV",
          "text": "Then He finished talking with him, and God went up from Abraham."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:33",
          "text": "When the LORD had finished speaking with Abraham, He departed, and Abraham returned home."
        },
        {
          "reference": "Genesis 35:13",
          "text": "Then God went up from the place where He had spoken with him."
        },
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Exodus 33:11",
          "text": "Thus the LORD would speak to Moses face to face, as a man speaks to his friend. Then Moses would return to the camp, but his young assistant Joshua son of Nun would not leave the tent."
        },
        {
          "reference": "Numbers 12:8",
          "text": "I speak with him face to face, clearly and not in riddles; he sees the form of the LORD. Why then were you unafraid to speak against My servant Moses?”"
        },
        {
          "reference": "Deuteronomy 34:10",
          "text": "Since that time, no prophet has risen in Israel like Moses, whom the LORD knew face to face—"
        },
        {
          "reference": "Judges 6:21",
          "text": "Then the angel of the LORD extended the tip of the staff that was in his hand and touched the meat and the unleavened bread. And fire flared from the rock and consumed the meat and the unleavened bread. Then the angel of the LORD vanished from his sight."
        },
        {
          "reference": "1 Kings 19:11-12",
          "text": "Then the LORD said, “Go out and stand on the mountain before the LORD. Behold, the LORD is about to pass by.” And a great and mighty wind tore into the mountains and shattered the rocks before the LORD, but the LORD was not in the wind. After the wind there was an earthquake, but the LORD was not in the earthquake. / After the earthquake there was a fire, but the LORD was not in the fire. And after the fire came a still, small voice."
        },
        {
          "reference": "2 Kings 2:11",
          "text": "As they were walking along and talking together, suddenly a chariot of fire with horses of fire appeared and separated the two of them, and Elijah went up into heaven in a whirlwind."
        },
        {
          "reference": "Isaiah 6:1-4",
          "text": "In the year that King Uzziah died, I saw the Lord seated on a throne, high and exalted; and the train of His robe filled the temple. / Above Him stood seraphim, each having six wings: With two wings they covered their faces, with two they covered their feet, and with two they were flying. / And they were calling out to one another: “Holy, holy, holy is the LORD of Hosts; all the earth is full of His glory.” ..."
        },
        {
          "reference": "Ezekiel 1:28",
          "text": "The appearance of the brilliant light all around Him was like that of a rainbow in a cloud on a rainy day. This was the appearance of the likeness of the glory of the LORD. And when I saw it, I fell facedown and heard a voice speaking."
        },
        {
          "reference": "Daniel 10:8-9",
          "text": "So I was left alone, gazing at this great vision. No strength remained in me; my face grew deathly pale, and I was powerless. / I heard the sound of his words, and as I listened, I fell into a deep sleep, with my face to the ground."
        },
        {
          "reference": "Matthew 1:23",
          "text": "“Behold, the virgin will be with child and will give birth to a son, and they will call Him Immanuel” (which means, “God with us”)."
        },
        {
          "reference": "Matthew 28:20",
          "text": "and teaching them to obey all that I have commanded you. And surely I am with you always, even to the end of the age.”"
        },
        {
          "reference": "Luke 1:19",
          "text": "“I am Gabriel,” replied the angel. “I stand in the presence of God, and I have been sent to speak to you and to bring you this good news."
        }
      ]
    },
    {
      "reference": "Genesis 17:23",
      "book": "Genesis",
      "chapter": 17,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "On that very day Abraham took his son Ishmael and all those born in his household or bought with his money, every male in his household, and circumcised them, as God told him."
        },
        {
          "version": "NLT",
          "text": "On that very day Abraham took his son, Ishmael, and every male in his household, including those born there and those he had bought. Then he circumcised them, cutting off their foreskins, just as God had told him."
        },
        {
          "version": "ESV",
          "text": "Then Abraham took Ishmael his son and all those born in his house or bought with his money, every male among the men of Abraham’s house, and he circumcised the flesh of their foreskins that very day, as God had said to him."
        },
        {
          "version": "NKJV",
          "text": "So Abraham took Ishmael his son, all who were born in his house and all who were bought with his money, every male among the men of Abraham’s house, and circumcised the flesh of their foreskins that very same day, as God had said to him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:4",
          "text": "When his son Isaac was eight days old, Abraham circumcised him, as God had commanded him."
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Romans 4:11",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them."
        },
        {
          "reference": "Galatians 5:3",
          "text": "Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law."
        },
        {
          "reference": "Colossians 2:11-12",
          "text": "In Him you were also circumcised, in the putting off of your sinful nature, with the circumcision performed by Christ and not by human hands. / And having been buried with Him in baptism, you were raised with Him through your faith in the power of God, who raised Him from the dead."
        },
        {
          "reference": "Deuteronomy 10:16",
          "text": "Circumcise your hearts, therefore, and stiffen your necks no more."
        },
        {
          "reference": "Jeremiah 4:4",
          "text": "Circumcise yourselves to the LORD, and remove the foreskins of your hearts, O men of Judah and people of Jerusalem. Otherwise, My wrath will break out like fire and burn with no one to extinguish it, because of your evil deeds.”"
        },
        {
          "reference": "Romans 2:28-29",
          "text": "A man is not a Jew because he is one outwardly, nor is circumcision only outward and physical. / No, a man is a Jew because he is one inwardly, and circumcision is a matter of the heart, by the Spirit, not by the written code. Such a man’s praise does not come from men, but from God."
        },
        {
          "reference": "Philippians 3:3",
          "text": "For it is we who are the circumcision, we who worship by the Spirit of God, who glory in Christ Jesus, and who put no confidence in the flesh—"
        },
        {
          "reference": "Genesis 18:19",
          "text": "For I have chosen him, so that he will command his children and his household after him to keep the way of the LORD by doing what is right and just, in order that the LORD may bring upon Abraham what He has promised.”"
        },
        {
          "reference": "Genesis 22:3",
          "text": "So Abraham got up early the next morning, saddled his donkey, and took along two of his servants and his son Isaac. He split the wood for a burnt offering and set out for the place God had designated."
        },
        {
          "reference": "Genesis 26:5",
          "text": "because Abraham listened to My voice and kept My charge, My commandments, My statutes, and My laws.”"
        }
      ]
    },
    {
      "reference": "Genesis 17:24",
      "book": "Genesis",
      "chapter": 17,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham was ninety-nine years old when he was circumcised,"
        },
        {
          "version": "NLT",
          "text": "Abraham was ninety-nine years old when he was circumcised,"
        },
        {
          "version": "ESV",
          "text": "Abraham was ninety-nine years old when he was circumcised in the flesh of his foreskin."
        },
        {
          "version": "NKJV",
          "text": "Abraham was ninety-nine years old when he was circumcised in the flesh of his foreskin."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:4",
          "text": "When his son Isaac was eight days old, Abraham circumcised him, as God had commanded him."
        },
        {
          "reference": "Genesis 12:4",
          "text": "So Abram departed, as the LORD had directed him, and Lot went with him. Abram was seventy-five years old when he left Haran."
        },
        {
          "reference": "Genesis 15:6",
          "text": "Abram believed the LORD, and it was credited to him as righteousness."
        },
        {
          "reference": "Genesis 18:11",
          "text": "And Abraham and Sarah were already old and well along in years; Sarah had passed the age of childbearing."
        },
        {
          "reference": "Genesis 22:3",
          "text": "So Abraham got up early the next morning, saddled his donkey, and took along two of his servants and his son Isaac. He split the wood for a burnt offering and set out for the place God had designated."
        },
        {
          "reference": "Genesis 25:7-8",
          "text": "Abraham lived a total of 175 years. / And at a ripe old age he breathed his last and died, old and contented, and was gathered to his people."
        },
        {
          "reference": "Genesis 26:5",
          "text": "because Abraham listened to My voice and kept My charge, My commandments, My statutes, and My laws.”"
        },
        {
          "reference": "Genesis 35:27-29",
          "text": "Jacob returned to his father Isaac at Mamre, near Kiriath-arba (that is, Hebron), where Abraham and Isaac had stayed. / And Isaac lived 180 years. / Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Romans 4:11",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them."
        },
        {
          "reference": "Romans 4:19",
          "text": "Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb."
        },
        {
          "reference": "Romans 4:12",
          "text": "And he is also the father of the circumcised who not only are circumcised, but who also walk in the footsteps of the faith that our father Abraham had before he was circumcised."
        }
      ]
    },
    {
      "reference": "Genesis 17:25",
      "book": "Genesis",
      "chapter": 17,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "and his son Ishmael was thirteen;"
        },
        {
          "version": "NLT",
          "text": "and Ishmael, his son, was thirteen."
        },
        {
          "version": "ESV",
          "text": "And Ishmael his son was thirteen years old when he was circumcised in the flesh of his foreskin."
        },
        {
          "version": "NKJV",
          "text": "And Ishmael his son was thirteen years old when he was circumcised in the flesh of his foreskin."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:4",
          "text": "When his son Isaac was eight days old, Abraham circumcised him, as God had commanded him."
        },
        {
          "reference": "Genesis 12:4",
          "text": "So Abram departed, as the LORD had directed him, and Lot went with him. Abram was seventy-five years old when he left Haran."
        },
        {
          "reference": "Genesis 15:6",
          "text": "Abram believed the LORD, and it was credited to him as righteousness."
        },
        {
          "reference": "Genesis 18:19",
          "text": "For I have chosen him, so that he will command his children and his household after him to keep the way of the LORD by doing what is right and just, in order that the LORD may bring upon Abraham what He has promised.”"
        },
        {
          "reference": "Genesis 22:2",
          "text": "“Take your son,” God said, “your only son Isaac, whom you love, and go to the land of Moriah. Offer him there as a burnt offering on one of the mountains, which I will show you.”"
        },
        {
          "reference": "Genesis 26:3-5",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed, / because Abraham listened to My voice and kept My charge, My commandments, My statutes, and My laws.”"
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Deuteronomy 30:6",
          "text": "The LORD your God will circumcise your hearts and the hearts of your descendants, and you will love Him with all your heart and with all your soul, so that you may live."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "Romans 4:11",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them."
        },
        {
          "reference": "Romans 4:16-17",
          "text": "Therefore, the promise comes by faith, so that it may rest on grace and may be guaranteed to all Abraham’s offspring—not only to those who are of the law, but also to those who are of the faith of Abraham. He is the father of us all. / As it is written: “I have made you a father of many nations.” He is our father in the presence of God, in whom he believed, the God who gives life to the dead and calls into being what does not yet exist."
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Galatians 3:7-9",
          "text": "Understand, then, that those who have faith are sons of Abraham. / The Scripture foresaw that God would justify the Gentiles by faith, and foretold the gospel to Abraham: “All nations will be blessed through you.” / So those who have faith are blessed along with Abraham, the man of faith."
        }
      ]
    },
    {
      "reference": "Genesis 17:26",
      "book": "Genesis",
      "chapter": 17,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham and his son Ishmael were both circumcised on that very day."
        },
        {
          "version": "NLT",
          "text": "Both Abraham and his son, Ishmael, were circumcised on that same day,"
        },
        {
          "version": "ESV",
          "text": "That very day Abraham and his son Ishmael were circumcised."
        },
        {
          "version": "NKJV",
          "text": "That very same day Abraham was circumcised, and his son Ishmael;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:4",
          "text": "When his son Isaac was eight days old, Abraham circumcised him, as God had commanded him."
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 15:18",
          "text": "On that day the LORD made a covenant with Abram, saying, “To your descendants I have given this land—from the river of Egypt to the great River Euphrates—"
        },
        {
          "reference": "Genesis 22:17-18",
          "text": "I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies. / And through your offspring all nations of the earth will be blessed, because you have obeyed My voice.”"
        },
        {
          "reference": "Genesis 26:3-5",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed, / because Abraham listened to My voice and kept My charge, My commandments, My statutes, and My laws.”"
        },
        {
          "reference": "Genesis 28:13-14",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring."
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Deuteronomy 30:6",
          "text": "The LORD your God will circumcise your hearts and the hearts of your descendants, and you will love Him with all your heart and with all your soul, so that you may live."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "2 Samuel 7:12-16",
          "text": "And when your days are fulfilled and you rest with your fathers, I will raise up your descendant after you, who will come from your own body, and I will establish his kingdom. / He will build a house for My Name, and I will establish the throne of his kingdom forever. / I will be his Father, and he will be My son. When he does wrong, I will discipline him with the rod of men and with the blows of the sons of men. ..."
        },
        {
          "reference": "Psalm 105:8-10",
          "text": "He remembers His covenant forever, the word He ordained for a thousand generations— / the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant:"
        },
        {
          "reference": "Isaiah 51:2",
          "text": "Look to Abraham your father, and to Sarah who gave you birth. When I called him, he was but one; then I blessed him and multiplied him."
        },
        {
          "reference": "Jeremiah 31:31-34",
          "text": "Behold, the days are coming, declares the LORD, when I will make a new covenant with the house of Israel and with the house of Judah. / It will not be like the covenant I made with their fathers when I took them by the hand to lead them out of the land of Egypt—a covenant they broke, though I was a husband to them,” declares the LORD. / “But this is the covenant I will make with the house of Israel after those days, declares the LORD. I will put My law in their minds and inscribe it on their hearts. And I will be their God, and they will be My people. ..."
        },
        {
          "reference": "Ezekiel 16:60",
          "text": "But I will remember the covenant I made with you in the days of your youth, and I will establish an everlasting covenant with you."
        }
      ]
    },
    {
      "reference": "Genesis 17:27",
      "book": "Genesis",
      "chapter": 17,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "And every male in Abraham’s household, including those born in his household or bought from a foreigner, was circumcised with him."
        },
        {
          "version": "NLT",
          "text": "along with all the other men and boys of the household, whether they were born there or bought as servants. All were circumcised with him."
        },
        {
          "version": "ESV",
          "text": "And all the men of his house, those born in the house and those bought with money from a foreigner, were circumcised with him."
        },
        {
          "version": "NKJV",
          "text": "and all the men of his house, born in the house or bought with money from a foreigner, were circumcised with him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:5",
          "text": "And Abram took his wife Sarai, his nephew Lot, and all the possessions and people they had acquired in Haran, and set out for the land of Canaan. When they came to the land of Canaan,"
        },
        {
          "reference": "Genesis 14:14",
          "text": "And when Abram heard that his relative had been captured, he mobilized the 318 trained men born in his household, and they set out in pursuit as far as Dan."
        },
        {
          "reference": "Genesis 15:3",
          "text": "Abram continued, “Behold, You have given me no offspring, so a servant in my household will be my heir.”"
        },
        {
          "reference": "Genesis 18:19",
          "text": "For I have chosen him, so that he will command his children and his household after him to keep the way of the LORD by doing what is right and just, in order that the LORD may bring upon Abraham what He has promised.”"
        },
        {
          "reference": "Genesis 24:35",
          "text": "“The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys."
        },
        {
          "reference": "Genesis 26:14",
          "text": "He owned so many flocks and herds and servants that the Philistines envied him."
        },
        {
          "reference": "Genesis 30:43",
          "text": "Thus Jacob became exceedingly prosperous. He owned large flocks, maidservants and menservants, and camels and donkeys."
        },
        {
          "reference": "Genesis 32:5",
          "text": "I have oxen, donkeys, flocks, menservants, and maidservants. I have sent this message to inform my master, so that I may find favor in your sight.’”"
        },
        {
          "reference": "Genesis 36:6-7",
          "text": "Later, Esau took his wives and sons and daughters and all the people of his household, along with his livestock, all his other animals, and all the property he had acquired in Canaan, and he moved to a land far away from his brother Jacob. / For their possessions were too great for them to dwell together; the land where they stayed could not support them because of their livestock."
        },
        {
          "reference": "Exodus 12:44",
          "text": "But any slave who has been purchased may eat of it, after you have circumcised him."
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Leviticus 22:11",
          "text": "But if a priest buys a slave with his own money, or if a slave is born in his household, that slave may eat his food."
        },
        {
          "reference": "Joshua 9:21",
          "text": "They continued, “Let them live, but let them be woodcutters and water carriers for the whole congregation.” So the leaders kept their promise."
        },
        {
          "reference": "1 Samuel 8:11",
          "text": "He said, “This will be the manner of the king who will reign over you: He will take your sons and appoint them to serve his own chariots and horses, and to run in front of his chariots."
        },
        {
          "reference": "2 Samuel 9:10",
          "text": "You and your sons and servants are to work the ground for him and bring in the harvest, so that your master’s grandson may have food to eat. But Mephibosheth, your master’s grandson, is always to eat at my table.” Now Ziba had fifteen sons and twenty servants."
        }
      ]
    }
  ]
}