{
  "book": "genesis",
  "chapter": 18,
  "verses": [
    {
      "reference": "Genesis 18:1",
      "book": "Genesis",
      "chapter": 18,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "The LORD appeared to Abraham near the great trees of Mamre while he was sitting at the entrance to his tent in the heat of the day."
        },
        {
          "version": "NLT",
          "text": "The LORD appeared again to Abraham near the oak grove belonging to Mamre. One day Abraham was sitting at the entrance to his tent during the hottest part of the day."
        },
        {
          "version": "ESV",
          "text": "And the LORD appeared to him by the oaks of Mamre, as he sat at the door of his tent in the heat of the day."
        },
        {
          "version": "NKJV",
          "text": "Then the LORD appeared to him by the terebinth trees of Mamre, as he was sitting in the tent door in the heat of the day."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 13:2",
          "text": "Do not neglect to show hospitality to strangers, for by so doing some people have entertained angels without knowing it."
        },
        {
          "reference": "Genesis 19:1",
          "text": "Now the two angels arrived at Sodom in the evening, and Lot was sitting in the gateway of the city. When Lot saw them, he got up to meet them, bowed facedown,"
        },
        {
          "reference": "Judges 6:11-14",
          "text": "Then the angel of the LORD came and sat down under the oak in Ophrah that belonged to Joash the Abiezrite, where his son Gideon was threshing wheat in a winepress to hide it from the Midianites. / And the angel of the LORD appeared to Gideon and said, “The LORD is with you, O mighty man of valor.” / “Please, my Lord,” Gideon replied, “if the LORD is with us, why has all this happened to us? And where are all His wonders of which our fathers told us, saying, ‘Has not the LORD brought us up out of Egypt?’ But now the LORD has forsaken us and delivered us into the hand of Midian.” ..."
        },
        {
          "reference": "Exodus 3:2",
          "text": "There the angel of the LORD appeared to him in a blazing fire from within a bush. Moses saw the bush ablaze with fire, but it was not consumed."
        },
        {
          "reference": "Genesis 17:1",
          "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, “I am God Almighty. Walk before Me and be blameless."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 32:24-30",
          "text": "So Jacob was left all alone, and there a man wrestled with him until daybreak. / When the man saw that he could not overpower Jacob, he struck the socket of Jacob’s hip and dislocated it as they wrestled. / Then the man said, “Let me go, for it is daybreak.” But Jacob replied, “I will not let you go unless you bless me.” ..."
        },
        {
          "reference": "John 1:14",
          "text": "The Word became flesh and made His dwelling among us. We have seen His glory, the glory of the one and only Son from the Father, full of grace and truth."
        },
        {
          "reference": "Luke 24:15-16",
          "text": "And as they talked and deliberated, Jesus Himself came up and walked along with them. / But their eyes were kept from recognizing Him."
        },
        {
          "reference": "Acts 7:30",
          "text": "After forty years had passed, an angel appeared to Moses in the flames of a burning bush in the desert near Mount Sinai."
        },
        {
          "reference": "Genesis 22:11",
          "text": "Just then the angel of the LORD called out to him from heaven, “Abraham, Abraham!” “Here I am,” he replied."
        },
        {
          "reference": "Genesis 35:9",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him."
        },
        {
          "reference": "Genesis 16:7",
          "text": "Now the angel of the LORD found Hagar by a spring of water in the desert—the spring along the road to Shur."
        },
        {
          "reference": "Exodus 33:11",
          "text": "Thus the LORD would speak to Moses face to face, as a man speaks to his friend. Then Moses would return to the camp, but his young assistant Joshua son of Nun would not leave the tent."
        },
        {
          "reference": "Joshua 5:13-15",
          "text": "Now when Joshua was near Jericho, he looked up and saw a man standing in front of him with a drawn sword in His hand. Joshua approached Him and asked, “Are You for us or for our enemies?” / “Neither,” He replied. “I have now come as Commander of the LORD’s army.” Then Joshua fell facedown in reverence and asked Him, “What does my Lord have to say to His servant?” / The Commander of the LORD’s army replied, “Take off your sandals, for the place where you are standing is holy.” And Joshua did so."
        }
      ]
    },
    {
      "reference": "Genesis 18:2",
      "book": "Genesis",
      "chapter": 18,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham looked up and saw three men standing nearby. When he saw them, he hurried from the entrance of his tent to meet them and bowed low to the ground."
        },
        {
          "version": "NLT",
          "text": "He looked up and noticed three men standing nearby. When he saw them, he ran to meet them and welcomed them, bowing low to the ground."
        },
        {
          "version": "ESV",
          "text": "He lifted up his eyes and looked, and behold, three men were standing in front of him. When he saw them, he ran from the tent door to meet them and bowed himself to the earth"
        },
        {
          "version": "NKJV",
          "text": "So he lifted his eyes and looked, and behold, three men were standing by him; and when he saw them, he ran from the tent door to meet them, and bowed himself to the ground,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 13:2",
          "text": "Do not neglect to show hospitality to strangers, for by so doing some people have entertained angels without knowing it."
        },
        {
          "reference": "Judges 13:3-21",
          "text": "The angel of the LORD appeared to the woman and said to her, “It is true that you are barren and have no children; but you will conceive and give birth to a son. / Now please be careful not to drink wine or strong drink, and not to eat anything unclean. / For behold, you will conceive and give birth to a son. And no razor shall touch his head, because the boy will be a Nazirite to God from the womb, and he will begin the deliverance of Israel from the hand of the Philistines.” ..."
        },
        {
          "reference": "Genesis 19:1-3",
          "text": "Now the two angels arrived at Sodom in the evening, and Lot was sitting in the gateway of the city. When Lot saw them, he got up to meet them, bowed facedown, / and said, “My lords, please turn aside into the house of your servant; wash your feet and spend the night. Then you can rise early and go on your way.” “No,” they answered, “we will spend the night in the square.” / But Lot insisted so strongly that they followed him into his house. He prepared a feast for them and baked unleavened bread, and they ate."
        },
        {
          "reference": "Luke 24:4",
          "text": "While they were puzzling over this, suddenly two men in radiant apparel stood beside them."
        },
        {
          "reference": "Acts 1:10",
          "text": "They were looking intently into the sky as He was going, when suddenly two men dressed in white stood beside them."
        },
        {
          "reference": "Genesis 32:24-30",
          "text": "So Jacob was left all alone, and there a man wrestled with him until daybreak. / When the man saw that he could not overpower Jacob, he struck the socket of Jacob’s hip and dislocated it as they wrestled. / Then the man said, “Let me go, for it is daybreak.” But Jacob replied, “I will not let you go unless you bless me.” ..."
        },
        {
          "reference": "Joshua 5:13-15",
          "text": "Now when Joshua was near Jericho, he looked up and saw a man standing in front of him with a drawn sword in His hand. Joshua approached Him and asked, “Are You for us or for our enemies?” / “Neither,” He replied. “I have now come as Commander of the LORD’s army.” Then Joshua fell facedown in reverence and asked Him, “What does my Lord have to say to His servant?” / The Commander of the LORD’s army replied, “Take off your sandals, for the place where you are standing is holy.” And Joshua did so."
        },
        {
          "reference": "Daniel 3:25",
          "text": "“Look!” he exclaimed. “I see four men, unbound and unharmed, walking around in the fire—and the fourth looks like a son of the gods!”"
        },
        {
          "reference": "Daniel 6:22",
          "text": "My God sent His angel and shut the mouths of the lions. They have not hurt me, for I was found innocent in His sight, and I have done no wrong against you, O king.”"
        },
        {
          "reference": "Matthew 28:2-3",
          "text": "Suddenly there was a great earthquake, for an angel of the Lord descended from heaven, rolled away the stone, and sat on it. / His appearance was like lightning, and his clothes were white as snow."
        },
        {
          "reference": "Mark 16:5",
          "text": "When they entered the tomb, they saw a young man dressed in a white robe sitting on the right side, and they were alarmed."
        },
        {
          "reference": "Luke 1:11",
          "text": "Just then an angel of the Lord appeared to Zechariah, standing at the right side of the altar of incense."
        },
        {
          "reference": "Acts 10:3",
          "text": "One day at about the ninth hour, he had a clear vision of an angel of God who came to him and said, “Cornelius!”"
        },
        {
          "reference": "Revelation 22:8-9",
          "text": "And I, John, am the one who heard and saw these things. And when I had heard and seen them, I fell down to worship at the feet of the angel who had shown me these things. / But he said to me, “Do not do that! I am a fellow servant with you and your brothers the prophets, and with those who keep the words of this book. Worship God!”"
        },
        {
          "reference": "Genesis 28:12-15",
          "text": "And Jacob had a dream about a ladder that rested on the earth with its top reaching up to heaven, and God’s angels were going up and down the ladder. / And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. ..."
        }
      ]
    },
    {
      "reference": "Genesis 18:3",
      "book": "Genesis",
      "chapter": 18,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "He said, “If I have found favor in your eyes, my lord, do not pass your servant by."
        },
        {
          "version": "NLT",
          "text": "“My lord,” he said, “if it pleases you, stop here for a while."
        },
        {
          "version": "ESV",
          "text": "and said, “O Lord, if I have found favor in your sight, do not pass by your servant."
        },
        {
          "version": "NKJV",
          "text": "and said, “My Lord, if I have now found favor in Your sight, do not pass on by Your servant."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 13:2",
          "text": "Do not neglect to show hospitality to strangers, for by so doing some people have entertained angels without knowing it."
        },
        {
          "reference": "Matthew 25:35-40",
          "text": "For I was hungry and you gave Me something to eat, I was thirsty and you gave Me something to drink, I was a stranger and you took Me in, / I was naked and you clothed Me, I was sick and you looked after Me, I was in prison and you visited Me.’ / Then the righteous will answer Him, ‘Lord, when did we see You hungry and feed You, or thirsty and give You something to drink? ..."
        },
        {
          "reference": "1 Peter 4:9",
          "text": "Show hospitality to one another without complaining."
        },
        {
          "reference": "Romans 12:13",
          "text": "Share with the saints who are in need. Practice hospitality."
        },
        {
          "reference": "Luke 24:28-31",
          "text": "As they approached the village where they were headed, He seemed to be going farther. / But they pleaded with Him, “Stay with us, for it is nearly evening and the day is almost over.” So He went in to stay with them. / While He was reclining at the table with them, He took bread, spoke a blessing and broke it, and gave it to them. ..."
        },
        {
          "reference": "1 Timothy 5:10",
          "text": "and well known for good deeds such as bringing up children, entertaining strangers, washing the feet of the saints, imparting relief to the afflicted, and devoting herself to every good work."
        },
        {
          "reference": "Acts 16:15",
          "text": "And when she and her household had been baptized, she urged us, “If you consider me a believer in the Lord, come and stay at my house.” And she persuaded us."
        },
        {
          "reference": "3 John 1:5-8",
          "text": "Beloved, you are faithful in what you are doing for the brothers, and especially since they are strangers to you. / They have testified to the church about your love. You will do well to send them on their way in a manner worthy of God. / For they went out on behalf of the Name, accepting nothing from the Gentiles. ..."
        },
        {
          "reference": "James 2:15-16",
          "text": "Suppose a brother or sister is without clothes and daily food. / If one of you tells him, “Go in peace; stay warm and well fed,” but does not provide for his physical needs, what good is that?"
        },
        {
          "reference": "Luke 10:38-42",
          "text": "As they traveled along, Jesus entered a village where a woman named Martha welcomed Him into her home. / She had a sister named Mary, who sat at the Lord’s feet listening to His message. / But Martha was distracted by all the preparations to be made. She came to Jesus and said, “Lord, do You not care that my sister has left me to serve alone? Tell her to help me!” ..."
        },
        {
          "reference": "Exodus 23:4-5",
          "text": "If you encounter your enemy’s stray ox or donkey, you must return it to him. / If you see the donkey of one who hates you fallen under its load, do not leave it there; you must help him with it."
        },
        {
          "reference": "Leviticus 19:34",
          "text": "You must treat the foreigner living among you as native-born and love him as yourself, for you were foreigners in the land of Egypt. I am the LORD your God."
        },
        {
          "reference": "Deuteronomy 10:19",
          "text": "So you also must love the foreigner, since you yourselves were foreigners in the land of Egypt."
        },
        {
          "reference": "2 Kings 4:8-10",
          "text": "One day Elisha went to Shunem, and a prominent woman who lived there persuaded him to have a meal. So whenever he would pass by, he would stop there to eat. / Then the woman said to her husband, “Behold, now I know that the one who often comes our way is a holy man of God. / Please let us make a small room upstairs and put in it a bed, a table, a chair, and a lamp for him. Then when he comes to us, he can stay there.”"
        },
        {
          "reference": "Job 31:32",
          "text": "but no stranger had to lodge on the street, for my door has been open to the traveler—"
        }
      ]
    },
    {
      "reference": "Genesis 18:4",
      "book": "Genesis",
      "chapter": 18,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "Let a little water be brought, and then you may all wash your feet and rest under this tree."
        },
        {
          "version": "NLT",
          "text": "Rest in the shade of this tree while water is brought to wash your feet."
        },
        {
          "version": "ESV",
          "text": "Let a little water be brought, and wash your feet, and rest yourselves under the tree,"
        },
        {
          "version": "NKJV",
          "text": "Please let a little water be brought, and wash your feet, and rest yourselves under the tree."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 13:2",
          "text": "Do not neglect to show hospitality to strangers, for by so doing some people have entertained angels without knowing it."
        },
        {
          "reference": "Matthew 10:42",
          "text": "And if anyone gives even a cup of cold water to one of these little ones because he is My disciple, truly I tell you, he will never lose his reward.”"
        },
        {
          "reference": "1 Peter 4:9",
          "text": "Show hospitality to one another without complaining."
        },
        {
          "reference": "Romans 12:13",
          "text": "Share with the saints who are in need. Practice hospitality."
        },
        {
          "reference": "1 Timothy 5:10",
          "text": "and well known for good deeds such as bringing up children, entertaining strangers, washing the feet of the saints, imparting relief to the afflicted, and devoting herself to every good work."
        },
        {
          "reference": "Luke 7:44",
          "text": "And turning toward the woman, He said to Simon, “Do you see this woman? When I entered your house, you did not give Me water for My feet, but she wet My feet with her tears and wiped them with her hair."
        },
        {
          "reference": "John 13:14",
          "text": "So if I, your Lord and Teacher, have washed your feet, you also should wash one another’s feet."
        },
        {
          "reference": "Matthew 25:35-40",
          "text": "For I was hungry and you gave Me something to eat, I was thirsty and you gave Me something to drink, I was a stranger and you took Me in, / I was naked and you clothed Me, I was sick and you looked after Me, I was in prison and you visited Me.’ / Then the righteous will answer Him, ‘Lord, when did we see You hungry and feed You, or thirsty and give You something to drink? ..."
        },
        {
          "reference": "1 Kings 17:10-11",
          "text": "So Elijah got up and went to Zarephath. When he arrived at the city gate, there was a widow gathering sticks. Elijah called to her and said, “Please bring me a little water in a cup, so that I may drink.” / And as she was going to get it, he called to her and said, “Please bring me a piece of bread.”"
        },
        {
          "reference": "Judges 19:21",
          "text": "So he brought him to his house and fed his donkeys. And they washed their feet and ate and drank."
        },
        {
          "reference": "Exodus 23:4-5",
          "text": "If you encounter your enemy’s stray ox or donkey, you must return it to him. / If you see the donkey of one who hates you fallen under its load, do not leave it there; you must help him with it."
        },
        {
          "reference": "Isaiah 32:2",
          "text": "Each will be like a shelter from the wind, a refuge from the storm, like streams of water in a dry land, like the shadow of a great rock in an arid land."
        },
        {
          "reference": "2 Kings 4:8-10",
          "text": "One day Elisha went to Shunem, and a prominent woman who lived there persuaded him to have a meal. So whenever he would pass by, he would stop there to eat. / Then the woman said to her husband, “Behold, now I know that the one who often comes our way is a holy man of God. / Please let us make a small room upstairs and put in it a bed, a table, a chair, and a lamp for him. Then when he comes to us, he can stay there.”"
        },
        {
          "reference": "2 Samuel 19:24",
          "text": "Then Mephibosheth, Saul’s grandson, went down to meet the king. He had not cared for his feet or trimmed his mustache or washed his clothes from the day the king had left until the day he returned safely."
        },
        {
          "reference": "1 Samuel 25:41",
          "text": "She arose, bowed facedown, and said, “Here is your servant, ready to serve and to wash the feet of my lord’s servants.”"
        }
      ]
    },
    {
      "reference": "Genesis 18:5",
      "book": "Genesis",
      "chapter": 18,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "Let me get you something to eat, so you can be refreshed and then go on your way—now that you have come to your servant.” “Very well,” they answered, &#8220do as you say.”"
        },
        {
          "version": "NLT",
          "text": "And since you’ve honored your servant with this visit, let me prepare some food to refresh you before you continue on your journey.” “All right,” they said. “Do as you have said.”"
        },
        {
          "version": "ESV",
          "text": "while I bring a morsel of bread, that you may refresh yourselves, and after that you may pass on—since you have come to your servant.” So they said, “Do as you have said.”"
        },
        {
          "version": "NKJV",
          "text": "And I will bring a morsel of bread, that you may refresh your hearts. After that you may pass by, inasmuch as you have come to your servant.” They said, “Do as you have said.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 18:6",
      "book": "Genesis",
      "chapter": 18,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "So Abraham hurried into the tent to Sarah. “Quick,” he said, “get three seahs of the finest flour and knead it and bake some bread.”"
        },
        {
          "version": "NLT",
          "text": "So Abraham ran back to the tent and said to Sarah, “Hurry! Get three large measures of your best flour, knead it into dough, and bake some bread.”"
        },
        {
          "version": "ESV",
          "text": "And Abraham went quickly into the tent to Sarah and said, “Quick! Three seahs of fine flour! Knead it, and make cakes.”"
        },
        {
          "version": "NKJV",
          "text": "So Abraham hurried into the tent to Sarah and said, “Quickly, make ready three measures of fine meal; knead it and make cakes.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 13:2",
          "text": "Do not neglect to show hospitality to strangers, for by so doing some people have entertained angels without knowing it."
        },
        {
          "reference": "Matthew 13:33",
          "text": "He told them still another parable: “The kingdom of heaven is like leaven that a woman took and mixed into three measures of flour, until all of it was leavened.”"
        },
        {
          "reference": "Luke 13:21",
          "text": "It is like leaven that a woman took and mixed into three measures of flour, until all of it was leavened.”"
        },
        {
          "reference": "1 Peter 4:9",
          "text": "Show hospitality to one another without complaining."
        },
        {
          "reference": "Romans 12:13",
          "text": "Share with the saints who are in need. Practice hospitality."
        },
        {
          "reference": "1 Timothy 5:10",
          "text": "and well known for good deeds such as bringing up children, entertaining strangers, washing the feet of the saints, imparting relief to the afflicted, and devoting herself to every good work."
        },
        {
          "reference": "Luke 10:38-42",
          "text": "As they traveled along, Jesus entered a village where a woman named Martha welcomed Him into her home. / She had a sister named Mary, who sat at the Lord’s feet listening to His message. / But Martha was distracted by all the preparations to be made. She came to Jesus and said, “Lord, do You not care that my sister has left me to serve alone? Tell her to help me!” ..."
        },
        {
          "reference": "John 12:2",
          "text": "So they hosted a dinner for Jesus there. Martha served, and Lazarus was among those reclining at the table with Him."
        },
        {
          "reference": "Acts 16:15",
          "text": "And when she and her household had been baptized, she urged us, “If you consider me a believer in the Lord, come and stay at my house.” And she persuaded us."
        },
        {
          "reference": "1 Kings 17:10-16",
          "text": "So Elijah got up and went to Zarephath. When he arrived at the city gate, there was a widow gathering sticks. Elijah called to her and said, “Please bring me a little water in a cup, so that I may drink.” / And as she was going to get it, he called to her and said, “Please bring me a piece of bread.” / But she replied, “As surely as the LORD your God lives, I have no bread—only a handful of flour in a jar and a little oil in a jug. Look, I am gathering a couple of sticks to take home and prepare a meal for myself and my son, so that we may eat it and die.” ..."
        },
        {
          "reference": "Judges 6:19",
          "text": "So Gideon went in and prepared a young goat and unleavened bread and an ephah of flour. He placed the meat in a basket and the broth in a pot and brought them out to present to Him under the oak."
        },
        {
          "reference": "1 Samuel 28:24",
          "text": "The woman had a fattened calf at her house, and she quickly slaughtered it. She also took flour, kneaded it, and baked unleavened bread."
        },
        {
          "reference": "2 Kings 4:8-10",
          "text": "One day Elisha went to Shunem, and a prominent woman who lived there persuaded him to have a meal. So whenever he would pass by, he would stop there to eat. / Then the woman said to her husband, “Behold, now I know that the one who often comes our way is a holy man of God. / Please let us make a small room upstairs and put in it a bed, a table, a chair, and a lamp for him. Then when he comes to us, he can stay there.”"
        },
        {
          "reference": "Exodus 12:39",
          "text": "Since their dough had no leaven, the people baked what they had brought out of Egypt into unleavened loaves. For when they had been driven out of Egypt, they could not delay and had not prepared any provisions for themselves."
        },
        {
          "reference": "Leviticus 23:17",
          "text": "Bring two loaves of bread from your dwellings as a wave offering, each made from two-tenths of an ephah of fine flour, baked with leaven, as the firstfruits to the LORD."
        }
      ]
    },
    {
      "reference": "Genesis 18:7",
      "book": "Genesis",
      "chapter": 18,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he ran to the herd and selected a choice, tender calf and gave it to a servant, who hurried to prepare it."
        },
        {
          "version": "NLT",
          "text": "Then Abraham ran out to the herd and chose a tender calf and gave it to his servant, who quickly prepared it."
        },
        {
          "version": "ESV",
          "text": "And Abraham ran to the herd and took a calf, tender and good, and gave it to a young man, who prepared it quickly."
        },
        {
          "version": "NKJV",
          "text": "And Abraham ran to the herd, took a tender and good calf, gave it to a young man, and he hastened to prepare it."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 19:3",
          "text": "But Lot insisted so strongly that they followed him into his house. He prepared a feast for them and baked unleavened bread, and they ate."
        },
        {
          "reference": "Judges 6:19",
          "text": "So Gideon went in and prepared a young goat and unleavened bread and an ephah of flour. He placed the meat in a basket and the broth in a pot and brought them out to present to Him under the oak."
        },
        {
          "reference": "1 Samuel 28:24",
          "text": "The woman had a fattened calf at her house, and she quickly slaughtered it. She also took flour, kneaded it, and baked unleavened bread."
        },
        {
          "reference": "2 Samuel 12:4",
          "text": "Now a traveler came to the rich man, who refrained from taking one of his own sheep or cattle to prepare for the traveler who had come to him. Instead, he took the poor man’s lamb and prepared it for his guest.”"
        },
        {
          "reference": "1 Kings 19:21",
          "text": "So Elisha turned back from him, took his pair of oxen, and slaughtered them. Using the oxen’s equipment for fuel, he cooked the meat and gave it to the people, and they ate. Then he set out to follow and serve Elijah."
        },
        {
          "reference": "Luke 15:23",
          "text": "Bring the fattened calf and kill it. Let us feast and celebrate."
        },
        {
          "reference": "Luke 15:27",
          "text": "‘Your brother has returned,’ he said, ‘and your father has killed the fattened calf, because he has him back safe and sound.’"
        },
        {
          "reference": "Luke 15:30",
          "text": "But when this son of yours returns from squandering your wealth with prostitutes, you kill the fattened calf for him!’"
        },
        {
          "reference": "Matthew 22:4",
          "text": "Again, he sent other servants and said, ‘Tell those who have been invited that I have prepared my dinner. My oxen and fattened cattle have been killed, and everything is ready. Come to the wedding banquet.’"
        },
        {
          "reference": "1 Samuel 25:18",
          "text": "Then Abigail hurried and took two hundred loaves of bread, two skins of wine, five butchered sheep, five seahs of roasted grain, a hundred clusters of raisins, and two hundred cakes of figs. She loaded them on donkeys"
        },
        {
          "reference": "2 Samuel 17:29",
          "text": "honey, curds, sheep, and cheese from the herd for David and his people to eat. For they said, “The people have become hungry, exhausted, and thirsty in the wilderness.”"
        },
        {
          "reference": "1 Kings 4:23",
          "text": "ten fat oxen, twenty range oxen, and a hundred sheep, as well as deer, gazelles, roebucks, and fattened poultry."
        },
        {
          "reference": "1 Chronicles 12:40",
          "text": "And their neighbors from as far away as Issachar, Zebulun, and Naphtali came bringing food on donkeys, camels, mules, and oxen—abundant supplies of flour, fig cakes and raisin cakes, wine and oil, oxen and sheep. Indeed, there was joy in Israel."
        },
        {
          "reference": "Proverbs 9:2",
          "text": "She has prepared her meat and mixed her wine; she has also set her table."
        },
        {
          "reference": "Isaiah 22:13",
          "text": "But look, there is joy and gladness, butchering of cattle and slaughtering of sheep, eating of meat and drinking of wine: “Let us eat and drink, for tomorrow we die!”"
        }
      ]
    },
    {
      "reference": "Genesis 18:8",
      "book": "Genesis",
      "chapter": 18,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "He then brought some curds and milk and the calf that had been prepared, and set these before them. While they ate, he stood near them under a tree."
        },
        {
          "version": "NLT",
          "text": "When the food was ready, Abraham took some yogurt and milk and the roasted meat, and he served it to the men. As they ate, Abraham waited on them in the shade of the trees."
        },
        {
          "version": "ESV",
          "text": "Then he took curds and milk and the calf that he had prepared, and set it before them. And he stood by them under the tree while they ate."
        },
        {
          "version": "NKJV",
          "text": "So he took butter and milk and the calf which he had prepared, and set it before them; and he stood by them under the tree as they ate."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 13:2",
          "text": "Do not neglect to show hospitality to strangers, for by so doing some people have entertained angels without knowing it."
        },
        {
          "reference": "Judges 6:18-19",
          "text": "Please do not depart from this place until I return to You. Let me bring my offering and set it before You.” And the LORD said, “I will stay until you return.” / So Gideon went in and prepared a young goat and unleavened bread and an ephah of flour. He placed the meat in a basket and the broth in a pot and brought them out to present to Him under the oak."
        },
        {
          "reference": "1 Samuel 28:24",
          "text": "The woman had a fattened calf at her house, and she quickly slaughtered it. She also took flour, kneaded it, and baked unleavened bread."
        },
        {
          "reference": "Luke 24:30",
          "text": "While He was reclining at the table with them, He took bread, spoke a blessing and broke it, and gave it to them."
        },
        {
          "reference": "1 Kings 17:10-15",
          "text": "So Elijah got up and went to Zarephath. When he arrived at the city gate, there was a widow gathering sticks. Elijah called to her and said, “Please bring me a little water in a cup, so that I may drink.” / And as she was going to get it, he called to her and said, “Please bring me a piece of bread.” / But she replied, “As surely as the LORD your God lives, I have no bread—only a handful of flour in a jar and a little oil in a jug. Look, I am gathering a couple of sticks to take home and prepare a meal for myself and my son, so that we may eat it and die.” ..."
        },
        {
          "reference": "Matthew 22:4",
          "text": "Again, he sent other servants and said, ‘Tell those who have been invited that I have prepared my dinner. My oxen and fattened cattle have been killed, and everything is ready. Come to the wedding banquet.’"
        },
        {
          "reference": "1 Samuel 9:24",
          "text": "So the cook picked up the leg and what was attached to it and set it before Saul. Then Samuel said, “Here is what was kept back. It was set apart for you. Eat, for it has been kept for you for this occasion, from the time I said, ‘I have invited the people.’” So Saul dined with Samuel that day."
        },
        {
          "reference": "Luke 10:8",
          "text": "If you enter a town and they welcome you, eat whatever is set before you."
        },
        {
          "reference": "1 Kings 19:21",
          "text": "So Elisha turned back from him, took his pair of oxen, and slaughtered them. Using the oxen’s equipment for fuel, he cooked the meat and gave it to the people, and they ate. Then he set out to follow and serve Elijah."
        },
        {
          "reference": "Acts 16:34",
          "text": "Then he brought them into his home and set a meal before them. So he and all his household rejoiced that they had come to believe in God."
        },
        {
          "reference": "2 Samuel 12:4",
          "text": "Now a traveler came to the rich man, who refrained from taking one of his own sheep or cattle to prepare for the traveler who had come to him. Instead, he took the poor man’s lamb and prepared it for his guest.”"
        },
        {
          "reference": "Luke 24:42-43",
          "text": "So they gave Him a piece of broiled fish, / and He took it and ate it in front of them."
        },
        {
          "reference": "1 Kings 4:22-23",
          "text": "Solomon’s provisions for a single day were thirty cors of fine flour, sixty cors of meal, / ten fat oxen, twenty range oxen, and a hundred sheep, as well as deer, gazelles, roebucks, and fattened poultry."
        },
        {
          "reference": "John 12:2",
          "text": "So they hosted a dinner for Jesus there. Martha served, and Lazarus was among those reclining at the table with Him."
        },
        {
          "reference": "2 Kings 4:42-44",
          "text": "Now a man from Baal-shalishah came to the man of God with a sack of twenty loaves of barley bread from the first ripe grain. “Give it to the people to eat,” said Elisha. / But his servant asked, “How am I to set twenty loaves before a hundred men?” “Give it to the people to eat,” said Elisha, “for this is what the LORD says: ‘They will eat and have some left over.’” / So he set it before them, and they ate and had some left over, according to the word of the LORD."
        }
      ]
    },
    {
      "reference": "Genesis 18:9",
      "book": "Genesis",
      "chapter": 18,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "“Where is your wife Sarah?” they asked him. “There, in the tent,” he said."
        },
        {
          "version": "NLT",
          "text": "“Where is Sarah, your wife?” the visitors asked. “She’s inside the tent,” Abraham replied."
        },
        {
          "version": "ESV",
          "text": "They said to him, “Where is Sarah your wife?” And he said, “She is in the tent.”"
        },
        {
          "version": "NKJV",
          "text": "Then they said to him, “Where is Sarah your wife?” So he said, “Here, in the tent.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:15-19",
          "text": "Then God said to Abraham, “As for Sarai your wife, do not call her Sarai, for her name is to be Sarah. / And I will bless her and will surely give you a son by her. I will bless her, and she will be the mother of nations; kings of peoples will descend from her.” / Abraham fell facedown. Then he laughed and said to himself, “Can a child be born to a man who is a hundred years old? Can Sarah give birth at the age of ninety?” ..."
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Romans 9:9",
          "text": "For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "Genesis 16:11",
          "text": "The angel of the LORD proceeded: “Behold, you have conceived and will bear a son. And you shall name him Ishmael, for the LORD has heard your cry of affliction."
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 15:4-5",
          "text": "Then the word of the LORD came to Abram, saying, “This one will not be your heir, but one who comes from your own body will be your heir.” / And the LORD took him outside and said, “Now look to the heavens and count the stars, if you are able.” Then He told him, “So shall your offspring be.”"
        },
        {
          "reference": "Genesis 22:15-18",
          "text": "And the angel of the LORD called to Abraham from heaven a second time, / saying, “By Myself I have sworn, declares the LORD, that because you have done this and have not withheld your only son, / I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies. ..."
        },
        {
          "reference": "Genesis 24:60",
          "text": "And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.”"
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "Genesis 30:22-24",
          "text": "Then God remembered Rachel. He listened to her and opened her womb, / and she conceived and gave birth to a son. “God has taken away my shame,” she said. / She named him Joseph, and said, “May the LORD add to me another son.”"
        },
        {
          "reference": "1 Samuel 1:19-20",
          "text": "The next morning they got up early to bow in worship before the LORD, and then they returned home to Ramah. And Elkanah had relations with his wife Hannah, and the LORD remembered her. / So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "2 Kings 4:16-17",
          "text": "And Elisha declared, “At this time next year, you will hold a son in your arms.” “No, my lord,” she said. “Do not lie to your maidservant, O man of God.” / But the woman did conceive, and at that time the next year she gave birth to a son, just as Elisha had told her."
        },
        {
          "reference": "Luke 1:13",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        }
      ]
    },
    {
      "reference": "Genesis 18:10",
      "book": "Genesis",
      "chapter": 18,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "Then one of them said, “I will surely return to you about this time next year, and Sarah your wife will have a son.” Now Sarah was listening at the entrance to the tent, which was behind him."
        },
        {
          "version": "NLT",
          "text": "Then one of them said, “I will return to you about this time next year, and your wife, Sarah, will have a son!” Sarah was listening to this conversation from the tent."
        },
        {
          "version": "ESV",
          "text": "The LORD said, “I will surely return to you about this time next year, and Sarah your wife shall have a son.” And Sarah was listening at the tent door behind him."
        },
        {
          "version": "NKJV",
          "text": "And He said, “I will certainly return to you according to the time of life, and behold, Sarah your wife shall have a son.” (Sarah was listening in the tent door which was behind him.)"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Romans 9:9",
          "text": "For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        },
        {
          "reference": "Luke 1:13",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        },
        {
          "reference": "Luke 1:18-20",
          "text": "“How can I be sure of this?” Zechariah asked the angel. “I am an old man, and my wife is well along in years.” / “I am Gabriel,” replied the angel. “I stand in the presence of God, and I have been sent to speak to you and to bring you this good news. / And now you will be silent and unable to speak until the day this comes to pass, because you did not believe my words, which will be fulfilled at their proper time.”"
        },
        {
          "reference": "Luke 1:34-37",
          "text": "“How can this be,” Mary asked the angel, “since I am a virgin?” / The angel replied, “The Holy Spirit will come upon you, and the power of the Most High will overshadow you. So the Holy One to be born will be called the Son of God. / Look, even Elizabeth your relative has conceived a son in her old age, and she who was called barren is in her sixth month. ..."
        },
        {
          "reference": "Genesis 17:19",
          "text": "But God replied, “Your wife Sarah will indeed bear you a son, and you are to name him Isaac. I will establish My covenant with him as an everlasting covenant for his descendants after him."
        },
        {
          "reference": "Genesis 21:6-7",
          "text": "Then Sarah said, “God has made me laugh, and everyone who hears of this will laugh with me.” / She added, “Who would have told Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.”"
        },
        {
          "reference": "2 Kings 4:16-17",
          "text": "And Elisha declared, “At this time next year, you will hold a son in your arms.” “No, my lord,” she said. “Do not lie to your maidservant, O man of God.” / But the woman did conceive, and at that time the next year she gave birth to a son, just as Elisha had told her."
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "Genesis 15:4-5",
          "text": "Then the word of the LORD came to Abram, saying, “This one will not be your heir, but one who comes from your own body will be your heir.” / And the LORD took him outside and said, “Now look to the heavens and count the stars, if you are able.” Then He told him, “So shall your offspring be.”"
        },
        {
          "reference": "Genesis 30:22-24",
          "text": "Then God remembered Rachel. He listened to her and opened her womb, / and she conceived and gave birth to a son. “God has taken away my shame,” she said. / She named him Joseph, and said, “May the LORD add to me another son.”"
        },
        {
          "reference": "Psalm 113:9",
          "text": "He settles the barren woman in her home as a joyful mother to her children. Hallelujah!"
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "Romans 4:17-21",
          "text": "As it is written: “I have made you a father of many nations.” He is our father in the presence of God, in whom he believed, the God who gives life to the dead and calls into being what does not yet exist. / Against all hope, Abraham in hope believed and so became the father of many nations, just as he had been told, “So shall your offspring be.” / Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. ..."
        }
      ]
    },
    {
      "reference": "Genesis 18:11",
      "book": "Genesis",
      "chapter": 18,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham and Sarah were already very old, and Sarah was past the age of childbearing."
        },
        {
          "version": "NLT",
          "text": "Abraham and Sarah were both very old by this time, and Sarah was long past the age of having children."
        },
        {
          "version": "ESV",
          "text": "Now Abraham and Sarah were old, advanced in years. The way of women had ceased to be with Sarah."
        },
        {
          "version": "NKJV",
          "text": "Now Abraham and Sarah were old, well advanced in age; and Sarah had passed the age of childbearing."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 4:19",
          "text": "Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb."
        },
        {
          "reference": "Hebrews 11:11-12",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised. / And so from one man, and he as good as dead, came descendants as numerous as the stars in the sky and as countless as the sand on the seashore."
        },
        {
          "reference": "Luke 1:7",
          "text": "But they had no children, because Elizabeth was barren, and they were both well along in years."
        },
        {
          "reference": "Luke 1:18",
          "text": "“How can I be sure of this?” Zechariah asked the angel. “I am an old man, and my wife is well along in years.”"
        },
        {
          "reference": "Genesis 17:17",
          "text": "Abraham fell facedown. Then he laughed and said to himself, “Can a child be born to a man who is a hundred years old? Can Sarah give birth at the age of ninety?”"
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Romans 9:9",
          "text": "For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Isaiah 51:2",
          "text": "Look to Abraham your father, and to Sarah who gave you birth. When I called him, he was but one; then I blessed him and multiplied him."
        },
        {
          "reference": "1 Peter 3:6",
          "text": "just as Sarah obeyed Abraham and called him lord. And you are her children if you do what is right and refuse to give way to fear."
        },
        {
          "reference": "Hebrews 6:15",
          "text": "And so Abraham, after waiting patiently, obtained the promise."
        },
        {
          "reference": "Genesis 15:3-4",
          "text": "Abram continued, “Behold, You have given me no offspring, so a servant in my household will be my heir.” / Then the word of the LORD came to Abram, saying, “This one will not be your heir, but one who comes from your own body will be your heir.”"
        },
        {
          "reference": "Genesis 21:6-7",
          "text": "Then Sarah said, “God has made me laugh, and everyone who hears of this will laugh with me.” / She added, “Who would have told Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.”"
        },
        {
          "reference": "2 Kings 4:14",
          "text": "So he asked, “Then what should be done for her?” “Well, she has no son,” Gehazi replied, “and her husband is old.”"
        },
        {
          "reference": "Judges 13:2-3",
          "text": "Now there was a man from Zorah named Manoah, from the clan of the Danites, whose wife was barren and had no children. / The angel of the LORD appeared to the woman and said to her, “It is true that you are barren and have no children; but you will conceive and give birth to a son."
        },
        {
          "reference": "1 Samuel 1:5-6",
          "text": "But to Hannah he would give a double portion, for he loved her even though the LORD had closed her womb. / Because the LORD had closed Hannah’s womb, her rival would provoke her viciously to taunt her."
        }
      ]
    },
    {
      "reference": "Genesis 18:12",
      "book": "Genesis",
      "chapter": 18,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "So Sarah laughed to herself as she thought, &#8220After I am worn out and my lord is old, will I now have this pleasure?”"
        },
        {
          "version": "NLT",
          "text": "So she laughed silently to herself and said, “How could a worn-out woman like me enjoy such pleasure, especially when my master—my husband—is also so old?”"
        },
        {
          "version": "ESV",
          "text": "So Sarah laughed to herself, saying, “After I am worn out, and my lord is old, shall I have pleasure?”"
        },
        {
          "version": "NKJV",
          "text": "Therefore Sarah laughed within herself, saying, “After I have grown old, shall I have pleasure, my lord being old also?”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 18:13",
      "book": "Genesis",
      "chapter": 18,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the LORD said to Abraham, “Why did Sarah laugh and say, ‘Will I really have a child, now that I am old?’"
        },
        {
          "version": "NLT",
          "text": "Then the LORD said to Abraham, “Why did Sarah laugh? Why did she say, ‘Can an old woman like me have a baby?’"
        },
        {
          "version": "ESV",
          "text": "The LORD said to Abraham, “Why did Sarah laugh and say, ‘Shall I indeed bear a child, now that I am old?’"
        },
        {
          "version": "NKJV",
          "text": "And the LORD said to Abraham, “Why did Sarah laugh, saying, ‘Shall I surely bear a child, since I am old?’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 1:37",
          "text": "For no word from God will ever fail.”"
        },
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        },
        {
          "reference": "Romans 4:19-21",
          "text": "Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. / Yet he did not waver through disbelief in the promise of God, but was strengthened in his faith and gave glory to God, / being fully persuaded that God was able to do what He had promised."
        },
        {
          "reference": "Matthew 19:26",
          "text": "Jesus looked at them and said, “With man this is impossible, but with God all things are possible.”"
        },
        {
          "reference": "Jeremiah 32:17",
          "text": "“Oh, Lord GOD! You have made the heavens and the earth by Your great power and outstretched arm. Nothing is too difficult for You!"
        },
        {
          "reference": "Jeremiah 32:27",
          "text": "“Behold, I am the LORD, the God of all flesh. Is anything too difficult for Me?"
        },
        {
          "reference": "Job 42:2",
          "text": "“I know that You can do all things and that no plan of Yours can be thwarted."
        },
        {
          "reference": "Numbers 11:23",
          "text": "The LORD answered Moses, “Is the LORD’s arm too short? Now you will see whether or not My word will come to pass.”"
        },
        {
          "reference": "Isaiah 46:10",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’"
        },
        {
          "reference": "Isaiah 55:8-9",
          "text": "“For My thoughts are not your thoughts, neither are your ways My ways,” declares the LORD. / “For as the heavens are higher than the earth, so My ways are higher than your ways and My thoughts than your thoughts."
        },
        {
          "reference": "Psalm 115:3",
          "text": "Our God is in heaven; He does as He pleases."
        },
        {
          "reference": "Psalm 135:6",
          "text": "The LORD does all that pleases Him in the heavens and on the earth, in the seas and in all their depths."
        },
        {
          "reference": "Ephesians 3:20",
          "text": "Now to Him who is able to do immeasurably more than all we ask or imagine, according to His power that is at work within us,"
        },
        {
          "reference": "Mark 10:27",
          "text": "Jesus looked at them and said, “With man this is impossible, but not with God. For all things are possible with God.”"
        },
        {
          "reference": "Luke 18:27",
          "text": "But Jesus said, “What is impossible with man is possible with God.”"
        }
      ]
    },
    {
      "reference": "Genesis 18:14",
      "book": "Genesis",
      "chapter": 18,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Is anything too hard for the LORD? I will return to you at the appointed time next year, and Sarah will have a son.”"
        },
        {
          "version": "NLT",
          "text": "Is anything too hard for the LORD? I will return about this time next year, and Sarah will have a son.”"
        },
        {
          "version": "ESV",
          "text": "Is anything too hard for the LORD? At the appointed time I will return to you, about this time next year, and Sarah shall have a son.”"
        },
        {
          "version": "NKJV",
          "text": "Is anything too hard for the LORD? At the appointed time I will return to you, according to the time of life, and Sarah shall have a son.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 1:37",
          "text": "For no word from God will ever fail.”"
        },
        {
          "reference": "Jeremiah 32:17",
          "text": "“Oh, Lord GOD! You have made the heavens and the earth by Your great power and outstretched arm. Nothing is too difficult for You!"
        },
        {
          "reference": "Matthew 19:26",
          "text": "Jesus looked at them and said, “With man this is impossible, but with God all things are possible.”"
        },
        {
          "reference": "Job 42:2",
          "text": "“I know that You can do all things and that no plan of Yours can be thwarted."
        },
        {
          "reference": "Romans 4:21",
          "text": "being fully persuaded that God was able to do what He had promised."
        },
        {
          "reference": "Numbers 11:23",
          "text": "The LORD answered Moses, “Is the LORD’s arm too short? Now you will see whether or not My word will come to pass.”"
        },
        {
          "reference": "Isaiah 46:10-11",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’ / I summon a bird of prey from the east, a man for My purpose from a far-off land. Truly I have spoken, and truly I will bring it to pass. I have planned it, and I will surely do it."
        },
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        },
        {
          "reference": "Psalm 115:3",
          "text": "Our God is in heaven; He does as He pleases."
        },
        {
          "reference": "Ephesians 3:20",
          "text": "Now to Him who is able to do immeasurably more than all we ask or imagine, according to His power that is at work within us,"
        },
        {
          "reference": "2 Kings 7:1-2",
          "text": "Then Elisha said, “Hear the word of the LORD! This is what the LORD says: ‘About this time tomorrow at the gate of Samaria, a seah of fine flour will sell for a shekel, and two seahs of barley will sell for a shekel.’” / But the officer on whose arm the king leaned answered the man of God, “Look, even if the LORD were to make windows in heaven, could this really happen?” “You will see it with your own eyes,” replied Elisha, “but you will not eat any of it.”"
        },
        {
          "reference": "Mark 10:27",
          "text": "Jesus looked at them and said, “With man this is impossible, but not with God. For all things are possible with God.”"
        },
        {
          "reference": "Jeremiah 32:27",
          "text": "“Behold, I am the LORD, the God of all flesh. Is anything too difficult for Me?"
        },
        {
          "reference": "Isaiah 55:11",
          "text": "so My word that proceeds from My mouth will not return to Me empty, but it will accomplish what I please, and it will prosper where I send it."
        },
        {
          "reference": "Romans 9:9",
          "text": "For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        }
      ]
    },
    {
      "reference": "Genesis 18:15",
      "book": "Genesis",
      "chapter": 18,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "Sarah was afraid, so she lied and said, “I did not laugh.” But he said, “Yes, you did laugh.”"
        },
        {
          "version": "NLT",
          "text": "Sarah was afraid, so she denied it, saying, “I didn’t laugh.” But the LORD said, “No, you did laugh.”"
        },
        {
          "version": "ESV",
          "text": "But Sarah denied it, saying, “I did not laugh,” for she was afraid. He said, “No, but you did laugh.”"
        },
        {
          "version": "NKJV",
          "text": "But Sarah denied it, saying, “I did not laugh,” for she was afraid. And He said, “No, but you did laugh!”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        },
        {
          "reference": "Luke 1:18-20",
          "text": "“How can I be sure of this?” Zechariah asked the angel. “I am an old man, and my wife is well along in years.” / “I am Gabriel,” replied the angel. “I stand in the presence of God, and I have been sent to speak to you and to bring you this good news. / And now you will be silent and unable to speak until the day this comes to pass, because you did not believe my words, which will be fulfilled at their proper time.”"
        },
        {
          "reference": "Romans 4:19-21",
          "text": "Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. / Yet he did not waver through disbelief in the promise of God, but was strengthened in his faith and gave glory to God, / being fully persuaded that God was able to do what He had promised."
        },
        {
          "reference": "Matthew 19:26",
          "text": "Jesus looked at them and said, “With man this is impossible, but with God all things are possible.”"
        },
        {
          "reference": "Luke 1:37",
          "text": "For no word from God will ever fail.”"
        },
        {
          "reference": "Romans 9:9",
          "text": "For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "1 Peter 3:6",
          "text": "just as Sarah obeyed Abraham and called him lord. And you are her children if you do what is right and refuse to give way to fear."
        },
        {
          "reference": "John 8:56",
          "text": "Your father Abraham rejoiced that he would see My day. He saw it and was glad.”"
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "James 5:11",
          "text": "See how blessed we consider those who have persevered. You have heard of Job’s perseverance and have seen the outcome from the Lord. The Lord is full of compassion and mercy."
        },
        {
          "reference": "Genesis 17:17",
          "text": "Abraham fell facedown. Then he laughed and said to himself, “Can a child be born to a man who is a hundred years old? Can Sarah give birth at the age of ninety?”"
        },
        {
          "reference": "Genesis 21:6-7",
          "text": "Then Sarah said, “God has made me laugh, and everyone who hears of this will laugh with me.” / She added, “Who would have told Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.”"
        },
        {
          "reference": "Genesis 12:11-13",
          "text": "As he was about to enter Egypt, he said to his wife Sarai, “Look, I know that you are a beautiful woman, / and when the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live. / Please say you are my sister, so that I will be treated well for your sake, and on account of you my life will be spared.”"
        },
        {
          "reference": "Genesis 20:2",
          "text": "Abraham said of his wife Sarah, “She is my sister.” So Abimelech king of Gerar had Sarah brought to him."
        },
        {
          "reference": "Genesis 16:2",
          "text": "So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        }
      ]
    },
    {
      "reference": "Genesis 18:16",
      "book": "Genesis",
      "chapter": 18,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "When the men got up to leave, they looked down toward Sodom, and Abraham walked along with them to see them on their way."
        },
        {
          "version": "NLT",
          "text": "Then the men got up from their meal and looked out toward Sodom. As they left, Abraham went with them to send them on their way."
        },
        {
          "version": "ESV",
          "text": "Then the men set out from there, and they looked down toward Sodom. And Abraham went with them to set them on their way."
        },
        {
          "version": "NKJV",
          "text": "Then the men rose from there and looked toward Sodom, and Abraham went with them to send them on the way."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 19:1-3",
          "text": "Now the two angels arrived at Sodom in the evening, and Lot was sitting in the gateway of the city. When Lot saw them, he got up to meet them, bowed facedown, / and said, “My lords, please turn aside into the house of your servant; wash your feet and spend the night. Then you can rise early and go on your way.” “No,” they answered, “we will spend the night in the square.” / But Lot insisted so strongly that they followed him into his house. He prepared a feast for them and baked unleavened bread, and they ate."
        },
        {
          "reference": "Genesis 13:14-18",
          "text": "After Lot had departed, the LORD said to Abram, “Now lift up your eyes from the place where you are, and look to the north and south and east and west, / for all the land that you see, I will give to you and your offspring forever. / I will make your offspring like the dust of the earth, so that if one could count the dust of the earth, then your offspring could be counted. ..."
        },
        {
          "reference": "Genesis 22:1-2",
          "text": "Some time later God tested Abraham and said to him, “Abraham!” “Here I am,” he answered. / “Take your son,” God said, “your only son Isaac, whom you love, and go to the land of Moriah. Offer him there as a burnt offering on one of the mountains, which I will show you.”"
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 15:1-6",
          "text": "After these events, the word of the LORD came to Abram in a vision: “Do not be afraid, Abram. I am your shield, your very great reward.” / But Abram replied, “O Lord GOD, what can You give me, since I remain childless, and the heir of my house is Eliezer of Damascus?” / Abram continued, “Behold, You have given me no offspring, so a servant in my household will be my heir.” ..."
        },
        {
          "reference": "Genesis 17:1-8",
          "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, “I am God Almighty. Walk before Me and be blameless. / I will establish My covenant between Me and you, and I will multiply you exceedingly.” / Then Abram fell facedown, and God said to him, ..."
        },
        {
          "reference": "Genesis 19:27-29",
          "text": "Early the next morning, Abraham got up and returned to the place where he had stood before the LORD. / He looked down toward Sodom and Gomorrah and all the land of the plain, and he saw the smoke rising from the land like smoke from a furnace. / So when God destroyed the cities of the plain, He remembered Abraham, and He brought Lot out of the catastrophe that destroyed the cities where he had lived."
        },
        {
          "reference": "Genesis 20:1-2",
          "text": "Now Abraham journeyed from there to the region of the Negev and settled between Kadesh and Shur. While he was staying in Gerar, / Abraham said of his wife Sarah, “She is my sister.” So Abimelech king of Gerar had Sarah brought to him."
        },
        {
          "reference": "Genesis 21:1-3",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised. / And Abraham gave the name Isaac to the son Sarah bore to him."
        },
        {
          "reference": "Genesis 24:1-4",
          "text": "By now Abraham was old and well along in years, and the LORD had blessed him in every way. / So Abraham instructed the chief servant of his household, who managed all he owned, “Place your hand under my thigh, / and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling, ..."
        },
        {
          "reference": "Genesis 26:1-5",
          "text": "Now there was another famine in the land, subsequent to the one that had occurred in Abraham’s time. And Isaac went to Abimelech king of the Philistines at Gerar. / The LORD appeared to Isaac and said, “Do not go down to Egypt. Settle in the land where I tell you. / Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. ..."
        },
        {
          "reference": "Genesis 28:10-15",
          "text": "Meanwhile Jacob left Beersheba and set out for Haran. / On reaching a certain place, he spent the night there because the sun had set. And taking one of the stones from that place, he put it under his head and lay down to sleep. / And Jacob had a dream about a ladder that rested on the earth with its top reaching up to heaven, and God’s angels were going up and down the ladder. ..."
        },
        {
          "reference": "Genesis 32:24-30",
          "text": "So Jacob was left all alone, and there a man wrestled with him until daybreak. / When the man saw that he could not overpower Jacob, he struck the socket of Jacob’s hip and dislocated it as they wrestled. / Then the man said, “Let me go, for it is daybreak.” But Jacob replied, “I will not let you go unless you bless me.” ..."
        },
        {
          "reference": "Genesis 35:9-12",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him. / And God said to him, “Though your name is Jacob, you will no longer be called Jacob. Instead, your name will be Israel.” So God named him Israel. / And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. ..."
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        }
      ]
    },
    {
      "reference": "Genesis 18:17",
      "book": "Genesis",
      "chapter": 18,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the LORD said, “Shall I hide from Abraham what I am about to do?"
        },
        {
          "version": "NLT",
          "text": "“Should I hide my plan from Abraham?” the LORD asked."
        },
        {
          "version": "ESV",
          "text": "The LORD said, “Shall I hide from Abraham what I am about to do,"
        },
        {
          "version": "NKJV",
          "text": "And the LORD said, “Shall I hide from Abraham what I am doing,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Amos 3:7",
          "text": "Surely the Lord GOD does nothing without revealing His plan to His servants the prophets."
        },
        {
          "reference": "Psalm 25:14",
          "text": "The LORD confides in those who fear Him, and reveals His covenant to them."
        },
        {
          "reference": "John 15:15",
          "text": "No longer do I call you servants, for a servant does not understand what his master is doing. But I have called you friends, because everything I have learned from My Father I have made known to you."
        },
        {
          "reference": "James 2:23",
          "text": "And the Scripture was fulfilled that says, “Abraham believed God, and it was credited to him as righteousness,” and he was called a friend of God."
        },
        {
          "reference": "Isaiah 41:8",
          "text": "“But you, O Israel, My servant, Jacob, whom I have chosen, descendant of Abraham My friend—"
        },
        {
          "reference": "Galatians 3:8",
          "text": "The Scripture foresaw that God would justify the Gentiles by faith, and foretold the gospel to Abraham: “All nations will be blessed through you.”"
        },
        {
          "reference": "Romans 4:13",
          "text": "For the promise to Abraham and his offspring that he would be heir of the world was not given through the law, but through the righteousness that comes by faith."
        },
        {
          "reference": "Hebrews 11:8-10",
          "text": "By faith Abraham, when called to go to a place he would later receive as his inheritance, obeyed and went, without knowing where he was going. / By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise. / For he was looking forward to the city with foundations, whose architect and builder is God."
        },
        {
          "reference": "2 Chronicles 20:7",
          "text": "Our God, did You not drive out the inhabitants of this land before Your people Israel and give it forever to the descendants of Abraham Your friend?"
        },
        {
          "reference": "Exodus 33:11",
          "text": "Thus the LORD would speak to Moses face to face, as a man speaks to his friend. Then Moses would return to the camp, but his young assistant Joshua son of Nun would not leave the tent."
        },
        {
          "reference": "John 16:12-15",
          "text": "I still have much to tell you, but you cannot yet bear to hear it. / However, when the Spirit of truth comes, He will guide you into all truth. For He will not speak on His own, but He will speak what He hears, and He will declare to you what is to come. / He will glorify Me by taking from what is Mine and disclosing it to you. ..."
        },
        {
          "reference": "Ephesians 3:3-5",
          "text": "that is, the mystery made known to me by revelation, as I have already written briefly. / In reading this, then, you will be able to understand my insight into the mystery of Christ, / which was not made known to men in other generations as it has now been revealed by the Spirit to God’s holy apostles and prophets."
        },
        {
          "reference": "1 Corinthians 2:9-10",
          "text": "Rather, as it is written: “No eye has seen, no ear has heard, no heart has imagined, what God has prepared for those who love Him.” / But God has revealed it to us by the Spirit. The Spirit searches all things, even the deep things of God."
        },
        {
          "reference": "Matthew 13:11",
          "text": "He replied, “The knowledge of the mysteries of the kingdom of heaven has been given to you, but not to them."
        },
        {
          "reference": "Luke 10:21-24",
          "text": "At that time Jesus rejoiced in the Holy Spirit and declared, “I praise You, Father, Lord of heaven and earth, because You have hidden these things from the wise and learned, and revealed them to little children. Yes, Father, for this was well-pleasing in Your sight. / All things have been entrusted to Me by My Father. No one knows who the Son is except the Father, and no one knows who the Father is except the Son and those to whom the Son chooses to reveal Him.” / Then Jesus turned to the disciples and said privately, “Blessed are the eyes that see what you see. ..."
        }
      ]
    },
    {
      "reference": "Genesis 18:18",
      "book": "Genesis",
      "chapter": 18,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham will surely become a great and powerful nation, and all nations on earth will be blessed through him."
        },
        {
          "version": "NLT",
          "text": "“For Abraham will certainly become a great and mighty nation, and all the nations of the earth will be blessed through him."
        },
        {
          "version": "ESV",
          "text": "seeing that Abraham shall surely become a great and mighty nation, and all the nations of the earth shall be blessed in him?"
        },
        {
          "version": "NKJV",
          "text": "since Abraham shall surely become a great and mighty nation, and all the nations of the earth shall be blessed in him?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 22:17-18",
          "text": "I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies. / And through your offspring all nations of the earth will be blessed, because you have obeyed My voice.”"
        },
        {
          "reference": "Genesis 26:4",
          "text": "I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed,"
        },
        {
          "reference": "Genesis 28:14",
          "text": "Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring."
        },
        {
          "reference": "Galatians 3:8",
          "text": "The Scripture foresaw that God would justify the Gentiles by faith, and foretold the gospel to Abraham: “All nations will be blessed through you.”"
        },
        {
          "reference": "Galatians 3:14",
          "text": "He redeemed us in order that the blessing promised to Abraham would come to the Gentiles in Christ Jesus, so that by faith we might receive the promise of the Spirit."
        },
        {
          "reference": "Romans 4:13",
          "text": "For the promise to Abraham and his offspring that he would be heir of the world was not given through the law, but through the righteousness that comes by faith."
        },
        {
          "reference": "Acts 3:25",
          "text": "And you are sons of the prophets and of the covenant God made with your fathers when He said to Abraham, ‘Through your offspring all the families of the earth will be blessed.’"
        },
        {
          "reference": "Hebrews 6:14",
          "text": "saying, “I will surely bless you and multiply your descendants.”"
        },
        {
          "reference": "Psalm 72:17",
          "text": "May his name endure forever; may his name continue as long as the sun shines. In him may all nations be blessed; may they call him blessed."
        },
        {
          "reference": "Isaiah 51:2",
          "text": "Look to Abraham your father, and to Sarah who gave you birth. When I called him, he was but one; then I blessed him and multiplied him."
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Galatians 3:16",
          "text": "The promises were spoken to Abraham and to his seed. The Scripture does not say, “and to seeds,” meaning many, but “and to your seed,” meaning One, who is Christ."
        },
        {
          "reference": "Genesis 17:4-6",
          "text": "“As for Me, this is My covenant with you: You will be the father of many nations. / No longer will you be called Abram, but your name will be Abraham, for I have made you a father of many nations. / I will make you exceedingly fruitful; I will make nations of you, and kings will descend from you."
        },
        {
          "reference": "Genesis 35:11",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you."
        }
      ]
    },
    {
      "reference": "Genesis 18:19",
      "book": "Genesis",
      "chapter": 18,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "For I have chosen him, so that he will direct his children and his household after him to keep the way of the LORD by doing what is right and just, so that the LORD will bring about for Abraham what he has promised him.”"
        },
        {
          "version": "NLT",
          "text": "I have singled him out so that he will direct his sons and their families to keep the way of the LORD by doing what is right and just. Then I will do for Abraham all that I have promised.”"
        },
        {
          "version": "ESV",
          "text": "For I have chosen him, that he may command his children and his household after him to keep the way of the LORD by doing righteousness and justice, so that the LORD may bring to Abraham what he has promised him.”"
        },
        {
          "version": "NKJV",
          "text": "For I have known him, in order that he may command his children and his household after him, that they keep the way of the LORD, to do righteousness and justice, that the LORD may bring to Abraham what He has spoken to him.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 6:6-7",
          "text": "These words I am commanding you today are to be upon your hearts. / And you shall teach them diligently to your children and speak of them when you sit at home and when you walk along the road, when you lie down and when you get up."
        },
        {
          "reference": "Joshua 24:15",
          "text": "But if it is unpleasing in your sight to serve the LORD, then choose for yourselves this day whom you will serve, whether the gods your fathers served beyond the Euphrates, or the gods of the Amorites in whose land you are living. As for me and my house, we will serve the LORD!”"
        },
        {
          "reference": "Proverbs 22:6",
          "text": "Train up a child in the way he should go, and when he is old he will not depart from it."
        },
        {
          "reference": "Psalm 78:5-7",
          "text": "For He established a testimony in Jacob and appointed a law in Israel, which He commanded our fathers to teach to their children, / that the coming generation would know them—even children yet to be born—to arise and tell their own children / that they should put their confidence in God, not forgetting His works, but keeping His commandments."
        },
        {
          "reference": "Ephesians 6:4",
          "text": "Fathers, do not provoke your children to wrath; instead, bring them up in the discipline and instruction of the Lord."
        },
        {
          "reference": "Deuteronomy 4:9-10",
          "text": "Only be on your guard and diligently watch yourselves, so that you do not forget the things your eyes have seen, and so that they do not slip from your heart as long as you live. Teach them to your children and grandchildren. / The day you stood before the LORD your God at Horeb, the LORD said to me, “Gather the people before Me to hear My words, so that they may learn to fear Me all the days they live on the earth, and that they may teach them to their children.”"
        },
        {
          "reference": "1 Samuel 2:30",
          "text": "Therefore, the LORD, the God of Israel, declares: ‘I did indeed say that your house and the house of your father would walk before Me forever. But now the LORD declares: Far be it from Me! For I will honor those who honor Me, but those who despise Me will be disdained."
        },
        {
          "reference": "1 Kings 2:3-4",
          "text": "And keep the charge of the LORD your God to walk in His ways and to keep His statutes, commandments, ordinances, and decrees, as written in the Law of Moses, so that you may prosper in all you do and wherever you turn, / and so that the LORD may fulfill His promise to me: ‘If your descendants take heed to walk faithfully before Me with all their heart and soul, you will never fail to have a man on the throne of Israel.’"
        },
        {
          "reference": "Malachi 2:15",
          "text": "Has not the LORD made them one, having a portion of the Spirit? And why one? Because He seeks godly offspring. So guard yourselves in your spirit and do not break faith with the wife of your youth."
        },
        {
          "reference": "2 Timothy 3:15",
          "text": "From infancy you have known the Holy Scriptures, which are able to make you wise for salvation through faith in Christ Jesus."
        },
        {
          "reference": "Acts 10:2",
          "text": "He and all his household were devout and God-fearing. He gave generously to the people and prayed to God regularly."
        },
        {
          "reference": "Hebrews 11:17-19",
          "text": "By faith Abraham, when he was tested, offered up Isaac on the altar. He who had received the promises was ready to offer his one and only son, / even though God had said to him, “Through Isaac your offspring will be reckoned.” / Abraham reasoned that God could raise the dead, and in a sense, he did receive Isaac back from death."
        },
        {
          "reference": "Romans 4:12",
          "text": "And he is also the father of the circumcised who not only are circumcised, but who also walk in the footsteps of the faith that our father Abraham had before he was circumcised."
        },
        {
          "reference": "Galatians 3:29",
          "text": "And if you belong to Christ, then you are Abraham’s seed and heirs according to the promise."
        },
        {
          "reference": "Isaiah 38:19",
          "text": "The living, only the living, can thank You, as I do today; fathers will tell their children about Your faithfulness."
        }
      ]
    },
    {
      "reference": "Genesis 18:20",
      "book": "Genesis",
      "chapter": 18,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the LORD said, “The outcry against Sodom and Gomorrah is so great and their sin so grievous"
        },
        {
          "version": "NLT",
          "text": "So the LORD told Abraham, “I have heard a great outcry from Sodom and Gomorrah, because their sin is so flagrant."
        },
        {
          "version": "ESV",
          "text": "Then the LORD said, “Because the outcry against Sodom and Gomorrah is great and their sin is very grave,"
        },
        {
          "version": "NKJV",
          "text": "And the LORD said, “Because the outcry against Sodom and Gomorrah is great, and because their sin is very grave,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 19:13",
          "text": "because we are about to destroy this place. For the outcry to the LORD against its people is so great that He has sent us to destroy it.”"
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "Jeremiah 23:14",
          "text": "And among the prophets of Jerusalem I have seen a horrible thing: They commit adultery and walk in lies. They strengthen the hands of evildoers, so that no one turns his back on wickedness. They are all like Sodom to Me; the people of Jerusalem are like Gomorrah.”"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "2 Peter 2:6-8",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Romans 9:29",
          "text": "It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Lamentations 4:6",
          "text": "The punishment of the daughter of my people is greater than that of Sodom, which was overthrown in an instant without a hand turned to help her."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Matthew 10:15",
          "text": "Truly I tell you, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Mark 6:11",
          "text": "If anyone will not welcome you or listen to you, shake the dust off your feet when you leave that place, as a testimony against them.”"
        }
      ]
    },
    {
      "reference": "Genesis 18:21",
      "book": "Genesis",
      "chapter": 18,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "that I will go down and see if what they have done is as bad as the outcry that has reached me. If not, I will know.”"
        },
        {
          "version": "NLT",
          "text": "I am going down to see if their actions are as wicked as I have heard. If not, I want to know.”"
        },
        {
          "version": "ESV",
          "text": "I will go down to see whether they have done altogether according to the outcry that has come to me. And if not, I will know.”"
        },
        {
          "version": "NKJV",
          "text": "I will go down now and see whether they have done altogether according to the outcry against it that has come to Me; and if not, I will know.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 11:5",
          "text": "Then the LORD came down to see the city and the tower that the sons of men were building."
        },
        {
          "reference": "Genesis 19:13",
          "text": "because we are about to destroy this place. For the outcry to the LORD against its people is so great that He has sent us to destroy it.”"
        },
        {
          "reference": "Exodus 3:7-8",
          "text": "The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings. / I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites."
        },
        {
          "reference": "Exodus 2:23-25",
          "text": "After a long time, the king of Egypt died. The Israelites groaned and cried out under their burden of slavery, and their cry for deliverance from bondage ascended to God. / So God heard their groaning, and He remembered His covenant with Abraham, Isaac, and Jacob. / God saw the Israelites and took notice."
        },
        {
          "reference": "Deuteronomy 8:2",
          "text": "Remember that these forty years the LORD your God led you all the way in the wilderness, so that He might humble you and test you in order to know what was in your heart, whether or not you would keep His commandments."
        },
        {
          "reference": "Psalm 14:2",
          "text": "The LORD looks down from heaven upon the sons of men to see if any understand, if any seek God."
        },
        {
          "reference": "Psalm 53:2",
          "text": "God looks down from heaven upon the sons of men to see if any understand, if any seek God."
        },
        {
          "reference": "Isaiah 5:7",
          "text": "For the vineyard of the LORD of Hosts is the house of Israel, and the men of Judah are the plant of His delight. He looked for justice, but saw bloodshed; for righteousness, but heard a cry of distress."
        },
        {
          "reference": "Isaiah 10:1-3",
          "text": "Woe to those who enact unjust statutes and issue oppressive decrees, / to deprive the poor of fair treatment and withhold justice from the oppressed of My people, to make widows their prey and orphans their plunder. / What will you do on the day of reckoning when devastation comes from afar? To whom will you flee for help? Where will you leave your wealth?"
        },
        {
          "reference": "Jeremiah 6:6-7",
          "text": "For this is what the LORD of Hosts says: “Cut down the trees and raise a siege ramp against Jerusalem. This city must be punished; there is nothing but oppression in her midst. / As a well gushes its water, so she pours out her evil. Violence and destruction resound in her; sickness and wounds are ever before Me."
        },
        {
          "reference": "Jeremiah 11:20",
          "text": "O LORD of Hosts, who judges righteously, who examines the heart and mind, let me see Your vengeance upon them, for to You I have committed my cause."
        },
        {
          "reference": "Jeremiah 18:11",
          "text": "Now therefore, tell the men of Judah and the residents of Jerusalem that this is what the LORD says: ‘Behold, I am planning a disaster for you and devising a plan against you. Turn now, each of you, from your evil ways, and correct your ways and deeds.’"
        },
        {
          "reference": "Ezekiel 9:9",
          "text": "He replied, “The iniquity of the house of Israel and Judah is exceedingly great. The land is full of bloodshed, and the city is full of perversity. For they say, ‘The LORD has forsaken the land; the LORD does not see.’"
        },
        {
          "reference": "Amos 3:7",
          "text": "Surely the Lord GOD does nothing without revealing His plan to His servants the prophets."
        },
        {
          "reference": "Jonah 1:2",
          "text": "“Get up! Go to the great city of Nineveh and preach against it, because its wickedness has come up before Me.”"
        }
      ]
    },
    {
      "reference": "Genesis 18:22",
      "book": "Genesis",
      "chapter": 18,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "The men turned away and went toward Sodom, but Abraham remained standing before the LORD."
        },
        {
          "version": "NLT",
          "text": "The other men turned and headed toward Sodom, but the LORD remained with Abraham."
        },
        {
          "version": "ESV",
          "text": "So the men turned from there and went toward Sodom, but Abraham still stood before the LORD."
        },
        {
          "version": "NKJV",
          "text": "Then the men turned away from there and went toward Sodom, but Abraham still stood before the LORD."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 19:1",
          "text": "Now the two angels arrived at Sodom in the evening, and Lot was sitting in the gateway of the city. When Lot saw them, he got up to meet them, bowed facedown,"
        },
        {
          "reference": "Genesis 13:12-13",
          "text": "Abram lived in the land of Canaan, but Lot settled in the cities of the plain and pitched his tent toward Sodom. / But the men of Sodom were wicked, sinning greatly against the LORD."
        },
        {
          "reference": "Genesis 19:27-29",
          "text": "Early the next morning, Abraham got up and returned to the place where he had stood before the LORD. / He looked down toward Sodom and Gomorrah and all the land of the plain, and he saw the smoke rising from the land like smoke from a furnace. / So when God destroyed the cities of the plain, He remembered Abraham, and He brought Lot out of the catastrophe that destroyed the cities where he had lived."
        },
        {
          "reference": "Genesis 13:18",
          "text": "So Abram moved his tent and went to live near the Oaks of Mamre at Hebron, where he built an altar to the LORD."
        },
        {
          "reference": "Genesis 14:12",
          "text": "They also carried off Abram’s nephew Lot and his possessions, since Lot was living in Sodom."
        },
        {
          "reference": "Genesis 19:17",
          "text": "As soon as the men had brought them out, one of them said, “Run for your lives! Do not look back, and do not stop anywhere on the plain! Flee to the mountains, or you will be swept away!”"
        },
        {
          "reference": "Genesis 19:24-25",
          "text": "Then the LORD rained down sulfur and fire on Sodom and Gomorrah—from the LORD out of the heavens. / Thus He destroyed these cities and the entire plain, including all the inhabitants of the cities and everything that grew on the ground."
        },
        {
          "reference": "Genesis 19:13",
          "text": "because we are about to destroy this place. For the outcry to the LORD against its people is so great that He has sent us to destroy it.”"
        },
        {
          "reference": "Genesis 19:16",
          "text": "But when Lot hesitated, the men grabbed his hand and the hands of his wife and his two daughters. And they led them safely out of the city, because of the LORD’s compassion for them."
        },
        {
          "reference": "Genesis 19:15",
          "text": "At daybreak the angels hurried Lot along, saying, “Get up! Take your wife and your two daughters who are here, or you will be swept away in the punishment of the city.”"
        },
        {
          "reference": "Genesis 19:4-5",
          "text": "Before they had gone to bed, all the men of the city of Sodom, both young and old, surrounded the house. / They called out to Lot, saying, “Where are the men who came to you tonight? Send them out to us so we can have relations with them!”"
        },
        {
          "reference": "Genesis 19:10-11",
          "text": "But the men inside reached out, pulled Lot into the house with them, and shut the door. / And they struck the men at the entrance, young and old, with blindness, so that they wearied themselves trying to find the door."
        },
        {
          "reference": "Genesis 19:6-8",
          "text": "Lot went outside to meet them, shutting the door behind him. / “Please, my brothers,” he pleaded, “don’t do such a wicked thing! / Look, I have two daughters who have never slept with a man. Let me bring them to you, and you can do to them as you please. But do not do anything to these men, for they have come under the protection of my roof.”"
        },
        {
          "reference": "Genesis 19:14",
          "text": "So Lot went out and spoke to the sons-in-law who were pledged in marriage to his daughters. “Get up,” he said. “Get out of this place, for the LORD is about to destroy the city!” But his sons-in-law thought he was joking."
        },
        {
          "reference": "Genesis 19:26",
          "text": "But Lot’s wife looked back, and she became a pillar of salt."
        }
      ]
    },
    {
      "reference": "Genesis 18:23",
      "book": "Genesis",
      "chapter": 18,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Abraham approached him and said: “Will you sweep away the righteous with the wicked?"
        },
        {
          "version": "NLT",
          "text": "Abraham approached him and said, “Will you sweep away both the righteous and the wicked?"
        },
        {
          "version": "ESV",
          "text": "Then Abraham drew near and said, “Will you indeed sweep away the righteous with the wicked?"
        },
        {
          "version": "NKJV",
          "text": "And Abraham came near and said, “Would You also destroy the righteous with the wicked?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 32:11-14",
          "text": "But Moses sought the favor of the LORD his God, saying, “O LORD, why does Your anger burn against Your people, whom You brought out of the land of Egypt with great power and a mighty hand? / Why should the Egyptians declare, ‘He brought them out with evil intent, to kill them in the mountains and wipe them from the face of the earth’? Turn from Your fierce anger and relent from doing harm to Your people. / Remember Your servants Abraham, Isaac, and Israel, to whom You swore by Your very self when You declared, ‘I will make your descendants as numerous as the stars in the sky, and I will give your descendants all this land that I have promised, and it shall be their inheritance forever.’” ..."
        },
        {
          "reference": "Numbers 14:13-19",
          "text": "But Moses said to the LORD, “The Egyptians will hear of it, for by Your strength You brought this people from among them. / And they will tell it to the inhabitants of this land. They have already heard that You, O LORD, are in the midst of this people, that You, O LORD, have been seen face to face, that Your cloud stands over them, and that You go before them in a pillar of cloud by day and a pillar of fire by night. / If You kill this people as one man, the nations who have heard of Your fame will say, ..."
        },
        {
          "reference": "Jeremiah 5:1",
          "text": "“Go up and down the streets of Jerusalem. Look now and take note; search her squares. If you can find a single person, anyone who acts justly, anyone who seeks the truth, then I will forgive the city."
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "Amos 7:2-6",
          "text": "And when the locusts had eaten every green plant in the land, I said, “Lord GOD, please forgive! How will Jacob survive, since he is so small?” / So the LORD relented from this plan. “It will not happen,” He said. / This is what the Lord GOD showed me: The Lord GOD was calling for judgment by fire. It consumed the great deep and devoured the land. ..."
        },
        {
          "reference": "Job 23:4-5",
          "text": "I would plead my case before Him and fill my mouth with arguments. / I would learn how He would answer, and consider what He would say."
        },
        {
          "reference": "Isaiah 1:18",
          "text": "“Come now, let us reason together,” says the LORD. “Though your sins are like scarlet, they will be as white as snow; though they are as red as crimson, they will become like wool."
        },
        {
          "reference": "Psalm 106:23",
          "text": "So He said He would destroy them—had not Moses His chosen one stood before Him in the breach to divert His wrath from destroying them."
        },
        {
          "reference": "Psalm 34:15-17",
          "text": "The eyes of the LORD are on the righteous, and His ears are inclined to their cry. / But the face of the LORD is against those who do evil, to wipe out all memory of them from the earth. / The righteous cry out, and the LORD hears; He delivers them from all their troubles."
        },
        {
          "reference": "Psalm 37:28",
          "text": "For the LORD loves justice and will not forsake His saints. They are preserved forever, but the offspring of the wicked will be cut off."
        },
        {
          "reference": "Psalm 145:18-20",
          "text": "The LORD is near to all who call on Him, to all who call out to Him in truth. / He fulfills the desires of those who fear Him; He hears their cry and saves them. / The LORD preserves all who love Him, but all the wicked He will destroy."
        },
        {
          "reference": "Matthew 5:13-16",
          "text": "You are the salt of the earth. But if the salt loses its savor, how can it be made salty again? It is no longer good for anything, except to be thrown out and trampled by men. / You are the light of the world. A city on a hill cannot be hidden. / Neither do people light a lamp and put it under a basket. Instead, they set it on a stand, and it gives light to everyone in the house. ..."
        },
        {
          "reference": "Matthew 7:7-11",
          "text": "Ask, and it will be given to you; seek, and you will find; knock, and the door will be opened to you. / For everyone who asks receives; he who seeks finds; and to him who knocks, the door will be opened. / Which of you, if his son asks for bread, will give him a stone? ..."
        },
        {
          "reference": "Luke 11:5-10",
          "text": "Then Jesus said to them, “Suppose one of you goes to his friend at midnight and says, ‘Friend, lend me three loaves of bread, / because a friend of mine has come to me on a journey, and I have nothing to set before him.’ / And suppose the one inside answers, ‘Do not bother me. My door is already shut, and my children and I are in bed. I cannot get up to give you anything.’ ..."
        },
        {
          "reference": "Luke 18:1-8",
          "text": "Then Jesus told them a parable about their need to pray at all times and not lose heart: / “In a certain town there was a judge who neither feared God nor respected men. / And there was a widow in that town who kept appealing to him, ‘Give me justice against my adversary.’ ..."
        }
      ]
    },
    {
      "reference": "Genesis 18:24",
      "book": "Genesis",
      "chapter": 18,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "What if there are fifty righteous people in the city? Will you really sweep it away and not spare the place for the sake of the fifty righteous people in it?"
        },
        {
          "version": "NLT",
          "text": "Suppose you find fifty righteous people living there in the city—will you still sweep it away and not spare it for their sakes?"
        },
        {
          "version": "ESV",
          "text": "Suppose there are fifty righteous within the city. Will you then sweep away the place and not spare it for the fifty righteous who are in it?"
        },
        {
          "version": "NKJV",
          "text": "Suppose there were fifty righteous within the city; would You also destroy the place and not spare it for the fifty righteous that were in it?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 19:29",
          "text": "So when God destroyed the cities of the plain, He remembered Abraham, and He brought Lot out of the catastrophe that destroyed the cities where he had lived."
        },
        {
          "reference": "Exodus 32:14",
          "text": "So the LORD relented from the calamity He had threatened to bring on His people."
        },
        {
          "reference": "Jeremiah 5:1",
          "text": "“Go up and down the streets of Jerusalem. Look now and take note; search her squares. If you can find a single person, anyone who acts justly, anyone who seeks the truth, then I will forgive the city."
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "Amos 7:3",
          "text": "So the LORD relented from this plan. “It will not happen,” He said."
        },
        {
          "reference": "Amos 7:6",
          "text": "So the LORD relented from this plan. “It will not happen either,” said the Lord GOD."
        },
        {
          "reference": "Jonah 3:10",
          "text": "When God saw their actions—that they had turned from their evil ways—He relented from the disaster He had threatened to bring upon them."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Luke 10:12-13",
          "text": "I tell you, it will be more bearable on that day for Sodom than for that town. / Woe to you, Chorazin! Woe to you, Bethsaida! For if the miracles that were performed in you had been performed in Tyre and Sidon, they would have repented long ago, sitting in sackcloth and ashes."
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Romans 9:27-29",
          "text": "Isaiah cries out concerning Israel: “Though the number of the Israelites is like the sand of the sea, only the remnant will be saved. / For the Lord will carry out His sentence on the earth thoroughly and decisively.” / It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        },
        {
          "reference": "2 Peter 2:6-9",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)— ..."
        },
        {
          "reference": "James 5:16",
          "text": "Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous man has great power to prevail."
        },
        {
          "reference": "Isaiah 1:9",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah."
        },
        {
          "reference": "Isaiah 65:8",
          "text": "This is what the LORD says: “As the new wine is found in a cluster of grapes, and men say, ‘Do not destroy it, for it contains a blessing,’ so I will act on behalf of My servants; I will not destroy them all."
        }
      ]
    },
    {
      "reference": "Genesis 18:25",
      "book": "Genesis",
      "chapter": 18,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "Far be it from you to do such a thing—to kill the righteous with the wicked, treating the righteous and the wicked alike. Far be it from you! Will not the Judge of all the earth do right?”"
        },
        {
          "version": "NLT",
          "text": "Surely you wouldn’t do such a thing, destroying the righteous along with the wicked. Why, you would be treating the righteous and the wicked exactly the same! Surely you wouldn’t do that! Should not the Judge of all the earth do what is right?”"
        },
        {
          "version": "ESV",
          "text": "Far be it from you to do such a thing, to put the righteous to death with the wicked, so that the righteous fare as the wicked! Far be that from you! Shall not the Judge of all the earth do what is just?”"
        },
        {
          "version": "NKJV",
          "text": "Far be it from You to do such a thing as this, to slay the righteous with the wicked, so that the righteous should be as the wicked; far be it from You! Shall not the Judge of all the earth do right?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 3:6",
          "text": "Certainly not! In that case, how could God judge the world?"
        },
        {
          "reference": "Psalm 58:11",
          "text": "Then men will say, “There is surely a reward for the righteous! There is surely a God who judges the earth!”"
        },
        {
          "reference": "Job 8:3",
          "text": "Does God pervert justice? Does the Almighty pervert what is right?"
        },
        {
          "reference": "Deuteronomy 32:4",
          "text": "He is the Rock, His work is perfect; all His ways are just. A God of faithfulness without injustice, righteous and upright is He."
        },
        {
          "reference": "Psalm 9:8",
          "text": "He judges the world with justice; He governs the people with equity."
        },
        {
          "reference": "2 Peter 2:9",
          "text": "if all this is so, then the Lord knows how to rescue the godly from trials and to hold the unrighteous for punishment on the day of judgment."
        },
        {
          "reference": "Psalm 96:13",
          "text": "before the LORD, for He is coming—He is coming to judge the earth. He will judge the world in righteousness and the peoples in His faithfulness."
        },
        {
          "reference": "Acts 17:31",
          "text": "For He has set a day when He will judge the world with justice by the Man He has appointed. He has given proof of this to everyone by raising Him from the dead.”"
        },
        {
          "reference": "Psalm 98:9",
          "text": "before the LORD, for He comes to judge the earth. He will judge the world with righteousness and the peoples with equity."
        },
        {
          "reference": "Isaiah 3:10-11",
          "text": "Tell the righteous it will be well with them, for they will enjoy the fruit of their labor. / Woe to the wicked; disaster is upon them! For they will be repaid with what their hands have done."
        },
        {
          "reference": "2 Timothy 4:8",
          "text": "From now on there is laid up for me the crown of righteousness, which the Lord, the righteous Judge, will award to me on that day—and not only to me, but to all who crave His appearing."
        },
        {
          "reference": "Psalm 7:11",
          "text": "God is a righteous judge and a God who feels indignation each day."
        },
        {
          "reference": "Ecclesiastes 3:17",
          "text": "I said in my heart, “God will judge the righteous and the wicked, since there is a time for every activity and every deed.”"
        },
        {
          "reference": "Hebrews 12:23",
          "text": "in joyful assembly, to the congregation of the firstborn, enrolled in heaven. You have come to God the Judge of all, to the spirits of the righteous made perfect,"
        },
        {
          "reference": "Psalm 11:7",
          "text": "For the LORD is righteous; He loves justice. The upright will see His face."
        }
      ]
    },
    {
      "reference": "Genesis 18:26",
      "book": "Genesis",
      "chapter": 18,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "The LORD said, “If I find fifty righteous people in the city of Sodom, I will spare the whole place for their sake.”"
        },
        {
          "version": "NLT",
          "text": "And the LORD replied, “If I find fifty righteous people in Sodom, I will spare the entire city for their sake.”"
        },
        {
          "version": "ESV",
          "text": "And the LORD said, “If I find at Sodom fifty righteous in the city, I will spare the whole place for their sake.”"
        },
        {
          "version": "NKJV",
          "text": "So the LORD said, “If I find in Sodom fifty righteous within the city, then I will spare all the place for their sakes.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 32:14",
          "text": "So the LORD relented from the calamity He had threatened to bring on His people."
        },
        {
          "reference": "Jeremiah 5:1",
          "text": "“Go up and down the streets of Jerusalem. Look now and take note; search her squares. If you can find a single person, anyone who acts justly, anyone who seeks the truth, then I will forgive the city."
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "Amos 7:3",
          "text": "So the LORD relented from this plan. “It will not happen,” He said."
        },
        {
          "reference": "Amos 7:6",
          "text": "So the LORD relented from this plan. “It will not happen either,” said the Lord GOD."
        },
        {
          "reference": "Jonah 3:10",
          "text": "When God saw their actions—that they had turned from their evil ways—He relented from the disaster He had threatened to bring upon them."
        },
        {
          "reference": "2 Chronicles 7:14",
          "text": "and if My people who are called by My name humble themselves and pray and seek My face and turn from their wicked ways, then I will hear from heaven, forgive their sin, and heal their land."
        },
        {
          "reference": "Isaiah 1:9",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah."
        },
        {
          "reference": "Isaiah 65:8",
          "text": "This is what the LORD says: “As the new wine is found in a cluster of grapes, and men say, ‘Do not destroy it, for it contains a blessing,’ so I will act on behalf of My servants; I will not destroy them all."
        },
        {
          "reference": "Jeremiah 18:8",
          "text": "But if that nation I warned turns from its evil, then I will relent of the disaster I had planned to bring."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Matthew 12:41",
          "text": "The men of Nineveh will stand at the judgment with this generation and condemn it; for they repented at the preaching of Jonah, and now One greater than Jonah is here."
        },
        {
          "reference": "Luke 10:12-13",
          "text": "I tell you, it will be more bearable on that day for Sodom than for that town. / Woe to you, Chorazin! Woe to you, Bethsaida! For if the miracles that were performed in you had been performed in Tyre and Sidon, they would have repented long ago, sitting in sackcloth and ashes."
        },
        {
          "reference": "Luke 11:32",
          "text": "The men of Nineveh will stand at the judgment with this generation and condemn it; for they repented at the preaching of Jonah, and now One greater than Jonah is here."
        },
        {
          "reference": "Romans 9:29",
          "text": "It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        }
      ]
    },
    {
      "reference": "Genesis 18:27",
      "book": "Genesis",
      "chapter": 18,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Abraham spoke up again: “Now that I have been so bold as to speak to the Lord, though I am nothing but dust and ashes,"
        },
        {
          "version": "NLT",
          "text": "Then Abraham spoke again. “Since I have begun, let me speak further to my Lord, even though I am but dust and ashes."
        },
        {
          "version": "ESV",
          "text": "Abraham answered and said, “Behold, I have undertaken to speak to the Lord, I who am but dust and ashes."
        },
        {
          "version": "NKJV",
          "text": "Then Abraham answered and said, “Indeed now, I who am but dust and ashes have taken it upon myself to speak to the Lord:"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Job 42:6",
          "text": "Therefore I despise myself, and I repent in dust and ashes.”"
        },
        {
          "reference": "Isaiah 6:5",
          "text": "Then I said: “Woe is me, for I am ruined, because I am a man of unclean lips dwelling among a people of unclean lips; for my eyes have seen the King, the LORD of Hosts.”"
        },
        {
          "reference": "Luke 18:13",
          "text": "But the tax collector stood at a distance, unwilling even to lift up his eyes to heaven. Instead, he beat his breast and said, ‘God, have mercy on me, a sinner!’"
        },
        {
          "reference": "Exodus 3:11",
          "text": "But Moses asked God, “Who am I, that I should go to Pharaoh and bring the Israelites out of Egypt?”"
        },
        {
          "reference": "1 Kings 8:38-39",
          "text": "then may whatever prayer or petition Your people Israel make—each knowing his own afflictions and spreading out his hands toward this temple— / be heard by You from heaven, Your dwelling place. And may You forgive and act, and repay each man according to all his ways, since You know his heart—for You alone know the hearts of all men—"
        },
        {
          "reference": "Psalm 51:17",
          "text": "The sacrifices of God are a broken spirit; a broken and a contrite heart, O God, You will not despise."
        },
        {
          "reference": "Matthew 3:14",
          "text": "But John tried to prevent Him, saying, “I need to be baptized by You, and do You come to me?”"
        },
        {
          "reference": "Romans 7:18",
          "text": "I know that nothing good lives in me, that is, in my flesh; for I have the desire to do what is good, but I cannot carry it out."
        },
        {
          "reference": "1 Timothy 1:15",
          "text": "This is a trustworthy saying, worthy of full acceptance: Christ Jesus came into the world to save sinners, of whom I am the worst."
        },
        {
          "reference": "2 Corinthians 12:11",
          "text": "I have become a fool, but you drove me to it. In fact, you should have commended me, since I am in no way inferior to those “super-apostles,” even though I am nothing."
        },
        {
          "reference": "Job 40:4-5",
          "text": "“Behold, I am insignificant. How can I reply to You? I place my hand over my mouth. / I have spoken once, but I have no answer—twice, but I have nothing to add.”"
        },
        {
          "reference": "Isaiah 64:6",
          "text": "Each of us has become like something unclean, and all our righteous acts are like filthy rags; we all wither like a leaf, and our iniquities carry us away like the wind."
        },
        {
          "reference": "James 4:10",
          "text": "Humble yourselves before the Lord, and He will exalt you."
        },
        {
          "reference": "Philippians 3:8",
          "text": "More than that, I count all things as loss compared to the surpassing excellence of knowing Christ Jesus my Lord, for whom I have lost all things. I consider them rubbish, that I may gain Christ"
        },
        {
          "reference": "1 Peter 5:5-6",
          "text": "Young men, in the same way, submit yourselves to your elders. And all of you, clothe yourselves with humility toward one another, because, “God opposes the proud, but gives grace to the humble.” / Humble yourselves, therefore, under God’s mighty hand, so that in due time He may exalt you."
        }
      ]
    },
    {
      "reference": "Genesis 18:28",
      "book": "Genesis",
      "chapter": 18,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "what if the number of the righteous is five less than fifty? Will you destroy the whole city for lack of five people?” “If I find forty-five there,” he said, “I will not destroy it.”"
        },
        {
          "version": "NLT",
          "text": "Suppose there are only forty-five righteous people rather than fifty? Will you destroy the whole city for lack of five?” And the LORD said, “I will not destroy it if I find forty-five righteous people there.”"
        },
        {
          "version": "ESV",
          "text": "Suppose five of the fifty righteous are lacking. Will you destroy the whole city for lack of five?” And he said, “I will not destroy it if I find forty-five there.”"
        },
        {
          "version": "NKJV",
          "text": "Suppose there were five less than the fifty righteous; would You destroy all of the city for lack of five?” So He said, “If I find there forty-five, I will not destroy it. ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 32:14",
          "text": "So the LORD relented from the calamity He had threatened to bring on His people."
        },
        {
          "reference": "Numbers 14:19-20",
          "text": "Pardon, I pray, the iniquity of this people, in keeping with the greatness of Your loving devotion, just as You have forgiven them ever since they left Egypt.” / “I have pardoned them as you requested,” the LORD replied."
        },
        {
          "reference": "Jeremiah 5:1",
          "text": "“Go up and down the streets of Jerusalem. Look now and take note; search her squares. If you can find a single person, anyone who acts justly, anyone who seeks the truth, then I will forgive the city."
        },
        {
          "reference": "Amos 7:2-3",
          "text": "And when the locusts had eaten every green plant in the land, I said, “Lord GOD, please forgive! How will Jacob survive, since he is so small?” / So the LORD relented from this plan. “It will not happen,” He said."
        },
        {
          "reference": "Amos 7:5-6",
          "text": "Then I said, “Lord GOD, please stop! How will Jacob survive, since he is so small?” / So the LORD relented from this plan. “It will not happen either,” said the Lord GOD."
        },
        {
          "reference": "Jonah 3:10",
          "text": "When God saw their actions—that they had turned from their evil ways—He relented from the disaster He had threatened to bring upon them."
        },
        {
          "reference": "Isaiah 1:9",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah."
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "2 Chronicles 7:14",
          "text": "and if My people who are called by My name humble themselves and pray and seek My face and turn from their wicked ways, then I will hear from heaven, forgive their sin, and heal their land."
        },
        {
          "reference": "Psalm 106:23",
          "text": "So He said He would destroy them—had not Moses His chosen one stood before Him in the breach to divert His wrath from destroying them."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Luke 10:13-14",
          "text": "Woe to you, Chorazin! Woe to you, Bethsaida! For if the miracles that were performed in you had been performed in Tyre and Sidon, they would have repented long ago, sitting in sackcloth and ashes. / But it will be more bearable for Tyre and Sidon at the judgment than for you."
        },
        {
          "reference": "Matthew 18:19-20",
          "text": "Again, I tell you truly that if two of you on the earth agree about anything you ask for, it will be done for you by My Father in heaven. / For where two or three gather together in My name, there am I with them.”"
        },
        {
          "reference": "James 5:16",
          "text": "Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous man has great power to prevail."
        },
        {
          "reference": "1 John 5:14-15",
          "text": "And this is the confidence that we have before Him: If we ask anything according to His will, He hears us. / And if we know that He hears us in whatever we ask, we know that we already possess what we have asked of Him."
        }
      ]
    },
    {
      "reference": "Genesis 18:29",
      "book": "Genesis",
      "chapter": 18,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "Once again he spoke to him, “What if only forty are found there?” He said, &#8220For the sake of forty, I will not do it.”"
        },
        {
          "version": "NLT",
          "text": "Then Abraham pressed his request further. “Suppose there are only forty?” And the LORD replied, “I will not destroy it for the sake of the forty.”"
        },
        {
          "version": "ESV",
          "text": "Again he spoke to him and said, “Suppose forty are found there.” He answered, “For the sake of forty I will not do it.”"
        },
        {
          "version": "NKJV",
          "text": "And he spoke to Him yet again and said, “Suppose there should be forty found there?” So He said, “I will not do it for the sake of forty.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 19:24-25",
          "text": "Then the LORD rained down sulfur and fire on Sodom and Gomorrah—from the LORD out of the heavens. / Thus He destroyed these cities and the entire plain, including all the inhabitants of the cities and everything that grew on the ground."
        },
        {
          "reference": "Exodus 32:11-14",
          "text": "But Moses sought the favor of the LORD his God, saying, “O LORD, why does Your anger burn against Your people, whom You brought out of the land of Egypt with great power and a mighty hand? / Why should the Egyptians declare, ‘He brought them out with evil intent, to kill them in the mountains and wipe them from the face of the earth’? Turn from Your fierce anger and relent from doing harm to Your people. / Remember Your servants Abraham, Isaac, and Israel, to whom You swore by Your very self when You declared, ‘I will make your descendants as numerous as the stars in the sky, and I will give your descendants all this land that I have promised, and it shall be their inheritance forever.’” ..."
        },
        {
          "reference": "Numbers 14:17-20",
          "text": "So now I pray, may the power of my Lord be magnified, just as You have declared: / ‘The LORD is slow to anger and abounding in loving devotion, forgiving iniquity and transgression. Yet He will by no means leave the guilty unpunished; He will visit the iniquity of the fathers upon their children to the third and fourth generation.’ / Pardon, I pray, the iniquity of this people, in keeping with the greatness of Your loving devotion, just as You have forgiven them ever since they left Egypt.” ..."
        },
        {
          "reference": "Jeremiah 5:1",
          "text": "“Go up and down the streets of Jerusalem. Look now and take note; search her squares. If you can find a single person, anyone who acts justly, anyone who seeks the truth, then I will forgive the city."
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "Amos 7:2-6",
          "text": "And when the locusts had eaten every green plant in the land, I said, “Lord GOD, please forgive! How will Jacob survive, since he is so small?” / So the LORD relented from this plan. “It will not happen,” He said. / This is what the Lord GOD showed me: The Lord GOD was calling for judgment by fire. It consumed the great deep and devoured the land. ..."
        },
        {
          "reference": "Jonah 3:10",
          "text": "When God saw their actions—that they had turned from their evil ways—He relented from the disaster He had threatened to bring upon them."
        },
        {
          "reference": "Isaiah 1:9",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah."
        },
        {
          "reference": "Isaiah 55:6-7",
          "text": "Seek the LORD while He may be found; call on Him while He is near. / Let the wicked man forsake his way and the unrighteous man his thoughts; let him return to the LORD, that He may have compassion, and to our God, for He will freely pardon."
        },
        {
          "reference": "2 Chronicles 7:14",
          "text": "and if My people who are called by My name humble themselves and pray and seek My face and turn from their wicked ways, then I will hear from heaven, forgive their sin, and heal their land."
        },
        {
          "reference": "Matthew 7:7-8",
          "text": "Ask, and it will be given to you; seek, and you will find; knock, and the door will be opened to you. / For everyone who asks receives; he who seeks finds; and to him who knocks, the door will be opened."
        },
        {
          "reference": "Matthew 18:19-20",
          "text": "Again, I tell you truly that if two of you on the earth agree about anything you ask for, it will be done for you by My Father in heaven. / For where two or three gather together in My name, there am I with them.”"
        },
        {
          "reference": "Luke 11:9-10",
          "text": "So I tell you: Ask, and it will be given to you; seek, and you will find; knock, and the door will be opened to you. / For everyone who asks receives; he who seeks finds; and to him who knocks, the door will be opened."
        },
        {
          "reference": "Luke 18:1-8",
          "text": "Then Jesus told them a parable about their need to pray at all times and not lose heart: / “In a certain town there was a judge who neither feared God nor respected men. / And there was a widow in that town who kept appealing to him, ‘Give me justice against my adversary.’ ..."
        },
        {
          "reference": "Romans 9:27-29",
          "text": "Isaiah cries out concerning Israel: “Though the number of the Israelites is like the sand of the sea, only the remnant will be saved. / For the Lord will carry out His sentence on the earth thoroughly and decisively.” / It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        }
      ]
    },
    {
      "reference": "Genesis 18:30",
      "book": "Genesis",
      "chapter": 18,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he said, “May the Lord not be angry, but let me speak. What if only thirty can be found there?” He answered, “I will not do it if I find thirty there.”"
        },
        {
          "version": "NLT",
          "text": "“Please don’t be angry, my Lord,” Abraham pleaded. “Let me speak—suppose only thirty righteous people are found?” And the LORD replied, “I will not destroy it if I find thirty.”"
        },
        {
          "version": "ESV",
          "text": "Then he said, “Oh let not the Lord be angry, and I will speak. Suppose thirty are found there.” He answered, “I will not do it, if I find thirty there.”"
        },
        {
          "version": "NKJV",
          "text": "Then he said, “Let not the Lord be angry, and I will speak: Suppose thirty should be found there?” So He said, “I will not do it if I find thirty there.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 32:11-14",
          "text": "But Moses sought the favor of the LORD his God, saying, “O LORD, why does Your anger burn against Your people, whom You brought out of the land of Egypt with great power and a mighty hand? / Why should the Egyptians declare, ‘He brought them out with evil intent, to kill them in the mountains and wipe them from the face of the earth’? Turn from Your fierce anger and relent from doing harm to Your people. / Remember Your servants Abraham, Isaac, and Israel, to whom You swore by Your very self when You declared, ‘I will make your descendants as numerous as the stars in the sky, and I will give your descendants all this land that I have promised, and it shall be their inheritance forever.’” ..."
        },
        {
          "reference": "Numbers 14:17-20",
          "text": "So now I pray, may the power of my Lord be magnified, just as You have declared: / ‘The LORD is slow to anger and abounding in loving devotion, forgiving iniquity and transgression. Yet He will by no means leave the guilty unpunished; He will visit the iniquity of the fathers upon their children to the third and fourth generation.’ / Pardon, I pray, the iniquity of this people, in keeping with the greatness of Your loving devotion, just as You have forgiven them ever since they left Egypt.” ..."
        },
        {
          "reference": "Jeremiah 18:7-10",
          "text": "At any time I might announce that a nation or kingdom will be uprooted, torn down, and destroyed. / But if that nation I warned turns from its evil, then I will relent of the disaster I had planned to bring. / And if at another time I announce that I will build up and establish a nation or kingdom, ..."
        },
        {
          "reference": "Amos 7:2-6",
          "text": "And when the locusts had eaten every green plant in the land, I said, “Lord GOD, please forgive! How will Jacob survive, since he is so small?” / So the LORD relented from this plan. “It will not happen,” He said. / This is what the Lord GOD showed me: The Lord GOD was calling for judgment by fire. It consumed the great deep and devoured the land. ..."
        },
        {
          "reference": "Jonah 3:9-10",
          "text": "Who knows? God may turn and relent; He may turn from His fierce anger, so that we will not perish.” / When God saw their actions—that they had turned from their evil ways—He relented from the disaster He had threatened to bring upon them."
        },
        {
          "reference": "2 Chronicles 7:14",
          "text": "and if My people who are called by My name humble themselves and pray and seek My face and turn from their wicked ways, then I will hear from heaven, forgive their sin, and heal their land."
        },
        {
          "reference": "Isaiah 1:18",
          "text": "“Come now, let us reason together,” says the LORD. “Though your sins are like scarlet, they will be as white as snow; though they are as red as crimson, they will become like wool."
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "Psalm 106:23",
          "text": "So He said He would destroy them—had not Moses His chosen one stood before Him in the breach to divert His wrath from destroying them."
        },
        {
          "reference": "Job 42:8-10",
          "text": "So now, take seven bulls and seven rams, go to My servant Job, and sacrifice a burnt offering for yourselves. Then My servant Job will pray for you, for I will accept his prayer and not deal with you according to your folly. For you have not spoken accurately about Me, as My servant Job has.” / So Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite went and did as the LORD had told them; and the LORD accepted Job’s prayer. / After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions."
        },
        {
          "reference": "Matthew 7:7-11",
          "text": "Ask, and it will be given to you; seek, and you will find; knock, and the door will be opened to you. / For everyone who asks receives; he who seeks finds; and to him who knocks, the door will be opened. / Which of you, if his son asks for bread, will give him a stone? ..."
        },
        {
          "reference": "Luke 11:9-13",
          "text": "So I tell you: Ask, and it will be given to you; seek, and you will find; knock, and the door will be opened to you. / For everyone who asks receives; he who seeks finds; and to him who knocks, the door will be opened. / What father among you, if his son asks for a fish, will give him a snake instead? ..."
        },
        {
          "reference": "James 5:16",
          "text": "Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous man has great power to prevail."
        },
        {
          "reference": "1 John 5:14-15",
          "text": "And this is the confidence that we have before Him: If we ask anything according to His will, He hears us. / And if we know that He hears us in whatever we ask, we know that we already possess what we have asked of Him."
        },
        {
          "reference": "Hebrews 4:16",
          "text": "Let us then approach the throne of grace with confidence, so that we may receive mercy and find grace to help us in our time of need."
        }
      ]
    },
    {
      "reference": "Genesis 18:31",
      "book": "Genesis",
      "chapter": 18,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham said, “Now that I have been so bold as to speak to the Lord, what if only twenty can be found there?” He said, &#8220For the sake of twenty, I will not destroy it.”"
        },
        {
          "version": "NLT",
          "text": "Then Abraham said, “Since I have dared to speak to the Lord, let me continue—suppose there are only twenty?” And the LORD replied, “Then I will not destroy it for the sake of the twenty.”"
        },
        {
          "version": "ESV",
          "text": "He said, “Behold, I have undertaken to speak to the Lord. Suppose twenty are found there.” He answered, “For the sake of twenty I will not destroy it.”"
        },
        {
          "version": "NKJV",
          "text": "And he said, “Indeed now, I have taken it upon myself to speak to the Lord: Suppose twenty should be found there?” So He said, “I will not destroy it for the sake of twenty.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 32:11-14",
          "text": "But Moses sought the favor of the LORD his God, saying, “O LORD, why does Your anger burn against Your people, whom You brought out of the land of Egypt with great power and a mighty hand? / Why should the Egyptians declare, ‘He brought them out with evil intent, to kill them in the mountains and wipe them from the face of the earth’? Turn from Your fierce anger and relent from doing harm to Your people. / Remember Your servants Abraham, Isaac, and Israel, to whom You swore by Your very self when You declared, ‘I will make your descendants as numerous as the stars in the sky, and I will give your descendants all this land that I have promised, and it shall be their inheritance forever.’” ..."
        },
        {
          "reference": "Numbers 14:17-19",
          "text": "So now I pray, may the power of my Lord be magnified, just as You have declared: / ‘The LORD is slow to anger and abounding in loving devotion, forgiving iniquity and transgression. Yet He will by no means leave the guilty unpunished; He will visit the iniquity of the fathers upon their children to the third and fourth generation.’ / Pardon, I pray, the iniquity of this people, in keeping with the greatness of Your loving devotion, just as You have forgiven them ever since they left Egypt.”"
        },
        {
          "reference": "Jeremiah 5:1",
          "text": "“Go up and down the streets of Jerusalem. Look now and take note; search her squares. If you can find a single person, anyone who acts justly, anyone who seeks the truth, then I will forgive the city."
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "Amos 7:2-6",
          "text": "And when the locusts had eaten every green plant in the land, I said, “Lord GOD, please forgive! How will Jacob survive, since he is so small?” / So the LORD relented from this plan. “It will not happen,” He said. / This is what the Lord GOD showed me: The Lord GOD was calling for judgment by fire. It consumed the great deep and devoured the land. ..."
        },
        {
          "reference": "Isaiah 1:9",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah."
        },
        {
          "reference": "Isaiah 53:12",
          "text": "Therefore I will allot Him a portion with the great, and He will divide the spoils with the strong, because He has poured out His life unto death, and He was numbered with the transgressors. Yet He bore the sin of many and made intercession for the transgressors."
        },
        {
          "reference": "Psalm 106:23",
          "text": "So He said He would destroy them—had not Moses His chosen one stood before Him in the breach to divert His wrath from destroying them."
        },
        {
          "reference": "Job 42:8-10",
          "text": "So now, take seven bulls and seven rams, go to My servant Job, and sacrifice a burnt offering for yourselves. Then My servant Job will pray for you, for I will accept his prayer and not deal with you according to your folly. For you have not spoken accurately about Me, as My servant Job has.” / So Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite went and did as the LORD had told them; and the LORD accepted Job’s prayer. / After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions."
        },
        {
          "reference": "1 Samuel 12:23",
          "text": "As for me, far be it from me that I should sin against the LORD by ceasing to pray for you. And I will continue to teach you the good and right way."
        },
        {
          "reference": "2 Chronicles 30:18-20",
          "text": "A large number of the people—many from Ephraim, Manasseh, Issachar, and Zebulun—had not purified themselves, yet they ate the Passover, contrary to what was written. But Hezekiah interceded for them, saying, “May the LORD, who is good, provide atonement for everyone / who sets his heart on seeking God—the LORD, the God of his fathers—even if he is not cleansed according to the purification rules of the sanctuary.” / And the LORD heard Hezekiah and healed the people."
        },
        {
          "reference": "James 5:16",
          "text": "Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous man has great power to prevail."
        },
        {
          "reference": "1 John 2:1",
          "text": "My little children, I am writing these things to you so that you will not sin. But if anyone does sin, we have an advocate before the Father—Jesus Christ, the Righteous One."
        },
        {
          "reference": "Romans 8:34",
          "text": "Who is there to condemn us? For Christ Jesus, who died, and more than that was raised to life, is at the right hand of God—and He is interceding for us."
        },
        {
          "reference": "Hebrews 7:25",
          "text": "Therefore He is able to save completely those who draw near to God through Him, since He always lives to intercede for them."
        }
      ]
    },
    {
      "reference": "Genesis 18:32",
      "book": "Genesis",
      "chapter": 18,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he said, “May the Lord not be angry, but let me speak just once more. What if only ten can be found there?” He answered, &#8220For the sake of ten, I will not destroy it.”"
        },
        {
          "version": "NLT",
          "text": "Finally, Abraham said, “Lord, please don’t be angry with me if I speak one more time. Suppose only ten are found there?” And the LORD replied, “Then I will not destroy it for the sake of the ten.”"
        },
        {
          "version": "ESV",
          "text": "Then he said, “Oh let not the Lord be angry, and I will speak again but this once. Suppose ten are found there.” He answered, “For the sake of ten I will not destroy it.”"
        },
        {
          "version": "NKJV",
          "text": "Then he said, “Let not the Lord be angry, and I will speak but once more: Suppose ten should be found there?” And He said, “I will not destroy it for the sake of ten.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 32:11-14",
          "text": "But Moses sought the favor of the LORD his God, saying, “O LORD, why does Your anger burn against Your people, whom You brought out of the land of Egypt with great power and a mighty hand? / Why should the Egyptians declare, ‘He brought them out with evil intent, to kill them in the mountains and wipe them from the face of the earth’? Turn from Your fierce anger and relent from doing harm to Your people. / Remember Your servants Abraham, Isaac, and Israel, to whom You swore by Your very self when You declared, ‘I will make your descendants as numerous as the stars in the sky, and I will give your descendants all this land that I have promised, and it shall be their inheritance forever.’” ..."
        },
        {
          "reference": "Numbers 14:17-20",
          "text": "So now I pray, may the power of my Lord be magnified, just as You have declared: / ‘The LORD is slow to anger and abounding in loving devotion, forgiving iniquity and transgression. Yet He will by no means leave the guilty unpunished; He will visit the iniquity of the fathers upon their children to the third and fourth generation.’ / Pardon, I pray, the iniquity of this people, in keeping with the greatness of Your loving devotion, just as You have forgiven them ever since they left Egypt.” ..."
        },
        {
          "reference": "Jeremiah 5:1",
          "text": "“Go up and down the streets of Jerusalem. Look now and take note; search her squares. If you can find a single person, anyone who acts justly, anyone who seeks the truth, then I will forgive the city."
        },
        {
          "reference": "Amos 7:2-6",
          "text": "And when the locusts had eaten every green plant in the land, I said, “Lord GOD, please forgive! How will Jacob survive, since he is so small?” / So the LORD relented from this plan. “It will not happen,” He said. / This is what the Lord GOD showed me: The Lord GOD was calling for judgment by fire. It consumed the great deep and devoured the land. ..."
        },
        {
          "reference": "Isaiah 1:9",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah."
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "2 Chronicles 7:14",
          "text": "and if My people who are called by My name humble themselves and pray and seek My face and turn from their wicked ways, then I will hear from heaven, forgive their sin, and heal their land."
        },
        {
          "reference": "Job 33:24",
          "text": "to be gracious to him and say, ‘Spare him from going down to the Pit; I have found his ransom,’"
        },
        {
          "reference": "Psalm 106:23",
          "text": "So He said He would destroy them—had not Moses His chosen one stood before Him in the breach to divert His wrath from destroying them."
        },
        {
          "reference": "Isaiah 53:12",
          "text": "Therefore I will allot Him a portion with the great, and He will divide the spoils with the strong, because He has poured out His life unto death, and He was numbered with the transgressors. Yet He bore the sin of many and made intercession for the transgressors."
        },
        {
          "reference": "Matthew 7:7-11",
          "text": "Ask, and it will be given to you; seek, and you will find; knock, and the door will be opened to you. / For everyone who asks receives; he who seeks finds; and to him who knocks, the door will be opened. / Which of you, if his son asks for bread, will give him a stone? ..."
        },
        {
          "reference": "Luke 11:5-10",
          "text": "Then Jesus said to them, “Suppose one of you goes to his friend at midnight and says, ‘Friend, lend me three loaves of bread, / because a friend of mine has come to me on a journey, and I have nothing to set before him.’ / And suppose the one inside answers, ‘Do not bother me. My door is already shut, and my children and I are in bed. I cannot get up to give you anything.’ ..."
        },
        {
          "reference": "Luke 18:1-8",
          "text": "Then Jesus told them a parable about their need to pray at all times and not lose heart: / “In a certain town there was a judge who neither feared God nor respected men. / And there was a widow in that town who kept appealing to him, ‘Give me justice against my adversary.’ ..."
        },
        {
          "reference": "Romans 9:27-29",
          "text": "Isaiah cries out concerning Israel: “Though the number of the Israelites is like the sand of the sea, only the remnant will be saved. / For the Lord will carry out His sentence on the earth thoroughly and decisively.” / It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        },
        {
          "reference": "James 5:16",
          "text": "Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous man has great power to prevail."
        }
      ]
    },
    {
      "reference": "Genesis 18:33",
      "book": "Genesis",
      "chapter": 18,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "When the LORD had finished speaking with Abraham, he left, and Abraham returned home."
        },
        {
          "version": "NLT",
          "text": "When the LORD had finished his conversation with Abraham, he went on his way, and Abraham returned to his tent."
        },
        {
          "version": "ESV",
          "text": "And the LORD went his way, when he had finished speaking to Abraham, and Abraham returned to his place."
        },
        {
          "version": "NKJV",
          "text": "So the LORD went His way as soon as He had finished speaking with Abraham; and Abraham returned to his place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "James 5:16",
          "text": "Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous man has great power to prevail."
        },
        {
          "reference": "Exodus 32:11-14",
          "text": "But Moses sought the favor of the LORD his God, saying, “O LORD, why does Your anger burn against Your people, whom You brought out of the land of Egypt with great power and a mighty hand? / Why should the Egyptians declare, ‘He brought them out with evil intent, to kill them in the mountains and wipe them from the face of the earth’? Turn from Your fierce anger and relent from doing harm to Your people. / Remember Your servants Abraham, Isaac, and Israel, to whom You swore by Your very self when You declared, ‘I will make your descendants as numerous as the stars in the sky, and I will give your descendants all this land that I have promised, and it shall be their inheritance forever.’” ..."
        },
        {
          "reference": "Jeremiah 15:1",
          "text": "Then the LORD said to me: “Even if Moses and Samuel should stand before Me, My heart would not go out to this people. Send them from My presence, and let them go!"
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "1 Samuel 12:23",
          "text": "As for me, far be it from me that I should sin against the LORD by ceasing to pray for you. And I will continue to teach you the good and right way."
        },
        {
          "reference": "Psalm 106:23",
          "text": "So He said He would destroy them—had not Moses His chosen one stood before Him in the breach to divert His wrath from destroying them."
        },
        {
          "reference": "1 Timothy 2:1",
          "text": "First of all, then, I urge that petitions, prayers, intercessions, and thanksgiving be offered for everyone—"
        },
        {
          "reference": "Luke 18:1",
          "text": "Then Jesus told them a parable about their need to pray at all times and not lose heart:"
        },
        {
          "reference": "Hebrews 7:25",
          "text": "Therefore He is able to save completely those who draw near to God through Him, since He always lives to intercede for them."
        },
        {
          "reference": "1 John 5:14-15",
          "text": "And this is the confidence that we have before Him: If we ask anything according to His will, He hears us. / And if we know that He hears us in whatever we ask, we know that we already possess what we have asked of Him."
        },
        {
          "reference": "Romans 8:34",
          "text": "Who is there to condemn us? For Christ Jesus, who died, and more than that was raised to life, is at the right hand of God—and He is interceding for us."
        },
        {
          "reference": "Job 42:10",
          "text": "After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions."
        },
        {
          "reference": "Numbers 14:13-20",
          "text": "But Moses said to the LORD, “The Egyptians will hear of it, for by Your strength You brought this people from among them. / And they will tell it to the inhabitants of this land. They have already heard that You, O LORD, are in the midst of this people, that You, O LORD, have been seen face to face, that Your cloud stands over them, and that You go before them in a pillar of cloud by day and a pillar of fire by night. / If You kill this people as one man, the nations who have heard of Your fame will say, ..."
        },
        {
          "reference": "2 Chronicles 7:14",
          "text": "and if My people who are called by My name humble themselves and pray and seek My face and turn from their wicked ways, then I will hear from heaven, forgive their sin, and heal their land."
        },
        {
          "reference": "Isaiah 59:16",
          "text": "He saw that there was no man; He was amazed that there was no one to intercede. So His own arm brought salvation, and His own righteousness sustained Him."
        }
      ]
    }
  ]
}