{
  "book": "genesis",
  "chapter": 19,
  "verses": [
    {
      "reference": "Genesis 19:1",
      "book": "Genesis",
      "chapter": 19,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "The two angels arrived at Sodom in the evening, and Lot was sitting in the gateway of the city. When he saw them, he got up to meet them and bowed down with his face to the ground."
        },
        {
          "version": "NLT",
          "text": "That evening the two angels came to the entrance of the city of Sodom. Lot was sitting there, and when he saw them, he stood up to meet them. Then he welcomed them and bowed with his face to the ground."
        },
        {
          "version": "ESV",
          "text": "The two angels came to Sodom in the evening, and Lot was sitting in the gate of Sodom. When Lot saw them, he rose to meet them and bowed himself with his face to the earth"
        },
        {
          "version": "NKJV",
          "text": "Now the two angels came to Sodom in the evening, and Lot was sitting in the gate of Sodom. When Lot saw them, he rose to meet them, and he bowed himself with his face toward the ground."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:2",
          "text": "And Abraham looked up and saw three men standing nearby. When he saw them, he ran from the entrance of his tent to meet them and bowed low to the ground."
        },
        {
          "reference": "Genesis 18:22",
          "text": "And the two men turned away and went toward Sodom, but Abraham remained standing before the LORD."
        },
        {
          "reference": "Genesis 18:16",
          "text": "When the men got up to leave, they looked out over Sodom, and Abraham walked along with them to see them off."
        },
        {
          "reference": "Genesis 13:12-13",
          "text": "Abram lived in the land of Canaan, but Lot settled in the cities of the plain and pitched his tent toward Sodom. / But the men of Sodom were wicked, sinning greatly against the LORD."
        },
        {
          "reference": "Genesis 18:1",
          "text": "Then the LORD appeared to Abraham by the Oaks of Mamre in the heat of the day, while he was sitting at the entrance of his tent."
        },
        {
          "reference": "Genesis 13:10",
          "text": "And Lot looked out and saw that the whole plain of the Jordan, all the way to Zoar, was well watered like the garden of the LORD, like the land of Egypt. (This was before the LORD destroyed Sodom and Gomorrah.)"
        },
        {
          "reference": "Genesis 18:20-21",
          "text": "Then the LORD said, “The outcry against Sodom and Gomorrah is great. Because their sin is so grievous, / I will go down to see if their actions fully justify the outcry that has reached Me. If not, I will find out.”"
        },
        {
          "reference": "Genesis 14:12",
          "text": "They also carried off Abram’s nephew Lot and his possessions, since Lot was living in Sodom."
        },
        {
          "reference": "Genesis 18:33",
          "text": "When the LORD had finished speaking with Abraham, He departed, and Abraham returned home."
        },
        {
          "reference": "Hebrews 13:2",
          "text": "Do not neglect to show hospitality to strangers, for by so doing some people have entertained angels without knowing it."
        },
        {
          "reference": "2 Peter 2:6-8",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Luke 17:28-29",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all."
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Matthew 10:14-15",
          "text": "And if anyone will not welcome you or heed your words, shake the dust off your feet when you leave that home or town. / Truly I tell you, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        }
      ]
    },
    {
      "reference": "Genesis 19:2",
      "book": "Genesis",
      "chapter": 19,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "“My lords,” he said, “please turn aside to your servant’s house. You can wash your feet and spend the night and then go on your way early in the morning.” “No,” they answered, “we will spend the night in the square.”"
        },
        {
          "version": "NLT",
          "text": "“My lords,” he said, “come to my home to wash your feet, and be my guests for the night. You may then get up early in the morning and be on your way again.” “Oh no,” they replied. “We’ll just spend the night out here in the city square.”"
        },
        {
          "version": "ESV",
          "text": "and said, “My lords, please turn aside to your servant’s house and spend the night and wash your feet. Then you may rise up early and go on your way.” They said, “No; we will spend the night in the town square.”"
        },
        {
          "version": "NKJV",
          "text": "And he said, “Here now, my lords, please turn in to your servant’s house and spend the night, and wash your feet; then you may rise early and go on your way.” And they said, “No, but we will spend the night in the open square.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 13:2",
          "text": "Do not neglect to show hospitality to strangers, for by so doing some people have entertained angels without knowing it."
        },
        {
          "reference": "Judges 19:20-21",
          "text": "“Peace to you,” said the old man. “Let me supply everything you need. Only do not spend the night in the square.” / So he brought him to his house and fed his donkeys. And they washed their feet and ate and drank."
        },
        {
          "reference": "Luke 24:29",
          "text": "But they pleaded with Him, “Stay with us, for it is nearly evening and the day is almost over.” So He went in to stay with them."
        },
        {
          "reference": "Matthew 25:35",
          "text": "For I was hungry and you gave Me something to eat, I was thirsty and you gave Me something to drink, I was a stranger and you took Me in,"
        },
        {
          "reference": "1 Peter 4:9",
          "text": "Show hospitality to one another without complaining."
        },
        {
          "reference": "Romans 12:13",
          "text": "Share with the saints who are in need. Practice hospitality."
        },
        {
          "reference": "2 Kings 4:8",
          "text": "One day Elisha went to Shunem, and a prominent woman who lived there persuaded him to have a meal. So whenever he would pass by, he would stop there to eat."
        },
        {
          "reference": "Acts 16:15",
          "text": "And when she and her household had been baptized, she urged us, “If you consider me a believer in the Lord, come and stay at my house.” And she persuaded us."
        },
        {
          "reference": "1 Timothy 3:2",
          "text": "An overseer, then, must be above reproach, the husband of but one wife, temperate, self-controlled, respectable, hospitable, able to teach,"
        },
        {
          "reference": "1 Timothy 5:10",
          "text": "and well known for good deeds such as bringing up children, entertaining strangers, washing the feet of the saints, imparting relief to the afflicted, and devoting herself to every good work."
        },
        {
          "reference": "1 Kings 17:10-11",
          "text": "So Elijah got up and went to Zarephath. When he arrived at the city gate, there was a widow gathering sticks. Elijah called to her and said, “Please bring me a little water in a cup, so that I may drink.” / And as she was going to get it, he called to her and said, “Please bring me a piece of bread.”"
        },
        {
          "reference": "2 Samuel 12:4",
          "text": "Now a traveler came to the rich man, who refrained from taking one of his own sheep or cattle to prepare for the traveler who had come to him. Instead, he took the poor man’s lamb and prepared it for his guest.”"
        },
        {
          "reference": "Job 31:32",
          "text": "but no stranger had to lodge on the street, for my door has been open to the traveler—"
        },
        {
          "reference": "Isaiah 58:7",
          "text": "Isn’t it to share your bread with the hungry, to bring the poor and homeless into your home, to clothe the naked when you see him, and not to turn away from your own flesh and blood?"
        },
        {
          "reference": "2 Corinthians 6:17",
          "text": "“Therefore come out from among them and be separate, says the Lord. Touch no unclean thing, and I will receive you.”"
        }
      ]
    },
    {
      "reference": "Genesis 19:3",
      "book": "Genesis",
      "chapter": 19,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "But he insisted so strongly that they did go with him and entered his house. He prepared a meal for them, baking bread without yeast, and they ate."
        },
        {
          "version": "NLT",
          "text": "But Lot insisted, so at last they went home with him. Lot prepared a feast for them, complete with fresh bread made without yeast, and they ate."
        },
        {
          "version": "ESV",
          "text": "But he pressed them strongly; so they turned aside to him and entered his house. And he made them a feast and baked unleavened bread, and they ate."
        },
        {
          "version": "NKJV",
          "text": "But he insisted strongly; so they turned in to him and entered his house. Then he made them a feast, and baked unleavened bread, and they ate."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 13:2",
          "text": "Do not neglect to show hospitality to strangers, for by so doing some people have entertained angels without knowing it."
        },
        {
          "reference": "Judges 19:20-21",
          "text": "“Peace to you,” said the old man. “Let me supply everything you need. Only do not spend the night in the square.” / So he brought him to his house and fed his donkeys. And they washed their feet and ate and drank."
        },
        {
          "reference": "Luke 24:29-30",
          "text": "But they pleaded with Him, “Stay with us, for it is nearly evening and the day is almost over.” So He went in to stay with them. / While He was reclining at the table with them, He took bread, spoke a blessing and broke it, and gave it to them."
        },
        {
          "reference": "1 Peter 4:9",
          "text": "Show hospitality to one another without complaining."
        },
        {
          "reference": "Romans 12:13",
          "text": "Share with the saints who are in need. Practice hospitality."
        },
        {
          "reference": "2 Kings 4:8-10",
          "text": "One day Elisha went to Shunem, and a prominent woman who lived there persuaded him to have a meal. So whenever he would pass by, he would stop there to eat. / Then the woman said to her husband, “Behold, now I know that the one who often comes our way is a holy man of God. / Please let us make a small room upstairs and put in it a bed, a table, a chair, and a lamp for him. Then when he comes to us, he can stay there.”"
        },
        {
          "reference": "Matthew 25:35",
          "text": "For I was hungry and you gave Me something to eat, I was thirsty and you gave Me something to drink, I was a stranger and you took Me in,"
        },
        {
          "reference": "Acts 16:15",
          "text": "And when she and her household had been baptized, she urged us, “If you consider me a believer in the Lord, come and stay at my house.” And she persuaded us."
        },
        {
          "reference": "1 Timothy 3:2",
          "text": "An overseer, then, must be above reproach, the husband of but one wife, temperate, self-controlled, respectable, hospitable, able to teach,"
        },
        {
          "reference": "1 Kings 17:10-15",
          "text": "So Elijah got up and went to Zarephath. When he arrived at the city gate, there was a widow gathering sticks. Elijah called to her and said, “Please bring me a little water in a cup, so that I may drink.” / And as she was going to get it, he called to her and said, “Please bring me a piece of bread.” / But she replied, “As surely as the LORD your God lives, I have no bread—only a handful of flour in a jar and a little oil in a jug. Look, I am gathering a couple of sticks to take home and prepare a meal for myself and my son, so that we may eat it and die.” ..."
        },
        {
          "reference": "Acts 28:7",
          "text": "Nearby stood an estate belonging to Publius, the chief official of the island. He welcomed us and entertained us hospitably for three days."
        },
        {
          "reference": "1 Samuel 25:6-8",
          "text": "and say to him, ‘Long life to you, and peace to you and to your house and to all that belongs to you. / Now I hear that it is time for shearing. When your shepherds were with us, we did not harass them, and nothing of theirs was missing the whole time they were in Carmel. / Ask your young men, and they will tell you. So let my young men find favor with you, for we have come on the day of a feast. Please give whatever you can spare to your servants and to your son David.’”"
        },
        {
          "reference": "2 Corinthians 9:7",
          "text": "Each one should give what he has decided in his heart to give, not out of regret or compulsion. For God loves a cheerful giver."
        },
        {
          "reference": "Job 31:32",
          "text": "but no stranger had to lodge on the street, for my door has been open to the traveler—"
        },
        {
          "reference": "Philemon 1:22",
          "text": "In the meantime, prepare a guest room for me, because I hope that through your prayers I will be restored to you."
        }
      ]
    },
    {
      "reference": "Genesis 19:4",
      "book": "Genesis",
      "chapter": 19,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "Before they had gone to bed, all the men from every part of the city of Sodom—both young and old—surrounded the house."
        },
        {
          "version": "NLT",
          "text": "But before they retired for the night, all the men of Sodom, young and old, came from all over the city and surrounded the house."
        },
        {
          "version": "ESV",
          "text": "But before they lay down, the men of the city, the men of Sodom, both young and old, all the people to the last man, surrounded the house."
        },
        {
          "version": "NKJV",
          "text": "Now before they lay down, the men of the city, the men of Sodom, both old and young, all the people from every quarter, surrounded the house."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 19:22",
          "text": "While they were enjoying themselves, suddenly the wicked men of the city surrounded the house. Pounding on the door, they said to the old man who owned the house, “Bring out the man who came to your house, so we can have relations with him!”"
        },
        {
          "reference": "Leviticus 18:22",
          "text": "You must not lie with a man as with a woman; that is an abomination."
        },
        {
          "reference": "Leviticus 20:13",
          "text": "If a man lies with a man as with a woman, they have both committed an abomination. They must surely be put to death; their blood is upon them."
        },
        {
          "reference": "Romans 1:26-27",
          "text": "For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. / Likewise, the men abandoned natural relations with women and burned with lust for one another. Men committed indecent acts with other men and received in themselves the due penalty for their error."
        },
        {
          "reference": "2 Peter 2:6-8",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "Deuteronomy 23:17",
          "text": "No daughter or son of Israel is to be a shrine prostitute."
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "1 Timothy 1:9-10",
          "text": "We realize that law is not enacted for the righteous, but for the lawless and rebellious, for the ungodly and sinful, for the unholy and profane, for killers of father or mother, for murderers, / for the sexually immoral, for homosexuals, for slave traders and liars and perjurers, and for anyone else who is averse to sound teaching"
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Hosea 9:9",
          "text": "They have deeply corrupted themselves as in the days of Gibeah; He will remember their guilt; He will punish their sins."
        },
        {
          "reference": "Jeremiah 23:14",
          "text": "And among the prophets of Jerusalem I have seen a horrible thing: They commit adultery and walk in lies. They strengthen the hands of evildoers, so that no one turns his back on wickedness. They are all like Sodom to Me; the people of Jerusalem are like Gomorrah.”"
        }
      ]
    },
    {
      "reference": "Genesis 19:5",
      "book": "Genesis",
      "chapter": 19,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "They called to Lot, “Where are the men who came to you tonight? Bring them out to us so that we can have sex with them.”"
        },
        {
          "version": "NLT",
          "text": "They shouted to Lot, “Where are the men who came to spend the night with you? Bring them out to us so we can have sex with them!”"
        },
        {
          "version": "ESV",
          "text": "And they called to Lot, “Where are the men who came to you tonight? Bring them out to us, that we may know them.”"
        },
        {
          "version": "NKJV",
          "text": "And they called to Lot and said to him, “Where are the men who came to you tonight? Bring them out to us that we may know them carnally. ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 19:22",
          "text": "While they were enjoying themselves, suddenly the wicked men of the city surrounded the house. Pounding on the door, they said to the old man who owned the house, “Bring out the man who came to your house, so we can have relations with him!”"
        },
        {
          "reference": "Leviticus 18:22",
          "text": "You must not lie with a man as with a woman; that is an abomination."
        },
        {
          "reference": "Leviticus 20:13",
          "text": "If a man lies with a man as with a woman, they have both committed an abomination. They must surely be put to death; their blood is upon them."
        },
        {
          "reference": "Romans 1:26-27",
          "text": "For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. / Likewise, the men abandoned natural relations with women and burned with lust for one another. Men committed indecent acts with other men and received in themselves the due penalty for their error."
        },
        {
          "reference": "2 Peter 2:6-8",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "Deuteronomy 23:17",
          "text": "No daughter or son of Israel is to be a shrine prostitute."
        },
        {
          "reference": "1 Timothy 1:9-10",
          "text": "We realize that law is not enacted for the righteous, but for the lawless and rebellious, for the ungodly and sinful, for the unholy and profane, for killers of father or mother, for murderers, / for the sexually immoral, for homosexuals, for slave traders and liars and perjurers, and for anyone else who is averse to sound teaching"
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "Matthew 10:15",
          "text": "Truly I tell you, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town."
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Hosea 9:9",
          "text": "They have deeply corrupted themselves as in the days of Gibeah; He will remember their guilt; He will punish their sins."
        },
        {
          "reference": "Revelation 11:8",
          "text": "Their bodies will lie in the street of the great city—figuratively called Sodom and Egypt—where their Lord was also crucified."
        }
      ]
    },
    {
      "reference": "Genesis 19:6",
      "book": "Genesis",
      "chapter": 19,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Lot went outside to meet them and shut the door behind him"
        },
        {
          "version": "NLT",
          "text": "So Lot stepped outside to talk to them, shutting the door behind him."
        },
        {
          "version": "ESV",
          "text": "Lot went out to the men at the entrance, shut the door after him,"
        },
        {
          "version": "NKJV",
          "text": "So Lot went out to them through the doorway, shut the door behind him,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 19:23-24",
          "text": "The owner of the house went out and said to them, “No, my brothers, do not do this wicked thing! After all, this man is a guest in my house. Do not commit this outrage. / Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.”"
        },
        {
          "reference": "2 Peter 2:7-8",
          "text": "and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Leviticus 18:22",
          "text": "You must not lie with a man as with a woman; that is an abomination."
        },
        {
          "reference": "Leviticus 20:13",
          "text": "If a man lies with a man as with a woman, they have both committed an abomination. They must surely be put to death; their blood is upon them."
        },
        {
          "reference": "Romans 1:26-27",
          "text": "For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. / Likewise, the men abandoned natural relations with women and burned with lust for one another. Men committed indecent acts with other men and received in themselves the due penalty for their error."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Deuteronomy 23:17",
          "text": "No daughter or son of Israel is to be a shrine prostitute."
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "2 Kings 23:7",
          "text": "He also tore down the quarters of the male shrine prostitutes that were in the house of the LORD, where the women had woven tapestries for Asherah."
        },
        {
          "reference": "1 Timothy 1:9-10",
          "text": "We realize that law is not enacted for the righteous, but for the lawless and rebellious, for the ungodly and sinful, for the unholy and profane, for killers of father or mother, for murderers, / for the sexually immoral, for homosexuals, for slave traders and liars and perjurers, and for anyone else who is averse to sound teaching"
        },
        {
          "reference": "Hosea 9:9",
          "text": "They have deeply corrupted themselves as in the days of Gibeah; He will remember their guilt; He will punish their sins."
        }
      ]
    },
    {
      "reference": "Genesis 19:7",
      "book": "Genesis",
      "chapter": 19,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "and said, “No, my friends. Don’t do this wicked thing."
        },
        {
          "version": "NLT",
          "text": "“Please, my brothers,” he begged, “don’t do such a wicked thing."
        },
        {
          "version": "ESV",
          "text": "and said, “I beg you, my brothers, do not act so wickedly."
        },
        {
          "version": "NKJV",
          "text": "and said, “Please, my brethren, do not do so wickedly!"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 19:23-24",
          "text": "The owner of the house went out and said to them, “No, my brothers, do not do this wicked thing! After all, this man is a guest in my house. Do not commit this outrage. / Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.”"
        },
        {
          "reference": "Leviticus 18:22",
          "text": "You must not lie with a man as with a woman; that is an abomination."
        },
        {
          "reference": "Leviticus 20:13",
          "text": "If a man lies with a man as with a woman, they have both committed an abomination. They must surely be put to death; their blood is upon them."
        },
        {
          "reference": "Romans 1:26-27",
          "text": "For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. / Likewise, the men abandoned natural relations with women and burned with lust for one another. Men committed indecent acts with other men and received in themselves the due penalty for their error."
        },
        {
          "reference": "2 Peter 2:6-8",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Deuteronomy 23:17",
          "text": "No daughter or son of Israel is to be a shrine prostitute."
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "1 Timothy 1:9-10",
          "text": "We realize that law is not enacted for the righteous, but for the lawless and rebellious, for the ungodly and sinful, for the unholy and profane, for killers of father or mother, for murderers, / for the sexually immoral, for homosexuals, for slave traders and liars and perjurers, and for anyone else who is averse to sound teaching"
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Hosea 9:9",
          "text": "They have deeply corrupted themselves as in the days of Gibeah; He will remember their guilt; He will punish their sins."
        },
        {
          "reference": "Jeremiah 23:14",
          "text": "And among the prophets of Jerusalem I have seen a horrible thing: They commit adultery and walk in lies. They strengthen the hands of evildoers, so that no one turns his back on wickedness. They are all like Sodom to Me; the people of Jerusalem are like Gomorrah.”"
        }
      ]
    },
    {
      "reference": "Genesis 19:8",
      "book": "Genesis",
      "chapter": 19,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "Look, I have two daughters who have never slept with a man. Let me bring them out to you, and you can do what you like with them. But don’t do anything to these men, for they have come under the protection of my roof.”"
        },
        {
          "version": "NLT",
          "text": "Look, I have two virgin daughters. Let me bring them out to you, and you can do with them as you wish. But please, leave these men alone, for they are my guests and are under my protection.”"
        },
        {
          "version": "ESV",
          "text": "Behold, I have two daughters who have not known any man. Let me bring them out to you, and do to them as you please. Only do nothing to these men, for they have come under the shelter of my roof.”"
        },
        {
          "version": "NKJV",
          "text": "See now, I have two daughters who have not known a man; please, let me bring them out to you, and you may do to them as you wish; only do nothing to these men, since this is the reason they have come under the shadow of my roof.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 19:24",
          "text": "Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.”"
        },
        {
          "reference": "Judges 19:22-30",
          "text": "While they were enjoying themselves, suddenly the wicked men of the city surrounded the house. Pounding on the door, they said to the old man who owned the house, “Bring out the man who came to your house, so we can have relations with him!” / The owner of the house went out and said to them, “No, my brothers, do not do this wicked thing! After all, this man is a guest in my house. Do not commit this outrage. / Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.” ..."
        },
        {
          "reference": "Deuteronomy 22:25-27",
          "text": "But if the man encounters a betrothed woman in the open country, and he overpowers her and lies with her, only the man who has done this must die. / Do nothing to the young woman, because she has committed no sin worthy of death. This case is just like one in which a man attacks his neighbor and murders him. / When he found her in the field, the betrothed woman cried out, but there was no one to save her."
        },
        {
          "reference": "Leviticus 18:22",
          "text": "You must not lie with a man as with a woman; that is an abomination."
        },
        {
          "reference": "Leviticus 20:13",
          "text": "If a man lies with a man as with a woman, they have both committed an abomination. They must surely be put to death; their blood is upon them."
        },
        {
          "reference": "Romans 1:26-27",
          "text": "For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. / Likewise, the men abandoned natural relations with women and burned with lust for one another. Men committed indecent acts with other men and received in themselves the due penalty for their error."
        },
        {
          "reference": "2 Peter 2:7-8",
          "text": "and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Matthew 10:14-15",
          "text": "And if anyone will not welcome you or heed your words, shake the dust off your feet when you leave that home or town. / Truly I tell you, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "1 Timothy 1:9-10",
          "text": "We realize that law is not enacted for the righteous, but for the lawless and rebellious, for the ungodly and sinful, for the unholy and profane, for killers of father or mother, for murderers, / for the sexually immoral, for homosexuals, for slave traders and liars and perjurers, and for anyone else who is averse to sound teaching"
        },
        {
          "reference": "2 Timothy 3:1-5",
          "text": "But understand this: In the last days terrible times will come. / For men will be lovers of themselves, lovers of money, boastful, arrogant, abusive, disobedient to their parents, ungrateful, unholy, / unloving, unforgiving, slanderous, without self-control, brutal, without love of good, ..."
        },
        {
          "reference": "Revelation 21:8",
          "text": "But to the cowardly and unbelieving and abominable and murderers and sexually immoral and sorcerers and idolaters and all liars, their place will be in the lake that burns with fire and sulfur. This is the second death.”"
        }
      ]
    },
    {
      "reference": "Genesis 19:9",
      "book": "Genesis",
      "chapter": 19,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "“Get out of our way,” they replied. “This fellow came here as a foreigner, and now he wants to play the judge! We’ll treat you worse than them.” They kept bringing pressure on Lot and moved forward to break down the door."
        },
        {
          "version": "NLT",
          "text": "“Stand back!” they shouted. “This fellow came to town as an outsider, and now he’s acting like our judge! We’ll treat you far worse than those other men!” And they lunged toward Lot to break down the door."
        },
        {
          "version": "ESV",
          "text": "But they said, “Stand back!” And they said, “This fellow came to sojourn, and he has become the judge! Now we will deal worse with you than with them.” Then they pressed hard against the man Lot, and drew near to break the door down."
        },
        {
          "version": "NKJV",
          "text": "And they said, “Stand back!” Then they said, “This one came in to stay here, and he keeps acting as a judge; now we will deal worse with you than with them.” So they pressed hard against the man Lot, and came near to break down the door."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 19:22",
          "text": "While they were enjoying themselves, suddenly the wicked men of the city surrounded the house. Pounding on the door, they said to the old man who owned the house, “Bring out the man who came to your house, so we can have relations with him!”"
        },
        {
          "reference": "2 Peter 2:7-8",
          "text": "and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Leviticus 18:22",
          "text": "You must not lie with a man as with a woman; that is an abomination."
        },
        {
          "reference": "Romans 1:26-27",
          "text": "For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. / Likewise, the men abandoned natural relations with women and burned with lust for one another. Men committed indecent acts with other men and received in themselves the due penalty for their error."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Deuteronomy 23:17",
          "text": "No daughter or son of Israel is to be a shrine prostitute."
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "2 Kings 23:7",
          "text": "He also tore down the quarters of the male shrine prostitutes that were in the house of the LORD, where the women had woven tapestries for Asherah."
        },
        {
          "reference": "Hosea 9:9",
          "text": "They have deeply corrupted themselves as in the days of Gibeah; He will remember their guilt; He will punish their sins."
        },
        {
          "reference": "Jeremiah 23:14",
          "text": "And among the prophets of Jerusalem I have seen a horrible thing: They commit adultery and walk in lies. They strengthen the hands of evildoers, so that no one turns his back on wickedness. They are all like Sodom to Me; the people of Jerusalem are like Gomorrah.”"
        },
        {
          "reference": "Revelation 11:8",
          "text": "Their bodies will lie in the street of the great city—figuratively called Sodom and Egypt—where their Lord was also crucified."
        }
      ]
    },
    {
      "reference": "Genesis 19:10",
      "book": "Genesis",
      "chapter": 19,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "But the men inside reached out and pulled Lot back into the house and shut the door."
        },
        {
          "version": "NLT",
          "text": "But the two angels reached out, pulled Lot into the house, and bolted the door."
        },
        {
          "version": "ESV",
          "text": "But the men reached out their hands and brought Lot into the house with them and shut the door."
        },
        {
          "version": "NKJV",
          "text": "But the men reached out their hands and pulled Lot into the house with them, and shut the door."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:2-5",
          "text": "And Abraham looked up and saw three men standing nearby. When he saw them, he ran from the entrance of his tent to meet them and bowed low to the ground. / “My lord,” said Abraham, “if I have found favor in your sight, please do not pass your servant by. / Let a little water be brought, that you may wash your feet and rest yourselves under the tree. ..."
        },
        {
          "reference": "Exodus 12:23",
          "text": "When the LORD passes through to strike down the Egyptians, He will see the blood on the top and sides of the doorframe and will pass over that doorway; so He will not allow the destroyer to enter your houses and strike you down."
        },
        {
          "reference": "Judges 19:25-26",
          "text": "But the men would not listen to him. So the Levite took his concubine and sent her outside to them, and they raped her and abused her throughout the night, and at dawn they let her go. / Early that morning, the woman went back to the house where her master was staying, collapsed at the doorway, and lay there until it was light."
        },
        {
          "reference": "2 Kings 6:18-20",
          "text": "As the Arameans came down against him, Elisha prayed to the LORD, “Please strike these people with blindness.” So He struck them with blindness, according to the word of Elisha. / And Elisha told them, “This is not the way, and this is not the city. Follow me, and I will take you to the man you are seeking.” And he led them to Samaria. / When they had entered Samaria, Elisha said, “O LORD, open the eyes of these men that they may see.” Then the LORD opened their eyes, and they looked around and discovered that they were in Samaria."
        },
        {
          "reference": "Psalm 34:7",
          "text": "The angel of the LORD encamps around those who fear Him, and he delivers them."
        },
        {
          "reference": "Psalm 91:11-12",
          "text": "For He will command His angels concerning you to guard you in all your ways. / They will lift you up in their hands, so that you will not strike your foot against a stone."
        },
        {
          "reference": "Isaiah 37:36",
          "text": "Then the angel of the LORD went out and struck down 185,000 men in the camp of the Assyrians. When the people got up the next morning, there were all the dead bodies!"
        },
        {
          "reference": "Daniel 6:22",
          "text": "My God sent His angel and shut the mouths of the lions. They have not hurt me, for I was found innocent in His sight, and I have done no wrong against you, O king.”"
        },
        {
          "reference": "Zechariah 2:5",
          "text": "For I will be a wall of fire around it, declares the LORD, and I will be the glory within it.’”"
        },
        {
          "reference": "Matthew 4:6",
          "text": "“If You are the Son of God,” he said, “throw Yourself down. For it is written: ‘He will command His angels concerning You, and they will lift You up in their hands, so that You will not strike Your foot against a stone.’”"
        },
        {
          "reference": "Matthew 18:10",
          "text": "See that you do not look down on any of these little ones. For I tell you that their angels in heaven always see the face of My Father in heaven."
        },
        {
          "reference": "Luke 4:10-11",
          "text": "For it is written: ‘He will command His angels concerning You to guard You carefully, / and they will lift You up in their hands, so that You will not strike Your foot against a stone.’”"
        },
        {
          "reference": "Luke 16:26",
          "text": "And besides all this, a great chasm has been fixed between us and you, so that even those who wish cannot cross from here to you, nor can anyone cross from there to us.’"
        },
        {
          "reference": "John 8:59",
          "text": "At this, they picked up stones to throw at Him. But Jesus was hidden and went out of the temple area."
        },
        {
          "reference": "Acts 5:19",
          "text": "But during the night an angel of the Lord opened the doors of the jail and brought them out, saying,"
        }
      ]
    },
    {
      "reference": "Genesis 19:11",
      "book": "Genesis",
      "chapter": 19,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Then they struck the men who were at the door of the house, young and old, with blindness so that they could not find the door."
        },
        {
          "version": "NLT",
          "text": "Then they blinded all the men, young and old, who were at the door of the house, so they gave up trying to get inside."
        },
        {
          "version": "ESV",
          "text": "And they struck with blindness the men who were at the entrance of the house, both small and great, so that they wore themselves out groping for the door."
        },
        {
          "version": "NKJV",
          "text": "And they struck the men who were at the doorway of the house with blindness, both small and great, so that they became weary trying to find the door."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 13:11",
          "text": "Now look, the hand of the Lord is against you, and for a time you will be blind and unable to see the light of the sun.” Immediately mist and darkness came over him, and he groped about, seeking someone to lead him by the hand."
        },
        {
          "reference": "2 Kings 6:18",
          "text": "As the Arameans came down against him, Elisha prayed to the LORD, “Please strike these people with blindness.” So He struck them with blindness, according to the word of Elisha."
        },
        {
          "reference": "Exodus 4:11",
          "text": "And the LORD said to him, “Who gave man his mouth? Or who makes the mute or the deaf, the sighted or the blind? Is it not I, the LORD?"
        },
        {
          "reference": "John 9:39-41",
          "text": "Then Jesus declared, “For judgment I have come into this world, so that the blind may see and those who see may become blind.” / Some of the Pharisees who were with Him heard this, and they asked Him, “Are we blind too?” / “If you were blind,” Jesus replied, “you would not be guilty of sin. But since you claim you can see, your guilt remains.”"
        },
        {
          "reference": "2 Corinthians 4:4",
          "text": "The god of this age has blinded the minds of unbelievers, so they cannot see the light of the gospel of the glory of Christ, who is the image of God."
        },
        {
          "reference": "Deuteronomy 28:28-29",
          "text": "The LORD will afflict you with madness, blindness, and confusion of mind, / and at noon you will grope about like a blind man in the darkness. You will not prosper in your ways. Day after day you will be oppressed and plundered, with no one to save you."
        },
        {
          "reference": "Isaiah 29:10",
          "text": "For the LORD has poured out on you a spirit of deep sleep. He has shut your eyes, O prophets; He has covered your heads, O seers."
        },
        {
          "reference": "Romans 11:8",
          "text": "as it is written: “God gave them a spirit of stupor, eyes that could not see, and ears that could not hear, to this very day.”"
        },
        {
          "reference": "Matthew 15:14",
          "text": "Disregard them! They are blind guides. If a blind man leads a blind man, both will fall into a pit.”"
        },
        {
          "reference": "Luke 24:16",
          "text": "But their eyes were kept from recognizing Him."
        },
        {
          "reference": "2 Thessalonians 2:11",
          "text": "For this reason God will send them a powerful delusion so that they believe the lie,"
        },
        {
          "reference": "Isaiah 6:9-10",
          "text": "And He replied: “Go and tell this people, ‘Be ever hearing, but never understanding; be ever seeing, but never perceiving.’ / Make the hearts of this people calloused; deafen their ears and close their eyes. Otherwise they might see with their eyes, hear with their ears, understand with their hearts, and turn and be healed.”"
        },
        {
          "reference": "John 12:40",
          "text": "“He has blinded their eyes and hardened their hearts, so that they cannot see with their eyes, and understand with their hearts, and turn, and I would heal them.”"
        },
        {
          "reference": "Mark 4:12",
          "text": "so that, ‘they may be ever seeing but never perceiving, and ever hearing but never understanding; otherwise they might turn and be forgiven.’”"
        },
        {
          "reference": "Isaiah 44:18",
          "text": "They do not comprehend or discern, for He has shut their eyes so they cannot see and closed their minds so they cannot understand."
        }
      ]
    },
    {
      "reference": "Genesis 19:12",
      "book": "Genesis",
      "chapter": 19,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "The two men said to Lot, &#8220Do you have anyone else here—sons-in-law, sons or daughters, or anyone else in the city who belongs to you? Get them out of here,"
        },
        {
          "version": "NLT",
          "text": "Meanwhile, the angels questioned Lot. “Do you have any other relatives here in the city?” they asked. “Get them out of this place—your sons-in-law, sons, daughters, or anyone else."
        },
        {
          "version": "ESV",
          "text": "Then the men said to Lot, “Have you anyone else here? Sons-in-law, sons, daughters, or anyone you have in the city, bring them out of the place."
        },
        {
          "version": "NKJV",
          "text": "Then the men said to Lot, “Have you anyone else here? Son-in-law, your sons, your daughters, and whomever you have in the city—take them out of this place!"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 19:13",
      "book": "Genesis",
      "chapter": 19,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "because we are going to destroy this place. The outcry to the LORD against its people is so great that he has sent us to destroy it.”"
        },
        {
          "version": "NLT",
          "text": "For we are about to destroy this city completely. The outcry against this place is so great it has reached the LORD, and he has sent us to destroy it.”"
        },
        {
          "version": "ESV",
          "text": "For we are about to destroy this place, because the outcry against its people has become great before the LORD, and the LORD has sent us to destroy it.”"
        },
        {
          "version": "NKJV",
          "text": "For we will destroy this place, because the outcry against them has grown great before the face of the LORD, and the LORD has sent us to destroy it.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:20-21",
          "text": "Then the LORD said, “The outcry against Sodom and Gomorrah is great. Because their sin is so grievous, / I will go down to see if their actions fully justify the outcry that has reached Me. If not, I will find out.”"
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "2 Peter 2:6-8",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "Jeremiah 23:14",
          "text": "And among the prophets of Jerusalem I have seen a horrible thing: They commit adultery and walk in lies. They strengthen the hands of evildoers, so that no one turns his back on wickedness. They are all like Sodom to Me; the people of Jerusalem are like Gomorrah.”"
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Matthew 10:15",
          "text": "Truly I tell you, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town."
        },
        {
          "reference": "Zephaniah 2:9",
          "text": "Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.”"
        },
        {
          "reference": "Romans 9:29",
          "text": "It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        },
        {
          "reference": "Lamentations 4:6",
          "text": "The punishment of the daughter of my people is greater than that of Sodom, which was overthrown in an instant without a hand turned to help her."
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Hosea 11:8",
          "text": "How could I give you up, O Ephraim? How could I surrender you, O Israel? How could I make you like Admah? How could I treat you like Zeboiim? My heart is turned within Me; My compassion is stirred!"
        }
      ]
    },
    {
      "reference": "Genesis 19:14",
      "book": "Genesis",
      "chapter": 19,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "So Lot went out and spoke to his sons-in-law, who were pledged to marry his daughters. He said, “Hurry and get out of this place, because the LORD is about to destroy the city!” But his sons-in-law thought he was joking."
        },
        {
          "version": "NLT",
          "text": "So Lot rushed out to tell his daughters’ fiancés, “Quick, get out of the city! The LORD is about to destroy it.” But the young men thought he was only joking."
        },
        {
          "version": "ESV",
          "text": "So Lot went out and said to his sons-in-law, who were to marry his daughters, “Up! Get out of this place, for the LORD is about to destroy the city.” But he seemed to his sons-in-law to be jesting."
        },
        {
          "version": "NKJV",
          "text": "So Lot went out and spoke to his sons-in-law, who had married his daughters, and said, “Get up, get out of this place; for the LORD will destroy this city!” But to his sons-in-law he seemed to be joking."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "2 Peter 2:6-8",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Isaiah 1:9-10",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah. / Hear the word of the LORD, you rulers of Sodom; listen to the instruction of our God, you people of Gomorrah!"
        },
        {
          "reference": "Jeremiah 23:14",
          "text": "And among the prophets of Jerusalem I have seen a horrible thing: They commit adultery and walk in lies. They strengthen the hands of evildoers, so that no one turns his back on wickedness. They are all like Sodom to Me; the people of Jerusalem are like Gomorrah.”"
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Zephaniah 2:9",
          "text": "Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.”"
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Lamentations 4:6",
          "text": "The punishment of the daughter of my people is greater than that of Sodom, which was overthrown in an instant without a hand turned to help her."
        },
        {
          "reference": "Romans 9:29",
          "text": "It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        },
        {
          "reference": "2 Peter 3:7",
          "text": "And by that same word, the present heavens and earth are reserved for fire, being kept for the day of judgment and destruction of ungodly men."
        },
        {
          "reference": "Revelation 11:8",
          "text": "Their bodies will lie in the street of the great city—figuratively called Sodom and Egypt—where their Lord was also crucified."
        }
      ]
    },
    {
      "reference": "Genesis 19:15",
      "book": "Genesis",
      "chapter": 19,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "With the coming of dawn, the angels urged Lot, saying, “Hurry! Take your wife and your two daughters who are here, or you will be swept away when the city is punished.”"
        },
        {
          "version": "NLT",
          "text": "At dawn the next morning the angels became insistent. “Hurry,” they said to Lot. “Take your wife and your two daughters who are here. Get out right now, or you will be swept away in the destruction of the city!”"
        },
        {
          "version": "ESV",
          "text": "As morning dawned, the angels urged Lot, saying, “Up! Take your wife and your two daughters who are here, lest you be swept away in the punishment of the city.”"
        },
        {
          "version": "NKJV",
          "text": "When the morning dawned, the angels urged Lot to hurry, saying, “Arise, take your wife and your two daughters who are here, lest you be consumed in the punishment of the city.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "2 Peter 2:7-8",
          "text": "and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Luke 17:28-29",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "Luke 17:32",
          "text": "Remember Lot’s wife!"
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "2 Peter 3:9",
          "text": "The Lord is not slow in keeping His promise as some understand slowness, but is patient with you, not wanting anyone to perish but everyone to come to repentance."
        },
        {
          "reference": "Revelation 18:4",
          "text": "Then I heard another voice from heaven say: “Come out of her, My people, so that you will not share in her sins or contract any of her plagues."
        },
        {
          "reference": "Genesis 18:22-33",
          "text": "And the two men turned away and went toward Sodom, but Abraham remained standing before the LORD. / Abraham stepped forward and said, “Will You really sweep away the righteous with the wicked? / What if there are fifty righteous ones in the city? Will You really sweep it away and not spare the place for the sake of the fifty righteous ones who are there? ..."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Jeremiah 50:40",
          "text": "As God overthrew Sodom and Gomorrah along with their neighbors,” declares the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Zephaniah 2:9",
          "text": "Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.”"
        }
      ]
    },
    {
      "reference": "Genesis 19:16",
      "book": "Genesis",
      "chapter": 19,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "When he hesitated, the men grasped his hand and the hands of his wife and of his two daughters and led them safely out of the city, for the LORD was merciful to them."
        },
        {
          "version": "NLT",
          "text": "When Lot still hesitated, the angels seized his hand and the hands of his wife and two daughters and rushed them to safety outside the city, for the LORD was merciful."
        },
        {
          "version": "ESV",
          "text": "But he lingered. So the men seized him and his wife and his two daughters by the hand, the LORD being merciful to him, and they brought him out and set him outside the city."
        },
        {
          "version": "NKJV",
          "text": "And while he lingered, the men took hold of his hand, his wife’s hand, and the hands of his two daughters, the LORD being merciful to him, and they brought him out and set him outside the city."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "2 Peter 2:7-8",
          "text": "and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Luke 17:28-29",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "2 Peter 2:9",
          "text": "if all this is so, then the Lord knows how to rescue the godly from trials and to hold the unrighteous for punishment on the day of judgment."
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Luke 17:32",
          "text": "Remember Lot’s wife!"
        },
        {
          "reference": "1 Corinthians 10:13",
          "text": "No temptation has seized you except what is common to man. And God is faithful; He will not let you be tempted beyond what you can bear. But when you are tempted, He will also provide an escape, so that you can stand up under it."
        },
        {
          "reference": "Romans 9:29",
          "text": "It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Jeremiah 50:40",
          "text": "As God overthrew Sodom and Gomorrah along with their neighbors,” declares the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Zephaniah 2:9",
          "text": "Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.”"
        }
      ]
    },
    {
      "reference": "Genesis 19:17",
      "book": "Genesis",
      "chapter": 19,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "As soon as they had brought them out, one of them said, &#8220Flee for your lives! Don’t look back, and don’t stop anywhere in the plain! Flee to the mountains or you will be swept away!”"
        },
        {
          "version": "NLT",
          "text": "When they were safely out of the city, one of the angels ordered, “Run for your lives! And don’t look back or stop anywhere in the valley! Escape to the mountains, or you will be swept away!”"
        },
        {
          "version": "ESV",
          "text": "And as they brought them out, one said, “Escape for your life. Do not look back or stop anywhere in the valley. Escape to the hills, lest you be swept away.”"
        },
        {
          "version": "NKJV",
          "text": "So it came to pass, when they had brought them outside, that he said, “Escape for your life! Do not look behind you nor stay anywhere in the plain. Escape to the mountains, lest you be destroyed.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 19:18",
      "book": "Genesis",
      "chapter": 19,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "But Lot said to them, “No, my lords, please!"
        },
        {
          "version": "NLT",
          "text": "“Oh no, my lord!” Lot begged."
        },
        {
          "version": "ESV",
          "text": "And Lot said to them, “Oh, no, my lords."
        },
        {
          "version": "NKJV",
          "text": "Then Lot said to them, “Please, no, my lords!"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:22-33",
          "text": "And the two men turned away and went toward Sodom, but Abraham remained standing before the LORD. / Abraham stepped forward and said, “Will You really sweep away the righteous with the wicked? / What if there are fifty righteous ones in the city? Will You really sweep it away and not spare the place for the sake of the fifty righteous ones who are there? ..."
        },
        {
          "reference": "Genesis 13:8-13",
          "text": "So Abram said to Lot, “Please let there be no contention between you and me, or between your herdsmen and my herdsmen. After all, we are kinsmen. / Is not the whole land before you? Now separate yourself from me. If you go to the left, I will go to the right; if you go to the right, I will go to the left.” / And Lot looked out and saw that the whole plain of the Jordan, all the way to Zoar, was well watered like the garden of the LORD, like the land of Egypt. (This was before the LORD destroyed Sodom and Gomorrah.) ..."
        },
        {
          "reference": "Genesis 14:12",
          "text": "They also carried off Abram’s nephew Lot and his possessions, since Lot was living in Sodom."
        },
        {
          "reference": "Genesis 18:20-21",
          "text": "Then the LORD said, “The outcry against Sodom and Gomorrah is great. Because their sin is so grievous, / I will go down to see if their actions fully justify the outcry that has reached Me. If not, I will find out.”"
        },
        {
          "reference": "Genesis 19:1-3",
          "text": "Now the two angels arrived at Sodom in the evening, and Lot was sitting in the gateway of the city. When Lot saw them, he got up to meet them, bowed facedown, / and said, “My lords, please turn aside into the house of your servant; wash your feet and spend the night. Then you can rise early and go on your way.” “No,” they answered, “we will spend the night in the square.” / But Lot insisted so strongly that they followed him into his house. He prepared a feast for them and baked unleavened bread, and they ate."
        },
        {
          "reference": "Genesis 19:12-13",
          "text": "Then the two men said to Lot, “Do you have anyone else here—a son-in-law, your sons or daughters, or anyone else in the city who belongs to you? Get them out of here, / because we are about to destroy this place. For the outcry to the LORD against its people is so great that He has sent us to destroy it.”"
        },
        {
          "reference": "Genesis 19:24-25",
          "text": "Then the LORD rained down sulfur and fire on Sodom and Gomorrah—from the LORD out of the heavens. / Thus He destroyed these cities and the entire plain, including all the inhabitants of the cities and everything that grew on the ground."
        },
        {
          "reference": "Genesis 19:29",
          "text": "So when God destroyed the cities of the plain, He remembered Abraham, and He brought Lot out of the catastrophe that destroyed the cities where he had lived."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Isaiah 1:9",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah."
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Jeremiah 50:40",
          "text": "As God overthrew Sodom and Gomorrah along with their neighbors,” declares the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Zephaniah 2:9",
          "text": "Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.”"
        }
      ]
    },
    {
      "reference": "Genesis 19:19",
      "book": "Genesis",
      "chapter": 19,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "Your servant has found favor in your eyes, and you have shown great kindness to me in sparing my life. But I can’t flee to the mountains; this disaster will overtake me, and I’ll die."
        },
        {
          "version": "NLT",
          "text": "“You have been so gracious to me and saved my life, and you have shown such great kindness. But I cannot go to the mountains. Disaster would catch up to me there, and I would soon die."
        },
        {
          "version": "ESV",
          "text": "Behold, your servant has found favor in your sight, and you have shown me great kindness in saving my life. But I cannot escape to the hills, lest the disaster overtake me and I die."
        },
        {
          "version": "NKJV",
          "text": "Indeed now, your servant has found favor in your sight, and you have increased your mercy which you have shown me by saving my life; but I cannot escape to the mountains, lest some evil overtake me and I die."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 6:8",
          "text": "Noah, however, found favor in the eyes of the LORD."
        },
        {
          "reference": "Exodus 33:12-17",
          "text": "Then Moses said to the LORD, “Look, You have been telling me, ‘Lead this people up,’ but You have not let me know whom You will send with me. Yet You have said, ‘I know you by name, and you have found favor in My sight.’ / Now if indeed I have found favor in Your sight, please let me know Your ways, that I may know You and find favor in Your sight. Remember that this nation is Your people.” / And the LORD answered, “My Presence will go with you, and I will give you rest.” ..."
        },
        {
          "reference": "Numbers 11:11-15",
          "text": "So Moses asked the LORD, “Why have You brought this trouble on Your servant? Why have I not found favor in Your sight, that You have laid upon me the burden of all these people? / Did I conceive all these people? Did I give them birth, so that You should tell me, ‘Carry them in your bosom, as a nurse carries an infant,’ to the land that You swore to give their fathers? / Where can I get meat for all these people? For they keep crying out to me, ‘Give us meat to eat!’ ..."
        },
        {
          "reference": "Deuteronomy 7:9",
          "text": "Know therefore that the LORD your God is God, the faithful God who keeps His covenant of loving devotion for a thousand generations of those who love Him and keep His commandments."
        },
        {
          "reference": "1 Samuel 20:3",
          "text": "But David again vowed, “Your father knows very well that I have found favor in your eyes, and he has said, ‘Jonathan must not know of this, or he will be grieved.’ As surely as the LORD lives and as you yourself live, there is but a step between me and death.”"
        },
        {
          "reference": "2 Samuel 14:22",
          "text": "Joab fell facedown in homage and blessed the king. “Today,” said Joab, “your servant knows that he has found favor in your eyes, my lord the king, because the king has granted his request.”"
        },
        {
          "reference": "Psalm 84:11",
          "text": "For the LORD God is a sun and a shield; the LORD gives grace and glory; He withholds no good thing from those who walk with integrity."
        },
        {
          "reference": "Psalm 116:1-6",
          "text": "I love the LORD, for He has heard my voice—my appeal for mercy. / Because He has inclined His ear to me, I will call on Him as long as I live. / The ropes of death entangled me; the anguish of Sheol overcame me; I was confronted by trouble and sorrow. ..."
        },
        {
          "reference": "Proverbs 3:3-4",
          "text": "Never let loving devotion or faithfulness leave you; bind them around your neck, write them on the tablet of your heart. / Then you will find favor and high regard in the sight of God and man."
        },
        {
          "reference": "Isaiah 63:7",
          "text": "I will make known the LORD’s loving devotion and His praiseworthy acts, because of all that the LORD has done for us—the many good things for the house of Israel according to His great compassion and loving devotion."
        },
        {
          "reference": "Jeremiah 31:2",
          "text": "This is what the LORD says: “The people who survived the sword found favor in the wilderness when Israel went to find rest.”"
        },
        {
          "reference": "Lamentations 3:22-23",
          "text": "Because of the loving devotion of the LORD we are not consumed, for His mercies never fail. / They are new every morning; great is Your faithfulness!"
        },
        {
          "reference": "Daniel 9:18",
          "text": "Incline Your ear, O my God, and hear; open Your eyes and see the desolation of the city that bears Your name. For we are not presenting our petitions before You because of our righteous acts, but because of Your great compassion."
        },
        {
          "reference": "Luke 1:30",
          "text": "So the angel told her, “Do not be afraid, Mary, for you have found favor with God."
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        }
      ]
    },
    {
      "reference": "Genesis 19:20",
      "book": "Genesis",
      "chapter": 19,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "Look, here is a town near enough to run to, and it is small. Let me flee to it—it is very small, isn’t it? Then my life will be spared.”"
        },
        {
          "version": "NLT",
          "text": "See, there is a small village nearby. Please let me go there instead; don’t you see how small it is? Then my life will be saved.”"
        },
        {
          "version": "ESV",
          "text": "Behold, this city is near enough to flee to, and it is a little one. Let me escape there—is it not a little one?—and my life will be saved!”"
        },
        {
          "version": "NKJV",
          "text": "See now, this city is near enough to flee to, and it is a little one; please let me escape there ( is it not a little one?) and my soul shall live.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 13:10-13",
          "text": "And Lot looked out and saw that the whole plain of the Jordan, all the way to Zoar, was well watered like the garden of the LORD, like the land of Egypt. (This was before the LORD destroyed Sodom and Gomorrah.) / So Lot chose the whole plain of the Jordan for himself and set out toward the east. And Abram and Lot parted company. / Abram lived in the land of Canaan, but Lot settled in the cities of the plain and pitched his tent toward Sodom. ..."
        },
        {
          "reference": "Genesis 18:22-33",
          "text": "And the two men turned away and went toward Sodom, but Abraham remained standing before the LORD. / Abraham stepped forward and said, “Will You really sweep away the righteous with the wicked? / What if there are fifty righteous ones in the city? Will You really sweep it away and not spare the place for the sake of the fifty righteous ones who are there? ..."
        },
        {
          "reference": "Genesis 14:2",
          "text": "went to war against Bera king of Sodom, Birsha king of Gomorrah, Shinab king of Admah, Shemeber king of Zeboiim, and the king of Bela (that is, Zoar)."
        },
        {
          "reference": "Genesis 14:8",
          "text": "Then the king of Sodom, the king of Gomorrah, the king of Admah, the king of Zeboiim, and the king of Bela (that is, Zoar) marched out and arrayed themselves for battle in the Valley of Siddim"
        },
        {
          "reference": "Genesis 14:10",
          "text": "Now the Valley of Siddim was full of tar pits, and as the kings of Sodom and Gomorrah fled, some men fell into the pits, but the survivors fled to the hill country."
        },
        {
          "reference": "Genesis 14:12",
          "text": "They also carried off Abram’s nephew Lot and his possessions, since Lot was living in Sodom."
        },
        {
          "reference": "Genesis 14:16",
          "text": "He retrieved all the goods, as well as his relative Lot and his possessions, together with the women and the rest of the people."
        },
        {
          "reference": "Genesis 14:17",
          "text": "After Abram returned from defeating Chedorlaomer and the kings allied with him, the king of Sodom went out to meet him in the Valley of Shaveh (that is, the King’s Valley)."
        },
        {
          "reference": "Genesis 14:21-23",
          "text": "The king of Sodom said to Abram, “Give me the people, but take the goods for yourself.” / But Abram replied to the king of Sodom, “I have raised my hand to the LORD God Most High, Creator of heaven and earth, / that I will not accept even a thread, or a strap of a sandal, or anything that belongs to you, lest you should say, ‘I have made Abram rich.’"
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Isaiah 1:9",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah."
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Jeremiah 49:18",
          "text": "As Sodom and Gomorrah were overthrown along with their neighbors,” says the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Jeremiah 50:40",
          "text": "As God overthrew Sodom and Gomorrah along with their neighbors,” declares the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        }
      ]
    },
    {
      "reference": "Genesis 19:21",
      "book": "Genesis",
      "chapter": 19,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "He said to him, “Very well, I will grant this request too; I will not overthrow the town you speak of."
        },
        {
          "version": "NLT",
          "text": "“All right,” the angel said, “I will grant your request. I will not destroy the little village."
        },
        {
          "version": "ESV",
          "text": "He said to him, “Behold, I grant you this favor also, that I will not overthrow the city of which you have spoken."
        },
        {
          "version": "NKJV",
          "text": "And he said to him, “See, I have favored you concerning this thing also, in that I will not overthrow this city for which you have spoken."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 19:22",
      "book": "Genesis",
      "chapter": 19,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "But flee there quickly, because I cannot do anything until you reach it.” (That is why the town was called Zoar.)"
        },
        {
          "version": "NLT",
          "text": "But hurry! Escape to it, for I can do nothing until you arrive there.” (This explains why that village was known as Zoar, which means “little place.”)"
        },
        {
          "version": "ESV",
          "text": "Escape there quickly, for I can do nothing till you arrive there.” Therefore the name of the city was called Zoar."
        },
        {
          "version": "NKJV",
          "text": "Hurry, escape there. For I cannot do anything until you arrive there.” Therefore the name of the city was called Zoar."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:32",
          "text": "Finally, Abraham said, “May the Lord not be angry, but let me speak once more. Suppose ten are found there?” And He answered, “On account of the ten, I will not destroy it.”"
        },
        {
          "reference": "Genesis 6:8",
          "text": "Noah, however, found favor in the eyes of the LORD."
        },
        {
          "reference": "Exodus 32:14",
          "text": "So the LORD relented from the calamity He had threatened to bring on His people."
        },
        {
          "reference": "Numbers 16:45-48",
          "text": "“Get away from this congregation so that I may consume them in an instant.” And Moses and Aaron fell facedown. / Moses said to Aaron, “Take your censer, place fire from the altar in it, and add incense. Go quickly to the congregation and make atonement for them, because wrath has come out from the LORD; the plague has begun.” / So Aaron took the censer as Moses had ordered and ran into the midst of the assembly. And seeing that the plague had begun among the people, he offered the incense and made atonement for the people. ..."
        },
        {
          "reference": "Isaiah 55:6-7",
          "text": "Seek the LORD while He may be found; call on Him while He is near. / Let the wicked man forsake his way and the unrighteous man his thoughts; let him return to the LORD, that He may have compassion, and to our God, for He will freely pardon."
        },
        {
          "reference": "Jeremiah 5:1",
          "text": "“Go up and down the streets of Jerusalem. Look now and take note; search her squares. If you can find a single person, anyone who acts justly, anyone who seeks the truth, then I will forgive the city."
        },
        {
          "reference": "Ezekiel 22:30",
          "text": "I searched for a man among them to repair the wall and stand in the gap before Me on behalf of the land, so that I should not destroy it. But I found no one."
        },
        {
          "reference": "Amos 7:3",
          "text": "So the LORD relented from this plan. “It will not happen,” He said."
        },
        {
          "reference": "Jonah 3:10",
          "text": "When God saw their actions—that they had turned from their evil ways—He relented from the disaster He had threatened to bring upon them."
        },
        {
          "reference": "Matthew 24:22",
          "text": "If those days had not been cut short, nobody would be saved. But for the sake of the elect, those days will be cut short."
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Luke 18:7-8",
          "text": "Will not God bring about justice for His elect who cry out to Him day and night? Will He delay in helping them? / I tell you, He will promptly carry out justice on their behalf. Nevertheless, when the Son of Man comes, will He find faith on earth?”"
        },
        {
          "reference": "John 17:15",
          "text": "I am not asking that You take them out of the world, but that You keep them from the evil one."
        },
        {
          "reference": "Acts 27:24",
          "text": "and said, ‘Do not be afraid, Paul; you must stand before Caesar. And look, God has granted you the lives of all who sail with you.’"
        },
        {
          "reference": "Romans 9:29",
          "text": "It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        }
      ]
    },
    {
      "reference": "Genesis 19:23",
      "book": "Genesis",
      "chapter": 19,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "By the time Lot reached Zoar, the sun had risen over the land."
        },
        {
          "version": "NLT",
          "text": "Lot reached the village just as the sun was rising over the horizon."
        },
        {
          "version": "ESV",
          "text": "The sun had risen on the earth when Lot came to Zoar."
        },
        {
          "version": "NKJV",
          "text": "The sun had risen upon the earth when Lot entered Zoar."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "2 Peter 2:6-9",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)— ..."
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Jeremiah 50:40",
          "text": "As God overthrew Sodom and Gomorrah along with their neighbors,” declares the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Zephaniah 2:9",
          "text": "Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.”"
        },
        {
          "reference": "Revelation 11:8",
          "text": "Their bodies will lie in the street of the great city—figuratively called Sodom and Egypt—where their Lord was also crucified."
        },
        {
          "reference": "Revelation 18:8-10",
          "text": "Therefore her plagues will come in one day—death and grief and famine—and she will be consumed by fire, for mighty is the Lord God who judges her.” / Then the kings of the earth who committed sexual immorality and lived in luxury with her will weep and wail at the sight of the smoke rising from the fire that consumes her. / In fear of her torment, they will stand at a distance and cry out: “Woe, woe to the great city, the mighty city of Babylon! For in a single hour your judgment has come.”"
        },
        {
          "reference": "2 Thessalonians 1:7-9",
          "text": "and to grant relief to you who are oppressed and to us as well. This will take place when the Lord Jesus is revealed from heaven with His mighty angels / in blazing fire, inflicting vengeance on those who do not know God and do not obey the gospel of our Lord Jesus. / They will suffer the penalty of eternal destruction, separated from the presence of the Lord and the glory of His might,"
        },
        {
          "reference": "Romans 9:29",
          "text": "It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        },
        {
          "reference": "Isaiah 1:9",
          "text": "Unless the LORD of Hosts had left us a few survivors, we would have become like Sodom, we would have resembled Gomorrah."
        }
      ]
    },
    {
      "reference": "Genesis 19:24",
      "book": "Genesis",
      "chapter": 19,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the LORD rained down burning sulfur on Sodom and Gomorrah—from the LORD out of the heavens."
        },
        {
          "version": "NLT",
          "text": "Then the LORD rained down fire and burning sulfur from the sky on Sodom and Gomorrah."
        },
        {
          "version": "ESV",
          "text": "Then the LORD rained on Sodom and Gomorrah sulfur and fire from the LORD out of heaven."
        },
        {
          "version": "NKJV",
          "text": "Then the LORD rained brimstone and fire on Sodom and Gomorrah, from the LORD out of the heavens."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 17:29",
          "text": "But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all."
        },
        {
          "reference": "2 Peter 2:6",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly;"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Matthew 10:15",
          "text": "Truly I tell you, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Jeremiah 50:40",
          "text": "As God overthrew Sodom and Gomorrah along with their neighbors,” declares the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Zephaniah 2:9",
          "text": "Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.”"
        },
        {
          "reference": "Lamentations 4:6",
          "text": "The punishment of the daughter of my people is greater than that of Sodom, which was overthrown in an instant without a hand turned to help her."
        },
        {
          "reference": "Revelation 11:8",
          "text": "Their bodies will lie in the street of the great city—figuratively called Sodom and Egypt—where their Lord was also crucified."
        },
        {
          "reference": "Revelation 14:10",
          "text": "he too will drink the wine of God’s anger, poured undiluted into the cup of His wrath. And he will be tormented in fire and sulfur in the presence of the holy angels and of the Lamb."
        },
        {
          "reference": "Revelation 19:20",
          "text": "But the beast was captured along with the false prophet, who on its behalf had performed signs deceiving those who had the mark of the beast and worshiped its image. Both the beast and the false prophet were thrown alive into the fiery lake of burning sulfur."
        }
      ]
    },
    {
      "reference": "Genesis 19:25",
      "book": "Genesis",
      "chapter": 19,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "Thus he overthrew those cities and the entire plain, destroying all those living in the cities—and also the vegetation in the land."
        },
        {
          "version": "NLT",
          "text": "He utterly destroyed them, along with the other cities and villages of the plain, wiping out all the people and every bit of vegetation."
        },
        {
          "version": "ESV",
          "text": "And he overthrew those cities, and all the valley, and all the inhabitants of the cities, and what grew on the ground."
        },
        {
          "version": "NKJV",
          "text": "So He overthrew those cities, all the plain, all the inhabitants of the cities, and what grew on the ground."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 17:29-30",
          "text": "But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "2 Peter 2:6",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly;"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Jeremiah 50:40",
          "text": "As God overthrew Sodom and Gomorrah along with their neighbors,” declares the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Zephaniah 2:9",
          "text": "Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.”"
        },
        {
          "reference": "Lamentations 4:6",
          "text": "The punishment of the daughter of my people is greater than that of Sodom, which was overthrown in an instant without a hand turned to help her."
        },
        {
          "reference": "Hosea 11:8",
          "text": "How could I give you up, O Ephraim? How could I surrender you, O Israel? How could I make you like Admah? How could I treat you like Zeboiim? My heart is turned within Me; My compassion is stirred!"
        },
        {
          "reference": "Revelation 11:8",
          "text": "Their bodies will lie in the street of the great city—figuratively called Sodom and Egypt—where their Lord was also crucified."
        },
        {
          "reference": "Romans 9:29",
          "text": "It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        },
        {
          "reference": "2 Peter 3:7",
          "text": "And by that same word, the present heavens and earth are reserved for fire, being kept for the day of judgment and destruction of ungodly men."
        }
      ]
    },
    {
      "reference": "Genesis 19:26",
      "book": "Genesis",
      "chapter": 19,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "But Lot’s wife looked back, and she became a pillar of salt."
        },
        {
          "version": "NLT",
          "text": "But Lot’s wife looked back as she was following behind him, and she turned into a pillar of salt."
        },
        {
          "version": "ESV",
          "text": "But Lot’s wife, behind him, looked back, and she became a pillar of salt."
        },
        {
          "version": "NKJV",
          "text": "But his wife looked back behind him, and she became a pillar of salt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 17:32",
          "text": "Remember Lot’s wife!"
        },
        {
          "reference": "Matthew 24:16-18",
          "text": "then let those who are in Judea flee to the mountains. / Let no one on the housetop come down to retrieve anything from his house. / And let no one in the field return for his cloak."
        },
        {
          "reference": "Hebrews 10:38-39",
          "text": "But My righteous one will live by faith; and if he shrinks back, I will take no pleasure in him.” / But we are not of those who shrink back and are destroyed, but of those who have faith and preserve their souls."
        },
        {
          "reference": "Philippians 3:13-14",
          "text": "Brothers, I do not consider myself yet to have taken hold of it. But one thing I do: Forgetting what is behind and straining toward what is ahead, / I press on toward the goal to win the prize of God’s heavenly calling in Christ Jesus."
        },
        {
          "reference": "2 Peter 2:6-9",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)— ..."
        },
        {
          "reference": "Luke 9:62",
          "text": "Then Jesus declared, “No one who puts his hand to the plow and then looks back is fit for the kingdom of God.”"
        },
        {
          "reference": "Mark 13:15-16",
          "text": "Let no one on the housetop go back inside to retrieve anything from his house. / And let no one in the field return for his cloak."
        },
        {
          "reference": "1 Corinthians 10:11",
          "text": "Now these things happened to them as examples and were written down as warnings for us, on whom the fulfillment of the ages has come."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "Isaiah 3:9",
          "text": "The expression on their faces testifies against them, and like Sodom they flaunt their sin; they do not conceal it. Woe to them, for they have brought disaster upon themselves."
        },
        {
          "reference": "Ezekiel 18:24",
          "text": "But if a righteous man turns from his righteousness and practices iniquity, committing the same abominations as the wicked, will he live? None of the righteous acts he did will be remembered. Because of the unfaithfulness and sin he has committed, he will die."
        },
        {
          "reference": "Jeremiah 7:24",
          "text": "Yet they did not listen or incline their ear, but they followed the stubborn inclinations of their own evil hearts. They went backward and not forward."
        },
        {
          "reference": "Numbers 16:26",
          "text": "And he warned the congregation, “Move away now from the tents of these wicked men. Do not touch anything that belongs to them, or you will be swept away because of all their sins.”"
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        }
      ]
    },
    {
      "reference": "Genesis 19:27",
      "book": "Genesis",
      "chapter": 19,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "Early the next morning Abraham got up and returned to the place where he had stood before the LORD."
        },
        {
          "version": "NLT",
          "text": "Abraham got up early that morning and hurried out to the place where he had stood in the LORD’s presence."
        },
        {
          "version": "ESV",
          "text": "And Abraham went early in the morning to the place where he had stood before the LORD."
        },
        {
          "version": "NKJV",
          "text": "And Abraham went early in the morning to the place where he had stood before the LORD."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:22-23",
          "text": "And the two men turned away and went toward Sodom, but Abraham remained standing before the LORD. / Abraham stepped forward and said, “Will You really sweep away the righteous with the wicked?"
        },
        {
          "reference": "Genesis 18:16",
          "text": "When the men got up to leave, they looked out over Sodom, and Abraham walked along with them to see them off."
        },
        {
          "reference": "Genesis 18:33",
          "text": "When the LORD had finished speaking with Abraham, He departed, and Abraham returned home."
        },
        {
          "reference": "Genesis 13:14",
          "text": "After Lot had departed, the LORD said to Abram, “Now lift up your eyes from the place where you are, and look to the north and south and east and west,"
        },
        {
          "reference": "Genesis 22:3",
          "text": "So Abraham got up early the next morning, saddled his donkey, and took along two of his servants and his son Isaac. He split the wood for a burnt offering and set out for the place God had designated."
        },
        {
          "reference": "Genesis 28:18",
          "text": "Early the next morning, Jacob took the stone that he had placed under his head, and he set it up as a pillar. He poured oil on top of it,"
        },
        {
          "reference": "Genesis 12:8",
          "text": "From there Abram moved on to the hill country east of Bethel and pitched his tent, with Bethel to the west and Ai to the east. There he built an altar to the LORD, and he called on the name of the LORD."
        },
        {
          "reference": "Genesis 21:14",
          "text": "Early in the morning, Abraham got up, took bread and a skin of water, put them on Hagar’s shoulders, and sent her away with the boy. She left and wandered in the Wilderness of Beersheba."
        },
        {
          "reference": "Genesis 24:63",
          "text": "Early in the evening, Isaac went out to the field to meditate, and looking up, he saw the camels approaching."
        },
        {
          "reference": "Genesis 26:25",
          "text": "So Isaac built an altar there and called on the name of the LORD, and he pitched his tent there. His servants also dug a well there."
        },
        {
          "reference": "Exodus 34:2",
          "text": "Be ready in the morning, and come up on Mount Sinai to present yourself before Me on the mountaintop."
        },
        {
          "reference": "Psalm 5:3",
          "text": "In the morning, O LORD, You hear my voice; at daybreak I lay my plea before You and wait in expectation."
        },
        {
          "reference": "Psalm 119:147",
          "text": "I rise before dawn and cry for help; in Your word I have put my hope."
        },
        {
          "reference": "Psalm 130:6",
          "text": "My soul waits for the Lord more than watchmen wait for the morning—more than watchmen wait for the morning."
        },
        {
          "reference": "Mark 1:35",
          "text": "Early in the morning, while it was still dark, Jesus got up and went out to a solitary place to pray."
        }
      ]
    },
    {
      "reference": "Genesis 19:28",
      "book": "Genesis",
      "chapter": 19,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "He looked down toward Sodom and Gomorrah, toward all the land of the plain, and he saw dense smoke rising from the land, like smoke from a furnace."
        },
        {
          "version": "NLT",
          "text": "He looked out across the plain toward Sodom and Gomorrah and watched as columns of smoke rose from the cities like smoke from a furnace."
        },
        {
          "version": "ESV",
          "text": "And he looked down toward Sodom and Gomorrah and toward all the land of the valley, and he looked and, behold, the smoke of the land went up like the smoke of a furnace."
        },
        {
          "version": "NKJV",
          "text": "Then he looked toward Sodom and Gomorrah, and toward all the land of the plain; and he saw, and behold, the smoke of the land which went up like the smoke of a furnace."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 17:29-30",
          "text": "But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "2 Peter 2:6",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly;"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Revelation 18:9-10",
          "text": "Then the kings of the earth who committed sexual immorality and lived in luxury with her will weep and wail at the sight of the smoke rising from the fire that consumes her. / In fear of her torment, they will stand at a distance and cry out: “Woe, woe to the great city, the mighty city of Babylon! For in a single hour your judgment has come.”"
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Jeremiah 50:40",
          "text": "As God overthrew Sodom and Gomorrah along with their neighbors,” declares the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Amos 4:11",
          "text": "“Some of you I overthrew as I overthrew Sodom and Gomorrah, and you were like a firebrand snatched from a blaze, yet you did not return to Me,” declares the LORD."
        },
        {
          "reference": "Zephaniah 2:9",
          "text": "Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.”"
        },
        {
          "reference": "Lamentations 4:6",
          "text": "The punishment of the daughter of my people is greater than that of Sodom, which was overthrown in an instant without a hand turned to help her."
        },
        {
          "reference": "Isaiah 34:9-10",
          "text": "Edom’s streams will be turned to tar, and her soil to sulfur; her land will become a blazing pitch. / It will not be quenched—day or night. Its smoke will ascend forever. From generation to generation it will lie desolate; no one will ever again pass through it."
        },
        {
          "reference": "Revelation 14:10-11",
          "text": "he too will drink the wine of God’s anger, poured undiluted into the cup of His wrath. And he will be tormented in fire and sulfur in the presence of the holy angels and of the Lamb. / And the smoke of their torment rises forever and ever. Day and night there is no rest for those who worship the beast and its image, or for anyone who receives the mark of its name.”"
        },
        {
          "reference": "2 Thessalonians 1:7-9",
          "text": "and to grant relief to you who are oppressed and to us as well. This will take place when the Lord Jesus is revealed from heaven with His mighty angels / in blazing fire, inflicting vengeance on those who do not know God and do not obey the gospel of our Lord Jesus. / They will suffer the penalty of eternal destruction, separated from the presence of the Lord and the glory of His might,"
        }
      ]
    },
    {
      "reference": "Genesis 19:29",
      "book": "Genesis",
      "chapter": 19,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "So when God destroyed the cities of the plain, he remembered Abraham, and he brought Lot out of the catastrophe that overthrew the cities where Lot had lived."
        },
        {
          "version": "NLT",
          "text": "But God had listened to Abraham’s request and kept Lot safe, removing him from the disaster that engulfed the cities on the plain."
        },
        {
          "version": "ESV",
          "text": "So it was that, when God destroyed the cities of the valley, God remembered Abraham and sent Lot out of the midst of the overthrow when he overthrew the cities in which Lot had lived."
        },
        {
          "version": "NKJV",
          "text": "And it came to pass, when God destroyed the cities of the plain, that God remembered Abraham, and sent Lot out of the midst of the overthrow, when He overthrew the cities in which Lot had dwelt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:23-33",
          "text": "Abraham stepped forward and said, “Will You really sweep away the righteous with the wicked? / What if there are fifty righteous ones in the city? Will You really sweep it away and not spare the place for the sake of the fifty righteous ones who are there? / Far be it from You to do such a thing—to kill the righteous with the wicked, so that the righteous and the wicked are treated alike. Far be it from You! Will not the Judge of all the earth do what is right?” ..."
        },
        {
          "reference": "2 Peter 2:6-9",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)— ..."
        },
        {
          "reference": "Luke 17:28-30",
          "text": "It was the same in the days of Lot: People were eating and drinking, buying and selling, planting and building. / But on the day Lot left Sodom, fire and sulfur rained down from heaven and destroyed them all. / It will be just like that on the day the Son of Man is revealed."
        },
        {
          "reference": "Genesis 13:13",
          "text": "But the men of Sodom were wicked, sinning greatly against the LORD."
        },
        {
          "reference": "Genesis 18:20-21",
          "text": "Then the LORD said, “The outcry against Sodom and Gomorrah is great. Because their sin is so grievous, / I will go down to see if their actions fully justify the outcry that has reached Me. If not, I will find out.”"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Romans 9:29",
          "text": "It is just as Isaiah foretold: “Unless the Lord of Hosts had left us descendants, we would have become like Sodom, we would have resembled Gomorrah.”"
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Deuteronomy 29:23",
          "text": "All its soil will be a burning waste of sulfur and salt, unsown and unproductive, with no plant growing on it, just like the destruction of Sodom and Gomorrah, Admah and Zeboiim, which the LORD overthrew in His fierce anger."
        },
        {
          "reference": "Matthew 11:23-24",
          "text": "And you, Capernaum, will you be lifted up to heaven? No, you will be brought down to Hades! For if the miracles that were performed in you had been performed in Sodom, it would have remained to this day. / But I tell you that it will be more bearable for Sodom on the day of judgment than for you.”"
        },
        {
          "reference": "Genesis 6:8",
          "text": "Noah, however, found favor in the eyes of the LORD."
        },
        {
          "reference": "Genesis 8:1",
          "text": "But God remembered Noah and all the animals and livestock that were with him in the ark. And God sent a wind over the earth, and the waters began to subside."
        },
        {
          "reference": "Exodus 2:24-25",
          "text": "So God heard their groaning, and He remembered His covenant with Abraham, Isaac, and Jacob. / God saw the Israelites and took notice."
        },
        {
          "reference": "Psalm 106:4",
          "text": "Remember me, O LORD, in Your favor to Your people; visit me with Your salvation,"
        }
      ]
    },
    {
      "reference": "Genesis 19:30",
      "book": "Genesis",
      "chapter": 19,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "Lot and his two daughters left Zoar and settled in the mountains, for he was afraid to stay in Zoar. He and his two daughters lived in a cave."
        },
        {
          "version": "NLT",
          "text": "Afterward Lot left Zoar because he was afraid of the people there, and he went to live in a cave in the mountains with his two daughters."
        },
        {
          "version": "ESV",
          "text": "Now Lot went up out of Zoar and lived in the hills with his two daughters, for he was afraid to live in Zoar. So he lived in a cave with his two daughters."
        },
        {
          "version": "NKJV",
          "text": "Then Lot went up out of Zoar and dwelt in the mountains, and his two daughters were with him; for he was afraid to dwell in Zoar. And he and his two daughters dwelt in a cave."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 13:10-13",
          "text": "And Lot looked out and saw that the whole plain of the Jordan, all the way to Zoar, was well watered like the garden of the LORD, like the land of Egypt. (This was before the LORD destroyed Sodom and Gomorrah.) / So Lot chose the whole plain of the Jordan for himself and set out toward the east. And Abram and Lot parted company. / Abram lived in the land of Canaan, but Lot settled in the cities of the plain and pitched his tent toward Sodom. ..."
        },
        {
          "reference": "Genesis 13:18",
          "text": "So Abram moved his tent and went to live near the Oaks of Mamre at Hebron, where he built an altar to the LORD."
        },
        {
          "reference": "Genesis 14:12",
          "text": "They also carried off Abram’s nephew Lot and his possessions, since Lot was living in Sodom."
        },
        {
          "reference": "Genesis 14:16",
          "text": "He retrieved all the goods, as well as his relative Lot and his possessions, together with the women and the rest of the people."
        },
        {
          "reference": "Genesis 18:20-21",
          "text": "Then the LORD said, “The outcry against Sodom and Gomorrah is great. Because their sin is so grievous, / I will go down to see if their actions fully justify the outcry that has reached Me. If not, I will find out.”"
        },
        {
          "reference": "Genesis 19:17",
          "text": "As soon as the men had brought them out, one of them said, “Run for your lives! Do not look back, and do not stop anywhere on the plain! Flee to the mountains, or you will be swept away!”"
        },
        {
          "reference": "Genesis 19:26",
          "text": "But Lot’s wife looked back, and she became a pillar of salt."
        },
        {
          "reference": "Genesis 19:29",
          "text": "So when God destroyed the cities of the plain, He remembered Abraham, and He brought Lot out of the catastrophe that destroyed the cities where he had lived."
        },
        {
          "reference": "Deuteronomy 2:9",
          "text": "Then the LORD said to me, “Do not harass the Moabites or provoke them to war, for I will not give you any of their land, because I have given Ar to the descendants of Lot as their possession.”"
        },
        {
          "reference": "Deuteronomy 2:19",
          "text": "But when you get close to the Ammonites, do not harass them or provoke them, for I will not give you any of the land of the Ammonites. I have given it to the descendants of Lot as their possession.”"
        },
        {
          "reference": "Psalm 107:34",
          "text": "and fruitful land into fields of salt, because of the wickedness of its dwellers."
        },
        {
          "reference": "Isaiah 13:19",
          "text": "And Babylon, the jewel of the kingdoms, the glory of the pride of the Chaldeans, will be overthrown by God like Sodom and Gomorrah."
        },
        {
          "reference": "Jeremiah 49:18",
          "text": "As Sodom and Gomorrah were overthrown along with their neighbors,” says the LORD, “no one will dwell there; no man will abide there."
        },
        {
          "reference": "Lamentations 4:6",
          "text": "The punishment of the daughter of my people is greater than that of Sodom, which was overthrown in an instant without a hand turned to help her."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        }
      ]
    },
    {
      "reference": "Genesis 19:31",
      "book": "Genesis",
      "chapter": 19,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "One day the older daughter said to the younger, “Our father is old, and there is no man around here to give us children—as is the custom all over the earth."
        },
        {
          "version": "NLT",
          "text": "One day the older daughter said to her sister, “There are no men left anywhere in this entire area, so we can’t get married like everyone else. And our father will soon be too old to have children."
        },
        {
          "version": "ESV",
          "text": "And the firstborn said to the younger, “Our father is old, and there is not a man on earth to come in to us after the manner of all the earth."
        },
        {
          "version": "NKJV",
          "text": "Now the firstborn said to the younger, “Our father is old, and there is no man on the earth to come in to us as is the custom of all the earth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Leviticus 18:6-7",
          "text": "None of you are to approach any close relative to have sexual relations. I am the LORD. / You must not expose the nakedness of your father by having sexual relations with your mother. She is your mother; you must not have sexual relations with her."
        },
        {
          "reference": "Leviticus 20:12",
          "text": "If a man lies with his daughter-in-law, both must surely be put to death. They have acted perversely; their blood is upon them."
        },
        {
          "reference": "Deuteronomy 27:22",
          "text": "‘Cursed is he who sleeps with his sister, the daughter of his father or the daughter of his mother.’ And let all the people say, ‘Amen!’"
        },
        {
          "reference": "2 Samuel 13:11-14",
          "text": "And when she had brought them to him to eat, he took hold of her and said, “Come lie with me, my sister!” / “No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” ..."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Judges 19:24",
          "text": "Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.”"
        },
        {
          "reference": "1 Corinthians 5:1",
          "text": "It is actually reported that there is sexual immorality among you, and of a kind that is intolerable even among pagans: A man has his father’s wife."
        },
        {
          "reference": "Romans 1:26-27",
          "text": "For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. / Likewise, the men abandoned natural relations with women and burned with lust for one another. Men committed indecent acts with other men and received in themselves the due penalty for their error."
        },
        {
          "reference": "1 Corinthians 6:18",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body."
        },
        {
          "reference": "Ephesians 5:3",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "Matthew 5:28",
          "text": "But I tell you that anyone who looks at a woman to lust after her has already committed adultery with her in his heart."
        },
        {
          "reference": "Mark 7:21-23",
          "text": "For from within the hearts of men come evil thoughts, sexual immorality, theft, murder, adultery, / greed, wickedness, deceit, debauchery, envy, slander, arrogance, and foolishness. / All these evils come from within, and these are what defile a man.”"
        },
        {
          "reference": "Galatians 5:19",
          "text": "The acts of the flesh are obvious: sexual immorality, impurity, and debauchery;"
        },
        {
          "reference": "Colossians 3:5",
          "text": "Put to death, therefore, the components of your earthly nature: sexual immorality, impurity, lust, evil desires, and greed, which is idolatry."
        }
      ]
    },
    {
      "reference": "Genesis 19:32",
      "book": "Genesis",
      "chapter": 19,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "Let’s get our father to drink wine and then sleep with him and preserve our family line through our father.”"
        },
        {
          "version": "NLT",
          "text": "Come, let’s get him drunk with wine, and then we will have sex with him. That way we will preserve our family line through our father.”"
        },
        {
          "version": "ESV",
          "text": "Come, let us make our father drink wine, and we will lie with him, that we may preserve offspring from our father.”"
        },
        {
          "version": "NKJV",
          "text": "Come, let us make our father drink wine, and we will lie with him, that we may preserve the lineage of our father.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Leviticus 18:6-7",
          "text": "None of you are to approach any close relative to have sexual relations. I am the LORD. / You must not expose the nakedness of your father by having sexual relations with your mother. She is your mother; you must not have sexual relations with her."
        },
        {
          "reference": "Leviticus 18:17",
          "text": "You must not have sexual relations with both a woman and her daughter. You are not to marry her son’s daughter or her daughter’s daughter and have sexual relations with her. They are close relatives; it is depraved."
        },
        {
          "reference": "Deuteronomy 27:22",
          "text": "‘Cursed is he who sleeps with his sister, the daughter of his father or the daughter of his mother.’ And let all the people say, ‘Amen!’"
        },
        {
          "reference": "2 Samuel 13:11-14",
          "text": "And when she had brought them to him to eat, he took hold of her and said, “Come lie with me, my sister!” / “No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” ..."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Judges 19:24",
          "text": "Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.”"
        },
        {
          "reference": "2 Peter 2:6-8",
          "text": "if He condemned the cities of Sodom and Gomorrah to destruction, reducing them to ashes as an example of what is coming on the ungodly; / and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        },
        {
          "reference": "Romans 1:26-27",
          "text": "For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. / Likewise, the men abandoned natural relations with women and burned with lust for one another. Men committed indecent acts with other men and received in themselves the due penalty for their error."
        },
        {
          "reference": "1 Corinthians 5:1",
          "text": "It is actually reported that there is sexual immorality among you, and of a kind that is intolerable even among pagans: A man has his father’s wife."
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "Ephesians 5:3-5",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed. / Nor should there be obscenity, foolish talk, or crude joking, which are out of character, but rather thanksgiving. / For of this you can be sure: No immoral, impure, or greedy person (that is, an idolater) has any inheritance in the kingdom of Christ and of God."
        },
        {
          "reference": "Galatians 5:19-21",
          "text": "The acts of the flesh are obvious: sexual immorality, impurity, and debauchery; / idolatry and sorcery; hatred, discord, jealousy, and rage; rivalries, divisions, factions, / and envy; drunkenness, orgies, and the like. I warn you, as I did before, that those who practice such things will not inherit the kingdom of God."
        },
        {
          "reference": "Colossians 3:5-6",
          "text": "Put to death, therefore, the components of your earthly nature: sexual immorality, impurity, lust, evil desires, and greed, which is idolatry. / Because of these, the wrath of God is coming on the sons of disobedience."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        }
      ]
    },
    {
      "reference": "Genesis 19:33",
      "book": "Genesis",
      "chapter": 19,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "That night they got their father to drink wine, and the older daughter went in and slept with him. He was not aware of it when she lay down or when she got up."
        },
        {
          "version": "NLT",
          "text": "So that night they got him drunk with wine, and the older daughter went in and had intercourse with her father. He was unaware of her lying down or getting up again."
        },
        {
          "version": "ESV",
          "text": "So they made their father drink wine that night. And the firstborn went in and lay with her father. He did not know when she lay down or when she arose."
        },
        {
          "version": "NKJV",
          "text": "So they made their father drink wine that night. And the firstborn went in and lay with her father, and he did not know when she lay down or when she arose."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 9:21",
          "text": "But when he drank some of its wine, he became drunk and uncovered himself inside his tent."
        },
        {
          "reference": "Proverbs 20:1",
          "text": "Wine is a mocker, strong drink is a brawler, and whoever is led astray by them is not wise."
        },
        {
          "reference": "Ephesians 5:18",
          "text": "Do not get drunk on wine, which leads to reckless indiscretion. Instead, be filled with the Spirit."
        },
        {
          "reference": "Habakkuk 2:15",
          "text": "Woe to him who gives drink to his neighbors, pouring it from the wineskin until they are drunk, in order to gaze at their nakedness!"
        },
        {
          "reference": "Leviticus 18:6-7",
          "text": "None of you are to approach any close relative to have sexual relations. I am the LORD. / You must not expose the nakedness of your father by having sexual relations with your mother. She is your mother; you must not have sexual relations with her."
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "Romans 13:13",
          "text": "Let us behave decently, as in the daytime, not in carousing and drunkenness, not in sexual immorality and debauchery, not in dissension and jealousy."
        },
        {
          "reference": "Galatians 5:19-21",
          "text": "The acts of the flesh are obvious: sexual immorality, impurity, and debauchery; / idolatry and sorcery; hatred, discord, jealousy, and rage; rivalries, divisions, factions, / and envy; drunkenness, orgies, and the like. I warn you, as I did before, that those who practice such things will not inherit the kingdom of God."
        },
        {
          "reference": "Isaiah 5:11",
          "text": "Woe to those who rise early in the morning in pursuit of strong drink, who linger into the evening, to be inflamed by wine."
        },
        {
          "reference": "1 Thessalonians 5:7",
          "text": "For those who sleep, sleep at night, and those who get drunk, get drunk at night."
        },
        {
          "reference": "1 Peter 4:3",
          "text": "For you have spent enough time in the past carrying out the same desires as the Gentiles: living in debauchery, lust, drunkenness, orgies, carousing, and detestable idolatry."
        },
        {
          "reference": "Luke 21:34",
          "text": "But watch yourselves, or your hearts will be weighed down by dissipation, drunkenness, and the worries of life—and that day will spring upon you suddenly like a snare."
        },
        {
          "reference": "1 Corinthians 5:1",
          "text": "It is actually reported that there is sexual immorality among you, and of a kind that is intolerable even among pagans: A man has his father’s wife."
        },
        {
          "reference": "Proverbs 23:29-35",
          "text": "Who has woe? Who has sorrow? Who has contentions? Who has complaints? Who has needless wounds? Who has bloodshot eyes? / Those who linger over wine, who go to taste mixed drinks. / Do not gaze at wine while it is red, when it sparkles in the cup and goes down smoothly. ..."
        },
        {
          "reference": "2 Peter 2:7-8",
          "text": "and if He rescued Lot, a righteous man distressed by the depraved conduct of the lawless / (for that righteous man, living among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—"
        }
      ]
    },
    {
      "reference": "Genesis 19:34",
      "book": "Genesis",
      "chapter": 19,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "The next day the older daughter said to the younger, “Last night I slept with my father. Let’s get him to drink wine again tonight, and you go in and sleep with him so we can preserve our family line through our father.”"
        },
        {
          "version": "NLT",
          "text": "The next morning the older daughter said to her younger sister, “I had sex with our father last night. Let’s get him drunk with wine again tonight, and you go in and have sex with him. That way we will preserve our family line through our father.”"
        },
        {
          "version": "ESV",
          "text": "The next day, the firstborn said to the younger, “Behold, I lay last night with my father. Let us make him drink wine tonight also. Then you go in and lie with him, that we may preserve offspring from our father.”"
        },
        {
          "version": "NKJV",
          "text": "It happened on the next day that the firstborn said to the younger, “Indeed I lay with my father last night; let us make him drink wine tonight also, and you go in and lie with him, that we may preserve the lineage of our father.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Leviticus 18:6-7",
          "text": "None of you are to approach any close relative to have sexual relations. I am the LORD. / You must not expose the nakedness of your father by having sexual relations with your mother. She is your mother; you must not have sexual relations with her."
        },
        {
          "reference": "Leviticus 20:12",
          "text": "If a man lies with his daughter-in-law, both must surely be put to death. They have acted perversely; their blood is upon them."
        },
        {
          "reference": "Deuteronomy 27:22",
          "text": "‘Cursed is he who sleeps with his sister, the daughter of his father or the daughter of his mother.’ And let all the people say, ‘Amen!’"
        },
        {
          "reference": "2 Samuel 13:11-14",
          "text": "And when she had brought them to him to eat, he took hold of her and said, “Come lie with me, my sister!” / “No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” ..."
        },
        {
          "reference": "Ezekiel 22:11",
          "text": "One man commits an abomination with his neighbor’s wife; another wickedly defiles his daughter-in-law; and yet another violates his sister, his own father’s daughter."
        },
        {
          "reference": "1 Corinthians 5:1",
          "text": "It is actually reported that there is sexual immorality among you, and of a kind that is intolerable even among pagans: A man has his father’s wife."
        },
        {
          "reference": "1 Corinthians 6:18",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body."
        },
        {
          "reference": "Galatians 5:19",
          "text": "The acts of the flesh are obvious: sexual immorality, impurity, and debauchery;"
        },
        {
          "reference": "Ephesians 5:3",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed."
        },
        {
          "reference": "Colossians 3:5",
          "text": "Put to death, therefore, the components of your earthly nature: sexual immorality, impurity, lust, evil desires, and greed, which is idolatry."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "Hebrews 13:4",
          "text": "Marriage should be honored by all and the marriage bed kept undefiled, for God will judge the sexually immoral and adulterers."
        },
        {
          "reference": "Romans 1:24-27",
          "text": "Therefore God gave them over in the desires of their hearts to impurity for the dishonoring of their bodies with one another. / They exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is forever worthy of praise! Amen. / For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. ..."
        },
        {
          "reference": "1 Timothy 1:9-10",
          "text": "We realize that law is not enacted for the righteous, but for the lawless and rebellious, for the ungodly and sinful, for the unholy and profane, for killers of father or mother, for murderers, / for the sexually immoral, for homosexuals, for slave traders and liars and perjurers, and for anyone else who is averse to sound teaching"
        },
        {
          "reference": "Jude 1:7",
          "text": "In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        }
      ]
    },
    {
      "reference": "Genesis 19:35",
      "book": "Genesis",
      "chapter": 19,
      "verse": 35,
      "translations": [
        {
          "version": "NIV",
          "text": "So they got their father to drink wine that night also, and the younger daughter went in and slept with him. Again he was not aware of it when she lay down or when she got up."
        },
        {
          "version": "NLT",
          "text": "So that night they got him drunk with wine again, and the younger daughter went in and had intercourse with him. As before, he was unaware of her lying down or getting up again."
        },
        {
          "version": "ESV",
          "text": "So they made their father drink wine that night also. And the younger arose and lay with him, and he did not know when she lay down or when she arose."
        },
        {
          "version": "NKJV",
          "text": "Then they made their father drink wine that night also. And the younger arose and lay with him, and he did not know when she lay down or when she arose."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Leviticus 18:6-7",
          "text": "None of you are to approach any close relative to have sexual relations. I am the LORD. / You must not expose the nakedness of your father by having sexual relations with your mother. She is your mother; you must not have sexual relations with her."
        },
        {
          "reference": "Leviticus 18:29",
          "text": "Therefore anyone who commits any of these abominations must be cut off from among his people."
        },
        {
          "reference": "Deuteronomy 27:20",
          "text": "‘Cursed is he who sleeps with his father’s wife, for he has violated his father’s marriage bed.’ And let all the people say, ‘Amen!’"
        },
        {
          "reference": "2 Samuel 13:11-14",
          "text": "And when she had brought them to him to eat, he took hold of her and said, “Come lie with me, my sister!” / “No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” ..."
        },
        {
          "reference": "Ezekiel 16:49-50",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy. / Thus they were haughty and committed abominations before Me. Therefore I removed them, as you have seen."
        },
        {
          "reference": "Proverbs 23:31-33",
          "text": "Do not gaze at wine while it is red, when it sparkles in the cup and goes down smoothly. / In the end it bites like a snake and stings like a viper. / Your eyes will see strange things, and your mind will utter perversities."
        },
        {
          "reference": "Habakkuk 2:15",
          "text": "Woe to him who gives drink to his neighbors, pouring it from the wineskin until they are drunk, in order to gaze at their nakedness!"
        },
        {
          "reference": "Romans 1:24-27",
          "text": "Therefore God gave them over in the desires of their hearts to impurity for the dishonoring of their bodies with one another. / They exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is forever worthy of praise! Amen. / For this reason God gave them over to dishonorable passions. Even their women exchanged natural relations for unnatural ones. ..."
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "Galatians 5:19-21",
          "text": "The acts of the flesh are obvious: sexual immorality, impurity, and debauchery; / idolatry and sorcery; hatred, discord, jealousy, and rage; rivalries, divisions, factions, / and envy; drunkenness, orgies, and the like. I warn you, as I did before, that those who practice such things will not inherit the kingdom of God."
        },
        {
          "reference": "Ephesians 5:3-5",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed. / Nor should there be obscenity, foolish talk, or crude joking, which are out of character, but rather thanksgiving. / For of this you can be sure: No immoral, impure, or greedy person (that is, an idolater) has any inheritance in the kingdom of Christ and of God."
        },
        {
          "reference": "Colossians 3:5-6",
          "text": "Put to death, therefore, the components of your earthly nature: sexual immorality, impurity, lust, evil desires, and greed, which is idolatry. / Because of these, the wrath of God is coming on the sons of disobedience."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "1 Timothy 1:9-10",
          "text": "We realize that law is not enacted for the righteous, but for the lawless and rebellious, for the ungodly and sinful, for the unholy and profane, for killers of father or mother, for murderers, / for the sexually immoral, for homosexuals, for slave traders and liars and perjurers, and for anyone else who is averse to sound teaching"
        },
        {
          "reference": "Hebrews 12:16",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright."
        }
      ]
    },
    {
      "reference": "Genesis 19:36",
      "book": "Genesis",
      "chapter": 19,
      "verse": 36,
      "translations": [
        {
          "version": "NIV",
          "text": "So both of Lot’s daughters became pregnant by their father."
        },
        {
          "version": "NLT",
          "text": "As a result, both of Lot’s daughters became pregnant by their own father."
        },
        {
          "version": "ESV",
          "text": "Thus both the daughters of Lot became pregnant by their father."
        },
        {
          "version": "NKJV",
          "text": "Thus both the daughters of Lot were with child by their father."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Leviticus 18:6-18",
          "text": "None of you are to approach any close relative to have sexual relations. I am the LORD. / You must not expose the nakedness of your father by having sexual relations with your mother. She is your mother; you must not have sexual relations with her. / You must not have sexual relations with your father’s wife; it would dishonor your father. ..."
        },
        {
          "reference": "Deuteronomy 23:2",
          "text": "No one of illegitimate birth may enter the assembly of the LORD, nor may any of his descendants, even to the tenth generation."
        },
        {
          "reference": "2 Samuel 13:1-14",
          "text": "After some time, David’s son Amnon fell in love with Tamar, the beautiful sister of David’s son Absalom. / Amnon was sick with frustration over his sister Tamar, for she was a virgin, and it seemed implausible for him to do anything to her. / Now Amnon had a friend named Jonadab, the son of David’s brother Shimeah. Jonadab was a very shrewd man, ..."
        },
        {
          "reference": "Judges 11:1-2",
          "text": "Now Jephthah the Gileadite was a mighty man of valor; he was the son of a prostitute, and Gilead was his father. / And Gilead’s wife bore him sons who grew up, drove Jephthah out, and said to him, “You shall have no inheritance in our father’s house, because you are the son of another woman.”"
        },
        {
          "reference": "Ruth 4:10",
          "text": "Moreover, I have acquired Ruth the Moabitess, Mahlon’s widow, as my wife, to raise up the name of the deceased through his inheritance, so that his name will not disappear from among his brothers or from the gate of his home. You are witnesses today.”"
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:23-27",
          "text": "In those days I also saw Jews who had married women from Ashdod, Ammon, and Moab. / Half of their children spoke the language of Ashdod or of the other peoples, but could not speak the language of Judah. / I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! ..."
        },
        {
          "reference": "Psalm 51:5",
          "text": "Surely I was brought forth in iniquity; I was sinful when my mother conceived me."
        },
        {
          "reference": "Proverbs 6:32",
          "text": "He who commits adultery lacks judgment; whoever does so destroys himself."
        },
        {
          "reference": "Ezekiel 16:44-45",
          "text": "Behold, all who speak in proverbs will quote this proverb about you: ‘Like mother, like daughter.’ / You are the daughter of your mother, who despised her husband and children. You are the sister of your sisters, who despised their husbands and children. Your mother was a Hittite and your father an Amorite."
        },
        {
          "reference": "Matthew 1:5",
          "text": "Salmon was the father of Boaz by Rahab, Boaz the father of Obed by Ruth, Obed the father of Jesse,"
        },
        {
          "reference": "Matthew 1:18",
          "text": "This is how the birth of Jesus Christ came about: His mother Mary was pledged in marriage to Joseph, but before they came together, she was found to be with child through the Holy Spirit."
        },
        {
          "reference": "Luke 3:32",
          "text": "the son of Jesse, the son of Obed, the son of Boaz, the son of Sala, the son of Nahshon,"
        },
        {
          "reference": "John 8:41",
          "text": "You are doing the works of your father.” “We are not illegitimate children,” they declared. “Our only Father is God Himself.”"
        },
        {
          "reference": "Acts 15:20",
          "text": "Instead, we should write and tell them to abstain from food polluted by idols, from sexual immorality, from the meat of strangled animals, and from blood."
        }
      ]
    },
    {
      "reference": "Genesis 19:37",
      "book": "Genesis",
      "chapter": 19,
      "verse": 37,
      "translations": [
        {
          "version": "NIV",
          "text": "The older daughter had a son, and she named him Moab; he is the father of the Moabites of today."
        },
        {
          "version": "NLT",
          "text": "When the older daughter gave birth to a son, she named him Moab. He became the ancestor of the nation now known as the Moabites."
        },
        {
          "version": "ESV",
          "text": "The firstborn bore a son and called his name Moab. He is the father of the Moabites to this day."
        },
        {
          "version": "NKJV",
          "text": "The firstborn bore a son and called his name Moab; he is the father of the Moabites to this day."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 2:9",
          "text": "Then the LORD said to me, “Do not harass the Moabites or provoke them to war, for I will not give you any of their land, because I have given Ar to the descendants of Lot as their possession.”"
        },
        {
          "reference": "Deuteronomy 23:3-6",
          "text": "No Ammonite or Moabite or any of their descendants may enter the assembly of the LORD, even to the tenth generation. / For they did not meet you with food and water on your way out of Egypt, and they hired Balaam son of Beor from Pethor in Aram-naharaim to curse you. / Yet the LORD your God would not listen to Balaam, and the LORD your God turned the curse into a blessing for you, because the LORD your God loves you. ..."
        },
        {
          "reference": "Judges 3:12-14",
          "text": "Once again the Israelites did evil in the sight of the LORD. So He gave Eglon king of Moab power over Israel, because they had done evil in the sight of the LORD. / After enlisting the Ammonites and Amalekites to join forces with him, Eglon attacked and defeated Israel, taking possession of the City of Palms. / The Israelites served Eglon king of Moab eighteen years."
        },
        {
          "reference": "Ruth 1:4",
          "text": "who took Moabite women as their wives, one named Orpah and the other named Ruth. And after they had lived in Moab about ten years,"
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "2 Samuel 8:2",
          "text": "David also defeated the Moabites, made them lie down on the ground, and measured them off with a cord. He measured off with two lengths those to be put to death, and with one length those to be spared. So the Moabites became subject to David and brought him tribute."
        },
        {
          "reference": "2 Kings 3:4-27",
          "text": "Now Mesha king of Moab was a sheep breeder, and he would render to the king of Israel a hundred thousand lambs and the wool of a hundred thousand rams. / But after the death of Ahab, the king of Moab rebelled against the king of Israel. / So at that time King Jehoram set out from Samaria and mobilized all Israel. ..."
        },
        {
          "reference": "Isaiah 15:1-9",
          "text": "This is the burden against Moab: Ar in Moab is ruined, destroyed in a night! Kir in Moab is devastated, destroyed in a night! / Dibon goes up to its temple to weep at its high places. Moab wails over Nebo, as well as over Medeba. Every head is shaved, every beard is cut off. / In its streets they wear sackcloth; on the rooftops and in the public squares they all wail, falling down weeping. ..."
        },
        {
          "reference": "Isaiah 16:6-14",
          "text": "We have heard of Moab’s pomposity, his exceeding pride and conceit, his overflowing arrogance. But his boasting is empty. / Therefore let Moab wail; let them wail together for Moab. Moan for the raisin cakes of Kir-hareseth, you who are utterly stricken. / For the fields of Heshbon have withered, along with the grapevines of Sibmah. The rulers of the nations have trampled its choicest vines, which had reached as far as Jazer and spread toward the desert. Their shoots had spread out and passed over the sea. ..."
        },
        {
          "reference": "Jeremiah 48:1-47",
          "text": "Concerning Moab, this is what the LORD of Hosts, the God of Israel, says: “Woe to Nebo, for it will be devastated. Kiriathaim will be captured and disgraced; the fortress will be shattered and dismantled. / There is no longer praise for Moab; in Heshbon they devise evil against her: ‘Come, let us cut her off from nationhood.’ You too, O people of Madmen, will be silenced; the sword will pursue you. / A voice cries out from Horonaim: ‘Devastation and great destruction!’ ..."
        },
        {
          "reference": "Ezekiel 25:8-11",
          "text": "This is what the Lord GOD says: ‘Because Moab and Seir said, “Look, the house of Judah is like all the other nations,” / therefore I will indeed expose the flank of Moab beginning with its frontier cities—Beth-jeshimoth, Baal-meon, and Kiriathaim—the glory of the land. / I will give it along with the Ammonites as a possession to the people of the East, so that the Ammonites will no longer be remembered among the nations. ..."
        },
        {
          "reference": "Amos 2:1-3",
          "text": "This is what the LORD says: “For three transgressions of Moab, even four, I will not revoke My judgment, because he burned to lime the bones of Edom’s king. / So I will send fire against Moab to consume the citadels of Kerioth. Moab will die in tumult, amid war cries and the sound of the ram’s horn. / I will cut off the ruler of Moab and kill all the officials with him,” says the LORD."
        },
        {
          "reference": "Zephaniah 2:8-11",
          "text": "“I have heard the reproach of Moab and the insults of the Ammonites, who have taunted My people and threatened their borders. / Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.” / This they shall have in return for their pride, for taunting and mocking the people of the LORD of Hosts. ..."
        },
        {
          "reference": "Matthew 1:5",
          "text": "Salmon was the father of Boaz by Rahab, Boaz the father of Obed by Ruth, Obed the father of Jesse,"
        },
        {
          "reference": "Matthew 5:43-48",
          "text": "You have heard that it was said, ‘Love your neighbor’ and ‘Hate your enemy.’ / But I tell you, love your enemies and pray for those who persecute you, / that you may be sons of your Father in heaven. He causes His sun to rise on the evil and the good, and sends rain on the righteous and the unrighteous. ..."
        }
      ]
    },
    {
      "reference": "Genesis 19:38",
      "book": "Genesis",
      "chapter": 19,
      "verse": 38,
      "translations": [
        {
          "version": "NIV",
          "text": "The younger daughter also had a son, and she named him Ben-Ammi; he is the father of the Ammonites of today."
        },
        {
          "version": "NLT",
          "text": "When the younger daughter gave birth to a son, she named him Ben-ammi. He became the ancestor of the nation now known as the Ammonites."
        },
        {
          "version": "ESV",
          "text": "The younger also bore a son and called his name Ben-ammi. He is the father of the Ammonites to this day."
        },
        {
          "version": "NKJV",
          "text": "And the younger, she also bore a son and called his name Ben-Ammi; he is the father of the people of Ammon to this day."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 2:9",
          "text": "Then the LORD said to me, “Do not harass the Moabites or provoke them to war, for I will not give you any of their land, because I have given Ar to the descendants of Lot as their possession.”"
        },
        {
          "reference": "Deuteronomy 2:19",
          "text": "But when you get close to the Ammonites, do not harass them or provoke them, for I will not give you any of the land of the Ammonites. I have given it to the descendants of Lot as their possession.”"
        },
        {
          "reference": "Judges 3:12-14",
          "text": "Once again the Israelites did evil in the sight of the LORD. So He gave Eglon king of Moab power over Israel, because they had done evil in the sight of the LORD. / After enlisting the Ammonites and Amalekites to join forces with him, Eglon attacked and defeated Israel, taking possession of the City of Palms. / The Israelites served Eglon king of Moab eighteen years."
        },
        {
          "reference": "2 Kings 3:4-27",
          "text": "Now Mesha king of Moab was a sheep breeder, and he would render to the king of Israel a hundred thousand lambs and the wool of a hundred thousand rams. / But after the death of Ahab, the king of Moab rebelled against the king of Israel. / So at that time King Jehoram set out from Samaria and mobilized all Israel. ..."
        },
        {
          "reference": "Isaiah 15:1-9",
          "text": "This is the burden against Moab: Ar in Moab is ruined, destroyed in a night! Kir in Moab is devastated, destroyed in a night! / Dibon goes up to its temple to weep at its high places. Moab wails over Nebo, as well as over Medeba. Every head is shaved, every beard is cut off. / In its streets they wear sackcloth; on the rooftops and in the public squares they all wail, falling down weeping. ..."
        },
        {
          "reference": "Isaiah 16:1-14",
          "text": "Send the tribute lambs to the ruler of the land, from Sela in the desert to the mount of Daughter Zion. / Like fluttering birds pushed out of the nest, so are the daughters of Moab at the fords of the Arnon: / “Give us counsel; render a decision. Shelter us at noonday with shade as dark as night. Hide the refugees; do not betray the one who flees. ..."
        },
        {
          "reference": "Jeremiah 48:1-47",
          "text": "Concerning Moab, this is what the LORD of Hosts, the God of Israel, says: “Woe to Nebo, for it will be devastated. Kiriathaim will be captured and disgraced; the fortress will be shattered and dismantled. / There is no longer praise for Moab; in Heshbon they devise evil against her: ‘Come, let us cut her off from nationhood.’ You too, O people of Madmen, will be silenced; the sword will pursue you. / A voice cries out from Horonaim: ‘Devastation and great destruction!’ ..."
        },
        {
          "reference": "Ezekiel 25:8-11",
          "text": "This is what the Lord GOD says: ‘Because Moab and Seir said, “Look, the house of Judah is like all the other nations,” / therefore I will indeed expose the flank of Moab beginning with its frontier cities—Beth-jeshimoth, Baal-meon, and Kiriathaim—the glory of the land. / I will give it along with the Ammonites as a possession to the people of the East, so that the Ammonites will no longer be remembered among the nations. ..."
        },
        {
          "reference": "Amos 2:1-3",
          "text": "This is what the LORD says: “For three transgressions of Moab, even four, I will not revoke My judgment, because he burned to lime the bones of Edom’s king. / So I will send fire against Moab to consume the citadels of Kerioth. Moab will die in tumult, amid war cries and the sound of the ram’s horn. / I will cut off the ruler of Moab and kill all the officials with him,” says the LORD."
        },
        {
          "reference": "Zephaniah 2:8-11",
          "text": "“I have heard the reproach of Moab and the insults of the Ammonites, who have taunted My people and threatened their borders. / Therefore, as surely as I live,” declares the LORD of Hosts, the God of Israel, “surely Moab will be like Sodom and the Ammonites like Gomorrah—a place of weeds and salt pits, a perpetual wasteland. The remnant of My people will plunder them; the remainder of My nation will dispossess them.” / This they shall have in return for their pride, for taunting and mocking the people of the LORD of Hosts. ..."
        },
        {
          "reference": "Ruth 1:1-4",
          "text": "In the days when the judges ruled, there was a famine in the land. And a certain man from Bethlehem in Judah, with his wife and two sons, went to reside in the land of Moab. / The man’s name was Elimelech, his wife’s name was Naomi, and the names of his two sons were Mahlon and Chilion. They were Ephrathites from Bethlehem in Judah, and they entered the land of Moab and settled there. / Then Naomi’s husband Elimelech died, and she was left with her two sons, ..."
        },
        {
          "reference": "Numbers 21:29",
          "text": "Woe to you, O Moab! You are destroyed, O people of Chemosh! He gave up his sons as refugees, and his daughters into captivity to Sihon king of the Amorites."
        },
        {
          "reference": "Psalm 60:8",
          "text": "Moab is My washbasin; upon Edom I toss My sandal; over Philistia I shout in triumph.”"
        },
        {
          "reference": "Psalm 108:9",
          "text": "Moab is My washbasin; upon Edom I toss My sandal; over Philistia I shout in triumph.”"
        },
        {
          "reference": "Nehemiah 13:1-3",
          "text": "At that time the Book of Moses was read aloud in the hearing of the people, and in it they found the passage stating that no Ammonite or Moabite should ever enter the assembly of God, / because they had not met the Israelites with food and water, but had hired Balaam to call down a curse against them (although our God had turned the curse into a blessing). / As soon as the people heard this law, they excluded from Israel all of foreign descent."
        }
      ]
    }
  ]
}