{
  "book": "genesis",
  "chapter": 2,
  "verses": [
    {
      "reference": "Genesis 2:1",
      "book": "Genesis",
      "chapter": 2,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Thus the heavens and the earth were completed in all their vast array."
        },
        {
          "version": "NLT",
          "text": "So the creation of the heavens and the earth and everything in them was completed."
        },
        {
          "version": "ESV",
          "text": "Thus the heavens and the earth were finished, and all the host of them."
        },
        {
          "version": "NKJV",
          "text": "Thus the heavens and the earth, and all the host of them, were finished."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 20:11",
          "text": "For in six days the LORD made the heavens and the earth and the sea and all that is in them, but on the seventh day He rested. Therefore the LORD blessed the Sabbath day and set it apart as holy."
        },
        {
          "reference": "Hebrews 4:4",
          "text": "For somewhere He has spoken about the seventh day in this manner: “And on the seventh day God rested from all His works.”"
        },
        {
          "reference": "Exodus 31:17",
          "text": "It is a sign between Me and the Israelites forever; for in six days the LORD made the heavens and the earth, but on the seventh day He rested and was refreshed.’”"
        },
        {
          "reference": "Nehemiah 9:6",
          "text": "You alone are the LORD. You created the heavens, the highest heavens with all their host, the earth and all that is on it, the seas and all that is in them. You give life to all things, and the host of heaven worships You."
        },
        {
          "reference": "Isaiah 45:12",
          "text": "It is I who made the earth and created man upon it. It was My hands that stretched out the heavens, and I ordained all their host."
        },
        {
          "reference": "Psalm 33:6",
          "text": "By the word of the LORD the heavens were made, and all the stars by the breath of His mouth."
        },
        {
          "reference": "John 1:3",
          "text": "Through Him all things were made, and without Him nothing was made that has been made."
        },
        {
          "reference": "Colossians 1:16",
          "text": "For in Him all things were created, things in heaven and on earth, visible and invisible, whether thrones or dominions or rulers or authorities. All things were created through Him and for Him."
        },
        {
          "reference": "Psalm 104:24",
          "text": "How many are Your works, O LORD! In wisdom You have made them all; the earth is full of Your creatures."
        },
        {
          "reference": "Isaiah 40:28",
          "text": "Do you not know? Have you not heard? The LORD is the everlasting God, the Creator of the ends of the earth. He will not grow tired or weary; His understanding is beyond searching out."
        },
        {
          "reference": "Job 38:4-7",
          "text": "Where were you when I laid the foundations of the earth? Tell Me, if you have understanding. / Who fixed its measurements? Surely you know! Or who stretched a measuring line across it? / On what were its foundations set, or who laid its cornerstone, ..."
        },
        {
          "reference": "Revelation 4:11",
          "text": "“Worthy are You, our Lord and God, to receive glory and honor and power, for You created all things; by Your will they exist and were created.”"
        },
        {
          "reference": "Psalm 148:2-5",
          "text": "Praise Him, all His angels; praise Him, all His heavenly hosts. / Praise Him, O sun and moon; praise Him, all you shining stars. / Praise Him, O highest heavens, and you waters above the skies. ..."
        },
        {
          "reference": "Jeremiah 10:12",
          "text": "The LORD made the earth by His power; He established the world by His wisdom and stretched out the heavens by His understanding."
        },
        {
          "reference": "Acts 17:24",
          "text": "The God who made the world and everything in it is the Lord of heaven and earth and does not live in temples made by human hands."
        }
      ]
    },
    {
      "reference": "Genesis 2:2",
      "book": "Genesis",
      "chapter": 2,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "By the seventh day God had finished the work he had been doing; so on the seventh day he rested from all his work."
        },
        {
          "version": "NLT",
          "text": "On the seventh day God had finished his work of creation, so he rested from all his work."
        },
        {
          "version": "ESV",
          "text": "And on the seventh day God finished his work that he had done, and he rested on the seventh day from all his work that he had done."
        },
        {
          "version": "NKJV",
          "text": "And on the seventh day God ended His work which He had done, and He rested on the seventh day from all His work which He had done."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 20:11",
          "text": "For in six days the LORD made the heavens and the earth and the sea and all that is in them, but on the seventh day He rested. Therefore the LORD blessed the Sabbath day and set it apart as holy."
        },
        {
          "reference": "Hebrews 4:4",
          "text": "For somewhere He has spoken about the seventh day in this manner: “And on the seventh day God rested from all His works.”"
        },
        {
          "reference": "Exodus 31:17",
          "text": "It is a sign between Me and the Israelites forever; for in six days the LORD made the heavens and the earth, but on the seventh day He rested and was refreshed.’”"
        },
        {
          "reference": "Hebrews 4:9-10",
          "text": "There remains, then, a Sabbath rest for the people of God. / For whoever enters God’s rest also rests from his own work, just as God did from His."
        },
        {
          "reference": "Deuteronomy 5:14",
          "text": "but the seventh day is a Sabbath to the LORD your God, on which you must not do any work—neither you, nor your son or daughter, nor your manservant or maidservant, nor your ox or donkey or any of your livestock, nor the foreigner within your gates, so that your manservant and maidservant may rest as you do."
        },
        {
          "reference": "Isaiah 58:13-14",
          "text": "If you turn your foot from breaking the Sabbath, from doing as you please on My holy day, if you call the Sabbath a delight, and the LORD’s holy day honorable, if you honor it by not going your own way or seeking your own pleasure or speaking idle words, / then you will delight yourself in the LORD, and I will make you ride on the heights of the land and feed you with the heritage of your father Jacob.” For the mouth of the LORD has spoken."
        },
        {
          "reference": "Psalm 95:11",
          "text": "So I swore on oath in My anger, “They shall never enter My rest.”"
        },
        {
          "reference": "Mark 2:27-28",
          "text": "Then Jesus declared, “The Sabbath was made for man, not man for the Sabbath. / Therefore, the Son of Man is Lord even of the Sabbath.”"
        },
        {
          "reference": "Matthew 11:28-30",
          "text": "Come to Me, all you who are weary and burdened, and I will give you rest. / Take My yoke upon you and learn from Me, for I am gentle and humble in heart, and you will find rest for your souls. / For My yoke is easy and My burden is light.”"
        },
        {
          "reference": "Colossians 2:16-17",
          "text": "Therefore let no one judge you by what you eat or drink, or with regard to a feast, a New Moon, or a Sabbath. / These are a shadow of the things to come, but the body that casts it belongs to Christ."
        },
        {
          "reference": "Revelation 14:13",
          "text": "And I heard a voice from heaven telling me to write, “Blessed are the dead—those who die in the Lord from this moment on.” “Yes,” says the Spirit, “they will rest from their labors, for their deeds will follow them.”"
        },
        {
          "reference": "Nehemiah 9:14",
          "text": "You revealed to them Your holy Sabbath and gave them commandments and statutes and laws through Your servant Moses."
        },
        {
          "reference": "Ezekiel 20:12",
          "text": "I also gave them My Sabbaths as a sign between us, so that they would know that I am the LORD who sanctifies them."
        },
        {
          "reference": "Isaiah 56:2",
          "text": "Blessed is the man who does this, and the son of man who holds it fast, who keeps the Sabbath without profaning it and keeps his hand from doing any evil.”"
        },
        {
          "reference": "Luke 23:56",
          "text": "Then they returned to prepare spices and perfumes. And they rested on the Sabbath, according to the commandment."
        }
      ]
    },
    {
      "reference": "Genesis 2:3",
      "book": "Genesis",
      "chapter": 2,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Then God blessed the seventh day and made it holy, because on it he rested from all the work of creating that he had done."
        },
        {
          "version": "NLT",
          "text": "And God blessed the seventh day and declared it holy, because it was the day when he rested from all his work of creation."
        },
        {
          "version": "ESV",
          "text": "So God blessed the seventh day and made it holy, because on it God rested from all his work that he had done in creation."
        },
        {
          "version": "NKJV",
          "text": "Then God blessed the seventh day and sanctified it, because in it He rested from all His work which God had created and made."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 20:8-11",
          "text": "Remember the Sabbath day by keeping it holy. / Six days you shall labor and do all your work, / but the seventh day is a Sabbath to the LORD your God, on which you must not do any work—neither you, nor your son or daughter, nor your manservant or maidservant or livestock, nor the foreigner within your gates. ..."
        },
        {
          "reference": "Exodus 31:17",
          "text": "It is a sign between Me and the Israelites forever; for in six days the LORD made the heavens and the earth, but on the seventh day He rested and was refreshed.’”"
        },
        {
          "reference": "Hebrews 4:4-10",
          "text": "For somewhere He has spoken about the seventh day in this manner: “And on the seventh day God rested from all His works.” / And again, as He says in the passage above: “They shall never enter My rest.” / Since, then, it remains for some to enter His rest, and since those who formerly heard the good news did not enter because of their disobedience, ..."
        },
        {
          "reference": "Isaiah 58:13-14",
          "text": "If you turn your foot from breaking the Sabbath, from doing as you please on My holy day, if you call the Sabbath a delight, and the LORD’s holy day honorable, if you honor it by not going your own way or seeking your own pleasure or speaking idle words, / then you will delight yourself in the LORD, and I will make you ride on the heights of the land and feed you with the heritage of your father Jacob.” For the mouth of the LORD has spoken."
        },
        {
          "reference": "Deuteronomy 5:12-15",
          "text": "Observe the Sabbath day by keeping it holy, as the LORD your God has commanded you. / Six days you shall labor and do all your work, / but the seventh day is a Sabbath to the LORD your God, on which you must not do any work—neither you, nor your son or daughter, nor your manservant or maidservant, nor your ox or donkey or any of your livestock, nor the foreigner within your gates, so that your manservant and maidservant may rest as you do. ..."
        },
        {
          "reference": "Mark 2:27-28",
          "text": "Then Jesus declared, “The Sabbath was made for man, not man for the Sabbath. / Therefore, the Son of Man is Lord even of the Sabbath.”"
        },
        {
          "reference": "Leviticus 23:3",
          "text": "For six days work may be done, but the seventh day is a Sabbath of complete rest, a day of sacred assembly. You must not do any work; wherever you live, it is a Sabbath to the LORD."
        },
        {
          "reference": "Nehemiah 9:14",
          "text": "You revealed to them Your holy Sabbath and gave them commandments and statutes and laws through Your servant Moses."
        },
        {
          "reference": "Matthew 12:8",
          "text": "For the Son of Man is Lord of the Sabbath.”"
        },
        {
          "reference": "Ezekiel 20:12",
          "text": "I also gave them My Sabbaths as a sign between us, so that they would know that I am the LORD who sanctifies them."
        },
        {
          "reference": "Colossians 2:16-17",
          "text": "Therefore let no one judge you by what you eat or drink, or with regard to a feast, a New Moon, or a Sabbath. / These are a shadow of the things to come, but the body that casts it belongs to Christ."
        },
        {
          "reference": "Luke 6:5",
          "text": "Then Jesus declared, “The Son of Man is Lord of the Sabbath.”"
        },
        {
          "reference": "Psalm 95:11",
          "text": "So I swore on oath in My anger, “They shall never enter My rest.”"
        },
        {
          "reference": "Isaiah 56:2-6",
          "text": "Blessed is the man who does this, and the son of man who holds it fast, who keeps the Sabbath without profaning it and keeps his hand from doing any evil.” / Let no foreigner who has joined himself to the LORD say, “The LORD will utterly exclude me from His people.” And let the eunuch not say, “I am but a dry tree.” / For this is what the LORD says: “To the eunuchs who keep My Sabbaths, who choose what pleases Me and hold fast to My covenant— ..."
        },
        {
          "reference": "Revelation 14:13",
          "text": "And I heard a voice from heaven telling me to write, “Blessed are the dead—those who die in the Lord from this moment on.” “Yes,” says the Spirit, “they will rest from their labors, for their deeds will follow them.”"
        }
      ]
    },
    {
      "reference": "Genesis 2:4",
      "book": "Genesis",
      "chapter": 2,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "This is the account of the heavens and the earth when they were created, when the LORD God made the earth and the heavens."
        },
        {
          "version": "NLT",
          "text": "This is the account of the creation of the heavens and the earth. When the LORD God made the earth and the heavens,"
        },
        {
          "version": "ESV",
          "text": "These are the generations of the heavens and the earth when they were created, in the day that the LORD God made the earth and the heavens."
        },
        {
          "version": "NKJV",
          "text": "This is the history of the heavens and the earth when they were created, in the day that the LORD God made the earth and the heavens,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "John 1:1-3",
          "text": "In the beginning was the Word, and the Word was with God, and the Word was God. / He was with God in the beginning. / Through Him all things were made, and without Him nothing was made that has been made."
        },
        {
          "reference": "Colossians 1:16-17",
          "text": "For in Him all things were created, things in heaven and on earth, visible and invisible, whether thrones or dominions or rulers or authorities. All things were created through Him and for Him. / He is before all things, and in Him all things hold together."
        },
        {
          "reference": "Hebrews 1:2",
          "text": "But in these last days He has spoken to us by His Son, whom He appointed heir of all things, and through whom He made the universe."
        },
        {
          "reference": "Revelation 4:11",
          "text": "“Worthy are You, our Lord and God, to receive glory and honor and power, for You created all things; by Your will they exist and were created.”"
        },
        {
          "reference": "Isaiah 45:18",
          "text": "For thus says the LORD, who created the heavens—He is God; He formed the earth and fashioned it; He established it; He did not create it to be empty, but formed it to be inhabited: “I am the LORD, and there is no other."
        },
        {
          "reference": "Psalm 33:6-9",
          "text": "By the word of the LORD the heavens were made, and all the stars by the breath of His mouth. / He piles up the waters of the sea; He puts the depths into storehouses. / Let all the earth fear the LORD; let all the people of the world revere Him. ..."
        },
        {
          "reference": "Proverbs 8:22-31",
          "text": "The LORD created me as His first course, before His works of old. / From everlasting I was established, from the beginning, before the earth began. / When there were no watery depths, I was brought forth, when no springs were overflowing with water. ..."
        },
        {
          "reference": "Job 38:4-7",
          "text": "Where were you when I laid the foundations of the earth? Tell Me, if you have understanding. / Who fixed its measurements? Surely you know! Or who stretched a measuring line across it? / On what were its foundations set, or who laid its cornerstone, ..."
        },
        {
          "reference": "Nehemiah 9:6",
          "text": "You alone are the LORD. You created the heavens, the highest heavens with all their host, the earth and all that is on it, the seas and all that is in them. You give life to all things, and the host of heaven worships You."
        },
        {
          "reference": "Acts 17:24-26",
          "text": "The God who made the world and everything in it is the Lord of heaven and earth and does not live in temples made by human hands. / Nor is He served by human hands, as if He needed anything, because He Himself gives everyone life and breath and everything else. / From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Romans 1:20",
          "text": "For since the creation of the world God’s invisible qualities, His eternal power and divine nature, have been clearly seen, being understood from His workmanship, so that men are without excuse."
        },
        {
          "reference": "2 Peter 3:5",
          "text": "But they deliberately overlook the fact that long ago by God’s word the heavens existed and the earth was formed out of water and by water,"
        },
        {
          "reference": "Isaiah 42:5",
          "text": "This is what God the LORD says—He who created the heavens and stretched them out, who spread out the earth and its offspring, who gives breath to the people on it and life to those who walk in it:"
        },
        {
          "reference": "Jeremiah 10:12",
          "text": "The LORD made the earth by His power; He established the world by His wisdom and stretched out the heavens by His understanding."
        },
        {
          "reference": "Psalm 104:24-30",
          "text": "How many are Your works, O LORD! In wisdom You have made them all; the earth is full of Your creatures. / Here is the sea, vast and wide, teeming with creatures beyond number, living things both great and small. / There the ships pass, and Leviathan, which You formed to frolic there. ..."
        }
      ]
    },
    {
      "reference": "Genesis 2:5",
      "book": "Genesis",
      "chapter": 2,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "Now no shrub had yet appeared on the earth and no plant had yet sprung up, for the LORD God had not sent rain on the earth and there was no one to work the ground,"
        },
        {
          "version": "NLT",
          "text": "neither wild plants nor grains were growing on the earth. For the LORD God had not yet sent rain to water the earth, and there were no people to cultivate the soil."
        },
        {
          "version": "ESV",
          "text": "When no bush of the field was yet in the land and no small plant of the field had yet sprung up—for the LORD God had not caused it to rain on the land, and there was no man to work the ground,"
        },
        {
          "version": "NKJV",
          "text": "before any plant of the field was in the earth and before any herb of the field had grown. For the LORD God had not caused it to rain on the earth, and there was no man to till the ground;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Isaiah 55:10-11",
          "text": "For just as rain and snow fall from heaven and do not return without watering the earth, making it bud and sprout, and providing seed to sow and food to eat, / so My word that proceeds from My mouth will not return to Me empty, but it will accomplish what I please, and it will prosper where I send it."
        },
        {
          "reference": "Psalm 104:14",
          "text": "He makes the grass grow for the livestock and provides crops for man to cultivate, bringing forth food from the earth:"
        },
        {
          "reference": "Job 38:26-28",
          "text": "to bring rain on a barren land, on a desert where no man lives, / to satisfy the parched wasteland and make it sprout with tender grass? / Does the rain have a father? Who has begotten the drops of dew?"
        },
        {
          "reference": "Hebrews 6:7",
          "text": "For land that drinks in the rain often falling on it and that produces a crop useful to those for whom it is tended receives the blessing of God."
        },
        {
          "reference": "James 5:7",
          "text": "Be patient, then, brothers, until the Lord’s coming. See how the farmer awaits the precious fruit of the soil—how patient he is for the fall and spring rains."
        },
        {
          "reference": "Isaiah 30:23",
          "text": "Then He will send rain for the seed that you have sown in the ground, and the food that comes from your land will be rich and plentiful. On that day your cattle will graze in open pastures."
        },
        {
          "reference": "Jeremiah 14:22",
          "text": "Can the worthless idols of the nations bring rain? Do the skies alone send showers? Is this not by You, O LORD our God? So we put our hope in You, for You have done all these things."
        },
        {
          "reference": "Deuteronomy 11:14",
          "text": "then I will provide rain for your land in season, the autumn and spring rains, that you may gather your grain, new wine, and oil."
        },
        {
          "reference": "Acts 14:17",
          "text": "Yet He has not left Himself without testimony to His goodness: He gives you rain from heaven and fruitful seasons, filling your hearts with food and gladness.”"
        },
        {
          "reference": "Matthew 5:45",
          "text": "that you may be sons of your Father in heaven. He causes His sun to rise on the evil and the good, and sends rain on the righteous and the unrighteous."
        },
        {
          "reference": "1 Corinthians 3:6-7",
          "text": "I planted the seed and Apollos watered it, but God made it grow. / So neither he who plants nor he who waters is anything, but only God, who makes things grow."
        },
        {
          "reference": "Zechariah 10:1",
          "text": "Ask the LORD for rain in springtime; the LORD makes the storm clouds, and He will give everyone showers of rain and crops in the field."
        },
        {
          "reference": "Hosea 6:3",
          "text": "So let us know—let us press on to know the LORD. As surely as the sun rises, He will appear; He will come to us like the rain, like the spring showers that water the earth."
        },
        {
          "reference": "Joel 2:23",
          "text": "Be glad, O children of Zion, and rejoice in the LORD your God, for He has given you the autumn rains for your vindication. He sends you showers, both autumn and spring rains, as before."
        },
        {
          "reference": "Ezekiel 34:26",
          "text": "I will make them and the places around My hill a blessing. I will send down showers in season—showers of blessing."
        }
      ]
    },
    {
      "reference": "Genesis 2:6",
      "book": "Genesis",
      "chapter": 2,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "but streams came up from the earth and watered the whole surface of the ground."
        },
        {
          "version": "NLT",
          "text": "Instead, springs came up from the ground and watered all the land."
        },
        {
          "version": "ESV",
          "text": "and a mist was going up from the land and was watering the whole face of the ground—"
        },
        {
          "version": "NKJV",
          "text": "but a mist went up from the earth and watered the whole face of the ground."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Job 36:27-28",
          "text": "For He draws up drops of water which distill the rain from the mist, / which the clouds pour out and shower abundantly on mankind."
        },
        {
          "reference": "Psalm 104:13-14",
          "text": "He waters the mountains from His chambers; the earth is satisfied by the fruit of His works. / He makes the grass grow for the livestock and provides crops for man to cultivate, bringing forth food from the earth:"
        },
        {
          "reference": "Isaiah 55:10",
          "text": "For just as rain and snow fall from heaven and do not return without watering the earth, making it bud and sprout, and providing seed to sow and food to eat,"
        },
        {
          "reference": "Jeremiah 10:13",
          "text": "When He thunders, the waters in the heavens roar; He causes the clouds to rise from the ends of the earth. He generates the lightning with the rain and brings forth the wind from His storehouses."
        },
        {
          "reference": "Amos 4:7",
          "text": "“I also withheld the rain from you when the harvest was three months away. I sent rain on one city but withheld it from another. One field received rain; another without rain withered."
        },
        {
          "reference": "Deuteronomy 11:14",
          "text": "then I will provide rain for your land in season, the autumn and spring rains, that you may gather your grain, new wine, and oil."
        },
        {
          "reference": "1 Kings 18:41-45",
          "text": "And Elijah said to Ahab, “Go up, eat and drink, for there is the sound of a heavy rain.” / So Ahab went up to eat and drink. But Elijah climbed to the summit of Carmel, bent down on the ground, and put his face between his knees. / “Go and look toward the sea,” he said to his servant. So the servant went and looked, and he said, “There is nothing there.” Seven times Elijah said, “Go back.” ..."
        },
        {
          "reference": "Zechariah 10:1",
          "text": "Ask the LORD for rain in springtime; the LORD makes the storm clouds, and He will give everyone showers of rain and crops in the field."
        },
        {
          "reference": "Acts 14:17",
          "text": "Yet He has not left Himself without testimony to His goodness: He gives you rain from heaven and fruitful seasons, filling your hearts with food and gladness.”"
        },
        {
          "reference": "James 5:17-18",
          "text": "Elijah was a man just like us. He prayed earnestly that it would not rain, and it did not rain on the land for three and a half years. / Again he prayed, and the heavens gave rain, and the earth yielded its crops."
        },
        {
          "reference": "Hebrews 6:7",
          "text": "For land that drinks in the rain often falling on it and that produces a crop useful to those for whom it is tended receives the blessing of God."
        },
        {
          "reference": "Matthew 5:45",
          "text": "that you may be sons of your Father in heaven. He causes His sun to rise on the evil and the good, and sends rain on the righteous and the unrighteous."
        },
        {
          "reference": "Luke 12:54",
          "text": "Then Jesus said to the crowds, “As soon as you see a cloud rising in the west, you say, ‘A shower is coming,’ and that is what happens."
        },
        {
          "reference": "Revelation 11:6",
          "text": "These witnesses have power to shut the sky so that no rain will fall during the days of their prophecy, and power to turn the waters into blood and to strike the earth with every kind of plague as often as they wish."
        },
        {
          "reference": "Job 5:10",
          "text": "He gives rain to the earth and sends water upon the fields."
        }
      ]
    },
    {
      "reference": "Genesis 2:7",
      "book": "Genesis",
      "chapter": 2,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the LORD God formed a man from the dust of the ground and breathed into his nostrils the breath of life, and the man became a living being."
        },
        {
          "version": "NLT",
          "text": "Then the LORD God formed the man from the dust of the ground. He breathed the breath of life into the man’s nostrils, and the man became a living person."
        },
        {
          "version": "ESV",
          "text": "then the LORD God formed the man of dust from the ground and breathed into his nostrils the breath of life, and the man became a living creature."
        },
        {
          "version": "NKJV",
          "text": "And the LORD God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living being."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Job 33:4",
          "text": "The Spirit of God has made me, and the breath of the Almighty gives me life."
        },
        {
          "reference": "1 Corinthians 15:45",
          "text": "So it is written: “The first man Adam became a living being”; the last Adam a life-giving spirit."
        },
        {
          "reference": "Isaiah 64:8",
          "text": "But now, O LORD, You are our Father; we are the clay, and You are the potter; we are all the work of Your hand."
        },
        {
          "reference": "Ecclesiastes 12:7",
          "text": "before the dust returns to the ground from which it came and the spirit returns to God who gave it."
        },
        {
          "reference": "1 Corinthians 15:47",
          "text": "The first man was of the dust of the earth, the second man from heaven."
        },
        {
          "reference": "Job 27:3",
          "text": "as long as my breath is still within me and the breath of God remains in my nostrils,"
        },
        {
          "reference": "Acts 17:25",
          "text": "Nor is He served by human hands, as if He needed anything, because He Himself gives everyone life and breath and everything else."
        },
        {
          "reference": "Psalm 103:14",
          "text": "For He knows our frame; He is mindful that we are dust."
        },
        {
          "reference": "Romans 5:12",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned."
        },
        {
          "reference": "Zechariah 12:1",
          "text": "This is the burden of the word of the LORD concerning Israel. Thus declares the LORD, who stretches out the heavens and lays the foundation of the earth, who forms the spirit of man within him:"
        },
        {
          "reference": "1 Corinthians 15:22",
          "text": "For as in Adam all die, so in Christ all will be made alive."
        },
        {
          "reference": "Isaiah 42:5",
          "text": "This is what God the LORD says—He who created the heavens and stretched them out, who spread out the earth and its offspring, who gives breath to the people on it and life to those who walk in it:"
        },
        {
          "reference": "Romans 9:21",
          "text": "Does not the potter have the right to make from the same lump of clay one vessel for special occasions and another for common use?"
        },
        {
          "reference": "2 Corinthians 4:7",
          "text": "Now we have this treasure in jars of clay to show that this surpassingly great power is from God and not from us."
        },
        {
          "reference": "Psalm 139:14",
          "text": "I praise You, for I am fearfully and wonderfully made. Marvelous are Your works, and I know this very well."
        }
      ]
    },
    {
      "reference": "Genesis 2:8",
      "book": "Genesis",
      "chapter": 2,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "Now the LORD God had planted a garden in the east, in Eden; and there he put the man he had formed."
        },
        {
          "version": "NLT",
          "text": "Then the LORD God planted a garden in Eden in the east, and there he placed the man he had made."
        },
        {
          "version": "ESV",
          "text": "And the LORD God planted a garden in Eden, in the east, and there he put the man whom he had formed."
        },
        {
          "version": "NKJV",
          "text": "The LORD God planted a garden eastward in Eden, and there He put the man whom He had formed."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 2:7",
          "text": "He who has an ear, let him hear what the Spirit says to the churches. To the one who overcomes, I will grant the right to eat from the tree of life in the Paradise of God."
        },
        {
          "reference": "Revelation 22:1-2",
          "text": "Then the angel showed me a river of the water of life, as clear as crystal, flowing from the throne of God and of the Lamb / down the middle of the main street of the city. On either side of the river stood a tree of life, bearing twelve kinds of fruit and yielding a fresh crop for each month. And the leaves of the tree are for the healing of the nations."
        },
        {
          "reference": "Ezekiel 28:13",
          "text": "You were in Eden, the garden of God. Every kind of precious stone adorned you: ruby, topaz, and diamond, beryl, onyx, and jasper, sapphire, turquoise, and emerald. Your mountings and settings were crafted in gold, prepared on the day of your creation."
        },
        {
          "reference": "Isaiah 51:3",
          "text": "For the LORD will comfort Zion and will look with compassion on all her ruins; He will make her wilderness like Eden and her desert like the garden of the LORD. Joy and gladness will be found in her, thanksgiving and melodious song."
        },
        {
          "reference": "Ezekiel 31:8-9",
          "text": "The cedars in the garden of God could not rival it; the cypresses could not compare with its branches, nor the plane trees match its boughs. No tree in the garden of God could compare with its beauty. / I made it beautiful with its many branches, the envy of all the trees of Eden, which were in the garden of God.’"
        },
        {
          "reference": "Revelation 21:2",
          "text": "I saw the holy city, the new Jerusalem, coming down out of heaven from God, prepared as a bride adorned for her husband."
        },
        {
          "reference": "Revelation 22:14",
          "text": "Blessed are those who wash their robes, so that they may have the right to the tree of life and may enter the city by its gates."
        },
        {
          "reference": "Revelation 22:19",
          "text": "And if anyone takes away from the words of this book of prophecy, God will take away his share in the tree of life and the holy city, which are described in this book."
        },
        {
          "reference": "Ezekiel 36:35",
          "text": "Then they will say, ‘This land that was desolate has become like the garden of Eden. The cities that were once ruined, desolate, and destroyed are now fortified and inhabited.’"
        },
        {
          "reference": "Joel 2:3",
          "text": "Before them a fire devours, and behind them a flame scorches. The land before them is like the Garden of Eden, but behind them, it is like a desert wasteland—surely nothing will escape them."
        },
        {
          "reference": "Psalm 104:14",
          "text": "He makes the grass grow for the livestock and provides crops for man to cultivate, bringing forth food from the earth:"
        },
        {
          "reference": "Psalm 92:12-14",
          "text": "The righteous will flourish like a palm tree, and grow like a cedar in Lebanon. / Planted in the house of the LORD, they will flourish in the courts of our God. / In old age they will still bear fruit; healthy and green they will remain,"
        },
        {
          "reference": "Isaiah 58:11",
          "text": "The LORD will always guide you; He will satisfy you in a sun-scorched land and strengthen your frame. You will be like a well-watered garden, like a spring whose waters never fail."
        },
        {
          "reference": "Jeremiah 31:12",
          "text": "They will come and shout for joy on the heights of Zion; they will be radiant over the bounty of the LORD—the grain, new wine, and oil, and the young of the flocks and herds. Their life will be like a well-watered garden, and never again will they languish."
        },
        {
          "reference": "John 1:38-39",
          "text": "Jesus turned and saw them following. “What do you want?” He asked. They said to Him, “Rabbi” (which means Teacher), “where are You staying?” / “Come and see,” He replied. So they went and saw where He was staying, and spent that day with Him. It was about the tenth hour."
        }
      ]
    },
    {
      "reference": "Genesis 2:9",
      "book": "Genesis",
      "chapter": 2,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "The LORD God made all kinds of trees grow out of the ground—trees that were pleasing to the eye and good for food. In the middle of the garden were the tree of life and the tree of the knowledge of good and evil."
        },
        {
          "version": "NLT",
          "text": "The LORD God made all sorts of trees grow up from the ground—trees that were beautiful and that produced delicious fruit. In the middle of the garden he placed the tree of life and the tree of the knowledge of good and evil."
        },
        {
          "version": "ESV",
          "text": "And out of the ground the LORD God made to spring up every tree that is pleasant to the sight and good for food. The tree of life was in the midst of the garden, and the tree of the knowledge of good and evil."
        },
        {
          "version": "NKJV",
          "text": "And out of the ground the LORD God made every tree grow that is pleasant to the sight and good for food. The tree of life was also in the midst of the garden, and the tree of the knowledge of good and evil."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 22:2",
          "text": "down the middle of the main street of the city. On either side of the river stood a tree of life, bearing twelve kinds of fruit and yielding a fresh crop for each month. And the leaves of the tree are for the healing of the nations."
        },
        {
          "reference": "Revelation 2:7",
          "text": "He who has an ear, let him hear what the Spirit says to the churches. To the one who overcomes, I will grant the right to eat from the tree of life in the Paradise of God."
        },
        {
          "reference": "Ezekiel 47:12",
          "text": "Along both banks of the river, fruit trees of all kinds will grow. Their leaves will not wither, and their fruit will not fail. Each month they will bear fruit, because the water from the sanctuary flows to them. Their fruit will be used for food and their leaves for healing.”"
        },
        {
          "reference": "Proverbs 3:18",
          "text": "She is a tree of life to those who embrace her, and those who lay hold of her are blessed."
        },
        {
          "reference": "Proverbs 11:30",
          "text": "The fruit of the righteous is a tree of life, and he who wins souls is wise."
        },
        {
          "reference": "Revelation 22:14",
          "text": "Blessed are those who wash their robes, so that they may have the right to the tree of life and may enter the city by its gates."
        },
        {
          "reference": "Revelation 22:19",
          "text": "And if anyone takes away from the words of this book of prophecy, God will take away his share in the tree of life and the holy city, which are described in this book."
        },
        {
          "reference": "John 6:48-51",
          "text": "I am the bread of life. / Your fathers ate the manna in the wilderness, yet they died. / This is the bread that comes down from heaven, so that anyone may eat of it and not die. ..."
        },
        {
          "reference": "Matthew 7:17-19",
          "text": "Likewise, every good tree bears good fruit, but a bad tree bears bad fruit. / A good tree cannot bear bad fruit, and a bad tree cannot bear good fruit. / Every tree that does not bear good fruit is cut down and thrown into the fire."
        },
        {
          "reference": "Romans 5:12-19",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned. / For sin was in the world before the law was given; but sin is not taken into account when there is no law. / Nevertheless, death reigned from Adam until Moses, even over those who did not sin in the way that Adam transgressed. He is a pattern of the One to come. ..."
        },
        {
          "reference": "1 Corinthians 15:21-22",
          "text": "For since death came through a man, the resurrection of the dead comes also through a man. / For as in Adam all die, so in Christ all will be made alive."
        },
        {
          "reference": "1 Corinthians 15:45",
          "text": "So it is written: “The first man Adam became a living being”; the last Adam a life-giving spirit."
        },
        {
          "reference": "Romans 6:23",
          "text": "For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord."
        },
        {
          "reference": "Isaiah 61:3",
          "text": "to console the mourners in Zion—to give them a crown of beauty for ashes, the oil of joy for mourning, and a garment of praise for a spirit of despair. So they will be called oaks of righteousness, the planting of the LORD, that He may be glorified."
        },
        {
          "reference": "Ezekiel 31:8-9",
          "text": "The cedars in the garden of God could not rival it; the cypresses could not compare with its branches, nor the plane trees match its boughs. No tree in the garden of God could compare with its beauty. / I made it beautiful with its many branches, the envy of all the trees of Eden, which were in the garden of God.’"
        }
      ]
    },
    {
      "reference": "Genesis 2:10",
      "book": "Genesis",
      "chapter": 2,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "A river watering the garden flowed from Eden; from there it was separated into four headwaters."
        },
        {
          "version": "NLT",
          "text": "A river flowed from the land of Eden, watering the garden and then dividing into four branches."
        },
        {
          "version": "ESV",
          "text": "A river flowed out of Eden to water the garden, and there it divided and became four rivers."
        },
        {
          "version": "NKJV",
          "text": "Now a river went out of Eden to water the garden, and from there it parted and became four riverheads."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 22:1-2",
          "text": "Then the angel showed me a river of the water of life, as clear as crystal, flowing from the throne of God and of the Lamb / down the middle of the main street of the city. On either side of the river stood a tree of life, bearing twelve kinds of fruit and yielding a fresh crop for each month. And the leaves of the tree are for the healing of the nations."
        },
        {
          "reference": "Ezekiel 47:1-12",
          "text": "Then the man brought me back to the entrance of the temple, and I saw water flowing from under the threshold of the temple toward the east (for the temple faced east). The water was coming down from under the south side of the temple, south of the altar. / Next he brought me out through the north gate and led me around the outside to the outer gate facing east, and there I saw the water trickling out from the south side. / As the man went eastward with a measuring line in his hand, he measured off a thousand cubits and led me through ankle-deep water. ..."
        },
        {
          "reference": "Psalm 46:4",
          "text": "There is a river whose streams delight the city of God, the holy place where the Most High dwells."
        },
        {
          "reference": "Zechariah 14:8",
          "text": "And on that day living water will flow out from Jerusalem, half of it toward the Eastern Sea and the other half toward the Western Sea, in summer and winter alike."
        },
        {
          "reference": "Revelation 21:6",
          "text": "And He told me, “It is done! I am the Alpha and the Omega, the Beginning and the End. To the thirsty I will give freely from the spring of the water of life."
        },
        {
          "reference": "John 4:14",
          "text": "But whoever drinks the water I give him will never thirst. Indeed, the water I give him will become in him a fount of water springing up to eternal life.”"
        },
        {
          "reference": "Isaiah 48:18",
          "text": "If only you had paid attention to My commandments, your peace would have been like a river, and your righteousness like waves of the sea."
        },
        {
          "reference": "Joel 3:18",
          "text": "And in that day the mountains will drip with sweet wine, and the hills will flow with milk. All the streams of Judah will run with water, and a spring will flow from the house of the LORD to water the Valley of Acacias."
        },
        {
          "reference": "Revelation 7:17",
          "text": "For the Lamb in the center of the throne will be their shepherd. ‘He will lead them to springs of living water,’ and ‘God will wipe away every tear from their eyes.’”"
        },
        {
          "reference": "Isaiah 41:18",
          "text": "I will open rivers on the barren heights, and fountains in the middle of the valleys. I will turn the desert into a pool of water, and the dry land into flowing springs."
        },
        {
          "reference": "John 7:38",
          "text": "Whoever believes in Me, as the Scripture has said: ‘Streams of living water will flow from within him.’”"
        },
        {
          "reference": "Jeremiah 17:8",
          "text": "He is like a tree planted by the waters that sends out its roots toward the stream. It does not fear when the heat comes, and its leaves are always green. It does not worry in a year of drought, nor does it cease to produce fruit."
        },
        {
          "reference": "Revelation 22:17",
          "text": "The Spirit and the bride say, “Come!” Let the one who hears say, “Come!” And let the one who is thirsty come, and the one who desires the water of life drink freely."
        },
        {
          "reference": "Isaiah 55:1",
          "text": "“Come, all you who are thirsty, come to the waters; and you without money, come, buy, and eat! Come, buy wine and milk without money and without cost!"
        },
        {
          "reference": "Psalm 36:8-9",
          "text": "They feast on the abundance of Your house, and You give them drink from Your river of delights. / For with You is the fountain of life; in Your light we see light."
        }
      ]
    },
    {
      "reference": "Genesis 2:11",
      "book": "Genesis",
      "chapter": 2,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "The name of the first is the Pishon; it winds through the entire land of Havilah, where there is gold."
        },
        {
          "version": "NLT",
          "text": "The first branch, called the Pishon, flowed around the entire land of Havilah, where gold is found."
        },
        {
          "version": "ESV",
          "text": "The name of the first is the Pishon. It is the one that flowed around the whole land of Havilah, where there is gold."
        },
        {
          "version": "NKJV",
          "text": "The name of the first is Pishon; it is the one which skirts the whole land of Havilah, where there is gold."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 21:18-21",
          "text": "The wall was made of jasper, and the city itself of pure gold, as pure as glass. / The foundations of the city walls were adorned with every kind of precious stone: The first foundation was jasper, the second sapphire, the third chalcedony, the fourth emerald, / the fifth sardonyx, the sixth carnelian, the seventh chrysolite, the eighth beryl, the ninth topaz, the tenth chrysoprase, the eleventh jacinth, and the twelfth amethyst. ..."
        },
        {
          "reference": "Ezekiel 28:13",
          "text": "You were in Eden, the garden of God. Every kind of precious stone adorned you: ruby, topaz, and diamond, beryl, onyx, and jasper, sapphire, turquoise, and emerald. Your mountings and settings were crafted in gold, prepared on the day of your creation."
        },
        {
          "reference": "1 Kings 10:2",
          "text": "She arrived in Jerusalem with a very large caravan—with camels bearing spices, gold in great abundance, and precious stones. And she came to Solomon and spoke to him all that was on her mind."
        },
        {
          "reference": "Job 28:16",
          "text": "It cannot be valued in the gold of Ophir, in precious onyx or sapphire."
        },
        {
          "reference": "Isaiah 60:6",
          "text": "Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD."
        },
        {
          "reference": "1 Kings 9:28",
          "text": "They sailed to Ophir and imported gold from there—420 talents—and delivered it to Solomon."
        },
        {
          "reference": "2 Chronicles 9:10",
          "text": "(The servants of Hiram and of Solomon who brought gold from Ophir also brought algum wood and precious stones."
        },
        {
          "reference": "Numbers 31:22",
          "text": "Only the gold, silver, bronze, iron, tin, and lead—"
        },
        {
          "reference": "1 Kings 10:10",
          "text": "Then she gave the king 120 talents of gold, a great quantity of spices, and precious stones. Never again were spices in such abundance brought in as those the queen of Sheba gave to King Solomon."
        },
        {
          "reference": "2 Chronicles 9:1",
          "text": "Now when the queen of Sheba heard about the fame of Solomon, she came to test him with difficult questions. She arrived in Jerusalem with a very large caravan—with camels bearing spices, gold in abundance, and precious stones. And she came to Solomon and spoke with him about all that was on her mind."
        },
        {
          "reference": "Matthew 2:11",
          "text": "On coming to the house, they saw the Child with His mother Mary, and they fell down and worshiped Him. Then they opened their treasures and presented Him with gifts of gold and frankincense and myrrh."
        },
        {
          "reference": "Psalm 72:15",
          "text": "Long may he live! May gold from Sheba be given him. May people ever pray for him; may they bless him all day long."
        },
        {
          "reference": "1 Kings 10:14",
          "text": "The weight of gold that came to Solomon each year was 666 talents,"
        },
        {
          "reference": "2 Chronicles 9:13",
          "text": "The weight of gold that came to Solomon each year was 666 talents,"
        },
        {
          "reference": "Daniel 10:5",
          "text": "I lifted up my eyes, and behold, there was a certain man dressed in linen, with a belt of fine gold from Uphaz around his waist."
        }
      ]
    },
    {
      "reference": "Genesis 2:12",
      "book": "Genesis",
      "chapter": 2,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "(The gold of that land is good; aromatic resin and onyx are also there.)"
        },
        {
          "version": "NLT",
          "text": "The gold of that land is exceptionally pure; aromatic resin and onyx stone are also found there."
        },
        {
          "version": "ESV",
          "text": "And the gold of that land is good; bdellium and onyx stone are there."
        },
        {
          "version": "NKJV",
          "text": "And the gold of that land is good. Bdellium and the onyx stone are there."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 21:18-21",
          "text": "The wall was made of jasper, and the city itself of pure gold, as pure as glass. / The foundations of the city walls were adorned with every kind of precious stone: The first foundation was jasper, the second sapphire, the third chalcedony, the fourth emerald, / the fifth sardonyx, the sixth carnelian, the seventh chrysolite, the eighth beryl, the ninth topaz, the tenth chrysoprase, the eleventh jacinth, and the twelfth amethyst. ..."
        },
        {
          "reference": "Exodus 25:7",
          "text": "and onyx stones and gemstones to be mounted on the ephod and breastpiece."
        },
        {
          "reference": "1 Kings 10:2",
          "text": "She arrived in Jerusalem with a very large caravan—with camels bearing spices, gold in great abundance, and precious stones. And she came to Solomon and spoke to him all that was on her mind."
        },
        {
          "reference": "Job 28:15-19",
          "text": "It cannot be bought with gold, nor can its price be weighed out in silver. / It cannot be valued in the gold of Ophir, in precious onyx or sapphire. / Neither gold nor crystal can compare to it, nor jewels of fine gold be exchanged for it. ..."
        },
        {
          "reference": "Ezekiel 28:13",
          "text": "You were in Eden, the garden of God. Every kind of precious stone adorned you: ruby, topaz, and diamond, beryl, onyx, and jasper, sapphire, turquoise, and emerald. Your mountings and settings were crafted in gold, prepared on the day of your creation."
        },
        {
          "reference": "1 Kings 10:10",
          "text": "Then she gave the king 120 talents of gold, a great quantity of spices, and precious stones. Never again were spices in such abundance brought in as those the queen of Sheba gave to King Solomon."
        },
        {
          "reference": "2 Chronicles 9:9",
          "text": "Then she gave the king 120 talents of gold, a great quantity of spices, and precious stones. There had never been such spices as those the queen of Sheba gave to King Solomon."
        },
        {
          "reference": "Numbers 31:22",
          "text": "Only the gold, silver, bronze, iron, tin, and lead—"
        },
        {
          "reference": "1 Chronicles 29:2",
          "text": "Now with all my ability I have made provision for the house of my God—gold for the gold articles, silver for the silver, bronze for the bronze, iron for the iron, and wood for the wood, as well as onyx for the settings, turquoise, stones of various colors, all kinds of precious stones, and slabs of marble—all in abundance."
        },
        {
          "reference": "Isaiah 54:11-12",
          "text": "“O afflicted city, lashed by storms, without solace, surely I will set your stones in antimony and lay your foundations with sapphires. / I will make your pinnacles of rubies, your gates of sparkling jewels, and all your walls of precious stones."
        },
        {
          "reference": "Matthew 2:11",
          "text": "On coming to the house, they saw the Child with His mother Mary, and they fell down and worshiped Him. Then they opened their treasures and presented Him with gifts of gold and frankincense and myrrh."
        },
        {
          "reference": "1 Timothy 6:17",
          "text": "Instruct those who are rich in the present age not to be conceited and not to put their hope in the uncertainty of wealth, but in God, who richly provides all things for us to enjoy."
        },
        {
          "reference": "James 5:3",
          "text": "Your gold and silver are corroded. Their corrosion will testify against you and consume your flesh like fire. You have hoarded treasure in the last days."
        },
        {
          "reference": "Revelation 18:12",
          "text": "cargo of gold, silver, precious stones, and pearls; of fine linen, purple, silk, and scarlet; of all kinds of citron wood and every article of ivory, precious wood, bronze, iron, and marble;"
        },
        {
          "reference": "Proverbs 3:14-15",
          "text": "for she is more profitable than silver, and her gain is better than fine gold. / She is more precious than rubies; nothing you desire compares with her."
        }
      ]
    },
    {
      "reference": "Genesis 2:13",
      "book": "Genesis",
      "chapter": 2,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "The name of the second river is the Gihon; it winds through the entire land of Cush."
        },
        {
          "version": "NLT",
          "text": "The second branch, called the Gihon, flowed around the entire land of Cush."
        },
        {
          "version": "ESV",
          "text": "The name of the second river is the Gihon. It is the one that flowed around the whole land of Cush."
        },
        {
          "version": "NKJV",
          "text": "The name of the second river is Gihon; it is the one which goes around the whole land of Cush."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 9:14",
          "text": "saying to the sixth angel with the trumpet, “Release the four angels who are bound at the great river Euphrates.”"
        },
        {
          "reference": "Daniel 10:4",
          "text": "On the twenty-fourth day of the first month, as I was standing on the bank of the great river, the Tigris,"
        },
        {
          "reference": "Ezekiel 29:3-5",
          "text": "Speak to him and tell him that this is what the Lord GOD says: Behold, I am against you, O Pharaoh king of Egypt, O great monster who lies among his rivers, who says, ‘The Nile is mine; I made it myself.’ / But I will put hooks in your jaws and cause the fish of your streams to cling to your scales. I will haul you up out of your rivers, and all the fish of your streams will cling to your scales. / I will leave you in the desert, you and all the fish of your streams. You will fall on the open field and will not be taken away or gathered for burial. I have given you as food to the beasts of the earth and the birds of the air."
        },
        {
          "reference": "Isaiah 11:15",
          "text": "The LORD will devote to destruction the gulf of the Sea of Egypt; with a scorching wind He will sweep His hand over the Euphrates. He will split it into seven streams for men to cross with dry sandals."
        },
        {
          "reference": "Isaiah 19:5-10",
          "text": "The waters of the Nile will dry up, and the riverbed will be parched and empty. / The canals will stink; the streams of Egypt will trickle and dry up; the reeds and rushes will wither. / The bulrushes by the Nile, by the mouth of the river, and all the fields sown along the Nile, will wither, blow away, and be no more. ..."
        },
        {
          "reference": "Isaiah 27:12",
          "text": "In that day the LORD will thresh from the flowing Euphrates to the Wadi of Egypt, and you, O Israelites, will be gathered one by one."
        },
        {
          "reference": "Jeremiah 46:7-8",
          "text": "Who is this, rising like the Nile, like rivers whose waters churn? / Egypt rises like the Nile, and its waters churn like rivers, boasting, ‘I will rise and cover the earth; I will destroy the cities and their people.’"
        },
        {
          "reference": "Ezekiel 30:12",
          "text": "I will make the streams dry up and sell the land to the wicked. By the hands of foreigners I will bring desolation upon the land and everything in it. I, the LORD, have spoken."
        },
        {
          "reference": "Ezekiel 31:15",
          "text": "This is what the Lord GOD says: ‘On the day it was brought down to Sheol, I caused mourning. I covered the deep because of it; I held back its rivers; its abundant waters were restrained. I made Lebanon mourn for it, and all the trees of the field fainted because of it."
        },
        {
          "reference": "Ezekiel 32:2",
          "text": "“Son of man, take up a lament for Pharaoh king of Egypt and say to him: ‘You are like a lion among the nations; you are like a monster in the seas. You thrash about in your rivers, churning up the waters with your feet and muddying the streams.’"
        },
        {
          "reference": "Ezekiel 47:18",
          "text": "On the east side the border will run between Hauran and Damascus, along the Jordan between Gilead and the land of Israel, to the Eastern Sea and as far as Tamar. This will be the eastern boundary."
        },
        {
          "reference": "Zechariah 10:11",
          "text": "They will pass through the sea of distress and strike the waves of the sea; all the depths of the Nile will dry up. The pride of Assyria will be brought down, and the scepter of Egypt will depart."
        },
        {
          "reference": "Psalm 66:6",
          "text": "He turned the sea into dry land; they passed through the waters on foot; there we rejoiced in Him."
        },
        {
          "reference": "Psalm 74:15",
          "text": "You broke open the fountain and the flood; You dried up the ever-flowing rivers."
        },
        {
          "reference": "Psalm 105:41",
          "text": "He opened a rock, and water gushed out; it flowed like a river in the desert."
        }
      ]
    },
    {
      "reference": "Genesis 2:14",
      "book": "Genesis",
      "chapter": 2,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "The name of the third river is the Tigris; it runs along the east side of Ashur. And the fourth river is the Euphrates."
        },
        {
          "version": "NLT",
          "text": "The third branch, called the Tigris, flowed east of the land of Asshur. The fourth branch is called the Euphrates."
        },
        {
          "version": "ESV",
          "text": "And the name of the third river is the Tigris, which flows east of Assyria. And the fourth river is the Euphrates."
        },
        {
          "version": "NKJV",
          "text": "The name of the third river is Hiddekel; it is the one which goes toward the east of Assyria. The fourth river is the Euphrates."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 22:1-2",
          "text": "Then the angel showed me a river of the water of life, as clear as crystal, flowing from the throne of God and of the Lamb / down the middle of the main street of the city. On either side of the river stood a tree of life, bearing twelve kinds of fruit and yielding a fresh crop for each month. And the leaves of the tree are for the healing of the nations."
        },
        {
          "reference": "Ezekiel 47:1-12",
          "text": "Then the man brought me back to the entrance of the temple, and I saw water flowing from under the threshold of the temple toward the east (for the temple faced east). The water was coming down from under the south side of the temple, south of the altar. / Next he brought me out through the north gate and led me around the outside to the outer gate facing east, and there I saw the water trickling out from the south side. / As the man went eastward with a measuring line in his hand, he measured off a thousand cubits and led me through ankle-deep water. ..."
        },
        {
          "reference": "Daniel 10:4",
          "text": "On the twenty-fourth day of the first month, as I was standing on the bank of the great river, the Tigris,"
        },
        {
          "reference": "Psalm 46:4",
          "text": "There is a river whose streams delight the city of God, the holy place where the Most High dwells."
        },
        {
          "reference": "Isaiah 11:15",
          "text": "The LORD will devote to destruction the gulf of the Sea of Egypt; with a scorching wind He will sweep His hand over the Euphrates. He will split it into seven streams for men to cross with dry sandals."
        },
        {
          "reference": "Isaiah 19:5-10",
          "text": "The waters of the Nile will dry up, and the riverbed will be parched and empty. / The canals will stink; the streams of Egypt will trickle and dry up; the reeds and rushes will wither. / The bulrushes by the Nile, by the mouth of the river, and all the fields sown along the Nile, will wither, blow away, and be no more. ..."
        },
        {
          "reference": "2 Kings 5:12",
          "text": "Are not the Abanah and Pharpar, the rivers of Damascus, better than all the waters of Israel? Could I not have washed in them and been cleansed?” So he turned and went away in a rage."
        },
        {
          "reference": "Psalm 72:8",
          "text": "May he rule from sea to sea, and from the Euphrates to the ends of the earth."
        },
        {
          "reference": "Isaiah 8:7",
          "text": "the Lord will surely bring against them the mighty floodwaters of the Euphrates—the king of Assyria and all his pomp. It will overflow its channels and overrun its banks."
        },
        {
          "reference": "Isaiah 27:12",
          "text": "In that day the LORD will thresh from the flowing Euphrates to the Wadi of Egypt, and you, O Israelites, will be gathered one by one."
        },
        {
          "reference": "Isaiah 37:25",
          "text": "I have dug wells and drunk foreign waters. With the soles of my feet I have dried up all the streams of Egypt.”"
        },
        {
          "reference": "Isaiah 43:2",
          "text": "When you pass through the waters, I will be with you; and when you go through the rivers, they will not overwhelm you. When you walk through the fire, you will not be scorched; the flames will not set you ablaze."
        },
        {
          "reference": "Isaiah 44:27",
          "text": "who says to the depths of the sea, ‘Be dry, and I will dry up your currents,’"
        },
        {
          "reference": "Isaiah 50:2",
          "text": "Why was no one there when I arrived? Why did no one answer when I called? Is My hand too short to redeem you? Or do I lack the strength to deliver you? Behold, My rebuke dries up the sea; I turn the rivers into a desert; the fish rot for lack of water and die of thirst."
        },
        {
          "reference": "Isaiah 66:12",
          "text": "For this is what the LORD says: “I will extend peace to her like a river, and the wealth of nations like a flowing stream; you will nurse and be carried on her arm, and bounced upon her knees."
        }
      ]
    },
    {
      "reference": "Genesis 2:15",
      "book": "Genesis",
      "chapter": 2,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "The LORD God took the man and put him in the Garden of Eden to work it and take care of it."
        },
        {
          "version": "NLT",
          "text": "The LORD God placed the man in the Garden of Eden to tend and watch over it."
        },
        {
          "version": "ESV",
          "text": "The LORD God took the man and put him in the garden of Eden to work it and keep it."
        },
        {
          "version": "NKJV",
          "text": "Then the LORD God took the man and put him in the garden of Eden to tend and keep it."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 1:28",
          "text": "God blessed them and said to them, “Be fruitful and multiply, and fill the earth and subdue it; rule over the fish of the sea and the birds of the air and every creature that crawls upon the earth.”"
        },
        {
          "reference": "Genesis 3:23",
          "text": "Therefore the LORD God banished him from the Garden of Eden to work the ground from which he had been taken."
        },
        {
          "reference": "Numbers 18:7",
          "text": "But only you and your sons shall attend to your priesthood for everything concerning the altar and what is inside the veil, and you are to perform that service. I am giving you the work of the priesthood as a gift, but any outsider who comes near the sanctuary must be put to death.”"
        },
        {
          "reference": "Deuteronomy 5:33",
          "text": "You must walk in all the ways that the LORD your God has commanded you, so that you may live and prosper and prolong your days in the land that you will possess."
        },
        {
          "reference": "Deuteronomy 11:13-15",
          "text": "So if you carefully obey the commandments I am giving you today, to love the LORD your God and to serve Him with all your heart and with all your soul, / then I will provide rain for your land in season, the autumn and spring rains, that you may gather your grain, new wine, and oil. / And I will provide grass in the fields for your livestock, and you will eat and be satisfied."
        },
        {
          "reference": "Psalm 104:14",
          "text": "He makes the grass grow for the livestock and provides crops for man to cultivate, bringing forth food from the earth:"
        },
        {
          "reference": "Psalm 115:16",
          "text": "The highest heavens belong to the LORD, but the earth He has given to mankind."
        },
        {
          "reference": "Proverbs 12:11",
          "text": "The one who works his land will have plenty of food, but whoever chases fantasies lacks judgment."
        },
        {
          "reference": "Isaiah 58:11",
          "text": "The LORD will always guide you; He will satisfy you in a sun-scorched land and strengthen your frame. You will be like a well-watered garden, like a spring whose waters never fail."
        },
        {
          "reference": "Jeremiah 29:5",
          "text": "“Build houses and settle down. Plant gardens and eat their produce."
        },
        {
          "reference": "Ezekiel 36:34-36",
          "text": "The desolate land will be cultivated instead of lying desolate in the sight of all who pass through. / Then they will say, ‘This land that was desolate has become like the garden of Eden. The cities that were once ruined, desolate, and destroyed are now fortified and inhabited.’ / Then the nations around you that remain will know that I, the LORD, have rebuilt what was destroyed, and I have replanted what was desolate. I, the LORD, have spoken, and I will do it."
        },
        {
          "reference": "Matthew 25:21",
          "text": "His master replied, ‘Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things. Enter into the joy of your master!’"
        },
        {
          "reference": "Luke 12:42-44",
          "text": "And the Lord answered, “Who then is the faithful and wise manager, whom the master puts in charge of his servants to give them their portion at the proper time? / Blessed is that servant whose master finds him doing so when he returns. / Truly I tell you, he will put him in charge of all his possessions."
        },
        {
          "reference": "John 15:1-2",
          "text": "“I am the true vine, and My Father is the keeper of the vineyard. / He cuts off every branch in Me that bears no fruit, and every branch that does bear fruit, He prunes to make it even more fruitful."
        },
        {
          "reference": "Romans 8:20-22",
          "text": "For the creation was subjected to futility, not by its own will, but because of the One who subjected it, in hope / that the creation itself will be set free from its bondage to decay and brought into the glorious freedom of the children of God. / We know that the whole creation has been groaning together in the pains of childbirth until the present time."
        }
      ]
    },
    {
      "reference": "Genesis 2:16",
      "book": "Genesis",
      "chapter": 2,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "And the LORD God commanded the man, “You are free to eat from any tree in the garden;"
        },
        {
          "version": "NLT",
          "text": "But the LORD God warned him, “You may freely eat the fruit of every tree in the garden—"
        },
        {
          "version": "ESV",
          "text": "And the LORD God commanded the man, saying, “You may surely eat of every tree of the garden,"
        },
        {
          "version": "NKJV",
          "text": "And the LORD God commanded the man, saying, “Of every tree of the garden you may freely eat;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 3:1-3",
          "text": "Now the serpent was more crafty than any beast of the field that the LORD God had made. And he said to the woman, “Did God really say, ‘You must not eat from any tree in the garden?’” / The woman answered the serpent, “We may eat the fruit of the trees of the garden, / but about the fruit of the tree in the middle of the garden, God has said, ‘You must not eat of it or touch it, or you will die.’”"
        },
        {
          "reference": "Genesis 3:11",
          "text": "“Who told you that you were naked?” asked the LORD God. “Have you eaten from the tree of which I commanded you not to eat?”"
        },
        {
          "reference": "Genesis 3:17",
          "text": "And to Adam He said: “Because you have listened to the voice of your wife and have eaten from the tree of which I commanded you not to eat, cursed is the ground because of you; through toil you will eat of it all the days of your life."
        },
        {
          "reference": "Deuteronomy 30:19",
          "text": "I call heaven and earth as witnesses against you today that I have set before you life and death, blessing and cursing. Therefore choose life, so that you and your descendants may live,"
        },
        {
          "reference": "Ezekiel 18:4",
          "text": "Behold, every soul belongs to Me; both father and son are Mine. The soul who sins is the one who will die."
        },
        {
          "reference": "Ezekiel 18:20",
          "text": "The soul who sins is the one who will die. A son will not bear the iniquity of his father, and a father will not bear the iniquity of his son. The righteousness of the righteous man will fall upon him, and the wickedness of the wicked man will fall upon him."
        },
        {
          "reference": "Romans 5:12",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned."
        },
        {
          "reference": "Romans 5:17",
          "text": "For if, by the trespass of the one man, death reigned through that one man, how much more will those who receive the abundance of grace and of the gift of righteousness reign in life through the one man, Jesus Christ!"
        },
        {
          "reference": "Romans 6:23",
          "text": "For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord."
        },
        {
          "reference": "1 Corinthians 15:21-22",
          "text": "For since death came through a man, the resurrection of the dead comes also through a man. / For as in Adam all die, so in Christ all will be made alive."
        },
        {
          "reference": "1 Corinthians 15:45",
          "text": "So it is written: “The first man Adam became a living being”; the last Adam a life-giving spirit."
        },
        {
          "reference": "James 1:14-15",
          "text": "But each one is tempted when by his own evil desires he is lured away and enticed. / Then after desire has conceived, it gives birth to sin; and sin, when it is full-grown, gives birth to death."
        },
        {
          "reference": "Revelation 2:7",
          "text": "He who has an ear, let him hear what the Spirit says to the churches. To the one who overcomes, I will grant the right to eat from the tree of life in the Paradise of God."
        },
        {
          "reference": "Revelation 22:14",
          "text": "Blessed are those who wash their robes, so that they may have the right to the tree of life and may enter the city by its gates."
        },
        {
          "reference": "Matthew 4:4",
          "text": "But Jesus answered, “It is written: ‘Man shall not live on bread alone, but on every word that comes from the mouth of God.’”"
        }
      ]
    },
    {
      "reference": "Genesis 2:17",
      "book": "Genesis",
      "chapter": 2,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "but you must not eat from the tree of the knowledge of good and evil, for when you eat from it you will certainly die.”"
        },
        {
          "version": "NLT",
          "text": "except the tree of the knowledge of good and evil. If you eat its fruit, you are sure to die.”"
        },
        {
          "version": "ESV",
          "text": "but of the tree of the knowledge of good and evil you shall not eat, for in the day that you eat of it you shall surely die.”"
        },
        {
          "version": "NKJV",
          "text": "but of the tree of the knowledge of good and evil you shall not eat, for in the day that you eat of it you shall surely die.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 6:23",
          "text": "For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord."
        },
        {
          "reference": "James 1:15",
          "text": "Then after desire has conceived, it gives birth to sin; and sin, when it is full-grown, gives birth to death."
        },
        {
          "reference": "Ezekiel 18:4",
          "text": "Behold, every soul belongs to Me; both father and son are Mine. The soul who sins is the one who will die."
        },
        {
          "reference": "1 Corinthians 15:21-22",
          "text": "For since death came through a man, the resurrection of the dead comes also through a man. / For as in Adam all die, so in Christ all will be made alive."
        },
        {
          "reference": "Romans 5:12",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned."
        },
        {
          "reference": "Revelation 21:8",
          "text": "But to the cowardly and unbelieving and abominable and murderers and sexually immoral and sorcerers and idolaters and all liars, their place will be in the lake that burns with fire and sulfur. This is the second death.”"
        },
        {
          "reference": "Deuteronomy 30:15-19",
          "text": "See, I have set before you today life and prosperity, as well as death and disaster. / For I am commanding you today to love the LORD your God, to walk in His ways, and to keep His commandments, statutes, and ordinances, so that you may live and increase, and the LORD your God may bless you in the land that you are entering to possess. / But if your heart turns away and you do not listen, but are drawn away to bow down to other gods and worship them, ..."
        },
        {
          "reference": "Proverbs 11:19",
          "text": "Genuine righteousness leads to life, but the pursuit of evil brings death."
        },
        {
          "reference": "John 8:44",
          "text": "You belong to your father, the devil, and you want to carry out his desires. He was a murderer from the beginning, refusing to uphold the truth, because there is no truth in him. When he lies, he speaks his native language, because he is a liar and the father of lies."
        },
        {
          "reference": "1 John 3:4",
          "text": "Everyone who practices sin practices lawlessness as well. Indeed, sin is lawlessness."
        },
        {
          "reference": "Hosea 13:14",
          "text": "I will ransom them from the power of Sheol; I will redeem them from Death. Where, O Death, are your plagues? Where, O Sheol, is your sting? Compassion is hidden from My eyes."
        },
        {
          "reference": "1 Timothy 5:6",
          "text": "But she who lives for pleasure is dead even while she is still alive."
        },
        {
          "reference": "Matthew 7:13-14",
          "text": "Enter through the narrow gate. For wide is the gate and broad is the way that leads to destruction, and many enter through it. / But small is the gate and narrow the way that leads to life, and only a few find it."
        },
        {
          "reference": "Isaiah 3:11",
          "text": "Woe to the wicked; disaster is upon them! For they will be repaid with what their hands have done."
        },
        {
          "reference": "Galatians 6:8",
          "text": "The one who sows to please his flesh, from the flesh will reap destruction; but the one who sows to please the Spirit, from the Spirit will reap eternal life."
        }
      ]
    },
    {
      "reference": "Genesis 2:18",
      "book": "Genesis",
      "chapter": 2,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "The LORD God said, “It is not good for the man to be alone. I will make a helper suitable for him.”"
        },
        {
          "version": "NLT",
          "text": "Then the LORD God said, “It is not good for the man to be alone. I will make a helper who is just right for him.”"
        },
        {
          "version": "ESV",
          "text": "Then the LORD God said, “It is not good that the man should be alone; I will make him a helper fit for him.”"
        },
        {
          "version": "NKJV",
          "text": "And the LORD God said, “ It is not good that man should be alone; I will make him a helper comparable to him.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Ecclesiastes 4:9-12",
          "text": "Two are better than one, because they have a good return for their labor. / For if one falls down, his companion can lift him up; but pity the one who falls without another to help him up! / Again, if two lie down together, they will keep warm; but how can one keep warm alone? ..."
        },
        {
          "reference": "1 Corinthians 11:9",
          "text": "Neither was man created for woman, but woman for man."
        },
        {
          "reference": "Ephesians 5:22-33",
          "text": "Wives, submit to your husbands as to the Lord. / For the husband is the head of the wife as Christ is the head of the church, His body, of which He is the Savior. / Now as the church submits to Christ, so also wives should submit to their husbands in everything. ..."
        },
        {
          "reference": "Proverbs 18:22",
          "text": "He who finds a wife finds a good thing and obtains favor from the LORD."
        },
        {
          "reference": "1 Peter 3:7",
          "text": "Husbands, in the same way, treat your wives with consideration as a delicate vessel, and with honor as fellow heirs of the gracious gift of life, so that your prayers will not be hindered."
        },
        {
          "reference": "1 Corinthians 7:2",
          "text": "But because there is so much sexual immorality, each man should have his own wife, and each woman her own husband."
        },
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Mark 10:6-9",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh. ..."
        },
        {
          "reference": "1 Timothy 2:13",
          "text": "For Adam was formed first, and then Eve."
        },
        {
          "reference": "Colossians 3:18-19",
          "text": "Wives, submit to your husbands, as is fitting in the Lord. / Husbands, love your wives and do not be harsh with them."
        },
        {
          "reference": "1 Corinthians 11:11-12",
          "text": "In the Lord, however, woman is not independent of man, nor is man independent of woman. / For just as woman came from man, so also man is born of woman. But everything comes from God."
        },
        {
          "reference": "1 Corinthians 7:10-11",
          "text": "To the married I give this command (not I, but the Lord): A wife must not separate from her husband. / But if she does, she must remain unmarried or else be reconciled to her husband. And a husband must not divorce his wife."
        },
        {
          "reference": "Malachi 2:14-16",
          "text": "Yet you ask, “Why?” It is because the LORD has been a witness between you and the wife of your youth, against whom you have broken faith, though she is your companion and your wife by covenant. / Has not the LORD made them one, having a portion of the Spirit? And why one? Because He seeks godly offspring. So guard yourselves in your spirit and do not break faith with the wife of your youth. / “For I hate divorce,” says the LORD, the God of Israel. “He who divorces his wife covers his garment with violence,” says the LORD of Hosts. So guard yourselves in your spirit and do not break faith."
        },
        {
          "reference": "Ruth 1:9",
          "text": "May the LORD enable each of you to find rest in the home of your new husband.” And she kissed them as they wept aloud"
        },
        {
          "reference": "Song of Solomon 4:9-10",
          "text": "You have captured my heart, my sister, my bride; you have stolen my heart with one glance of your eyes, with one jewel of your neck. / How delightful is your love, my sister, my bride! Your love is much better than wine, and the fragrance of your perfume than all spices."
        }
      ]
    },
    {
      "reference": "Genesis 2:19",
      "book": "Genesis",
      "chapter": 2,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "Now the LORD God had formed out of the ground all the wild animals and all the birds in the sky. He brought them to the man to see what he would name them; and whatever the man called each living creature, that was its name."
        },
        {
          "version": "NLT",
          "text": "So the LORD God formed from the ground all the wild animals and all the birds of the sky. He brought them to the man to see what he would call them, and the man chose a name for each one."
        },
        {
          "version": "ESV",
          "text": "Now out of the ground the LORD God had formed every beast of the field and every bird of the heavens and brought them to the man to see what he would call them. And whatever the man called every living creature, that was its name."
        },
        {
          "version": "NKJV",
          "text": "Out of the ground the LORD God formed every beast of the field and every bird of the air, and brought them to Adam to see what he would call them. And whatever Adam called each living creature, that was its name."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 1:26-28",
          "text": "Then God said, “Let Us make man in Our image, after Our likeness, to rule over the fish of the sea and the birds of the air, over the livestock, and over all the earth itself and every creature that crawls upon it.” / So God created man in His own image; in the image of God He created him; male and female He created them. / God blessed them and said to them, “Be fruitful and multiply, and fill the earth and subdue it; rule over the fish of the sea and the birds of the air and every creature that crawls upon the earth.”"
        },
        {
          "reference": "Psalm 8:6-8",
          "text": "You made him ruler of the works of Your hands; You have placed everything under his feet: / all sheep and oxen, and even the beasts of the field, / the birds of the air and the fish of the sea, all that swim the paths of the seas."
        },
        {
          "reference": "James 3:7",
          "text": "All kinds of animals, birds, reptiles, and creatures of the sea are being tamed and have been tamed by man,"
        },
        {
          "reference": "Isaiah 43:20",
          "text": "The beasts of the field will honor Me, the jackals and the ostriches, because I provide water in the wilderness and rivers in the desert, to give drink to My chosen people."
        },
        {
          "reference": "Job 12:7-10",
          "text": "But ask the animals, and they will instruct you; ask the birds of the air, and they will tell you. / Or speak to the earth, and it will teach you; let the fish of the sea inform you. / Which of all these does not know that the hand of the LORD has done this? ..."
        },
        {
          "reference": "Romans 8:19-22",
          "text": "The creation waits in eager expectation for the revelation of the sons of God. / For the creation was subjected to futility, not by its own will, but because of the One who subjected it, in hope / that the creation itself will be set free from its bondage to decay and brought into the glorious freedom of the children of God. ..."
        },
        {
          "reference": "1 Corinthians 15:39",
          "text": "Not all flesh is the same: Men have one kind of flesh, animals have another, birds another, and fish another."
        },
        {
          "reference": "Hebrews 2:7-8",
          "text": "You made him a little lower than the angels; You crowned him with glory and honor / and placed everything under his feet.” When God subjected all things to him, He left nothing outside of his control. Yet at present we do not see everything subject to him."
        },
        {
          "reference": "Job 35:11",
          "text": "who teaches us more than the beasts of the earth and makes us wiser than the birds of the air?’"
        },
        {
          "reference": "Psalm 50:10-11",
          "text": "for every beast of the forest is Mine—the cattle on a thousand hills. / I know every bird in the mountains, and the creatures of the field are Mine."
        },
        {
          "reference": "Ecclesiastes 3:19-21",
          "text": "For the fates of both men and beasts are the same: As one dies, so dies the other—they all have the same breath. Man has no advantage over the animals, since everything is futile. / All go to one place; all come from dust, and all return to dust. / Who knows if the spirit of man rises upward and the spirit of the animal descends into the earth?"
        },
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Colossians 1:16",
          "text": "For in Him all things were created, things in heaven and on earth, visible and invisible, whether thrones or dominions or rulers or authorities. All things were created through Him and for Him."
        },
        {
          "reference": "Revelation 4:11",
          "text": "“Worthy are You, our Lord and God, to receive glory and honor and power, for You created all things; by Your will they exist and were created.”"
        },
        {
          "reference": "Matthew 6:26",
          "text": "Look at the birds of the air: They do not sow or reap or gather into barns, and yet your heavenly Father feeds them. Are you not much more valuable than they?"
        }
      ]
    },
    {
      "reference": "Genesis 2:20",
      "book": "Genesis",
      "chapter": 2,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "So the man gave names to all the livestock, the birds in the sky and all the wild animals. But for Adam no suitable helper was found."
        },
        {
          "version": "NLT",
          "text": "He gave names to all the livestock, all the birds of the sky, and all the wild animals. But still there was no helper just right for him."
        },
        {
          "version": "ESV",
          "text": "The man gave names to all livestock and to the birds of the heavens and to every beast of the field. But for Adam there was not found a helper fit for him."
        },
        {
          "version": "NKJV",
          "text": "So Adam gave names to all cattle, to the birds of the air, and to every beast of the field. But for Adam there was not found a helper comparable to him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 1:26-28",
          "text": "Then God said, “Let Us make man in Our image, after Our likeness, to rule over the fish of the sea and the birds of the air, over the livestock, and over all the earth itself and every creature that crawls upon it.” / So God created man in His own image; in the image of God He created him; male and female He created them. / God blessed them and said to them, “Be fruitful and multiply, and fill the earth and subdue it; rule over the fish of the sea and the birds of the air and every creature that crawls upon the earth.”"
        },
        {
          "reference": "Genesis 1:20-25",
          "text": "And God said, “Let the waters teem with living creatures, and let birds fly above the earth in the open expanse of the sky.” / So God created the great sea creatures and every living thing that moves, with which the waters teemed according to their kinds, and every winged bird after its kind. And God saw that it was good. / Then God blessed them and said, “Be fruitful and multiply and fill the waters of the seas, and let birds multiply on the earth.” ..."
        },
        {
          "reference": "Genesis 5:2",
          "text": "Male and female He created them, and He blessed them. And in the day they were created, He called them “man.”"
        },
        {
          "reference": "Genesis 9:2",
          "text": "The fear and dread of you will fall on every living creature on the earth, every bird of the air, every creature that crawls on the ground, and all the fish of the sea. They are delivered into your hand."
        },
        {
          "reference": "Psalm 8:6-8",
          "text": "You made him ruler of the works of Your hands; You have placed everything under his feet: / all sheep and oxen, and even the beasts of the field, / the birds of the air and the fish of the sea, all that swim the paths of the seas."
        },
        {
          "reference": "Job 12:7-10",
          "text": "But ask the animals, and they will instruct you; ask the birds of the air, and they will tell you. / Or speak to the earth, and it will teach you; let the fish of the sea inform you. / Which of all these does not know that the hand of the LORD has done this? ..."
        },
        {
          "reference": "1 Corinthians 15:39",
          "text": "Not all flesh is the same: Men have one kind of flesh, animals have another, birds another, and fish another."
        },
        {
          "reference": "Romans 8:19-22",
          "text": "The creation waits in eager expectation for the revelation of the sons of God. / For the creation was subjected to futility, not by its own will, but because of the One who subjected it, in hope / that the creation itself will be set free from its bondage to decay and brought into the glorious freedom of the children of God. ..."
        },
        {
          "reference": "Hebrews 2:6-8",
          "text": "But somewhere it is testified in these words: “What is man that You are mindful of him, or the son of man that You care for him? / You made him a little lower than the angels; You crowned him with glory and honor / and placed everything under his feet.” When God subjected all things to him, He left nothing outside of his control. Yet at present we do not see everything subject to him."
        },
        {
          "reference": "James 3:7",
          "text": "All kinds of animals, birds, reptiles, and creatures of the sea are being tamed and have been tamed by man,"
        },
        {
          "reference": "Isaiah 43:20",
          "text": "The beasts of the field will honor Me, the jackals and the ostriches, because I provide water in the wilderness and rivers in the desert, to give drink to My chosen people."
        },
        {
          "reference": "Hosea 2:18",
          "text": "On that day I will make a covenant for them with the beasts of the field and the birds of the air and the creatures that crawl on the ground. And I will abolish bow and sword and battle in the land, and will make them lie down in safety."
        },
        {
          "reference": "Acts 17:26",
          "text": "From one man He made every nation of men, that they should inhabit the whole earth; and He determined their appointed times and the boundaries of their lands."
        },
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Mark 10:6-9",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh. ..."
        }
      ]
    },
    {
      "reference": "Genesis 2:21",
      "book": "Genesis",
      "chapter": 2,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "So the LORD God caused the man to fall into a deep sleep; and while he was sleeping, he took one of the man’s ribs and then closed up the place with flesh."
        },
        {
          "version": "NLT",
          "text": "So the LORD God caused the man to fall into a deep sleep. While the man slept, the LORD God took out one of the man’s ribs and closed up the opening."
        },
        {
          "version": "ESV",
          "text": "So the LORD God caused a deep sleep to fall upon the man, and while he slept took one of his ribs and closed up its place with flesh."
        },
        {
          "version": "NKJV",
          "text": "And the LORD God caused a deep sleep to fall on Adam, and he slept; and He took one of his ribs, and closed up the flesh in its place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 1:27",
          "text": "So God created man in His own image; in the image of God He created him; male and female He created them."
        },
        {
          "reference": "Genesis 5:2",
          "text": "Male and female He created them, and He blessed them. And in the day they were created, He called them “man.”"
        },
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Mark 10:6-8",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh."
        },
        {
          "reference": "1 Corinthians 11:8-9",
          "text": "For man did not come from woman, but woman from man. / Neither was man created for woman, but woman for man."
        },
        {
          "reference": "Ephesians 5:28-31",
          "text": "In the same way, husbands ought to love their wives as their own bodies. He who loves his wife loves himself. / Indeed, no one ever hated his own body, but he nourishes and cherishes it, just as Christ does the church. / For we are members of His body. ..."
        },
        {
          "reference": "1 Timothy 2:13",
          "text": "For Adam was formed first, and then Eve."
        },
        {
          "reference": "1 Corinthians 15:45",
          "text": "So it is written: “The first man Adam became a living being”; the last Adam a life-giving spirit."
        },
        {
          "reference": "Romans 5:14",
          "text": "Nevertheless, death reigned from Adam until Moses, even over those who did not sin in the way that Adam transgressed. He is a pattern of the One to come."
        },
        {
          "reference": "1 Corinthians 6:16",
          "text": "Or don’t you know that he who unites himself with a prostitute is one with her in body? For it is said, “The two will become one flesh.”"
        },
        {
          "reference": "1 Corinthians 7:2",
          "text": "But because there is so much sexual immorality, each man should have his own wife, and each woman her own husband."
        },
        {
          "reference": "1 Peter 3:7",
          "text": "Husbands, in the same way, treat your wives with consideration as a delicate vessel, and with honor as fellow heirs of the gracious gift of life, so that your prayers will not be hindered."
        },
        {
          "reference": "Psalm 139:14",
          "text": "I praise You, for I am fearfully and wonderfully made. Marvelous are Your works, and I know this very well."
        },
        {
          "reference": "Job 33:6",
          "text": "I am just like you before God; I was also formed from clay."
        },
        {
          "reference": "Malachi 2:15",
          "text": "Has not the LORD made them one, having a portion of the Spirit? And why one? Because He seeks godly offspring. So guard yourselves in your spirit and do not break faith with the wife of your youth."
        }
      ]
    },
    {
      "reference": "Genesis 2:22",
      "book": "Genesis",
      "chapter": 2,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the LORD God made a woman from the rib he had taken out of the man, and he brought her to the man."
        },
        {
          "version": "NLT",
          "text": "Then the LORD God made a woman from the rib, and he brought her to the man."
        },
        {
          "version": "ESV",
          "text": "And the rib that the LORD God had taken from the man he made into a woman and brought her to the man."
        },
        {
          "version": "NKJV",
          "text": "Then the rib which the LORD God had taken from man He made into a woman, and He brought her to the man."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Ephesians 5:31-32",
          "text": "“For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh.” / This mystery is profound, but I am speaking about Christ and the church."
        },
        {
          "reference": "1 Corinthians 11:8-9",
          "text": "For man did not come from woman, but woman from man. / Neither was man created for woman, but woman for man."
        },
        {
          "reference": "Mark 10:6-9",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh. ..."
        },
        {
          "reference": "1 Timothy 2:13",
          "text": "For Adam was formed first, and then Eve."
        },
        {
          "reference": "1 Corinthians 6:16",
          "text": "Or don’t you know that he who unites himself with a prostitute is one with her in body? For it is said, “The two will become one flesh.”"
        },
        {
          "reference": "Genesis 1:27",
          "text": "So God created man in His own image; in the image of God He created him; male and female He created them."
        },
        {
          "reference": "Genesis 5:2",
          "text": "Male and female He created them, and He blessed them. And in the day they were created, He called them “man.”"
        },
        {
          "reference": "Malachi 2:15",
          "text": "Has not the LORD made them one, having a portion of the Spirit? And why one? Because He seeks godly offspring. So guard yourselves in your spirit and do not break faith with the wife of your youth."
        },
        {
          "reference": "Proverbs 18:22",
          "text": "He who finds a wife finds a good thing and obtains favor from the LORD."
        },
        {
          "reference": "1 Peter 3:7",
          "text": "Husbands, in the same way, treat your wives with consideration as a delicate vessel, and with honor as fellow heirs of the gracious gift of life, so that your prayers will not be hindered."
        },
        {
          "reference": "1 Corinthians 7:2-4",
          "text": "But because there is so much sexual immorality, each man should have his own wife, and each woman her own husband. / The husband should fulfill his marital duty to his wife, and likewise the wife to her husband. / The wife does not have authority over her own body, but the husband. Likewise the husband does not have authority over his own body, but the wife."
        },
        {
          "reference": "Colossians 3:18-19",
          "text": "Wives, submit to your husbands, as is fitting in the Lord. / Husbands, love your wives and do not be harsh with them."
        },
        {
          "reference": "Song of Solomon 4:9-10",
          "text": "You have captured my heart, my sister, my bride; you have stolen my heart with one glance of your eyes, with one jewel of your neck. / How delightful is your love, my sister, my bride! Your love is much better than wine, and the fragrance of your perfume than all spices."
        },
        {
          "reference": "Genesis 3:20",
          "text": "And Adam named his wife Eve, because she would be the mother of all the living."
        }
      ]
    },
    {
      "reference": "Genesis 2:23",
      "book": "Genesis",
      "chapter": 2,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "The man said, “This is now bone of my bones and flesh of my flesh; she shall be called ‘woman,’ for she was taken out of man.”"
        },
        {
          "version": "NLT",
          "text": "“At last!” the man exclaimed. “This one is bone from my bone, and flesh from my flesh! She will be called ‘woman,’ because she was taken from ‘man.’”"
        },
        {
          "version": "ESV",
          "text": "Then the man said, “This at last is bone of my bones and flesh of my flesh; she shall be called Woman, because she was taken out of Man.”"
        },
        {
          "version": "NKJV",
          "text": "And Adam said: “This is now bone of my bones And flesh of my flesh; She shall be called Woman, Because she was taken out of Man.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Ephesians 5:28-31",
          "text": "In the same way, husbands ought to love their wives as their own bodies. He who loves his wife loves himself. / Indeed, no one ever hated his own body, but he nourishes and cherishes it, just as Christ does the church. / For we are members of His body. ..."
        },
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "1 Corinthians 11:8-9",
          "text": "For man did not come from woman, but woman from man. / Neither was man created for woman, but woman for man."
        },
        {
          "reference": "1 Corinthians 6:16",
          "text": "Or don’t you know that he who unites himself with a prostitute is one with her in body? For it is said, “The two will become one flesh.”"
        },
        {
          "reference": "Mark 10:6-8",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh."
        },
        {
          "reference": "1 Timothy 2:13",
          "text": "For Adam was formed first, and then Eve."
        },
        {
          "reference": "1 Corinthians 7:2-4",
          "text": "But because there is so much sexual immorality, each man should have his own wife, and each woman her own husband. / The husband should fulfill his marital duty to his wife, and likewise the wife to her husband. / The wife does not have authority over her own body, but the husband. Likewise the husband does not have authority over his own body, but the wife."
        },
        {
          "reference": "1 Peter 3:7",
          "text": "Husbands, in the same way, treat your wives with consideration as a delicate vessel, and with honor as fellow heirs of the gracious gift of life, so that your prayers will not be hindered."
        },
        {
          "reference": "Romans 7:2",
          "text": "For instance, a married woman is bound by law to her husband as long as he lives. But if her husband dies, she is released from the law of marriage."
        },
        {
          "reference": "1 Corinthians 15:45-47",
          "text": "So it is written: “The first man Adam became a living being”; the last Adam a life-giving spirit. / The spiritual, however, was not first, but the natural, and then the spiritual. / The first man was of the dust of the earth, the second man from heaven."
        },
        {
          "reference": "Proverbs 18:22",
          "text": "He who finds a wife finds a good thing and obtains favor from the LORD."
        },
        {
          "reference": "Malachi 2:14-15",
          "text": "Yet you ask, “Why?” It is because the LORD has been a witness between you and the wife of your youth, against whom you have broken faith, though she is your companion and your wife by covenant. / Has not the LORD made them one, having a portion of the Spirit? And why one? Because He seeks godly offspring. So guard yourselves in your spirit and do not break faith with the wife of your youth."
        },
        {
          "reference": "Song of Solomon 4:9-10",
          "text": "You have captured my heart, my sister, my bride; you have stolen my heart with one glance of your eyes, with one jewel of your neck. / How delightful is your love, my sister, my bride! Your love is much better than wine, and the fragrance of your perfume than all spices."
        },
        {
          "reference": "Ecclesiastes 4:9-12",
          "text": "Two are better than one, because they have a good return for their labor. / For if one falls down, his companion can lift him up; but pity the one who falls without another to help him up! / Again, if two lie down together, they will keep warm; but how can one keep warm alone? ..."
        },
        {
          "reference": "Genesis 1:27",
          "text": "So God created man in His own image; in the image of God He created him; male and female He created them."
        }
      ]
    },
    {
      "reference": "Genesis 2:24",
      "book": "Genesis",
      "chapter": 2,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "That is why a man leaves his father and mother and is united to his wife, and they become one flesh."
        },
        {
          "version": "NLT",
          "text": "This explains why a man leaves his father and mother and is joined to his wife, and the two are united into one."
        },
        {
          "version": "ESV",
          "text": "Therefore a man shall leave his father and his mother and hold fast to his wife, and they shall become one flesh."
        },
        {
          "version": "NKJV",
          "text": "Therefore a man shall leave his father and mother and be joined to his wife, and they shall become one flesh."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Ephesians 5:31-33",
          "text": "“For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh.” / This mystery is profound, but I am speaking about Christ and the church. / Nevertheless, each one of you also must love his wife as he loves himself, and the wife must respect her husband."
        },
        {
          "reference": "Mark 10:6-9",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh. ..."
        },
        {
          "reference": "1 Corinthians 6:16",
          "text": "Or don’t you know that he who unites himself with a prostitute is one with her in body? For it is said, “The two will become one flesh.”"
        },
        {
          "reference": "1 Corinthians 7:2-4",
          "text": "But because there is so much sexual immorality, each man should have his own wife, and each woman her own husband. / The husband should fulfill his marital duty to his wife, and likewise the wife to her husband. / The wife does not have authority over her own body, but the husband. Likewise the husband does not have authority over his own body, but the wife."
        },
        {
          "reference": "Malachi 2:14-16",
          "text": "Yet you ask, “Why?” It is because the LORD has been a witness between you and the wife of your youth, against whom you have broken faith, though she is your companion and your wife by covenant. / Has not the LORD made them one, having a portion of the Spirit? And why one? Because He seeks godly offspring. So guard yourselves in your spirit and do not break faith with the wife of your youth. / “For I hate divorce,” says the LORD, the God of Israel. “He who divorces his wife covers his garment with violence,” says the LORD of Hosts. So guard yourselves in your spirit and do not break faith."
        },
        {
          "reference": "Proverbs 18:22",
          "text": "He who finds a wife finds a good thing and obtains favor from the LORD."
        },
        {
          "reference": "Proverbs 19:14",
          "text": "Houses and wealth are inherited from fathers, but a prudent wife is from the LORD."
        },
        {
          "reference": "1 Peter 3:7",
          "text": "Husbands, in the same way, treat your wives with consideration as a delicate vessel, and with honor as fellow heirs of the gracious gift of life, so that your prayers will not be hindered."
        },
        {
          "reference": "Colossians 3:18-19",
          "text": "Wives, submit to your husbands, as is fitting in the Lord. / Husbands, love your wives and do not be harsh with them."
        },
        {
          "reference": "Hebrews 13:4",
          "text": "Marriage should be honored by all and the marriage bed kept undefiled, for God will judge the sexually immoral and adulterers."
        },
        {
          "reference": "1 Timothy 5:14",
          "text": "So I advise the younger widows to marry, have children, and manage their households, denying the adversary occasion for slander."
        },
        {
          "reference": "Song of Solomon 3:4",
          "text": "I had just passed them when I found the one I love. I held him and would not let go until I had brought him to my mother’s house, to the chamber of the one who conceived me."
        },
        {
          "reference": "Song of Solomon 8:6-7",
          "text": "Set me as a seal over your heart, as a seal upon your arm. For love is as strong as death, its jealousy as unrelenting as Sheol. Its sparks are fiery flames, the fiercest blaze of all. / Mighty waters cannot quench love; rivers cannot sweep it away. If a man were to give all the wealth of his house for love, his offer would be utterly scorned."
        },
        {
          "reference": "Ecclesiastes 4:9-12",
          "text": "Two are better than one, because they have a good return for their labor. / For if one falls down, his companion can lift him up; but pity the one who falls without another to help him up! / Again, if two lie down together, they will keep warm; but how can one keep warm alone? ..."
        }
      ]
    },
    {
      "reference": "Genesis 2:25",
      "book": "Genesis",
      "chapter": 2,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "Adam and his wife were both naked, and they felt no shame."
        },
        {
          "version": "NLT",
          "text": "Now the man and his wife were both naked, but they felt no shame."
        },
        {
          "version": "ESV",
          "text": "And the man and his wife were both naked and were not ashamed."
        },
        {
          "version": "NKJV",
          "text": "And they were both naked, the man and his wife, and were not ashamed."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 3:7",
          "text": "And the eyes of both of them were opened, and they knew that they were naked; so they sewed together fig leaves and made coverings for themselves."
        },
        {
          "reference": "Genesis 3:10-11",
          "text": "“I heard Your voice in the garden,” he replied, “and I was afraid because I was naked; so I hid myself.” / “Who told you that you were naked?” asked the LORD God. “Have you eaten from the tree of which I commanded you not to eat?”"
        },
        {
          "reference": "Genesis 3:21",
          "text": "And the LORD God made garments of skin for Adam and his wife, and He clothed them."
        },
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Ephesians 5:31",
          "text": "“For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh.”"
        },
        {
          "reference": "1 Corinthians 15:45",
          "text": "So it is written: “The first man Adam became a living being”; the last Adam a life-giving spirit."
        },
        {
          "reference": "Romans 5:12-14",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned. / For sin was in the world before the law was given; but sin is not taken into account when there is no law. / Nevertheless, death reigned from Adam until Moses, even over those who did not sin in the way that Adam transgressed. He is a pattern of the One to come."
        },
        {
          "reference": "1 Timothy 2:13-14",
          "text": "For Adam was formed first, and then Eve. / And it was not Adam who was deceived, but the woman who was deceived and fell into transgression."
        },
        {
          "reference": "1 Corinthians 11:8-9",
          "text": "For man did not come from woman, but woman from man. / Neither was man created for woman, but woman for man."
        },
        {
          "reference": "Revelation 19:7-8",
          "text": "Let us rejoice and be glad and give Him the glory. For the marriage of the Lamb has come, and His bride has made herself ready. / She was given clothing of fine linen, bright and pure.” For the fine linen she wears is the righteous acts of the saints."
        },
        {
          "reference": "Revelation 21:2",
          "text": "I saw the holy city, the new Jerusalem, coming down out of heaven from God, prepared as a bride adorned for her husband."
        },
        {
          "reference": "Revelation 22:14",
          "text": "Blessed are those who wash their robes, so that they may have the right to the tree of life and may enter the city by its gates."
        },
        {
          "reference": "Psalm 8:4-8",
          "text": "what is man that You are mindful of him, or the son of man that You care for him? / You made him a little lower than the angels; You crowned him with glory and honor. / You made him ruler of the works of Your hands; You have placed everything under his feet: ..."
        },
        {
          "reference": "Isaiah 61:10",
          "text": "I will rejoice greatly in the LORD, my soul will exult in my God; for He has clothed me with garments of salvation and wrapped me in a robe of righteousness, as a bridegroom wears a priestly headdress, as a bride adorns herself with her jewels."
        },
        {
          "reference": "Isaiah 47:3",
          "text": "Your nakedness will be uncovered and your shame will be exposed. I will take vengeance; I will spare no one.”"
        }
      ]
    }
  ]
}