{
  "book": "genesis",
  "chapter": 20,
  "verses": [
    {
      "reference": "Genesis 20:1",
      "book": "Genesis",
      "chapter": 20,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Abraham moved on from there into the region of the Negev and lived between Kadesh and Shur. For a while he stayed in Gerar,"
        },
        {
          "version": "NLT",
          "text": "Abraham moved south to the Negev and lived for a while between Kadesh and Shur, and then he moved on to Gerar. While living there as a foreigner,"
        },
        {
          "version": "ESV",
          "text": "From there Abraham journeyed toward the territory of the Negeb and lived between Kadesh and Shur; and he sojourned in Gerar."
        },
        {
          "version": "NKJV",
          "text": "And Abraham journeyed from there to the South, and dwelt between Kadesh and Shur, and stayed in Gerar."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:10-20",
          "text": "Now there was a famine in the land. So Abram went down to Egypt to live there for a while because the famine was severe. / As he was about to enter Egypt, he said to his wife Sarai, “Look, I know that you are a beautiful woman, / and when the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live. ..."
        },
        {
          "reference": "Genesis 26:1-11",
          "text": "Now there was another famine in the land, subsequent to the one that had occurred in Abraham’s time. And Isaac went to Abimelech king of the Philistines at Gerar. / The LORD appeared to Isaac and said, “Do not go down to Egypt. Settle in the land where I tell you. / Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. ..."
        },
        {
          "reference": "Genesis 12:1",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you."
        },
        {
          "reference": "Genesis 13:1",
          "text": "So Abram went up out of Egypt into the Negev—he and his wife and all his possessions—and Lot was with him."
        },
        {
          "reference": "Genesis 18:1",
          "text": "Then the LORD appeared to Abraham by the Oaks of Mamre in the heat of the day, while he was sitting at the entrance of his tent."
        },
        {
          "reference": "Genesis 19:1",
          "text": "Now the two angels arrived at Sodom in the evening, and Lot was sitting in the gateway of the city. When Lot saw them, he got up to meet them, bowed facedown,"
        },
        {
          "reference": "Genesis 21:22-34",
          "text": "At that time Abimelech and Phicol the commander of his army said to Abraham, “God is with you in all that you do. / Now, therefore, swear to me here before God that you will not deal falsely with me or my children or descendants. Show to me and to the country in which you reside the same kindness that I have shown to you.” / And Abraham replied, “I swear it.” ..."
        },
        {
          "reference": "Genesis 24:62",
          "text": "Now Isaac had just returned from Beer-lahai-roi, for he was living in the Negev."
        },
        {
          "reference": "Genesis 26:23",
          "text": "From there Isaac went up to Beersheba,"
        },
        {
          "reference": "Genesis 12:9",
          "text": "And Abram journeyed on toward the Negev."
        },
        {
          "reference": "Genesis 11:31",
          "text": "And Terah took his son Abram, his grandson Lot son of Haran, and his daughter-in-law Sarai the wife of Abram, and they set out from Ur of the Chaldeans for the land of Canaan. But when they arrived in Haran, they settled there."
        },
        {
          "reference": "Genesis 16:7",
          "text": "Now the angel of the LORD found Hagar by a spring of water in the desert—the spring along the road to Shur."
        },
        {
          "reference": "Genesis 21:14",
          "text": "Early in the morning, Abraham got up, took bread and a skin of water, put them on Hagar’s shoulders, and sent her away with the boy. She left and wandered in the Wilderness of Beersheba."
        },
        {
          "reference": "Genesis 25:18",
          "text": "Ishmael’s descendants settled from Havilah to Shur, which is near the border of Egypt as you go toward Asshur. And they lived in hostility toward all their brothers."
        },
        {
          "reference": "Genesis 10:19",
          "text": "and the borders of Canaan extended from Sidon toward Gerar as far as Gaza, and then toward Sodom, Gomorrah, Admah, and Zeboiim, as far as Lasha."
        }
      ]
    },
    {
      "reference": "Genesis 20:2",
      "book": "Genesis",
      "chapter": 20,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "and there Abraham said of his wife Sarah, “She is my sister.” Then Abimelek king of Gerar sent for Sarah and took her."
        },
        {
          "version": "NLT",
          "text": "Abraham introduced his wife, Sarah, by saying, “She is my sister.” So King Abimelech of Gerar sent for Sarah and had her brought to him at his palace."
        },
        {
          "version": "ESV",
          "text": "And Abraham said of Sarah his wife, “She is my sister.” And Abimelech king of Gerar sent and took Sarah."
        },
        {
          "version": "NKJV",
          "text": "Now Abraham said of Sarah his wife, “She is my sister.” And Abimelech king of Gerar sent and took Sarah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:11-20",
          "text": "As he was about to enter Egypt, he said to his wife Sarai, “Look, I know that you are a beautiful woman, / and when the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live. / Please say you are my sister, so that I will be treated well for your sake, and on account of you my life will be spared.” ..."
        },
        {
          "reference": "Genesis 26:6-11",
          "text": "So Isaac settled in Gerar. / But when the men of that place asked about his wife, he said, “She is my sister.” For he was afraid to say, “She is my wife,” since he thought to himself, “The men of this place will kill me on account of Rebekah, because she is so beautiful.” / When Isaac had been there a long time, Abimelech king of the Philistines looked down from the window and was surprised to see Isaac caressing his wife Rebekah. ..."
        },
        {
          "reference": "Exodus 20:14",
          "text": "You shall not commit adultery."
        },
        {
          "reference": "Exodus 20:16",
          "text": "You shall not bear false witness against your neighbor."
        },
        {
          "reference": "Leviticus 18:20",
          "text": "You must not lie carnally with your neighbor’s wife and thus defile yourself with her."
        },
        {
          "reference": "Deuteronomy 5:18",
          "text": "You shall not commit adultery."
        },
        {
          "reference": "Deuteronomy 5:20",
          "text": "You shall not bear false witness against your neighbor."
        },
        {
          "reference": "2 Samuel 11:2-4",
          "text": "One evening David got up from his bed and strolled around on the roof of the palace. And from the roof he saw a woman bathing—a very beautiful woman. / So David sent and inquired about the woman, and he was told, “This is Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite.” / Then David sent messengers to get her, and when she came to him, he slept with her. (Now she had just purified herself from her uncleanness.) Then she returned home."
        },
        {
          "reference": "Proverbs 6:32",
          "text": "He who commits adultery lacks judgment; whoever does so destroys himself."
        },
        {
          "reference": "Proverbs 12:22",
          "text": "Lying lips are detestable to the LORD, but those who deal faithfully are His delight."
        },
        {
          "reference": "Matthew 5:27-28",
          "text": "You have heard that it was said, ‘Do not commit adultery.’ / But I tell you that anyone who looks at a woman to lust after her has already committed adultery with her in his heart."
        },
        {
          "reference": "Matthew 15:19",
          "text": "For out of the heart come evil thoughts, murder, adultery, sexual immorality, theft, false testimony, and slander."
        },
        {
          "reference": "Mark 10:19",
          "text": "You know the commandments: ‘Do not murder, do not commit adultery, do not steal, do not bear false witness, do not cheat others, honor your father and mother.’”"
        },
        {
          "reference": "Luke 18:20",
          "text": "You know the commandments: ‘Do not commit adultery, do not murder, do not steal, do not bear false witness, honor your father and mother.’”"
        },
        {
          "reference": "John 8:44",
          "text": "You belong to your father, the devil, and you want to carry out his desires. He was a murderer from the beginning, refusing to uphold the truth, because there is no truth in him. When he lies, he speaks his native language, because he is a liar and the father of lies."
        }
      ]
    },
    {
      "reference": "Genesis 20:3",
      "book": "Genesis",
      "chapter": 20,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "But God came to Abimelek in a dream one night and said to him, “You are as good as dead because of the woman you have taken; she is a married woman.”"
        },
        {
          "version": "NLT",
          "text": "But that night God came to Abimelech in a dream and told him, “You are a dead man, for that woman you have taken is already married!”"
        },
        {
          "version": "ESV",
          "text": "But God came to Abimelech in a dream by night and said to him, “Behold, you are a dead man because of the woman whom you have taken, for she is a man’s wife.”"
        },
        {
          "version": "NKJV",
          "text": "But God came to Abimelech in a dream by night, and said to him, “Indeed you are a dead man because of the woman whom you have taken, for she is a man’s wife.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:17",
          "text": "The LORD, however, afflicted Pharaoh and his household with severe plagues because of Abram’s wife Sarai."
        },
        {
          "reference": "Genesis 31:24",
          "text": "But that night God came to Laban the Aramean in a dream and warned him, “Be careful not to say anything to Jacob, either good or bad.”"
        },
        {
          "reference": "Genesis 26:7-11",
          "text": "But when the men of that place asked about his wife, he said, “She is my sister.” For he was afraid to say, “She is my wife,” since he thought to himself, “The men of this place will kill me on account of Rebekah, because she is so beautiful.” / When Isaac had been there a long time, Abimelech king of the Philistines looked down from the window and was surprised to see Isaac caressing his wife Rebekah. / Abimelech sent for Isaac and said, “So she is really your wife! How could you say, ‘She is my sister’?” Isaac replied, “Because I thought I might die on account of her.” ..."
        },
        {
          "reference": "Job 33:15-16",
          "text": "In a dream, in a vision in the night, when deep sleep falls upon men as they slumber on their beds, / He opens their ears and terrifies them with warnings"
        },
        {
          "reference": "Matthew 1:20",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit."
        },
        {
          "reference": "Acts 10:10-16",
          "text": "He became hungry and wanted something to eat, but while the meal was being prepared, he fell into a trance. / He saw heaven open and something like a large sheet being let down to earth by its four corners. / It contained all kinds of four-footed animals and reptiles of the earth, as well as birds of the air. ..."
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Daniel 2:1-3",
          "text": "In the second year of his reign, Nebuchadnezzar had dreams that troubled his spirit, and sleep escaped him. / So the king gave orders to summon the magicians, enchanters, sorcerers, and astrologers to explain his dreams. When they came and stood before the king, / he said to them, “I have had a dream, and my spirit is anxious to understand it.”"
        },
        {
          "reference": "Numbers 22:9-12",
          "text": "Then God came to Balaam and asked, “Who are these men with you?” / And Balaam said to God, “Balak son of Zippor, king of Moab, sent me this message: / ‘Behold, a people has come out of Egypt, and they cover the face of the land. Now come and put a curse on them for me. Perhaps I may be able to fight against them and drive them away.’” ..."
        },
        {
          "reference": "Matthew 2:12",
          "text": "And having been warned in a dream not to return to Herod, they withdrew to their country by another route."
        },
        {
          "reference": "Acts 16:9-10",
          "text": "During the night, Paul had a vision of a man of Macedonia standing and pleading with him, “Come over to Macedonia and help us.” / As soon as Paul had seen the vision, we got ready to leave for Macedonia, concluding that God had called us to preach the gospel to them."
        },
        {
          "reference": "1 Kings 3:5",
          "text": "One night at Gibeon the LORD appeared to Solomon in a dream, and God said, “Ask, and I will give it to you!”"
        },
        {
          "reference": "Matthew 2:22",
          "text": "But when he learned that Archelaus was reigning in Judea in place of his father Herod, he was afraid to go there. And having been warned in a dream, he withdrew to the district of Galilee,"
        },
        {
          "reference": "Acts 18:9-10",
          "text": "One night the Lord spoke to Paul in a vision: “Do not be afraid; keep on speaking; do not be silent. / For I am with you and no one will lay a hand on you, because I have many people in this city.”"
        },
        {
          "reference": "Job 4:12-16",
          "text": "Now a word came to me secretly; my ears caught a whisper of it. / In disquieting visions in the night, when deep sleep falls on men, / fear and trembling came over me and made all my bones shudder. ..."
        }
      ]
    },
    {
      "reference": "Genesis 20:4",
      "book": "Genesis",
      "chapter": 20,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Abimelek had not gone near her, so he said, “Lord, will you destroy an innocent nation?"
        },
        {
          "version": "NLT",
          "text": "But Abimelech had not slept with her yet, so he said, “Lord, will you destroy an innocent nation?"
        },
        {
          "version": "ESV",
          "text": "Now Abimelech had not approached her. So he said, “Lord, will you kill an innocent people?"
        },
        {
          "version": "NKJV",
          "text": "But Abimelech had not come near her; and he said, “Lord, will You slay a righteous nation also?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:17",
          "text": "The LORD, however, afflicted Pharaoh and his household with severe plagues because of Abram’s wife Sarai."
        },
        {
          "reference": "Genesis 18:25",
          "text": "Far be it from You to do such a thing—to kill the righteous with the wicked, so that the righteous and the wicked are treated alike. Far be it from You! Will not the Judge of all the earth do what is right?”"
        },
        {
          "reference": "Genesis 19:29",
          "text": "So when God destroyed the cities of the plain, He remembered Abraham, and He brought Lot out of the catastrophe that destroyed the cities where he had lived."
        },
        {
          "reference": "Genesis 26:9-11",
          "text": "Abimelech sent for Isaac and said, “So she is really your wife! How could you say, ‘She is my sister’?” Isaac replied, “Because I thought I might die on account of her.” / “What is this you have done to us?” asked Abimelech. “One of the people could easily have slept with your wife, and you would have brought guilt upon us.” / So Abimelech warned all the people, saying, “Whoever harms this man or his wife will surely be put to death.”"
        },
        {
          "reference": "Exodus 20:7",
          "text": "You shall not take the name of the LORD your God in vain, for the LORD will not leave anyone unpunished who takes His name in vain."
        },
        {
          "reference": "Exodus 34:7",
          "text": "maintaining loving devotion to a thousand generations, forgiving iniquity, transgression, and sin. Yet He will by no means leave the guilty unpunished; He will visit the iniquity of the fathers on their children and grandchildren to the third and fourth generations.”"
        },
        {
          "reference": "Leviticus 18:5",
          "text": "Keep My statutes and My judgments, for the man who does these things will live by them. I am the LORD."
        },
        {
          "reference": "Numbers 16:22",
          "text": "But Moses and Aaron fell facedown and said, “O God, the God of the spirits of all flesh, when one man sins, will You be angry with the whole congregation?”"
        },
        {
          "reference": "Deuteronomy 32:4",
          "text": "He is the Rock, His work is perfect; all His ways are just. A God of faithfulness without injustice, righteous and upright is He."
        },
        {
          "reference": "1 Samuel 24:12",
          "text": "May the LORD judge between you and me, and may the LORD take vengeance on you, but my hand will never be against you."
        },
        {
          "reference": "2 Samuel 24:17",
          "text": "When David saw the angel striking down the people, he said to the LORD, “Surely I, the shepherd, have sinned and acted wickedly. But these sheep, what have they done? Please, let Your hand fall upon me and my father’s house.”"
        },
        {
          "reference": "1 Kings 8:32",
          "text": "then may You hear from heaven and act. May You judge Your servants, condemning the wicked man by bringing down on his own head what he has done, and justifying the righteous man by rewarding him according to his righteousness."
        },
        {
          "reference": "Job 34:10-12",
          "text": "Therefore listen to me, O men of understanding. Far be it from God to do wrong, and from the Almighty to act unjustly. / For according to a man’s deeds He repays him; according to a man’s ways He brings consequences. / Indeed, it is true that God does not act wickedly, and the Almighty does not pervert justice."
        },
        {
          "reference": "Psalm 7:8-9",
          "text": "The LORD judges the peoples; vindicate me, O LORD, according to my righteousness and integrity. / Put an end to the evil of the wicked, but establish the righteous, O righteous God who searches hearts and minds."
        },
        {
          "reference": "Psalm 19:12-13",
          "text": "Who can discern his own errors? Cleanse me from my hidden faults. / Keep Your servant also from willful sins; may they not rule over me. Then I will be blameless and cleansed of great transgression."
        }
      ]
    },
    {
      "reference": "Genesis 20:5",
      "book": "Genesis",
      "chapter": 20,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "Did he not say to me, ‘She is my sister,’ and didn’t she also say, ‘He is my brother’? I have done this with a clear conscience and clean hands.”"
        },
        {
          "version": "NLT",
          "text": "Didn’t Abraham tell me, ‘She is my sister’? And she herself said, ‘Yes, he is my brother.’ I acted in complete innocence! My hands are clean.”"
        },
        {
          "version": "ESV",
          "text": "Did he not himself say to me, ‘She is my sister’? And she herself said, ‘He is my brother.’ In the integrity of my heart and the innocence of my hands I have done this.”"
        },
        {
          "version": "NKJV",
          "text": "Did he not say to me, ‘She is my sister’? And she, even she herself said, ‘He is my brother.’ In the integrity of my heart and innocence of my hands I have done this.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:11-20",
          "text": "As he was about to enter Egypt, he said to his wife Sarai, “Look, I know that you are a beautiful woman, / and when the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live. / Please say you are my sister, so that I will be treated well for your sake, and on account of you my life will be spared.” ..."
        },
        {
          "reference": "Genesis 26:7-11",
          "text": "But when the men of that place asked about his wife, he said, “She is my sister.” For he was afraid to say, “She is my wife,” since he thought to himself, “The men of this place will kill me on account of Rebekah, because she is so beautiful.” / When Isaac had been there a long time, Abimelech king of the Philistines looked down from the window and was surprised to see Isaac caressing his wife Rebekah. / Abimelech sent for Isaac and said, “So she is really your wife! How could you say, ‘She is my sister’?” Isaac replied, “Because I thought I might die on account of her.” ..."
        },
        {
          "reference": "Exodus 20:16",
          "text": "You shall not bear false witness against your neighbor."
        },
        {
          "reference": "Exodus 23:7",
          "text": "Stay far away from a false accusation. Do not kill the innocent or the just, for I will not acquit the guilty."
        },
        {
          "reference": "Deuteronomy 5:20",
          "text": "You shall not bear false witness against your neighbor."
        },
        {
          "reference": "1 Samuel 21:2",
          "text": "“The king has given me a mission,” David replied. “He told me no one is to know about the mission on which I am sending you. And I have directed my young men to meet me at a certain place."
        },
        {
          "reference": "1 Samuel 27:10",
          "text": "who would ask him, “What have you raided today?” And David would reply, “The Negev of Judah,” or “The Negev of Jerahmeel,” or “The Negev of the Kenites.”"
        },
        {
          "reference": "2 Samuel 17:20",
          "text": "When Absalom’s servants came to the woman at the house, they asked, “Where are Ahimaaz and Jonathan?” “They have crossed over the brook,” she replied. The men searched but did not find them, so they returned to Jerusalem."
        },
        {
          "reference": "1 Kings 22:22-23",
          "text": "And he replied, ‘I will go out and be a lying spirit in the mouths of all his prophets.’ ‘You will surely entice him and prevail,’ said the LORD. ‘Go and do it.’ / So you see, the LORD has put a lying spirit in the mouths of all these prophets of yours, and the LORD has pronounced disaster against you.”"
        },
        {
          "reference": "Psalm 15:2",
          "text": "He who walks with integrity and practices righteousness, who speaks the truth from his heart,"
        },
        {
          "reference": "Psalm 34:13",
          "text": "Keep your tongue from evil and your lips from deceitful speech."
        },
        {
          "reference": "Psalm 51:6",
          "text": "Surely You desire truth in the inmost being; You teach me wisdom in the inmost place."
        },
        {
          "reference": "Proverbs 12:19",
          "text": "Truthful lips endure forever, but a lying tongue lasts only a moment."
        },
        {
          "reference": "Proverbs 14:5",
          "text": "An honest witness does not deceive, but a dishonest witness pours forth lies."
        },
        {
          "reference": "Proverbs 19:5",
          "text": "A false witness will not go unpunished, and one who utters lies will not escape."
        }
      ]
    },
    {
      "reference": "Genesis 20:6",
      "book": "Genesis",
      "chapter": 20,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Then God said to him in the dream, “Yes, I know you did this with a clear conscience, and so I have kept you from sinning against me. That is why I did not let you touch her."
        },
        {
          "version": "NLT",
          "text": "In the dream God responded, “Yes, I know you are innocent. That’s why I kept you from sinning against me, and why I did not let you touch her."
        },
        {
          "version": "ESV",
          "text": "Then God said to him in the dream, “Yes, I know that you have done this in the integrity of your heart, and it was I who kept you from sinning against me. Therefore I did not let you touch her."
        },
        {
          "version": "NKJV",
          "text": "And God said to him in a dream, “Yes, I know that you did this in the integrity of your heart. For I also withheld you from sinning against Me; therefore I did not let you touch her."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 34:24",
          "text": "For I will drive out the nations before you and enlarge your borders, and no one will covet your land when you go up three times a year to appear before the LORD your God."
        },
        {
          "reference": "1 Samuel 25:26",
          "text": "Now, my lord, as surely as the LORD lives and you yourself live, since the LORD has held you back from bloodshed and from avenging yourself with your own hand, may your enemies and those who seek harm for my lord be like Nabal."
        },
        {
          "reference": "1 Samuel 25:34",
          "text": "Otherwise, as surely as the LORD, the God of Israel, lives, who has restrained me from harming you, if you had not come quickly to meet me, then surely no male belonging to Nabal would have been left alive by morning light.”"
        },
        {
          "reference": "2 Samuel 12:13",
          "text": "Then David said to Nathan, “I have sinned against the LORD.” “The LORD has taken away your sin,” Nathan replied. “You will not die."
        },
        {
          "reference": "Job 33:15-18",
          "text": "In a dream, in a vision in the night, when deep sleep falls upon men as they slumber on their beds, / He opens their ears and terrifies them with warnings / to turn a man from wrongdoing and keep him from pride, ..."
        },
        {
          "reference": "Psalm 19:13",
          "text": "Keep Your servant also from willful sins; may they not rule over me. Then I will be blameless and cleansed of great transgression."
        },
        {
          "reference": "Psalm 105:14-15",
          "text": "He let no man oppress them; He rebuked kings on their behalf: / “Do not touch My anointed ones! Do no harm to My prophets!”"
        },
        {
          "reference": "Proverbs 21:1",
          "text": "The king’s heart is a waterway in the hand of the LORD; He directs it where He pleases."
        },
        {
          "reference": "Isaiah 54:17",
          "text": "No weapon formed against you shall prosper, and you will refute every tongue that accuses you. This is the heritage of the servants of the LORD, and their vindication is from Me,” declares the LORD."
        },
        {
          "reference": "Jeremiah 10:23",
          "text": "I know, O LORD, that a man’s way is not his own; no one who walks directs his own steps."
        },
        {
          "reference": "Matthew 1:20",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit."
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Luke 1:35",
          "text": "The angel replied, “The Holy Spirit will come upon you, and the power of the Most High will overshadow you. So the Holy One to be born will be called the Son of God."
        },
        {
          "reference": "John 19:11",
          "text": "Jesus answered, “You would have no authority over Me if it were not given to you from above. Therefore the one who handed Me over to you is guilty of greater sin.”"
        },
        {
          "reference": "Acts 5:3-4",
          "text": "Then Peter said, “Ananias, how is it that Satan has filled your heart to lie to the Holy Spirit and withhold some of the proceeds from the land? / Did it not belong to you before it was sold? And after it was sold, was it not at your disposal? How could you conceive such a deed in your heart? You have not lied to men, but to God!”"
        }
      ]
    },
    {
      "reference": "Genesis 20:7",
      "book": "Genesis",
      "chapter": 20,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Now return the man’s wife, for he is a prophet, and he will pray for you and you will live. But if you do not return her, you may be sure that you and all who belong to you will die.”"
        },
        {
          "version": "NLT",
          "text": "Now return the woman to her husband, and he will pray for you, for he is a prophet. Then you will live. But if you don’t return her to him, you can be sure that you and all your people will die.”"
        },
        {
          "version": "ESV",
          "text": "Now then, return the man’s wife, for he is a prophet, so that he will pray for you, and you shall live. But if you do not return her, know that you shall surely die, you and all who are yours.”"
        },
        {
          "version": "NKJV",
          "text": "Now therefore, restore the man’s wife; for he is a prophet, and he will pray for you and you shall live. But if you do not restore her, know that you shall surely die, you and all who are yours.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Job 42:8-10",
          "text": "So now, take seven bulls and seven rams, go to My servant Job, and sacrifice a burnt offering for yourselves. Then My servant Job will pray for you, for I will accept his prayer and not deal with you according to your folly. For you have not spoken accurately about Me, as My servant Job has.” / So Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite went and did as the LORD had told them; and the LORD accepted Job’s prayer. / After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions."
        },
        {
          "reference": "Numbers 12:13",
          "text": "So Moses cried out to the LORD, “O God, please heal her!”"
        },
        {
          "reference": "1 Samuel 7:5",
          "text": "Then Samuel said, “Gather all Israel to Mizpah, and I will pray to the LORD on your behalf.”"
        },
        {
          "reference": "1 Samuel 12:19-23",
          "text": "They pleaded with Samuel, “Pray to the LORD your God for your servants so that we will not die! For we have added to all our sins the evil of asking for a king.” / “Do not be afraid,” Samuel replied. “Even though you have committed all this evil, do not turn aside from following the LORD, but serve the LORD with all your heart. / Do not turn aside after worthless things that cannot profit you or deliver you, for they are empty. ..."
        },
        {
          "reference": "1 Kings 13:6",
          "text": "Then the king responded to the man of God, “Intercede with the LORD your God and pray for me that my hand may be restored.” So the man of God interceded with the LORD, and the king’s hand was restored to him as it was before."
        },
        {
          "reference": "2 Kings 19:4",
          "text": "Perhaps the LORD your God will hear all the words of the Rabshakeh, whom his master the king of Assyria has sent to defy the living God, and He will rebuke him for the words that the LORD your God has heard. Therefore lift up a prayer for the remnant that still survives.”"
        },
        {
          "reference": "2 Kings 20:2-5",
          "text": "Then Hezekiah turned his face to the wall and prayed to the LORD, saying, / “Please, O LORD, remember how I have walked before You faithfully and with wholehearted devotion; I have done what is good in Your sight.” And Hezekiah wept bitterly. / Before Isaiah had left the middle courtyard, the word of the LORD came to him, saying, ..."
        },
        {
          "reference": "Jeremiah 7:16",
          "text": "As for you, do not pray for these people, do not offer a plea or petition on their behalf, and do not beg Me, for I will not listen to you."
        },
        {
          "reference": "Jeremiah 27:18",
          "text": "If they are indeed prophets and the word of the LORD is with them, let them now plead with the LORD of Hosts that the articles remaining in the house of the LORD, in the palace of the king of Judah, and in Jerusalem, not be taken to Babylon."
        },
        {
          "reference": "Ezekiel 14:14",
          "text": "then even if these three men—Noah, Daniel, and Job—were in it, their righteousness could deliver only themselves, declares the Lord GOD."
        },
        {
          "reference": "James 5:14-16",
          "text": "Is any one of you sick? He should call the elders of the church to pray over him and anoint him with oil in the name of the Lord. / And the prayer offered in faith will restore the one who is sick. The Lord will raise him up. If he has sinned, he will be forgiven. / Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous man has great power to prevail."
        },
        {
          "reference": "Matthew 5:44",
          "text": "But I tell you, love your enemies and pray for those who persecute you,"
        },
        {
          "reference": "Luke 6:28",
          "text": "bless those who curse you, pray for those who mistreat you."
        },
        {
          "reference": "Luke 23:34",
          "text": "Then Jesus said, “Father, forgive them, for they do not know what they are doing.” And they divided up His garments by casting lots."
        },
        {
          "reference": "Acts 8:24",
          "text": "Then Simon answered, “Pray to the Lord for me, so that nothing you have said may happen to me.”"
        }
      ]
    },
    {
      "reference": "Genesis 20:8",
      "book": "Genesis",
      "chapter": 20,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "Early the next morning Abimelek summoned all his officials, and when he told them all that had happened, they were very much afraid."
        },
        {
          "version": "NLT",
          "text": "Abimelech got up early the next morning and quickly called all his servants together. When he told them what had happened, his men were terrified."
        },
        {
          "version": "ESV",
          "text": "So Abimelech rose early in the morning and called all his servants and told them all these things. And the men were very much afraid."
        },
        {
          "version": "NKJV",
          "text": "So Abimelech rose early in the morning, called all his servants, and told all these things in their hearing; and the men were very much afraid."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:17-20",
          "text": "The LORD, however, afflicted Pharaoh and his household with severe plagues because of Abram’s wife Sarai. / So Pharaoh summoned Abram and asked, “What have you done to me? Why didn’t you tell me she was your wife? / Why did you say, ‘She is my sister,’ so that I took her as my wife? Now then, here is your wife. Take her and go!” ..."
        },
        {
          "reference": "Genesis 26:9-11",
          "text": "Abimelech sent for Isaac and said, “So she is really your wife! How could you say, ‘She is my sister’?” Isaac replied, “Because I thought I might die on account of her.” / “What is this you have done to us?” asked Abimelech. “One of the people could easily have slept with your wife, and you would have brought guilt upon us.” / So Abimelech warned all the people, saying, “Whoever harms this man or his wife will surely be put to death.”"
        },
        {
          "reference": "Exodus 9:20-21",
          "text": "Those among Pharaoh’s officials who feared the word of the LORD hurried to bring their servants and livestock to shelter, / but those who disregarded the word of the LORD left their servants and livestock in the field."
        },
        {
          "reference": "Exodus 12:30-33",
          "text": "During the night Pharaoh got up—he and all his officials and all the Egyptians—and there was loud wailing in Egypt; for there was no house without someone dead. / Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested. / Take your flocks and herds as well, just as you have said, and depart! And bless me also.” ..."
        },
        {
          "reference": "1 Samuel 5:8-12",
          "text": "So they called together all the rulers of the Philistines and asked, “What shall we do with the ark of the God of Israel?” “It must be moved to Gath,” they replied. So they carried away the ark of the God of Israel. / But after they had moved the ark to Gath, the LORD’s hand was also against that city, throwing it into great confusion and afflicting the men of the city, both young and old, with an outbreak of tumors. / So they sent the ark of God to Ekron, but as it arrived, the Ekronites cried out, “They have brought us the ark of the God of Israel in order to kill us and our people!” ..."
        },
        {
          "reference": "1 Samuel 6:2-9",
          "text": "the Philistines summoned the priests and diviners, saying, “What shall we do with the ark of the LORD? Tell us how to send it back to its place.” / They replied, “If you return the ark of the God of Israel, do not send it away empty, but by all means return it to Him with a guilt offering. Then you will be healed, and you will understand why His hand has not been lifted from you.” / “What guilt offering should we send back to Him?” asked the Philistines. “Five gold tumors and five gold rats,” they said, “according to the number of rulers of the Philistines, since the same plague has struck both you and your rulers. ..."
        },
        {
          "reference": "2 Samuel 24:10-17",
          "text": "After David had numbered the troops, his conscience was stricken and he said to the LORD, “I have sinned greatly in what I have done. Now, O LORD, I beg You to take away the iniquity of Your servant, for I have acted very foolishly.” / When David got up in the morning, the word of the LORD had come to Gad the prophet, David’s seer: / “Go and tell David that this is what the LORD says: ‘I am offering you three options. Choose one of them, and I will carry it out against you.’” ..."
        },
        {
          "reference": "1 Kings 13:6",
          "text": "Then the king responded to the man of God, “Intercede with the LORD your God and pray for me that my hand may be restored.” So the man of God interceded with the LORD, and the king’s hand was restored to him as it was before."
        },
        {
          "reference": "2 Kings 1:13-15",
          "text": "So the king sent a third captain with his fifty men. And the third captain went up, fell on his knees before Elijah, and begged him, “Man of God, may my life and the lives of these fifty servants of yours please be precious in your sight. / Behold, fire has come down from heaven and consumed the first two captains of fifty, with all their men. But now may my life be precious in your sight.” / Then the angel of the LORD said to Elijah, “Go down with him. Do not be afraid of him.” So Elijah got up and went down with him to the king."
        },
        {
          "reference": "2 Chronicles 32:25-26",
          "text": "But because his heart was proud, Hezekiah did not repay the favor shown to him. Therefore wrath came upon him and upon Judah and Jerusalem. / Then Hezekiah humbled the pride of his heart—he and the people of Jerusalem—so that the wrath of the LORD did not come upon them during the days of Hezekiah."
        },
        {
          "reference": "Jonah 3:6-9",
          "text": "When word reached the king of Nineveh, he got up from his throne, took off his royal robe, covered himself with sackcloth, and sat in ashes. / Then he issued a proclamation in Nineveh: “By the decree of the king and his nobles: Let no man or beast, herd or flock, taste anything at all. They must not eat or drink. / Furthermore, let both man and beast be covered with sackcloth, and have everyone call out earnestly to God. Let each one turn from his evil ways and from the violence in his hands. ..."
        },
        {
          "reference": "Matthew 2:12-13",
          "text": "And having been warned in a dream not to return to Herod, they withdrew to their country by another route. / When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.”"
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Luke 1:11-13",
          "text": "Just then an angel of the Lord appeared to Zechariah, standing at the right side of the altar of incense. / When Zechariah saw him, he was startled and gripped with fear. / But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        },
        {
          "reference": "Luke 2:8-20",
          "text": "And there were shepherds residing in the fields nearby, keeping watch over their flocks by night. / Just then an angel of the Lord stood before them, and the glory of the Lord shone around them, and they were terrified. / But the angel said to them, “Do not be afraid! For behold, I bring you good news of great joy that will be for all the people: ..."
        }
      ]
    },
    {
      "reference": "Genesis 20:9",
      "book": "Genesis",
      "chapter": 20,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Abimelek called Abraham in and said, “What have you done to us? How have I wronged you that you have brought such great guilt upon me and my kingdom? You have done things to me that should never be done.”"
        },
        {
          "version": "NLT",
          "text": "Then Abimelech called for Abraham. “What have you done to us?” he demanded. “What crime have I committed that deserves treatment like this, making me and my kingdom guilty of this great sin? No one should ever do what you have done!"
        },
        {
          "version": "ESV",
          "text": "Then Abimelech called Abraham and said to him, “What have you done to us? And how have I sinned against you, that you have brought on me and my kingdom a great sin? You have done to me things that ought not to be done.”"
        },
        {
          "version": "NKJV",
          "text": "And Abimelech called Abraham and said to him, “What have you done to us? How have I offended you, that you have brought on me and on my kingdom a great sin? You have done deeds to me that ought not to be done.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:18-19",
          "text": "So Pharaoh summoned Abram and asked, “What have you done to me? Why didn’t you tell me she was your wife? / Why did you say, ‘She is my sister,’ so that I took her as my wife? Now then, here is your wife. Take her and go!”"
        },
        {
          "reference": "Genesis 26:10",
          "text": "“What is this you have done to us?” asked Abimelech. “One of the people could easily have slept with your wife, and you would have brought guilt upon us.”"
        },
        {
          "reference": "Exodus 32:21",
          "text": "“What did this people do to you,” Moses asked Aaron, “that you have led them into so great a sin?”"
        },
        {
          "reference": "1 Samuel 26:18",
          "text": "And he continued, “Why is my lord pursuing his servant? What have I done? What evil is in my hand?"
        },
        {
          "reference": "2 Samuel 12:9",
          "text": "Why then have you despised the command of the LORD by doing evil in His sight? You put Uriah the Hittite to the sword and took his wife as your own. You have slain him with the sword of the Ammonites."
        },
        {
          "reference": "1 Kings 18:18",
          "text": "“I have not troubled Israel,” Elijah replied, “but you and your father’s house have, for you have forsaken the commandments of the LORD and have followed the Baals."
        },
        {
          "reference": "1 Chronicles 21:3",
          "text": "But Joab replied, “May the LORD multiply His troops a hundred times over. My lord the king, are they not all servants of my lord? Why does my lord want to do this? Why should he bring guilt on Israel?”"
        },
        {
          "reference": "Psalm 51:4",
          "text": "Against You, You only, have I sinned and done what is evil in Your sight, so that You may be proved right when You speak and blameless when You judge."
        },
        {
          "reference": "Proverbs 6:29",
          "text": "So is he who sleeps with another man’s wife; no one who touches her will go unpunished."
        },
        {
          "reference": "Proverbs 28:10",
          "text": "He who leads the upright along the path of evil will fall into his own pit, but the blameless will inherit what is good."
        },
        {
          "reference": "Matthew 14:3-4",
          "text": "Now Herod had arrested John and bound him and put him in prison on account of Herodias, his brother Philip’s wife, / because John had been telling him, “It is not lawful for you to have her.”"
        },
        {
          "reference": "Matthew 27:4",
          "text": "“I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.”"
        },
        {
          "reference": "Mark 6:18",
          "text": "For John had been telling Herod, “It is not lawful for you to have your brother’s wife!”"
        },
        {
          "reference": "Luke 3:19",
          "text": "But when he rebuked Herod the tetrarch regarding his brother’s wife Herodias and all the evils he had done,"
        },
        {
          "reference": "John 18:35",
          "text": "“Am I a Jew?” Pilate replied. “Your own people and chief priests handed You over to me. What have You done?”"
        }
      ]
    },
    {
      "reference": "Genesis 20:10",
      "book": "Genesis",
      "chapter": 20,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "And Abimelek asked Abraham, “What was your reason for doing this?”"
        },
        {
          "version": "NLT",
          "text": "Whatever possessed you to do such a thing?”"
        },
        {
          "version": "ESV",
          "text": "And Abimelech said to Abraham, “What did you see, that you did this thing?”"
        },
        {
          "version": "NKJV",
          "text": "Then Abimelech said to Abraham, “What did you have in view, that you have done this thing?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:18-19",
          "text": "So Pharaoh summoned Abram and asked, “What have you done to me? Why didn’t you tell me she was your wife? / Why did you say, ‘She is my sister,’ so that I took her as my wife? Now then, here is your wife. Take her and go!”"
        },
        {
          "reference": "Genesis 26:9-10",
          "text": "Abimelech sent for Isaac and said, “So she is really your wife! How could you say, ‘She is my sister’?” Isaac replied, “Because I thought I might die on account of her.” / “What is this you have done to us?” asked Abimelech. “One of the people could easily have slept with your wife, and you would have brought guilt upon us.”"
        },
        {
          "reference": "Exodus 32:21",
          "text": "“What did this people do to you,” Moses asked Aaron, “that you have led them into so great a sin?”"
        },
        {
          "reference": "1 Samuel 21:1-2",
          "text": "Then David came to Nob, to Ahimelech the priest. And when Ahimelech met David, he trembled and asked him, “Why are you alone? Why is no one with you?” / “The king has given me a mission,” David replied. “He told me no one is to know about the mission on which I am sending you. And I have directed my young men to meet me at a certain place."
        },
        {
          "reference": "2 Samuel 12:9-10",
          "text": "Why then have you despised the command of the LORD by doing evil in His sight? You put Uriah the Hittite to the sword and took his wife as your own. You have slain him with the sword of the Ammonites. / Now, therefore, the sword will never depart from your house, because you have despised Me and have taken the wife of Uriah the Hittite to be your own.’"
        },
        {
          "reference": "1 Kings 21:20",
          "text": "When Elijah arrived, Ahab said to him, “So you have found me out, my enemy.” He replied, “I have found you out because you have sold yourself to do evil in the sight of the LORD."
        },
        {
          "reference": "2 Kings 5:25-27",
          "text": "When Gehazi went in and stood before his master, Elisha asked him, “Gehazi, where have you been?” “Your servant did not go anywhere,” he replied. / But Elisha questioned him, “Did not my spirit go with you when the man got down from his chariot to meet you? Is this the time to accept money and clothing, olive groves and vineyards, sheep and oxen, menservants and maidservants? / Therefore, the leprosy of Naaman will cling to you and your descendants forever!” And as Gehazi left his presence, he was leprous—as white as snow."
        },
        {
          "reference": "Psalm 51:3-4",
          "text": "For I know my transgressions, and my sin is always before me. / Against You, You only, have I sinned and done what is evil in Your sight, so that You may be proved right when You speak and blameless when You judge."
        },
        {
          "reference": "Proverbs 12:19",
          "text": "Truthful lips endure forever, but a lying tongue lasts only a moment."
        },
        {
          "reference": "Proverbs 19:5",
          "text": "A false witness will not go unpunished, and one who utters lies will not escape."
        },
        {
          "reference": "Isaiah 29:15",
          "text": "Woe to those who dig deep to hide their plans from the LORD. In darkness they do their works and say, “Who sees us, and who will know?”"
        },
        {
          "reference": "Jeremiah 9:4-5",
          "text": "“Let everyone guard against his neighbor; do not trust any brother, for every brother deals craftily, and every friend spreads slander. / Each one betrays his friend; no one tells the truth. They have taught their tongues to lie; they wear themselves out committing iniquity."
        },
        {
          "reference": "Matthew 5:37",
          "text": "Simply let your ‘Yes’ be ‘Yes,’ and your ‘No,’ ‘No.’ Anything more comes from the evil one."
        },
        {
          "reference": "Matthew 12:36-37",
          "text": "But I tell you that men will give an account on the day of judgment for every careless word they have spoken. / For by your words you will be acquitted, and by your words you will be condemned.”"
        },
        {
          "reference": "Mark 7:21-23",
          "text": "For from within the hearts of men come evil thoughts, sexual immorality, theft, murder, adultery, / greed, wickedness, deceit, debauchery, envy, slander, arrogance, and foolishness. / All these evils come from within, and these are what defile a man.”"
        }
      ]
    },
    {
      "reference": "Genesis 20:11",
      "book": "Genesis",
      "chapter": 20,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham replied, “I said to myself, ‘There is surely no fear of God in this place, and they will kill me because of my wife.’"
        },
        {
          "version": "NLT",
          "text": "Abraham replied, “I thought, ‘This is a godless place. They will want my wife and will kill me to get her.’"
        },
        {
          "version": "ESV",
          "text": "Abraham said, “I did it because I thought, ‘There is no fear of God at all in this place, and they will kill me because of my wife.’"
        },
        {
          "version": "NKJV",
          "text": "And Abraham said, “Because I thought, surely the fear of God is not in this place; and they will kill me on account of my wife."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Proverbs 16:6",
          "text": "By loving devotion and faithfulness iniquity is atoned for, and by the fear of the LORD one turns aside from evil."
        },
        {
          "reference": "Romans 3:18",
          "text": "“There is no fear of God before their eyes.”"
        },
        {
          "reference": "Psalm 36:1",
          "text": "For the choirmaster. A Psalm of David, the servant of the LORD. An oracle is in my heart regarding the transgression of the wicked man: There is no fear of God before his eyes."
        },
        {
          "reference": "Exodus 1:17",
          "text": "The midwives, however, feared God and did not do as the king of Egypt had instructed; they let the boys live."
        },
        {
          "reference": "Job 28:28",
          "text": "And He said to man, ‘Behold, the fear of the Lord, that is wisdom, and to turn away from evil is understanding.’”"
        },
        {
          "reference": "Proverbs 8:13",
          "text": "To fear the LORD is to hate evil; I hate arrogant pride, evil conduct, and perverse speech."
        },
        {
          "reference": "Psalm 111:10",
          "text": "The fear of the LORD is the beginning of wisdom; all who follow His precepts gain rich understanding. His praise endures forever!"
        },
        {
          "reference": "Proverbs 1:7",
          "text": "The fear of the LORD is the beginning of knowledge, but fools despise wisdom and discipline."
        },
        {
          "reference": "Proverbs 9:10",
          "text": "The fear of the LORD is the beginning of wisdom, and knowledge of the Holy One is understanding."
        },
        {
          "reference": "2 Samuel 23:3",
          "text": "The God of Israel spoke; the Rock of Israel said to me, ‘He who rules the people with justice, who rules in the fear of God,"
        },
        {
          "reference": "Nehemiah 5:15",
          "text": "The governors before me had heavily burdened the people, taking from them bread and wine plus forty shekels of silver. Their servants also oppressed the people. But I did not do this, because of my fear of God."
        },
        {
          "reference": "Ecclesiastes 12:13",
          "text": "When all has been heard, the conclusion of the matter is this: Fear God and keep His commandments, because this is the whole duty of man."
        },
        {
          "reference": "Luke 18:2",
          "text": "“In a certain town there was a judge who neither feared God nor respected men."
        },
        {
          "reference": "Acts 10:35",
          "text": "but welcomes those from every nation who fear Him and do what is right."
        },
        {
          "reference": "Romans 1:21",
          "text": "For although they knew God, they neither glorified Him as God nor gave thanks to Him, but they became futile in their thinking and darkened in their foolish hearts."
        }
      ]
    },
    {
      "reference": "Genesis 20:12",
      "book": "Genesis",
      "chapter": 20,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "Besides, she really is my sister, the daughter of my father though not of my mother; and she became my wife."
        },
        {
          "version": "NLT",
          "text": "And she really is my sister, for we both have the same father, but different mothers. And I married her."
        },
        {
          "version": "ESV",
          "text": "Besides, she is indeed my sister, the daughter of my father though not the daughter of my mother, and she became my wife."
        },
        {
          "version": "NKJV",
          "text": "But indeed she is truly my sister. She is the daughter of my father, but not the daughter of my mother; and she became my wife."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:13",
          "text": "Please say you are my sister, so that I will be treated well for your sake, and on account of you my life will be spared.”"
        },
        {
          "reference": "Genesis 11:29",
          "text": "And Abram and Nahor took wives for themselves. Abram’s wife was named Sarai, and Nahor’s wife was named Milcah; she was the daughter of Haran, who was the father of both Milcah and Iscah."
        },
        {
          "reference": "Genesis 17:15-16",
          "text": "Then God said to Abraham, “As for Sarai your wife, do not call her Sarai, for her name is to be Sarah. / And I will bless her and will surely give you a son by her. I will bless her, and she will be the mother of nations; kings of peoples will descend from her.”"
        },
        {
          "reference": "Genesis 24:4",
          "text": "but will go to my country and my kindred to take a wife for my son Isaac.”"
        },
        {
          "reference": "Genesis 24:15",
          "text": "Before the servant had finished praying, Rebekah came out with her jar on her shoulder. She was the daughter of Bethuel son of Milcah, the wife of Abraham’s brother Nahor."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 26:7",
          "text": "But when the men of that place asked about his wife, he said, “She is my sister.” For he was afraid to say, “She is my wife,” since he thought to himself, “The men of this place will kill me on account of Rebekah, because she is so beautiful.”"
        },
        {
          "reference": "Genesis 29:10",
          "text": "As soon as Jacob saw Rachel, the daughter of his mother’s brother Laban, with Laban’s sheep, he went up and rolled the stone away from the mouth of the well and watered his uncle’s sheep."
        },
        {
          "reference": "Genesis 29:12",
          "text": "He told Rachel that he was Rebekah’s son, a relative of her father, and she ran and told her father."
        },
        {
          "reference": "Genesis 29:18",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.”"
        },
        {
          "reference": "Genesis 29:28",
          "text": "And Jacob did just that. He finished the week’s celebration, and Laban gave him his daughter Rachel as his wife."
        },
        {
          "reference": "Genesis 30:4",
          "text": "So Rachel gave Jacob her servant Bilhah as a wife, and he slept with her,"
        },
        {
          "reference": "Genesis 30:9",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife."
        },
        {
          "reference": "Genesis 31:15",
          "text": "Are we not regarded by him as outsiders? Not only has he sold us, but he has certainly squandered what was paid for us."
        },
        {
          "reference": "Genesis 35:22",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons:"
        }
      ]
    },
    {
      "reference": "Genesis 20:13",
      "book": "Genesis",
      "chapter": 20,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "And when God had me wander from my father’s household, I said to her, ‘This is how you can show your love to me: Everywhere we go, say of me, “He is my brother.\"’”"
        },
        {
          "version": "NLT",
          "text": "When God called me to leave my father’s home and to travel from place to place, I told her, ‘Do me a favor. Wherever we go, tell the people that I am your brother.’”"
        },
        {
          "version": "ESV",
          "text": "And when God caused me to wander from my father’s house, I said to her, ‘This is the kindness you must do me: at every place to which we come, say of me, “He is my brother.”’”"
        },
        {
          "version": "NKJV",
          "text": "And it came to pass, when God caused me to wander from my father’s house, that I said to her, ‘This is your kindness that you should do for me: in every place, wherever we go, say of me, “He is my brother.” ’ ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:11-13",
          "text": "As he was about to enter Egypt, he said to his wife Sarai, “Look, I know that you are a beautiful woman, / and when the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live. / Please say you are my sister, so that I will be treated well for your sake, and on account of you my life will be spared.”"
        },
        {
          "reference": "Genesis 26:7-9",
          "text": "But when the men of that place asked about his wife, he said, “She is my sister.” For he was afraid to say, “She is my wife,” since he thought to himself, “The men of this place will kill me on account of Rebekah, because she is so beautiful.” / When Isaac had been there a long time, Abimelech king of the Philistines looked down from the window and was surprised to see Isaac caressing his wife Rebekah. / Abimelech sent for Isaac and said, “So she is really your wife! How could you say, ‘She is my sister’?” Isaac replied, “Because I thought I might die on account of her.”"
        },
        {
          "reference": "Hebrews 11:8-9",
          "text": "By faith Abraham, when called to go to a place he would later receive as his inheritance, obeyed and went, without knowing where he was going. / By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "1 Peter 3:6",
          "text": "just as Sarah obeyed Abraham and called him lord. And you are her children if you do what is right and refuse to give way to fear."
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 17:1-8",
          "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, “I am God Almighty. Walk before Me and be blameless. / I will establish My covenant between Me and you, and I will multiply you exceedingly.” / Then Abram fell facedown, and God said to him, ..."
        },
        {
          "reference": "Genesis 18:10-15",
          "text": "Then the LORD said, “I will surely return to you at this time next year, and your wife Sarah will have a son!” Now Sarah was behind him, listening at the entrance to the tent. / And Abraham and Sarah were already old and well along in years; Sarah had passed the age of childbearing. / So she laughed to herself, saying, “After I am worn out and my master is old, will I now have this pleasure?” ..."
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Romans 4:17-21",
          "text": "As it is written: “I have made you a father of many nations.” He is our father in the presence of God, in whom he believed, the God who gives life to the dead and calls into being what does not yet exist. / Against all hope, Abraham in hope believed and so became the father of many nations, just as he had been told, “So shall your offspring be.” / Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. ..."
        },
        {
          "reference": "Galatians 3:6-9",
          "text": "So also, “Abraham believed God, and it was credited to him as righteousness.” / Understand, then, that those who have faith are sons of Abraham. / The Scripture foresaw that God would justify the Gentiles by faith, and foretold the gospel to Abraham: “All nations will be blessed through you.” ..."
        },
        {
          "reference": "Genesis 15:1-6",
          "text": "After these events, the word of the LORD came to Abram in a vision: “Do not be afraid, Abram. I am your shield, your very great reward.” / But Abram replied, “O Lord GOD, what can You give me, since I remain childless, and the heir of my house is Eliezer of Damascus?” / Abram continued, “Behold, You have given me no offspring, so a servant in my household will be my heir.” ..."
        },
        {
          "reference": "Genesis 24:7",
          "text": "The LORD, the God of heaven, who brought me from my father’s house and my native land, who spoke to me and promised me on oath, saying, ‘To your offspring I will give this land’—He will send His angel before you so that you can take a wife for my son from there."
        },
        {
          "reference": "Acts 7:2-5",
          "text": "And Stephen declared: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Haran, / and told him, ‘Leave your country and your kindred and go to the land I will show you.’ / So Abraham left the land of the Chaldeans and settled in Haran. After his father died, God brought him out of that place and into this land where you are now living. ..."
        },
        {
          "reference": "Genesis 11:31-32",
          "text": "And Terah took his son Abram, his grandson Lot son of Haran, and his daughter-in-law Sarai the wife of Abram, and they set out from Ur of the Chaldeans for the land of Canaan. But when they arrived in Haran, they settled there. / Terah lived 205 years, and he died in Haran."
        },
        {
          "reference": "Genesis 13:14-17",
          "text": "After Lot had departed, the LORD said to Abram, “Now lift up your eyes from the place where you are, and look to the north and south and east and west, / for all the land that you see, I will give to you and your offspring forever. / I will make your offspring like the dust of the earth, so that if one could count the dust of the earth, then your offspring could be counted. ..."
        }
      ]
    },
    {
      "reference": "Genesis 20:14",
      "book": "Genesis",
      "chapter": 20,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Abimelek brought sheep and cattle and male and female slaves and gave them to Abraham, and he returned Sarah his wife to him."
        },
        {
          "version": "NLT",
          "text": "Then Abimelech took some of his sheep and goats, cattle, and male and female servants, and he presented them to Abraham. He also returned his wife, Sarah, to him."
        },
        {
          "version": "ESV",
          "text": "Then Abimelech took sheep and oxen, and male servants and female servants, and gave them to Abraham, and returned Sarah his wife to him."
        },
        {
          "version": "NKJV",
          "text": "Then Abimelech took sheep, oxen, and male and female servants, and gave them to Abraham; and he restored Sarah his wife to him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:16",
          "text": "He treated Abram well on her account, and Abram acquired sheep and cattle, male and female donkeys, menservants and maidservants, and camels."
        },
        {
          "reference": "Genesis 26:14",
          "text": "He owned so many flocks and herds and servants that the Philistines envied him."
        },
        {
          "reference": "Exodus 12:32",
          "text": "Take your flocks and herds as well, just as you have said, and depart! And bless me also.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Job 42:10",
          "text": "After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions."
        },
        {
          "reference": "1 Samuel 25:18-19",
          "text": "Then Abigail hurried and took two hundred loaves of bread, two skins of wine, five butchered sheep, five seahs of roasted grain, a hundred clusters of raisins, and two hundred cakes of figs. She loaded them on donkeys / and said to her young men, “Go ahead of me. I will be right behind you.” But she did not tell her husband Nabal."
        },
        {
          "reference": "2 Samuel 16:1-2",
          "text": "When David had gone a little beyond the summit, Ziba the servant of Mephibosheth was there to meet him. He had a pair of saddled donkeys loaded with two hundred loaves of bread, a hundred clusters of raisins, a hundred summer fruits, and a skin of wine. / “Why do you have these?” asked the king. Ziba replied, “The donkeys are for the king’s household to ride, the bread and summer fruit are for the young men to eat, and the wine is to refresh those who become exhausted in the wilderness.”"
        },
        {
          "reference": "2 Kings 8:9",
          "text": "So Hazael went to meet Elisha, taking with him a gift of forty camel loads of every good thing from Damascus. And he went in and stood before him and said, “Your son Ben-hadad king of Aram has sent me to ask, ‘Will I recover from this illness?’”"
        },
        {
          "reference": "2 Chronicles 21:3",
          "text": "Their father had given them many gifts of silver and gold and precious things, as well as the fortified cities in Judah; but he gave the kingdom to Jehoram because he was the firstborn."
        },
        {
          "reference": "Esther 8:15",
          "text": "Mordecai went out from the presence of the king in royal garments of blue and white, with a large gold crown and a purple robe of fine linen. And the city of Susa shouted and rejoiced."
        },
        {
          "reference": "Isaiah 60:5-7",
          "text": "Then you will look and be radiant, and your heart will tremble and swell with joy, because the riches of the sea will be brought to you, and the wealth of the nations will come to you. / Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD. / All the flocks of Kedar will be gathered to you; the rams of Nebaioth will serve you and go up on My altar with acceptance; I will adorn My glorious house."
        },
        {
          "reference": "Matthew 2:11",
          "text": "On coming to the house, they saw the Child with His mother Mary, and they fell down and worshiped Him. Then they opened their treasures and presented Him with gifts of gold and frankincense and myrrh."
        },
        {
          "reference": "Matthew 5:44",
          "text": "But I tell you, love your enemies and pray for those who persecute you,"
        },
        {
          "reference": "Luke 6:27-28",
          "text": "But to those of you who will listen, I say: Love your enemies, do good to those who hate you, / bless those who curse you, pray for those who mistreat you."
        },
        {
          "reference": "Luke 6:35",
          "text": "But love your enemies, do good to them, and lend to them, expecting nothing in return. Then your reward will be great, and you will be sons of the Most High; for He is kind to the ungrateful and wicked."
        }
      ]
    },
    {
      "reference": "Genesis 20:15",
      "book": "Genesis",
      "chapter": 20,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "And Abimelek said, “My land is before you; live wherever you like.”"
        },
        {
          "version": "NLT",
          "text": "Then Abimelech said, “Look over my land and choose any place where you would like to live.”"
        },
        {
          "version": "ESV",
          "text": "And Abimelech said, “Behold, my land is before you; dwell where it pleases you.”"
        },
        {
          "version": "NKJV",
          "text": "And Abimelech said, “See, my land is before you; dwell where it pleases you.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:10-20",
          "text": "Now there was a famine in the land. So Abram went down to Egypt to live there for a while because the famine was severe. / As he was about to enter Egypt, he said to his wife Sarai, “Look, I know that you are a beautiful woman, / and when the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live. ..."
        },
        {
          "reference": "Genesis 26:1-11",
          "text": "Now there was another famine in the land, subsequent to the one that had occurred in Abraham’s time. And Isaac went to Abimelech king of the Philistines at Gerar. / The LORD appeared to Isaac and said, “Do not go down to Egypt. Settle in the land where I tell you. / Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. ..."
        },
        {
          "reference": "Genesis 13:14-17",
          "text": "After Lot had departed, the LORD said to Abram, “Now lift up your eyes from the place where you are, and look to the north and south and east and west, / for all the land that you see, I will give to you and your offspring forever. / I will make your offspring like the dust of the earth, so that if one could count the dust of the earth, then your offspring could be counted. ..."
        },
        {
          "reference": "Genesis 21:22-34",
          "text": "At that time Abimelech and Phicol the commander of his army said to Abraham, “God is with you in all that you do. / Now, therefore, swear to me here before God that you will not deal falsely with me or my children or descendants. Show to me and to the country in which you reside the same kindness that I have shown to you.” / And Abraham replied, “I swear it.” ..."
        },
        {
          "reference": "Genesis 23:3-20",
          "text": "Then Abraham got up from beside his dead wife and said to the Hittites, / “I am a foreigner and an outsider among you. Give me a burial site among you so that I can bury my dead.” / The Hittites replied to Abraham, ..."
        },
        {
          "reference": "Genesis 24:35",
          "text": "“The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys."
        },
        {
          "reference": "Genesis 26:12-14",
          "text": "Now Isaac sowed seed in the land, and that very year he reaped a hundredfold. And the LORD blessed him, / and he became richer and richer, until he was exceedingly wealthy. / He owned so many flocks and herds and servants that the Philistines envied him."
        },
        {
          "reference": "Genesis 31:24",
          "text": "But that night God came to Laban the Aramean in a dream and warned him, “Be careful not to say anything to Jacob, either good or bad.”"
        },
        {
          "reference": "Genesis 39:5",
          "text": "From the time that he put Joseph in charge of his household and all he owned, the LORD blessed the Egyptian’s household on account of him. The LORD’s blessing was on everything he owned, both in his house and in his field."
        },
        {
          "reference": "Exodus 12:36",
          "text": "And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 11:3",
          "text": "And the LORD gave the people favor in the sight of the Egyptians. Moreover, Moses himself was highly regarded in Egypt by Pharaoh’s officials and by the people."
        },
        {
          "reference": "Exodus 33:12-17",
          "text": "Then Moses said to the LORD, “Look, You have been telling me, ‘Lead this people up,’ but You have not let me know whom You will send with me. Yet You have said, ‘I know you by name, and you have found favor in My sight.’ / Now if indeed I have found favor in Your sight, please let me know Your ways, that I may know You and find favor in Your sight. Remember that this nation is Your people.” / And the LORD answered, “My Presence will go with you, and I will give you rest.” ..."
        },
        {
          "reference": "Deuteronomy 2:25",
          "text": "This very day I will begin to put the dread and fear of you upon all the nations under heaven. They will hear the reports of you and tremble in anguish because of you.”"
        },
        {
          "reference": "1 Kings 10:9",
          "text": "Blessed be the LORD your God, who has delighted in you to set you on the throne of Israel. Because of the LORD’s eternal love for Israel, He has made you king to carry out justice and righteousness.”"
        }
      ]
    },
    {
      "reference": "Genesis 20:16",
      "book": "Genesis",
      "chapter": 20,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "To Sarah he said, “I am giving your brother a thousand shekels of silver. This is to cover the offense against you before all who are with you; you are completely vindicated.”"
        },
        {
          "version": "NLT",
          "text": "And he said to Sarah, “Look, I am giving your ‘brother’ 1,000 pieces of silver in the presence of all these witnesses. This is to compensate you for any wrong I may have done to you. This will settle any claim against me, and your reputation is cleared.”"
        },
        {
          "version": "ESV",
          "text": "To Sarah he said, “Behold, I have given your brother a thousand pieces of silver. It is a sign of your innocence in the eyes of all who are with you, and before everyone you are vindicated.”"
        },
        {
          "version": "NKJV",
          "text": "Then to Sarah he said, “Behold, I have given your brother a thousand pieces of silver; indeed this vindicates you before all who are with you and before everybody.” Thus she was rebuked."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:18-20",
          "text": "So Pharaoh summoned Abram and asked, “What have you done to me? Why didn’t you tell me she was your wife? / Why did you say, ‘She is my sister,’ so that I took her as my wife? Now then, here is your wife. Take her and go!” / Then Pharaoh gave his men orders concerning Abram, and they sent him away with his wife and all his possessions."
        },
        {
          "reference": "Genesis 26:10-11",
          "text": "“What is this you have done to us?” asked Abimelech. “One of the people could easily have slept with your wife, and you would have brought guilt upon us.” / So Abimelech warned all the people, saying, “Whoever harms this man or his wife will surely be put to death.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Numbers 22:32-33",
          "text": "The angel of the LORD asked him, “Why have you beaten your donkey these three times? Behold, I have come out to oppose you, because your way is perverse before me. / The donkey saw me and turned away from me these three times. If she had not turned away, then by now I would surely have killed you and let her live.”"
        },
        {
          "reference": "Deuteronomy 22:19",
          "text": "They are also to fine him a hundred shekels of silver and give them to the young woman’s father, because this man has given a virgin of Israel a bad name. And she shall remain his wife; he must not divorce her as long as he lives."
        },
        {
          "reference": "1 Samuel 25:35",
          "text": "Then David accepted from her hand what she had brought him, and he said to her, “Go home in peace. See, I have heeded your voice and granted your request.”"
        },
        {
          "reference": "2 Samuel 12:6",
          "text": "Because he has done this thing and has shown no pity, he must pay for the lamb four times over.”"
        },
        {
          "reference": "2 Kings 12:16",
          "text": "The money from the guilt offerings and sin offerings was not brought into the house of the LORD; it belonged to the priests."
        },
        {
          "reference": "Job 42:9-10",
          "text": "So Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite went and did as the LORD had told them; and the LORD accepted Job’s prayer. / After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions."
        },
        {
          "reference": "Proverbs 6:31",
          "text": "Yet if caught, he must pay sevenfold; he must give up all the wealth of his house."
        },
        {
          "reference": "Isaiah 53:12",
          "text": "Therefore I will allot Him a portion with the great, and He will divide the spoils with the strong, because He has poured out His life unto death, and He was numbered with the transgressors. Yet He bore the sin of many and made intercession for the transgressors."
        },
        {
          "reference": "Matthew 5:23-24",
          "text": "So if you are offering your gift at the altar and there remember that your brother has something against you, / leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        },
        {
          "reference": "Matthew 18:15",
          "text": "If your brother sins against you, go and confront him privately. If he listens to you, you have won your brother over."
        },
        {
          "reference": "Luke 19:8",
          "text": "But Zacchaeus stood up and said to the Lord, “Look, Lord, half of my possessions I give to the poor, and if I have cheated anyone, I will repay it fourfold.”"
        },
        {
          "reference": "John 8:11",
          "text": "“No one, Lord,” she answered. “Then neither do I condemn you,” Jesus declared. “Now go and sin no more.”"
        }
      ]
    },
    {
      "reference": "Genesis 20:17",
      "book": "Genesis",
      "chapter": 20,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Abraham prayed to God, and God healed Abimelek, his wife and his female slaves so they could have children again,"
        },
        {
          "version": "NLT",
          "text": "Then Abraham prayed to God, and God healed Abimelech, his wife, and his female servants, so they could have children."
        },
        {
          "version": "ESV",
          "text": "Then Abraham prayed to God, and God healed Abimelech, and also healed his wife and female slaves so that they bore children."
        },
        {
          "version": "NKJV",
          "text": "So Abraham prayed to God; and God healed Abimelech, his wife, and his female servants. Then they bore children;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "James 5:16",
          "text": "Therefore confess your sins to each other and pray for each other so that you may be healed. The prayer of a righteous man has great power to prevail."
        },
        {
          "reference": "1 Samuel 1:27",
          "text": "I prayed for this boy, and since the LORD has granted me what I asked of Him,"
        },
        {
          "reference": "Job 42:10",
          "text": "After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions."
        },
        {
          "reference": "Numbers 12:13",
          "text": "So Moses cried out to the LORD, “O God, please heal her!”"
        },
        {
          "reference": "2 Kings 20:5",
          "text": "“Go back and tell Hezekiah the leader of My people that this is what the LORD, the God of your father David, says: ‘I have heard your prayer; I have seen your tears. I will surely heal you. On the third day from now you will go up to the house of the LORD."
        },
        {
          "reference": "Matthew 7:7",
          "text": "Ask, and it will be given to you; seek, and you will find; knock, and the door will be opened to you."
        },
        {
          "reference": "Luke 11:9",
          "text": "So I tell you: Ask, and it will be given to you; seek, and you will find; knock, and the door will be opened to you."
        },
        {
          "reference": "1 John 5:14-15",
          "text": "And this is the confidence that we have before Him: If we ask anything according to His will, He hears us. / And if we know that He hears us in whatever we ask, we know that we already possess what we have asked of Him."
        },
        {
          "reference": "Mark 11:24",
          "text": "Therefore I tell you, whatever you ask for in prayer, believe that you have received it, and it will be yours."
        },
        {
          "reference": "Philippians 4:6",
          "text": "Be anxious for nothing, but in everything, by prayer and petition, with thanksgiving, present your requests to God."
        },
        {
          "reference": "1 Timothy 2:1",
          "text": "First of all, then, I urge that petitions, prayers, intercessions, and thanksgiving be offered for everyone—"
        },
        {
          "reference": "Jeremiah 33:3",
          "text": "Call to Me, and I will answer and show you great and unsearchable things you do not know."
        },
        {
          "reference": "Psalm 30:2",
          "text": "O LORD my God, I cried to You for help, and You healed me."
        },
        {
          "reference": "2 Chronicles 30:20",
          "text": "And the LORD heard Hezekiah and healed the people."
        },
        {
          "reference": "Acts 28:8",
          "text": "The father of Publius was sick in bed, suffering from fever and dysentery. Paul went in to see him, and after praying and placing his hands on him, he healed the man."
        }
      ]
    },
    {
      "reference": "Genesis 20:18",
      "book": "Genesis",
      "chapter": 20,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "for the LORD had kept all the women in Abimelek’s household from conceiving because of Abraham’s wife Sarah."
        },
        {
          "version": "NLT",
          "text": "For the LORD had caused all the women to be infertile because of what happened with Abraham’s wife, Sarah."
        },
        {
          "version": "ESV",
          "text": "For the LORD had closed all the wombs of the house of Abimelech because of Sarah, Abraham’s wife."
        },
        {
          "version": "NKJV",
          "text": "for the LORD had closed up all the wombs of the house of Abimelech because of Sarah, Abraham’s wife."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:17",
          "text": "The LORD, however, afflicted Pharaoh and his household with severe plagues because of Abram’s wife Sarai."
        },
        {
          "reference": "Genesis 16:2",
          "text": "So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 30:2",
          "text": "Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "1 Samuel 1:5-6",
          "text": "But to Hannah he would give a double portion, for he loved her even though the LORD had closed her womb. / Because the LORD had closed Hannah’s womb, her rival would provoke her viciously to taunt her."
        },
        {
          "reference": "1 Samuel 5:6-12",
          "text": "Now the hand of the LORD was heavy on the people of Ashdod and its vicinity, ravaging them and afflicting them with tumors. / And when the men of Ashdod saw what was happening, they said, “The ark of the God of Israel must not stay here with us, because His hand is heavy upon us and upon our god Dagon.” / So they called together all the rulers of the Philistines and asked, “What shall we do with the ark of the God of Israel?” “It must be moved to Gath,” they replied. So they carried away the ark of the God of Israel. ..."
        },
        {
          "reference": "2 Samuel 6:23",
          "text": "And Michal the daughter of Saul had no children to the day of her death."
        },
        {
          "reference": "2 Kings 4:14-17",
          "text": "So he asked, “Then what should be done for her?” “Well, she has no son,” Gehazi replied, “and her husband is old.” / “Call her,” said Elisha. So Gehazi called her, and she stood in the doorway. / And Elisha declared, “At this time next year, you will hold a son in your arms.” “No, my lord,” she said. “Do not lie to your maidservant, O man of God.” ..."
        },
        {
          "reference": "Psalm 113:9",
          "text": "He settles the barren woman in her home as a joyful mother to her children. Hallelujah!"
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "Hosea 9:14",
          "text": "Give them, O LORD—what will You give? Give them wombs that miscarry and breasts that dry up!"
        },
        {
          "reference": "Luke 1:7",
          "text": "But they had no children, because Elizabeth was barren, and they were both well along in years."
        },
        {
          "reference": "Luke 1:36-37",
          "text": "Look, even Elizabeth your relative has conceived a son in her old age, and she who was called barren is in her sixth month. / For no word from God will ever fail.”"
        },
        {
          "reference": "Luke 1:57",
          "text": "When the time came for Elizabeth to have her child, she gave birth to a son."
        },
        {
          "reference": "Acts 5:19-20",
          "text": "But during the night an angel of the Lord opened the doors of the jail and brought them out, saying, / “Go, stand in the temple courts and tell the people the full message of this new life.”"
        },
        {
          "reference": "Acts 12:23",
          "text": "Immediately, because Herod did not give glory to God, an angel of the Lord struck him down, and he was eaten by worms and died."
        }
      ]
    }
  ]
}