{
  "book": "genesis",
  "chapter": 25,
  "verses": [
    {
      "reference": "Genesis 25:1",
      "book": "Genesis",
      "chapter": 25,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham had taken another wife, whose name was Keturah."
        },
        {
          "version": "NLT",
          "text": "Abraham married another wife, whose name was Keturah."
        },
        {
          "version": "ESV",
          "text": "Abraham took another wife, whose name was Keturah."
        },
        {
          "version": "NKJV",
          "text": "Abraham again took a wife, and her name was Keturah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:32",
          "text": "The sons born to Keturah, Abraham’s concubine: Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. The sons of Jokshan: Sheba and Dedan."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 21:2-3",
          "text": "So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised. / And Abraham gave the name Isaac to the son Sarah bore to him."
        },
        {
          "reference": "Genesis 16:3",
          "text": "So after he had lived in Canaan for ten years, his wife Sarai took her Egyptian maidservant Hagar and gave her to Abram to be his wife."
        },
        {
          "reference": "Genesis 22:20-24",
          "text": "Some time later, Abraham was told, “Milcah has also borne sons to your brother Nahor: / Uz the firstborn, his brother Buz, Kemuel (the father of Aram), / Chesed, Hazo, Pildash, Jidlaph, and Bethuel.” ..."
        },
        {
          "reference": "Genesis 23:1-2",
          "text": "Now Sarah lived to be 127 years old. / She died in Kiriath-arba (that is, Hebron) in the land of Canaan, and Abraham went out to mourn and to weep for her."
        },
        {
          "reference": "Genesis 17:1-2",
          "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, “I am God Almighty. Walk before Me and be blameless. / I will establish My covenant between Me and you, and I will multiply you exceedingly.”"
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 15:1-6",
          "text": "After these events, the word of the LORD came to Abram in a vision: “Do not be afraid, Abram. I am your shield, your very great reward.” / But Abram replied, “O Lord GOD, what can You give me, since I remain childless, and the heir of my house is Eliezer of Damascus?” / Abram continued, “Behold, You have given me no offspring, so a servant in my household will be my heir.” ..."
        },
        {
          "reference": "Genesis 18:10-14",
          "text": "Then the LORD said, “I will surely return to you at this time next year, and your wife Sarah will have a son!” Now Sarah was behind him, listening at the entrance to the tent. / And Abraham and Sarah were already old and well along in years; Sarah had passed the age of childbearing. / So she laughed to herself, saying, “After I am worn out and my master is old, will I now have this pleasure?” ..."
        },
        {
          "reference": "Genesis 20:1-2",
          "text": "Now Abraham journeyed from there to the region of the Negev and settled between Kadesh and Shur. While he was staying in Gerar, / Abraham said of his wife Sarah, “She is my sister.” So Abimelech king of Gerar had Sarah brought to him."
        },
        {
          "reference": "Romans 4:19",
          "text": "Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb."
        },
        {
          "reference": "Hebrews 11:11-12",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised. / And so from one man, and he as good as dead, came descendants as numerous as the stars in the sky and as countless as the sand on the seashore."
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "Matthew 1:1-2",
          "text": "This is the record of the genealogy of Jesus Christ, the son of David, the son of Abraham: / Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        }
      ]
    },
    {
      "reference": "Genesis 25:2",
      "book": "Genesis",
      "chapter": 25,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "She bore him Zimran, Jokshan, Medan, Midian, Ishbak and Shuah."
        },
        {
          "version": "NLT",
          "text": "She gave birth to Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah."
        },
        {
          "version": "ESV",
          "text": "She bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah."
        },
        {
          "version": "NKJV",
          "text": "And she bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:32-33",
          "text": "The sons born to Keturah, Abraham’s concubine: Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. The sons of Jokshan: Sheba and Dedan. / The sons of Midian: Ephah, Epher, Hanoch, Abida, and Eldaah. All of these were Keturah’s sons."
        },
        {
          "reference": "Genesis 21:2-3",
          "text": "So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised. / And Abraham gave the name Isaac to the son Sarah bore to him."
        },
        {
          "reference": "Genesis 16:15",
          "text": "And Hagar bore Abram a son, and Abram gave the name Ishmael to the son she had borne."
        },
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 22:20-24",
          "text": "Some time later, Abraham was told, “Milcah has also borne sons to your brother Nahor: / Uz the firstborn, his brother Buz, Kemuel (the father of Aram), / Chesed, Hazo, Pildash, Jidlaph, and Bethuel.” ..."
        },
        {
          "reference": "Genesis 24:36",
          "text": "My master’s wife Sarah has borne him a son in her old age, and my master has given him everything he owns."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:3",
          "text": "and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Exodus 2:21",
          "text": "Moses agreed to stay with the man, and he gave his daughter Zipporah to Moses in marriage."
        },
        {
          "reference": "Numbers 12:1",
          "text": "Then Miriam and Aaron criticized Moses because of the Cushite woman he had married, for he had taken a Cushite wife."
        },
        {
          "reference": "Judges 6:3",
          "text": "Whenever the Israelites planted their crops, the Midianites, Amalekites, and other people of the east would come up and invade them,"
        },
        {
          "reference": "1 Samuel 25:1-3",
          "text": "When Samuel died, all Israel gathered to mourn for him; and they buried him at his home in Ramah. Then David set out and went down to the Wilderness of Paran. / Now there was a man in Maon whose business was in Carmel. He was a very wealthy man with a thousand goats and three thousand sheep, which he was shearing in Carmel. / His name was Nabal, and his wife’s name was Abigail. She was an intelligent and beautiful woman, but her husband, a Calebite, was harsh and evil in his dealings."
        },
        {
          "reference": "1 Kings 11:1-3",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love. / He had seven hundred wives of royal birth and three hundred concubines—and his wives turned his heart away."
        },
        {
          "reference": "1 Chronicles 1:28",
          "text": "The sons of Abraham were Isaac and Ishmael."
        }
      ]
    },
    {
      "reference": "Genesis 25:3",
      "book": "Genesis",
      "chapter": 25,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Jokshan was the father of Sheba and Dedan; the descendants of Dedan were the Ashurites, the Letushites and the Leummites."
        },
        {
          "version": "NLT",
          "text": "Jokshan was the father of Sheba and Dedan. Dedan’s descendants were the Asshurites, Letushites, and Leummites."
        },
        {
          "version": "ESV",
          "text": "Jokshan fathered Sheba and Dedan. The sons of Dedan were Asshurim, Letushim, and Leummim."
        },
        {
          "version": "NKJV",
          "text": "Jokshan begot Sheba and Dedan. And the sons of Dedan were Asshurim, Letushim, and Leummim."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:32-33",
          "text": "The sons born to Keturah, Abraham’s concubine: Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. The sons of Jokshan: Sheba and Dedan. / The sons of Midian: Ephah, Epher, Hanoch, Abida, and Eldaah. All of these were Keturah’s sons."
        },
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Judges 6:3",
          "text": "Whenever the Israelites planted their crops, the Midianites, Amalekites, and other people of the east would come up and invade them,"
        },
        {
          "reference": "Judges 8:24",
          "text": "Then he added, “Let me make a request of you, that each of you give me an earring from his plunder.” (For the enemies had gold earrings because they were Ishmaelites.)"
        },
        {
          "reference": "1 Kings 10:15",
          "text": "not including the revenue from the merchants, traders, and all the Arabian kings and governors of the land."
        },
        {
          "reference": "Job 1:3",
          "text": "and he owned 7,000 sheep, 3,000 camels, 500 yoke of oxen, 500 female donkeys, and a very large number of servants. Job was the greatest man of all the people of the East."
        },
        {
          "reference": "Isaiah 60:6",
          "text": "Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD."
        },
        {
          "reference": "Jeremiah 6:20",
          "text": "What use to Me is frankincense from Sheba or sweet cane from a distant land? Your burnt offerings are not acceptable; your sacrifices do not please Me.”"
        },
        {
          "reference": "Ezekiel 27:21",
          "text": "Arabia and all the princes of Kedar were your customers, trading in lambs, rams, and goats."
        },
        {
          "reference": "Matthew 2:1-2",
          "text": "After Jesus was born in Bethlehem in Judea, during the time of King Herod, Magi from the east arrived in Jerusalem, / asking, “Where is the One who has been born King of the Jews? We saw His star in the east and have come to worship Him.”"
        },
        {
          "reference": "Matthew 12:42",
          "text": "The Queen of the South will rise at the judgment with this generation and condemn it; for she came from the ends of the earth to hear the wisdom of Solomon, and now One greater than Solomon is here."
        },
        {
          "reference": "Acts 8:27",
          "text": "So he started out, and on his way he met an Ethiopian eunuch, a court official in charge of the entire treasury of Candace, queen of the Ethiopians. He had gone to Jerusalem to worship,"
        },
        {
          "reference": "Galatians 4:25",
          "text": "Now Hagar stands for Mount Sinai in Arabia and corresponds to the present-day Jerusalem, because she is in slavery with her children."
        },
        {
          "reference": "1 Kings 4:30",
          "text": "Solomon’s wisdom was greater than that of all the men of the East, greater than all the wisdom of Egypt."
        },
        {
          "reference": "2 Chronicles 9:14",
          "text": "not including the revenue from the merchants and traders. And all the Arabian kings and governors of the land also brought gold and silver to Solomon."
        }
      ]
    },
    {
      "reference": "Genesis 25:4",
      "book": "Genesis",
      "chapter": 25,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Midian were Ephah, Epher, Hanok, Abida and Eldaah. All these were descendants of Keturah."
        },
        {
          "version": "NLT",
          "text": "Midian’s sons were Ephah, Epher, Hanoch, Abida, and Eldaah. These were all descendants of Abraham through Keturah."
        },
        {
          "version": "ESV",
          "text": "The sons of Midian were Ephah, Epher, Hanoch, Abida, and Eldaah. All these were the children of Keturah."
        },
        {
          "version": "NKJV",
          "text": "And the sons of Midian were Ephah, Epher, Hanoch, Abidah, and Eldaah. All these were the children of Keturah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:32-33",
          "text": "The sons born to Keturah, Abraham’s concubine: Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. The sons of Jokshan: Sheba and Dedan. / The sons of Midian: Ephah, Epher, Hanoch, Abida, and Eldaah. All of these were Keturah’s sons."
        },
        {
          "reference": "Genesis 21:13",
          "text": "But I will also make a nation of the slave woman’s son, because he is your offspring.”"
        },
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 16:10-12",
          "text": "Then the angel added, “I will greatly multiply your offspring so that they will be too numerous to count.” / The angel of the LORD proceeded: “Behold, you have conceived and will bear a son. And you shall name him Ishmael, for the LORD has heard your cry of affliction. / He will be a wild donkey of a man, and his hand will be against everyone, and everyone’s hand against him; he will live in hostility toward all his brothers.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:3",
          "text": "and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Genesis 46:3",
          "text": "“I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there."
        },
        {
          "reference": "Exodus 2:15",
          "text": "When Pharaoh heard about this matter, he sought to kill Moses. But Moses fled from Pharaoh and settled in the land of Midian, where he sat down beside a well."
        },
        {
          "reference": "Judges 6:3",
          "text": "Whenever the Israelites planted their crops, the Midianites, Amalekites, and other people of the east would come up and invade them,"
        },
        {
          "reference": "1 Kings 11:18",
          "text": "Hadad and his men set out from Midian and went to Paran. They took men from Paran with them and went to Egypt, to Pharaoh king of Egypt, who gave Hadad a house and land and provided him with food."
        },
        {
          "reference": "Isaiah 60:6-7",
          "text": "Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD. / All the flocks of Kedar will be gathered to you; the rams of Nebaioth will serve you and go up on My altar with acceptance; I will adorn My glorious house."
        },
        {
          "reference": "Jeremiah 25:23",
          "text": "Dedan, Tema, Buz, and all who cut the corners of their hair;"
        },
        {
          "reference": "Ezekiel 27:21",
          "text": "Arabia and all the princes of Kedar were your customers, trading in lambs, rams, and goats."
        },
        {
          "reference": "Romans 9:7",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.”"
        }
      ]
    },
    {
      "reference": "Genesis 25:5",
      "book": "Genesis",
      "chapter": 25,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham left everything he owned to Isaac."
        },
        {
          "version": "NLT",
          "text": "Abraham gave everything he owned to his son Isaac."
        },
        {
          "version": "ESV",
          "text": "Abraham gave all he had to Isaac."
        },
        {
          "version": "NKJV",
          "text": "And Abraham gave all that he had to Isaac."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:10-12",
          "text": "and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!” / Now this matter distressed Abraham greatly because it concerned his son Ishmael. / But God said to Abraham, “Do not be distressed about the boy and your maidservant. Listen to everything that Sarah tells you, for through Isaac your offspring will be reckoned."
        },
        {
          "reference": "Genesis 24:36",
          "text": "My master’s wife Sarah has borne him a son in her old age, and my master has given him everything he owns."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 17:19-21",
          "text": "But God replied, “Your wife Sarah will indeed bear you a son, and you are to name him Isaac. I will establish My covenant with him as an everlasting covenant for his descendants after him. / As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation. / But I will establish My covenant with Isaac, whom Sarah will bear to you at this time next year.”"
        },
        {
          "reference": "Genesis 26:3-5",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed, / because Abraham listened to My voice and kept My charge, My commandments, My statutes, and My laws.”"
        },
        {
          "reference": "Genesis 28:4",
          "text": "And may He give the blessing of Abraham to you and your descendants, so that you may possess the land where you dwell as a foreigner, the land God gave to Abraham.”"
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Genesis 48:4",
          "text": "and told me, ‘Behold, I will make you fruitful and multiply you; I will make you a multitude of peoples, and will give this land to your descendants after you as an everlasting possession.’"
        },
        {
          "reference": "Genesis 49:28-33",
          "text": "These are the tribes of Israel, twelve in all, and this was what their father said to them. He blessed them, and he blessed each one with a suitable blessing. / Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. ..."
        },
        {
          "reference": "Exodus 32:13",
          "text": "Remember Your servants Abraham, Isaac, and Israel, to whom You swore by Your very self when You declared, ‘I will make your descendants as numerous as the stars in the sky, and I will give your descendants all this land that I have promised, and it shall be their inheritance forever.’”"
        },
        {
          "reference": "Romans 9:7-9",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Galatians 4:28-31",
          "text": "Now you, brothers, like Isaac, are children of promise. / At that time, however, the son born by the flesh persecuted the son born by the Spirit. It is the same now. / But what does the Scripture say? “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with the free woman’s son.” ..."
        },
        {
          "reference": "Hebrews 11:18",
          "text": "even though God had said to him, “Through Isaac your offspring will be reckoned.”"
        },
        {
          "reference": "Acts 7:5",
          "text": "He gave him no inheritance here, not even a foot of ground. But God promised to give possession of the land to Abraham and his descendants, even though he did not yet have a child."
        },
        {
          "reference": "Romans 4:13",
          "text": "For the promise to Abraham and his offspring that he would be heir of the world was not given through the law, but through the righteousness that comes by faith."
        }
      ]
    },
    {
      "reference": "Genesis 25:6",
      "book": "Genesis",
      "chapter": 25,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "But while he was still living, he gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east."
        },
        {
          "version": "NLT",
          "text": "But before he died, he gave gifts to the sons of his concubines and sent them off to a land in the east, away from Isaac."
        },
        {
          "version": "ESV",
          "text": "But to the sons of his concubines Abraham gave gifts, and while he was still living he sent them away from his son Isaac, eastward to the east country."
        },
        {
          "version": "NKJV",
          "text": "But Abraham gave gifts to the sons of the concubines which Abraham had; and while he was still living he sent them eastward, away from Isaac his son, to the country of the east."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:14",
          "text": "Early in the morning, Abraham got up, took bread and a skin of water, put them on Hagar’s shoulders, and sent her away with the boy. She left and wandered in the Wilderness of Beersheba."
        },
        {
          "reference": "Genesis 16:15",
          "text": "And Hagar bore Abram a son, and Abram gave the name Ishmael to the son she had borne."
        },
        {
          "reference": "Genesis 21:10-12",
          "text": "and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!” / Now this matter distressed Abraham greatly because it concerned his son Ishmael. / But God said to Abraham, “Do not be distressed about the boy and your maidservant. Listen to everything that Sarah tells you, for through Isaac your offspring will be reckoned."
        },
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 21:13",
          "text": "But I will also make a nation of the slave woman’s son, because he is your offspring.”"
        },
        {
          "reference": "Genesis 22:2",
          "text": "“Take your son,” God said, “your only son Isaac, whom you love, and go to the land of Moriah. Offer him there as a burnt offering on one of the mountains, which I will show you.”"
        },
        {
          "reference": "Genesis 24:36",
          "text": "My master’s wife Sarah has borne him a son in her old age, and my master has given him everything he owns."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:6-7",
          "text": "Later, Esau took his wives and sons and daughters and all the people of his household, along with his livestock, all his other animals, and all the property he had acquired in Canaan, and he moved to a land far away from his brother Jacob. / For their possessions were too great for them to dwell together; the land where they stayed could not support them because of their livestock."
        },
        {
          "reference": "Judges 11:1-2",
          "text": "Now Jephthah the Gileadite was a mighty man of valor; he was the son of a prostitute, and Gilead was his father. / And Gilead’s wife bore him sons who grew up, drove Jephthah out, and said to him, “You shall have no inheritance in our father’s house, because you are the son of another woman.”"
        },
        {
          "reference": "1 Chronicles 1:32-33",
          "text": "The sons born to Keturah, Abraham’s concubine: Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. The sons of Jokshan: Sheba and Dedan. / The sons of Midian: Ephah, Epher, Hanoch, Abida, and Eldaah. All of these were Keturah’s sons."
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "Galatians 4:30",
          "text": "But what does the Scripture say? “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with the free woman’s son.”"
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Hebrews 11:18",
          "text": "even though God had said to him, “Through Isaac your offspring will be reckoned.”"
        }
      ]
    },
    {
      "reference": "Genesis 25:7",
      "book": "Genesis",
      "chapter": 25,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Abraham lived a hundred and seventy-five years."
        },
        {
          "version": "NLT",
          "text": "Abraham lived for 175 years,"
        },
        {
          "version": "ESV",
          "text": "These are the days of the years of Abraham’s life, 175 years."
        },
        {
          "version": "NKJV",
          "text": "This is the sum of the years of Abraham’s life which he lived: one hundred and seventy-five years."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 15:15",
          "text": "You, however, will go to your fathers in peace and be buried at a ripe old age."
        },
        {
          "reference": "Genesis 35:28-29",
          "text": "And Isaac lived 180 years. / Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 47:8-9",
          "text": "“How many years have you lived?” Pharaoh asked. / “My travels have lasted 130 years,” Jacob replied. “My years have been few and hard, and they have not matched the years of the travels of my fathers.”"
        },
        {
          "reference": "Genesis 49:33",
          "text": "When Jacob had finished instructing his sons, he pulled his feet into the bed and breathed his last, and he was gathered to his people."
        },
        {
          "reference": "Hebrews 11:13",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth."
        },
        {
          "reference": "Hebrews 11:39-40",
          "text": "These were all commended for their faith, yet they did not receive what was promised. / God had planned something better for us, so that together with us they would be made perfect."
        },
        {
          "reference": "1 Chronicles 29:28",
          "text": "He died at a ripe old age, full of years, riches, and honor, and his son Solomon reigned in his place."
        },
        {
          "reference": "Job 5:26",
          "text": "You will come to the grave in full vigor, like a sheaf of grain gathered in season."
        },
        {
          "reference": "Job 42:17",
          "text": "And so Job died, old and full of years."
        },
        {
          "reference": "Psalm 90:10",
          "text": "The length of our days is seventy years—or eighty if we are strong—yet their pride is but labor and sorrow, for they quickly pass, and we fly away."
        },
        {
          "reference": "Psalm 91:16",
          "text": "With long life I will satisfy him and show him My salvation.”"
        },
        {
          "reference": "Ecclesiastes 12:7",
          "text": "before the dust returns to the ground from which it came and the spirit returns to God who gave it."
        },
        {
          "reference": "Matthew 22:32",
          "text": "‘I am the God of Abraham, the God of Isaac, and the God of Jacob’? He is not the God of the dead, but of the living.”"
        },
        {
          "reference": "Luke 16:22",
          "text": "One day the beggar died and was carried by the angels to Abraham’s side. And the rich man also died and was buried."
        },
        {
          "reference": "Luke 20:37-38",
          "text": "Even Moses demonstrates that the dead are raised, in the passage about the burning bush. For he calls the Lord ‘the God of Abraham, the God of Isaac, and the God of Jacob.’ / He is not the God of the dead, but of the living, for to Him all are alive.”"
        }
      ]
    },
    {
      "reference": "Genesis 25:8",
      "book": "Genesis",
      "chapter": 25,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Abraham breathed his last and died at a good old age, an old man and full of years; and he was gathered to his people."
        },
        {
          "version": "NLT",
          "text": "and he died at a ripe old age, having lived a long and satisfying life. He breathed his last and joined his ancestors in death."
        },
        {
          "version": "ESV",
          "text": "Abraham breathed his last and died in a good old age, an old man and full of years, and was gathered to his people."
        },
        {
          "version": "NKJV",
          "text": "Then Abraham breathed his last and died in a good old age, an old man and full of years, and was gathered to his people."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:13",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth."
        },
        {
          "reference": "Genesis 15:15",
          "text": "You, however, will go to your fathers in peace and be buried at a ripe old age."
        },
        {
          "reference": "Job 5:26",
          "text": "You will come to the grave in full vigor, like a sheaf of grain gathered in season."
        },
        {
          "reference": "1 Chronicles 29:28",
          "text": "He died at a ripe old age, full of years, riches, and honor, and his son Solomon reigned in his place."
        },
        {
          "reference": "Philippians 1:21-23",
          "text": "For to me, to live is Christ, and to die is gain. / But if I go on living in the body, this will mean fruitful labor for me. So what shall I choose? I do not know. / I am torn between the two. I desire to depart and be with Christ, which is far better indeed."
        },
        {
          "reference": "2 Timothy 4:6-8",
          "text": "For I am already being poured out like a drink offering, and the time of my departure is at hand. / I have fought the good fight, I have finished the race, I have kept the faith. / From now on there is laid up for me the crown of righteousness, which the Lord, the righteous Judge, will award to me on that day—and not only to me, but to all who crave His appearing."
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 49:33",
          "text": "When Jacob had finished instructing his sons, he pulled his feet into the bed and breathed his last, and he was gathered to his people."
        },
        {
          "reference": "Numbers 20:24",
          "text": "“Aaron will be gathered to his people; he will not enter the land that I have given the Israelites, because both of you rebelled against My command at the waters of Meribah."
        },
        {
          "reference": "Numbers 27:13",
          "text": "After you have seen it, you too will be gathered to your people, as your brother Aaron was;"
        },
        {
          "reference": "Deuteronomy 32:50",
          "text": "And there on the mountain that you climb, you will die and be gathered to your people, just as your brother Aaron died on Mount Hor and was gathered to his people."
        },
        {
          "reference": "1 Kings 2:10",
          "text": "Then David rested with his fathers and was buried in the City of David."
        },
        {
          "reference": "Acts 7:5",
          "text": "He gave him no inheritance here, not even a foot of ground. But God promised to give possession of the land to Abraham and his descendants, even though he did not yet have a child."
        },
        {
          "reference": "Luke 2:29-30",
          "text": "“Sovereign Lord, as You have promised, You now dismiss Your servant in peace. / For my eyes have seen Your salvation,"
        },
        {
          "reference": "John 8:56",
          "text": "Your father Abraham rejoiced that he would see My day. He saw it and was glad.”"
        }
      ]
    },
    {
      "reference": "Genesis 25:9",
      "book": "Genesis",
      "chapter": 25,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite,"
        },
        {
          "version": "NLT",
          "text": "His sons Isaac and Ishmael buried him in the cave of Machpelah, near Mamre, in the field of Ephron son of Zohar the Hittite."
        },
        {
          "version": "ESV",
          "text": "Isaac and Ishmael his sons buried him in the cave of Machpelah, in the field of Ephron the son of Zohar the Hittite, east of Mamre,"
        },
        {
          "version": "NKJV",
          "text": "And his sons Isaac and Ishmael buried him in the cave of Machpelah, which is before Mamre, in the field of Ephron the son of Zohar the Hittite,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 49:29-31",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah."
        },
        {
          "reference": "Genesis 50:13",
          "text": "They carried him to the land of Canaan and buried him in the cave at Machpelah in the field near Mamre, which Abraham had purchased from Ephron the Hittite as a burial site."
        },
        {
          "reference": "Genesis 23:19",
          "text": "After this, Abraham buried his wife Sarah in the cave of the field at Machpelah near Mamre (that is, Hebron) in the land of Canaan."
        },
        {
          "reference": "Genesis 15:15",
          "text": "You, however, will go to your fathers in peace and be buried at a ripe old age."
        },
        {
          "reference": "Genesis 47:30",
          "text": "but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.”"
        },
        {
          "reference": "Genesis 50:25",
          "text": "And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Acts 7:16",
          "text": "Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Matthew 8:22",
          "text": "But Jesus told him, “Follow Me, and let the dead bury their own dead.”"
        },
        {
          "reference": "Luke 9:60",
          "text": "But Jesus told him, “Let the dead bury their own dead. You, however, go and proclaim the kingdom of God.”"
        },
        {
          "reference": "John 11:25-26",
          "text": "Jesus said to her, “I am the resurrection and the life. Whoever believes in Me will live, even though he dies. / And everyone who lives and believes in Me will never die. Do you believe this?”"
        },
        {
          "reference": "Acts 2:29",
          "text": "Brothers, I can tell you with confidence that the patriarch David died and was buried, and his tomb is with us to this day."
        }
      ]
    },
    {
      "reference": "Genesis 25:10",
      "book": "Genesis",
      "chapter": 25,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "the field Abraham had bought from the Hittites. There Abraham was buried with his wife Sarah."
        },
        {
          "version": "NLT",
          "text": "This was the field Abraham had purchased from the Hittites and where he had buried his wife Sarah."
        },
        {
          "version": "ESV",
          "text": "the field that Abraham purchased from the Hittites. There Abraham was buried, with Sarah his wife."
        },
        {
          "version": "NKJV",
          "text": "the field which Abraham purchased from the sons of Heth. There Abraham was buried, and Sarah his wife."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 23:19",
          "text": "After this, Abraham buried his wife Sarah in the cave of the field at Machpelah near Mamre (that is, Hebron) in the land of Canaan."
        },
        {
          "reference": "Genesis 49:29-32",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah. ..."
        },
        {
          "reference": "Genesis 50:13",
          "text": "They carried him to the land of Canaan and buried him in the cave at Machpelah in the field near Mamre, which Abraham had purchased from Ephron the Hittite as a burial site."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 13:15",
          "text": "for all the land that you see, I will give to you and your offspring forever."
        },
        {
          "reference": "Genesis 15:18",
          "text": "On that day the LORD made a covenant with Abram, saying, “To your descendants I have given this land—from the river of Egypt to the great River Euphrates—"
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 24:7",
          "text": "The LORD, the God of heaven, who brought me from my father’s house and my native land, who spoke to me and promised me on oath, saying, ‘To your offspring I will give this land’—He will send His angel before you so that you can take a wife for my son from there."
        },
        {
          "reference": "Genesis 26:3-4",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed,"
        },
        {
          "reference": "Genesis 28:13",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie."
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Genesis 48:4",
          "text": "and told me, ‘Behold, I will make you fruitful and multiply you; I will make you a multitude of peoples, and will give this land to your descendants after you as an everlasting possession.’"
        },
        {
          "reference": "Exodus 6:8",
          "text": "And I will bring you into the land that I swore to give to Abraham, Isaac, and Jacob. I will give it to you as a possession. I am the LORD!’”"
        },
        {
          "reference": "Acts 7:5",
          "text": "He gave him no inheritance here, not even a foot of ground. But God promised to give possession of the land to Abraham and his descendants, even though he did not yet have a child."
        },
        {
          "reference": "Hebrews 11:9",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        }
      ]
    },
    {
      "reference": "Genesis 25:11",
      "book": "Genesis",
      "chapter": 25,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "After Abraham’s death, God blessed his son Isaac, who then lived near Beer Lahai Roi."
        },
        {
          "version": "NLT",
          "text": "After Abraham’s death, God blessed his son Isaac, who settled near Beer-lahai-roi in the Negev."
        },
        {
          "version": "ESV",
          "text": "After the death of Abraham, God blessed Isaac his son. And Isaac settled at Beer-lahai-roi."
        },
        {
          "version": "NKJV",
          "text": "And it came to pass, after the death of Abraham, that God blessed his son Isaac. And Isaac dwelt at Beer Lahai Roi."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 17:19-21",
          "text": "But God replied, “Your wife Sarah will indeed bear you a son, and you are to name him Isaac. I will establish My covenant with him as an everlasting covenant for his descendants after him. / As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation. / But I will establish My covenant with Isaac, whom Sarah will bear to you at this time next year.”"
        },
        {
          "reference": "Genesis 26:1-5",
          "text": "Now there was another famine in the land, subsequent to the one that had occurred in Abraham’s time. And Isaac went to Abimelech king of the Philistines at Gerar. / The LORD appeared to Isaac and said, “Do not go down to Egypt. Settle in the land where I tell you. / Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. ..."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 35:9-12",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him. / And God said to him, “Though your name is Jacob, you will no longer be called Jacob. Instead, your name will be Israel.” So God named him Israel. / And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. ..."
        },
        {
          "reference": "Genesis 48:3-4",
          "text": "Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan, and there He blessed me / and told me, ‘Behold, I will make you fruitful and multiply you; I will make you a multitude of peoples, and will give this land to your descendants after you as an everlasting possession.’"
        },
        {
          "reference": "Exodus 2:24",
          "text": "So God heard their groaning, and He remembered His covenant with Abraham, Isaac, and Jacob."
        },
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Exodus 6:8",
          "text": "And I will bring you into the land that I swore to give to Abraham, Isaac, and Jacob. I will give it to you as a possession. I am the LORD!’”"
        },
        {
          "reference": "Numbers 23:19",
          "text": "God is not a man, that He should lie, or a son of man, that He should change His mind. Does He speak and not act? Does He promise and not fulfill?"
        },
        {
          "reference": "Deuteronomy 7:8",
          "text": "But because the LORD loved you and kept the oath He swore to your fathers, He brought you out with a mighty hand and redeemed you from the house of slavery, from the hand of Pharaoh king of Egypt."
        },
        {
          "reference": "Psalm 105:8-11",
          "text": "He remembers His covenant forever, the word He ordained for a thousand generations— / the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: ..."
        },
        {
          "reference": "Isaiah 41:8-10",
          "text": "“But you, O Israel, My servant, Jacob, whom I have chosen, descendant of Abraham My friend— / I brought you from the ends of the earth and called you from its farthest corners. I said, ‘You are My servant.’ I have chosen and not rejected you. / Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Matthew 1:1-2",
          "text": "This is the record of the genealogy of Jesus Christ, the son of David, the son of Abraham: / Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Luke 1:54-55",
          "text": "He has helped His servant Israel, remembering to be merciful, / as He promised to our fathers, to Abraham and his descendants forever.”"
        }
      ]
    },
    {
      "reference": "Genesis 25:12",
      "book": "Genesis",
      "chapter": 25,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "This is the account of the family line of Abraham’s son Ishmael, whom Sarah’s slave, Hagar the Egyptian, bore to Abraham."
        },
        {
          "version": "NLT",
          "text": "This is the account of the family of Ishmael, the son of Abraham through Hagar, Sarah’s Egyptian servant."
        },
        {
          "version": "ESV",
          "text": "These are the generations of Ishmael, Abraham’s son, whom Hagar the Egyptian, Sarah’s servant, bore to Abraham."
        },
        {
          "version": "NKJV",
          "text": "Now this is the genealogy of Ishmael, Abraham’s son, whom Hagar the Egyptian, Sarah’s maidservant, bore to Abraham."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 16:15",
          "text": "And Hagar bore Abram a son, and Abram gave the name Ishmael to the son she had borne."
        },
        {
          "reference": "Genesis 21:9-21",
          "text": "But Sarah saw that the son whom Hagar the Egyptian had borne to Abraham was mocking her son, / and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!” / Now this matter distressed Abraham greatly because it concerned his son Ishmael. ..."
        },
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-3",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "1 Chronicles 1:28-31",
          "text": "The sons of Abraham were Isaac and Ishmael. / These are their genealogies: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, Hadad, Tema, ..."
        },
        {
          "reference": "1 Chronicles 1:32-33",
          "text": "The sons born to Keturah, Abraham’s concubine: Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. The sons of Jokshan: Sheba and Dedan. / The sons of Midian: Ephah, Epher, Hanoch, Abida, and Eldaah. All of these were Keturah’s sons."
        },
        {
          "reference": "Romans 9:7-9",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Galatians 4:22-31",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise. / These things serve as illustrations, for the women represent two covenants. One covenant is from Mount Sinai and bears children into slavery: This is Hagar. ..."
        },
        {
          "reference": "Genesis 21:13",
          "text": "But I will also make a nation of the slave woman’s son, because he is your offspring.”"
        },
        {
          "reference": "Genesis 17:18",
          "text": "And Abraham said to God, “O that Ishmael might live under Your blessing!”"
        },
        {
          "reference": "Genesis 25:1-4",
          "text": "Now Abraham had taken another wife, named Keturah, / and she bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. / Jokshan was the father of Sheba and Dedan. And the sons of Dedan were the Asshurites, the Letushites, and the Leummites. ..."
        },
        {
          "reference": "Genesis 25:5-6",
          "text": "Abraham left everything he owned to Isaac. / But while he was still alive, Abraham gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east."
        },
        {
          "reference": "Genesis 25:19",
          "text": "This is the account of Abraham’s son Isaac. Abraham became the father of Isaac,"
        },
        {
          "reference": "Genesis 16:10-12",
          "text": "Then the angel added, “I will greatly multiply your offspring so that they will be too numerous to count.” / The angel of the LORD proceeded: “Behold, you have conceived and will bear a son. And you shall name him Ishmael, for the LORD has heard your cry of affliction. / He will be a wild donkey of a man, and his hand will be against everyone, and everyone’s hand against him; he will live in hostility toward all his brothers.”"
        }
      ]
    },
    {
      "reference": "Genesis 25:13",
      "book": "Genesis",
      "chapter": 25,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "These are the names of the sons of Ishmael, listed in the order of their birth: Nebaioth the firstborn of Ishmael, Kedar, Adbeel, Mibsam,"
        },
        {
          "version": "NLT",
          "text": "Here is a list, by their names and clans, of Ishmael’s descendants: The oldest was Nebaioth, followed by Kedar, Adbeel, Mibsam,"
        },
        {
          "version": "ESV",
          "text": "These are the names of the sons of Ishmael, named in the order of their birth: Nebaioth, the firstborn of Ishmael; and Kedar, Adbeel, Mibsam,"
        },
        {
          "version": "NKJV",
          "text": "And these were the names of the sons of Ishmael, by their names, according to their generations: The firstborn of Ishmael, Nebajoth; then Kedar, Adbeel, Mibsam,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:29-31",
          "text": "These are their genealogies: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, Hadad, Tema, / Jetur, Naphish, and Kedemah. These were the sons of Ishmael."
        },
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:3",
          "text": "and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Genesis 16:10-12",
          "text": "Then the angel added, “I will greatly multiply your offspring so that they will be too numerous to count.” / The angel of the LORD proceeded: “Behold, you have conceived and will bear a son. And you shall name him Ishmael, for the LORD has heard your cry of affliction. / He will be a wild donkey of a man, and his hand will be against everyone, and everyone’s hand against him; he will live in hostility toward all his brothers.”"
        },
        {
          "reference": "Isaiah 21:13-17",
          "text": "This is the burden against Arabia: In the thickets of Arabia you must lodge, O caravans of Dedanites. / Bring water for the thirsty, O dwellers of Tema; meet the refugees with food. / For they flee from the sword—the sword that is drawn—from the bow that is bent, and from the stress of battle. ..."
        },
        {
          "reference": "Jeremiah 49:28-33",
          "text": "Concerning Kedar and the kingdoms of Hazor, which Nebuchadnezzar king of Babylon defeated, this is what the LORD says: “Rise up, advance against Kedar, and destroy the people of the east! / They will take their tents and flocks, their tent curtains and all their goods. They will take their camels for themselves. They will shout to them: ‘Terror is on every side!’ / Run! Escape quickly! Lie low, O residents of Hazor,” declares the LORD, “for Nebuchadnezzar king of Babylon has drawn up a plan against you; he has devised a strategy against you. ..."
        },
        {
          "reference": "Ezekiel 25:13-14",
          "text": "therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Psalm 83:6",
          "text": "the tents of Edom and the Ishmaelites, of Moab and the Hagrites,"
        },
        {
          "reference": "1 Samuel 25:1-3",
          "text": "When Samuel died, all Israel gathered to mourn for him; and they buried him at his home in Ramah. Then David set out and went down to the Wilderness of Paran. / Now there was a man in Maon whose business was in Carmel. He was a very wealthy man with a thousand goats and three thousand sheep, which he was shearing in Carmel. / His name was Nabal, and his wife’s name was Abigail. She was an intelligent and beautiful woman, but her husband, a Calebite, was harsh and evil in his dealings."
        },
        {
          "reference": "Judges 8:24",
          "text": "Then he added, “Let me make a request of you, that each of you give me an earring from his plunder.” (For the enemies had gold earrings because they were Ishmaelites.)"
        },
        {
          "reference": "1 Kings 11:14-18",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        },
        {
          "reference": "2 Chronicles 21:16-17",
          "text": "Then the LORD stirred against Jehoram the spirit of the Philistines and Arabs who lived near the Cushites. / So they went to war against Judah, invaded it, and carried off all the possessions found in the king’s palace, along with his sons and wives; not a son was left to him except Jehoahaz, his youngest."
        },
        {
          "reference": "Nehemiah 4:7",
          "text": "When Sanballat and Tobiah, together with the Arabs, Ammonites, and Ashdodites, heard that the repair to the walls of Jerusalem was progressing and that the gaps were being closed, they were furious,"
        }
      ]
    },
    {
      "reference": "Genesis 25:14",
      "book": "Genesis",
      "chapter": 25,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Mishma, Dumah, Massa,"
        },
        {
          "version": "NLT",
          "text": "Mishma, Dumah, Massa,"
        },
        {
          "version": "ESV",
          "text": "Mishma, Dumah, Massa,"
        },
        {
          "version": "NKJV",
          "text": "Mishma, Dumah, Massa,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 36:3",
          "text": "and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "1 Chronicles 1:30",
          "text": "Mishma, Dumah, Massa, Hadad, Tema,"
        },
        {
          "reference": "Genesis 25:12-13",
          "text": "This is the account of Abraham’s son Ishmael, whom Hagar the Egyptian, Sarah’s maidservant, bore to Abraham. / These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam,"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Genesis 16:15",
          "text": "And Hagar bore Abram a son, and Abram gave the name Ishmael to the son she had borne."
        },
        {
          "reference": "Genesis 21:9-21",
          "text": "But Sarah saw that the son whom Hagar the Egyptian had borne to Abraham was mocking her son, / and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!” / Now this matter distressed Abraham greatly because it concerned his son Ishmael. ..."
        },
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 21:13",
          "text": "But I will also make a nation of the slave woman’s son, because he is your offspring.”"
        },
        {
          "reference": "Genesis 25:1-2",
          "text": "Now Abraham had taken another wife, named Keturah, / and she bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah."
        },
        {
          "reference": "Romans 9:7-9",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Galatians 4:22-31",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise. / These things serve as illustrations, for the women represent two covenants. One covenant is from Mount Sinai and bears children into slavery: This is Hagar. ..."
        },
        {
          "reference": "Hebrews 11:18",
          "text": "even though God had said to him, “Through Isaac your offspring will be reckoned.”"
        },
        {
          "reference": "Romans 4:18",
          "text": "Against all hope, Abraham in hope believed and so became the father of many nations, just as he had been told, “So shall your offspring be.”"
        },
        {
          "reference": "Galatians 3:16",
          "text": "The promises were spoken to Abraham and to his seed. The Scripture does not say, “and to seeds,” meaning many, but “and to your seed,” meaning One, who is Christ."
        }
      ]
    },
    {
      "reference": "Genesis 25:15",
      "book": "Genesis",
      "chapter": 25,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "Hadad, Tema, Jetur, Naphish and Kedemah."
        },
        {
          "version": "NLT",
          "text": "Hadad, Tema, Jetur, Naphish, and Kedemah."
        },
        {
          "version": "ESV",
          "text": "Hadad, Tema, Jetur, Naphish, and Kedemah."
        },
        {
          "version": "NKJV",
          "text": "Hadar, Tema, Jetur, Naphish, and Kedemah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:30",
          "text": "Mishma, Dumah, Massa, Hadad, Tema,"
        },
        {
          "reference": "Genesis 36:3",
          "text": "and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:10-12",
          "text": "These are the names of Esau’s sons: Eliphaz son of Esau’s wife Adah, and Reuel son of Esau’s wife Basemath. / The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz. / Additionally, Timna, a concubine of Esau’s son Eliphaz, gave birth to Amalek. These are the grandsons of Esau’s wife Adah."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 36:20-21",
          "text": "These are the sons of Seir the Horite, who were living in the land: Lotan, Shobal, Zibeon, Anah, / Dishon, Ezer, and Dishan. They are the chiefs of the Horites, the descendants of Seir in the land of Edom."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "1 Chronicles 1:36",
          "text": "The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek."
        },
        {
          "reference": "1 Chronicles 1:39",
          "text": "The sons of Lotan: Hori and Homam. Timna was Lotan’s sister."
        },
        {
          "reference": "1 Chronicles 1:51-54",
          "text": "Then Hadad died. Now the chiefs of Edom were Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 11:20",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future."
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "Romans 4:18",
          "text": "Against all hope, Abraham in hope believed and so became the father of many nations, just as he had been told, “So shall your offspring be.”"
        }
      ]
    },
    {
      "reference": "Genesis 25:16",
      "book": "Genesis",
      "chapter": 25,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the sons of Ishmael, and these are the names of the twelve tribal rulers according to their settlements and camps."
        },
        {
          "version": "NLT",
          "text": "These twelve sons of Ishmael became the founders of twelve tribes named after them, listed according to the places they settled and camped."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Ishmael and these are their names, by their villages and by their encampments, twelve princes according to their tribes."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Ishmael and these were their names, by their towns and their settlements, twelve princes according to their nations."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 21:13",
          "text": "But I will also make a nation of the slave woman’s son, because he is your offspring.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:3",
          "text": "and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 1:1-16",
          "text": "On the first day of the second month of the second year after the Israelites had come out of the land of Egypt, the LORD spoke to Moses in the Tent of Meeting in the Wilderness of Sinai. He said: / “Take a census of the whole congregation of Israel by their clans and families, listing every man by name, one by one. / You and Aaron are to number those who are twenty years of age or older by their divisions—everyone who can serve in Israel’s army. ..."
        },
        {
          "reference": "Numbers 2:1-34",
          "text": "Then the LORD said to Moses and Aaron: / “The Israelites are to camp around the Tent of Meeting at a distance from it, each man under his standard, with the banners of his family. / On the east side, toward the sunrise, the divisions of Judah are to camp under their standard: The leader of the Judahites is Nahshon son of Amminadab, ..."
        },
        {
          "reference": "Numbers 25:14-18",
          "text": "The name of the Israelite who was slain with the Midianite woman was Zimri son of Salu, the leader of a Simeonite family. / And the name of the slain Midianite woman was Cozbi, the daughter of Zur, a tribal chief of a Midianite family. / And the LORD said to Moses, ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "1 Chronicles 1:29-31",
          "text": "These are their genealogies: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, Hadad, Tema, / Jetur, Naphish, and Kedemah. These were the sons of Ishmael."
        },
        {
          "reference": "Isaiah 21:13-17",
          "text": "This is the burden against Arabia: In the thickets of Arabia you must lodge, O caravans of Dedanites. / Bring water for the thirsty, O dwellers of Tema; meet the refugees with food. / For they flee from the sword—the sword that is drawn—from the bow that is bent, and from the stress of battle. ..."
        },
        {
          "reference": "Jeremiah 25:23-24",
          "text": "Dedan, Tema, Buz, and all who cut the corners of their hair; / all the kings of Arabia, and all the kings of the mixed tribes who dwell in the desert;"
        },
        {
          "reference": "Ezekiel 25:13-14",
          "text": "therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        }
      ]
    },
    {
      "reference": "Genesis 25:17",
      "book": "Genesis",
      "chapter": 25,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Ishmael lived a hundred and thirty-seven years. He breathed his last and died, and he was gathered to his people."
        },
        {
          "version": "NLT",
          "text": "Ishmael lived for 137 years. Then he breathed his last and joined his ancestors in death."
        },
        {
          "version": "ESV",
          "text": "(These are the years of the life of Ishmael: 137 years. He breathed his last and died, and was gathered to his people.)"
        },
        {
          "version": "NKJV",
          "text": "These were the years of the life of Ishmael: one hundred and thirty-seven years; and he breathed his last and died, and was gathered to his people."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 16:12",
          "text": "He will be a wild donkey of a man, and his hand will be against everyone, and everyone’s hand against him; he will live in hostility toward all his brothers.”"
        },
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 21:13",
          "text": "But I will also make a nation of the slave woman’s son, because he is your offspring.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-3",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Genesis 46:13",
          "text": "The sons of Issachar: Tola, Puvah, Job, and Shimron."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "1 Chronicles 1:29-31",
          "text": "These are their genealogies: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, Hadad, Tema, / Jetur, Naphish, and Kedemah. These were the sons of Ishmael."
        },
        {
          "reference": "Isaiah 21:13-17",
          "text": "This is the burden against Arabia: In the thickets of Arabia you must lodge, O caravans of Dedanites. / Bring water for the thirsty, O dwellers of Tema; meet the refugees with food. / For they flee from the sword—the sword that is drawn—from the bow that is bent, and from the stress of battle. ..."
        },
        {
          "reference": "Jeremiah 49:28-33",
          "text": "Concerning Kedar and the kingdoms of Hazor, which Nebuchadnezzar king of Babylon defeated, this is what the LORD says: “Rise up, advance against Kedar, and destroy the people of the east! / They will take their tents and flocks, their tent curtains and all their goods. They will take their camels for themselves. They will shout to them: ‘Terror is on every side!’ / Run! Escape quickly! Lie low, O residents of Hazor,” declares the LORD, “for Nebuchadnezzar king of Babylon has drawn up a plan against you; he has devised a strategy against you. ..."
        },
        {
          "reference": "Ezekiel 25:13-14",
          "text": "therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        },
        {
          "reference": "Romans 9:7-13",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.” ..."
        },
        {
          "reference": "Galatians 4:22-31",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise. / These things serve as illustrations, for the women represent two covenants. One covenant is from Mount Sinai and bears children into slavery: This is Hagar. ..."
        }
      ]
    },
    {
      "reference": "Genesis 25:18",
      "book": "Genesis",
      "chapter": 25,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "His descendants settled in the area from Havilah to Shur, near the eastern border of Egypt, as you go toward Ashur. And they lived in hostility toward all the tribes related to them."
        },
        {
          "version": "NLT",
          "text": "Ishmael’s descendants occupied the region from Havilah to Shur, which is east of Egypt in the direction of Asshur. There they lived in open hostility toward all their relatives."
        },
        {
          "version": "ESV",
          "text": "They settled from Havilah to Shur, which is opposite Egypt in the direction of Assyria. He settled over against all his kinsmen."
        },
        {
          "version": "NKJV",
          "text": "(They dwelt from Havilah as far as Shur, which is east of Egypt as you go toward Assyria.) He died in the presence of all his brethren."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 16:12",
          "text": "He will be a wild donkey of a man, and his hand will be against everyone, and everyone’s hand against him; he will live in hostility toward all his brothers.”"
        },
        {
          "reference": "Exodus 15:22",
          "text": "Then Moses led Israel from the Red Sea, and they went out into the Desert of Shur. For three days they walked in the desert without finding water."
        },
        {
          "reference": "1 Samuel 15:7",
          "text": "Then Saul struck down the Amalekites all the way from Havilah to Shur, which is east of Egypt."
        },
        {
          "reference": "1 Samuel 27:8",
          "text": "Now David and his men went up and raided the Geshurites, the Girzites, and the Amalekites. (From ancient times these people had inhabited the land extending to Shur and Egypt.)"
        },
        {
          "reference": "1 Chronicles 1:29-31",
          "text": "These are their genealogies: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, Hadad, Tema, / Jetur, Naphish, and Kedemah. These were the sons of Ishmael."
        },
        {
          "reference": "Jeremiah 25:23-24",
          "text": "Dedan, Tema, Buz, and all who cut the corners of their hair; / all the kings of Arabia, and all the kings of the mixed tribes who dwell in the desert;"
        },
        {
          "reference": "Ezekiel 25:13",
          "text": "therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword."
        },
        {
          "reference": "Isaiah 21:13-17",
          "text": "This is the burden against Arabia: In the thickets of Arabia you must lodge, O caravans of Dedanites. / Bring water for the thirsty, O dwellers of Tema; meet the refugees with food. / For they flee from the sword—the sword that is drawn—from the bow that is bent, and from the stress of battle. ..."
        },
        {
          "reference": "Jeremiah 49:28-33",
          "text": "Concerning Kedar and the kingdoms of Hazor, which Nebuchadnezzar king of Babylon defeated, this is what the LORD says: “Rise up, advance against Kedar, and destroy the people of the east! / They will take their tents and flocks, their tent curtains and all their goods. They will take their camels for themselves. They will shout to them: ‘Terror is on every side!’ / Run! Escape quickly! Lie low, O residents of Hazor,” declares the LORD, “for Nebuchadnezzar king of Babylon has drawn up a plan against you; he has devised a strategy against you. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Judges 6:3",
          "text": "Whenever the Israelites planted their crops, the Midianites, Amalekites, and other people of the east would come up and invade them,"
        },
        {
          "reference": "1 Kings 11:14-18",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        },
        {
          "reference": "Psalm 83:6",
          "text": "the tents of Edom and the Ishmaelites, of Moab and the Hagrites,"
        },
        {
          "reference": "Isaiah 60:7",
          "text": "All the flocks of Kedar will be gathered to you; the rams of Nebaioth will serve you and go up on My altar with acceptance; I will adorn My glorious house."
        },
        {
          "reference": "Ezekiel 27:21",
          "text": "Arabia and all the princes of Kedar were your customers, trading in lambs, rams, and goats."
        }
      ]
    },
    {
      "reference": "Genesis 25:19",
      "book": "Genesis",
      "chapter": 25,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "This is the account of the family line of Abraham’s son Isaac. Abraham became the father of Isaac,"
        },
        {
          "version": "NLT",
          "text": "This is the account of the family of Isaac, the son of Abraham."
        },
        {
          "version": "ESV",
          "text": "These are the generations of Isaac, Abraham’s son: Abraham fathered Isaac,"
        },
        {
          "version": "NKJV",
          "text": "This is the genealogy of Isaac, Abraham’s son. Abraham begot Isaac."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:19",
          "text": "But God replied, “Your wife Sarah will indeed bear you a son, and you are to name him Isaac. I will establish My covenant with him as an everlasting covenant for his descendants after him."
        },
        {
          "reference": "Genesis 21:12",
          "text": "But God said to Abraham, “Do not be distressed about the boy and your maidservant. Listen to everything that Sarah tells you, for through Isaac your offspring will be reckoned."
        },
        {
          "reference": "Romans 9:7-13",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.” ..."
        },
        {
          "reference": "Hebrews 11:18",
          "text": "even though God had said to him, “Through Isaac your offspring will be reckoned.”"
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 26:3-5",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed, / because Abraham listened to My voice and kept My charge, My commandments, My statutes, and My laws.”"
        },
        {
          "reference": "Genesis 28:13-14",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring."
        },
        {
          "reference": "Galatians 4:28",
          "text": "Now you, brothers, like Isaac, are children of promise."
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Genesis 49:31",
          "text": "There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah."
        },
        {
          "reference": "1 Chronicles 1:28",
          "text": "The sons of Abraham were Isaac and Ishmael."
        },
        {
          "reference": "Matthew 1:2",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Luke 3:34",
          "text": "the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor,"
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        }
      ]
    },
    {
      "reference": "Genesis 25:20",
      "book": "Genesis",
      "chapter": 25,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "and Isaac was forty years old when he married Rebekah daughter of Bethuel the Aramean from Paddan Aram and sister of Laban the Aramean."
        },
        {
          "version": "NLT",
          "text": "When Isaac was forty years old, he married Rebekah, the daughter of Bethuel the Aramean from Paddan-aram and the sister of Laban the Aramean."
        },
        {
          "version": "ESV",
          "text": "and Isaac was forty years old when he took Rebekah, the daughter of Bethuel the Aramean of Paddan-aram, the sister of Laban the Aramean, to be his wife."
        },
        {
          "version": "NKJV",
          "text": "Isaac was forty years old when he took Rebekah as wife, the daughter of Bethuel the Syrian of Padan Aram, the sister of Laban the Syrian."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:3-4",
          "text": "and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling, / but will go to my country and my kindred to take a wife for my son Isaac.”"
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 29:1-30",
          "text": "Jacob resumed his journey and came to the land of the people of the east. / He looked and saw a well in the field, and near it lay three flocks of sheep, because the sheep were watered from this well. And a large stone covered the mouth of the well. / When all the flocks had been gathered there, the shepherds would roll away the stone from the mouth of the well and water the sheep. Then they would return the stone to its place over the mouth of the well. ..."
        },
        {
          "reference": "Genesis 21:21",
          "text": "And while he was dwelling in the Wilderness of Paran, his mother got a wife for him from the land of Egypt."
        },
        {
          "reference": "Genesis 22:23",
          "text": "And Bethuel became the father of Rebekah. Milcah bore these eight sons to Abraham’s brother Nahor."
        },
        {
          "reference": "Genesis 11:29",
          "text": "And Abram and Nahor took wives for themselves. Abram’s wife was named Sarai, and Nahor’s wife was named Milcah; she was the daughter of Haran, who was the father of both Milcah and Iscah."
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 17:19",
          "text": "But God replied, “Your wife Sarah will indeed bear you a son, and you are to name him Isaac. I will establish My covenant with him as an everlasting covenant for his descendants after him."
        },
        {
          "reference": "Genesis 24:15",
          "text": "Before the servant had finished praying, Rebekah came out with her jar on her shoulder. She was the daughter of Bethuel son of Milcah, the wife of Abraham’s brother Nahor."
        },
        {
          "reference": "Genesis 27:46",
          "text": "Then Rebekah said to Isaac, “I am weary of my life because of these Hittite women. If Jacob takes a Hittite wife from among them, what good is my life?”"
        },
        {
          "reference": "Genesis 28:5",
          "text": "So Isaac sent Jacob to Paddan-aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau."
        },
        {
          "reference": "Genesis 35:23-26",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. / The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. ..."
        },
        {
          "reference": "Genesis 36:2-3",
          "text": "Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth."
        }
      ]
    },
    {
      "reference": "Genesis 25:21",
      "book": "Genesis",
      "chapter": 25,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "Isaac prayed to the LORD on behalf of his wife, because she was childless. The LORD answered his prayer, and his wife Rebekah became pregnant."
        },
        {
          "version": "NLT",
          "text": "Isaac pleaded with the LORD on behalf of his wife, because she was unable to have children. The LORD answered Isaac’s prayer, and Rebekah became pregnant with twins."
        },
        {
          "version": "ESV",
          "text": "And Isaac prayed to the LORD for his wife, because she was barren. And the LORD granted his prayer, and Rebekah his wife conceived."
        },
        {
          "version": "NKJV",
          "text": "Now Isaac pleaded with the LORD for his wife, because she was barren; and the LORD granted his plea, and Rebekah his wife conceived."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Samuel 1:10-20",
          "text": "In her bitter distress, Hannah prayed to the LORD and wept with many tears. / And she made a vow, saying, “O LORD of Hosts, if only You will look upon the affliction of Your maidservant and remember me, not forgetting Your maidservant but giving her a son, then I will dedicate him to the LORD all the days of his life, and no razor shall ever touch his head.” / As Hannah kept on praying before the LORD, Eli watched her mouth. ..."
        },
        {
          "reference": "Luke 1:13",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        },
        {
          "reference": "Luke 1:36-37",
          "text": "Look, even Elizabeth your relative has conceived a son in her old age, and she who was called barren is in her sixth month. / For no word from God will ever fail.”"
        },
        {
          "reference": "Romans 9:10-12",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.”"
        },
        {
          "reference": "Genesis 30:22",
          "text": "Then God remembered Rachel. He listened to her and opened her womb,"
        },
        {
          "reference": "Judges 13:2-3",
          "text": "Now there was a man from Zorah named Manoah, from the clan of the Danites, whose wife was barren and had no children. / The angel of the LORD appeared to the woman and said to her, “It is true that you are barren and have no children; but you will conceive and give birth to a son."
        },
        {
          "reference": "1 Samuel 1:27",
          "text": "I prayed for this boy, and since the LORD has granted me what I asked of Him,"
        },
        {
          "reference": "Psalm 113:9",
          "text": "He settles the barren woman in her home as a joyful mother to her children. Hallelujah!"
        },
        {
          "reference": "Genesis 16:11",
          "text": "The angel of the LORD proceeded: “Behold, you have conceived and will bear a son. And you shall name him Ishmael, for the LORD has heard your cry of affliction."
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "2 Kings 4:14-17",
          "text": "So he asked, “Then what should be done for her?” “Well, she has no son,” Gehazi replied, “and her husband is old.” / “Call her,” said Elisha. So Gehazi called her, and she stood in the doorway. / And Elisha declared, “At this time next year, you will hold a son in your arms.” “No, my lord,” she said. “Do not lie to your maidservant, O man of God.” ..."
        },
        {
          "reference": "Matthew 1:20-21",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit. / She will give birth to a Son, and you are to give Him the name Jesus, because He will save His people from their sins.”"
        },
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        }
      ]
    },
    {
      "reference": "Genesis 25:22",
      "book": "Genesis",
      "chapter": 25,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "The babies jostled each other within her, and she said, “Why is this happening to me?” So she went to inquire of the LORD."
        },
        {
          "version": "NLT",
          "text": "But the two children struggled with each other in her womb. So she went to ask the LORD about it. “Why is this happening to me?” she asked."
        },
        {
          "version": "ESV",
          "text": "The children struggled together within her, and she said, “If it is thus, why is this happening to me?” So she went to inquire of the LORD."
        },
        {
          "version": "NKJV",
          "text": "But the children struggled together within her; and she said, “If all is well, why am I like this?” So she went to inquire of the LORD."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 9:10-12",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.”"
        },
        {
          "reference": "Hosea 12:3",
          "text": "In the womb he grasped his brother’s heel, and in his vigor he wrestled with God."
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Genesis 9:6",
          "text": "Whoever sheds the blood of man, by man his blood will be shed; for in His own image God has made mankind."
        },
        {
          "reference": "Genesis 27:29",
          "text": "May peoples serve you and nations bow down to you. May you be the master of your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed, and those who bless you be blessed.”"
        },
        {
          "reference": "1 Samuel 1:10-11",
          "text": "In her bitter distress, Hannah prayed to the LORD and wept with many tears. / And she made a vow, saying, “O LORD of Hosts, if only You will look upon the affliction of Your maidservant and remember me, not forgetting Your maidservant but giving her a son, then I will dedicate him to the LORD all the days of his life, and no razor shall ever touch his head.”"
        },
        {
          "reference": "2 Samuel 22:7",
          "text": "In my distress I called upon the LORD; I cried out to my God. And from His temple He heard my voice, and my cry for help reached His ears."
        },
        {
          "reference": "Psalm 22:1-2",
          "text": "For the choirmaster. To the tune of “The Doe of the Dawn.” A Psalm of David. My God, my God, why have You forsaken me? Why are You so far from saving me, so far from my words of groaning? / I cry out by day, O my God, but You do not answer, and by night, but I have no rest."
        },
        {
          "reference": "Psalm 139:13-16",
          "text": "For You formed my inmost being; You knit me together in my mother’s womb. / I praise You, for I am fearfully and wonderfully made. Marvelous are Your works, and I know this very well. / My frame was not hidden from You when I was made in secret, when I was woven together in the depths of the earth. ..."
        },
        {
          "reference": "Jeremiah 1:5",
          "text": "“Before I formed you in the womb I knew you, and before you were born I set you apart and appointed you as a prophet to the nations.”"
        },
        {
          "reference": "Luke 1:41-44",
          "text": "When Elizabeth heard Mary’s greeting, the baby leaped in her womb, and Elizabeth was filled with the Holy Spirit. / In a loud voice she exclaimed, “Blessed are you among women, and blessed is the fruit of your womb! / And why am I so honored, that the mother of my Lord should come to me? ..."
        },
        {
          "reference": "Matthew 1:20-21",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit. / She will give birth to a Son, and you are to give Him the name Jesus, because He will save His people from their sins.”"
        },
        {
          "reference": "Galatians 4:28-29",
          "text": "Now you, brothers, like Isaac, are children of promise. / At that time, however, the son born by the flesh persecuted the son born by the Spirit. It is the same now."
        },
        {
          "reference": "Hebrews 11:20",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future."
        },
        {
          "reference": "Ephesians 1:11",
          "text": "In Him we were also chosen as God’s own, having been predestined according to the plan of Him who works out everything by the counsel of His will,"
        }
      ]
    },
    {
      "reference": "Genesis 25:23",
      "book": "Genesis",
      "chapter": 25,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "The LORD said to her, “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "version": "NLT",
          "text": "And the LORD told her, “The sons in your womb will become two nations. From the very beginning, the two nations will be rivals. One nation will be stronger than the other; and your older son will serve your younger son.”"
        },
        {
          "version": "ESV",
          "text": "And the LORD said to her, “Two nations are in your womb, and two peoples from within you shall be divided; the one shall be stronger than the other, the older shall serve the younger.”"
        },
        {
          "version": "NKJV",
          "text": "And the LORD said to her: “Two nations are in your womb, Two peoples shall be separated from your body; One people shall be stronger than the other, And the older shall serve the younger.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 9:10-12",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.”"
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Hebrews 11:20",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future."
        },
        {
          "reference": "2 Samuel 8:14",
          "text": "He placed garrisons throughout Edom, and all the Edomites were subject to David. So the LORD made David victorious wherever he went."
        },
        {
          "reference": "Obadiah 1:10-12",
          "text": "Because of the violence against your brother Jacob, you will be covered with shame and cut off forever. / On the day you stood aloof while strangers carried off his wealth and foreigners entered his gate and cast lots for Jerusalem, you were just like one of them. / But you should not gloat in that day, your brother’s day of misfortune, nor rejoice over the people of Judah in the day of their destruction, nor boast proudly in the day of their distress."
        },
        {
          "reference": "Obadiah 1:18",
          "text": "Then the house of Jacob will be a blazing fire, and the house of Joseph a burning flame; but the house of Esau will be stubble—Jacob will set it ablaze and consume it. Therefore no survivor will remain from the house of Esau.” For the LORD has spoken."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land."
        },
        {
          "reference": "Ezekiel 35:5",
          "text": "Because you harbored an ancient hatred and delivered the Israelites over to the sword in the time of their disaster at the final stage of their punishment,"
        },
        {
          "reference": "Ezekiel 35:15",
          "text": "As you rejoiced when the inheritance of the house of Israel became desolate, so will I do to you. You will become a desolation, O Mount Seir, and so will all of Edom. Then they will know that I am the LORD."
        },
        {
          "reference": "Amos 1:11",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly."
        },
        {
          "reference": "Amos 9:12",
          "text": "that they may possess the remnant of Edom and all the nations that bear My name,” declares the LORD, who will do this."
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Isaiah 63:1",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.”"
        }
      ]
    },
    {
      "reference": "Genesis 25:24",
      "book": "Genesis",
      "chapter": 25,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "When the time came for her to give birth, there were twin boys in her womb."
        },
        {
          "version": "NLT",
          "text": "And when the time came to give birth, Rebekah discovered that she did indeed have twins!"
        },
        {
          "version": "ESV",
          "text": "When her days to give birth were completed, behold, there were twins in her womb."
        },
        {
          "version": "NKJV",
          "text": "So when her days were fulfilled for her to give birth, indeed there were twins in her womb."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 27:29",
          "text": "May peoples serve you and nations bow down to you. May you be the master of your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed, and those who bless you be blessed.”"
        },
        {
          "reference": "Genesis 27:40",
          "text": "You shall live by the sword and serve your brother. But when you rebel, you will tear his yoke from your neck.”"
        },
        {
          "reference": "Genesis 9:6",
          "text": "Whoever sheds the blood of man, by man his blood will be shed; for in His own image God has made mankind."
        },
        {
          "reference": "Genesis 17:16",
          "text": "And I will bless her and will surely give you a son by her. I will bless her, and she will be the mother of nations; kings of peoples will descend from her.”"
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 30:24",
          "text": "She named him Joseph, and said, “May the LORD add to me another son.”"
        },
        {
          "reference": "Genesis 38:27-30",
          "text": "When the time came for Tamar to give birth, there were twins in her womb. / And as she was giving birth, one of them put out his hand; so the midwife took a scarlet thread and tied it around his wrist. “This one came out first,” she announced. / But when he pulled his hand back and his brother came out, she said, “You have broken out first!” So he was named Perez. ..."
        },
        {
          "reference": "Exodus 1:7",
          "text": "but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Romans 9:10-12",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.”"
        },
        {
          "reference": "Hebrews 11:20",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future."
        },
        {
          "reference": "Romans 9:13",
          "text": "So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "1 Peter 2:9-10",
          "text": "But you are a chosen people, a royal priesthood, a holy nation, a people for God’s own possession, to proclaim the virtues of Him who called you out of darkness into His marvelous light. / Once you were not a people, but now you are the people of God; once you had not received mercy, but now you have received mercy."
        },
        {
          "reference": "Galatians 4:28-29",
          "text": "Now you, brothers, like Isaac, are children of promise. / At that time, however, the son born by the flesh persecuted the son born by the Spirit. It is the same now."
        }
      ]
    },
    {
      "reference": "Genesis 25:25",
      "book": "Genesis",
      "chapter": 25,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "The first to come out was red, and his whole body was like a hairy garment; so they named him Esau."
        },
        {
          "version": "NLT",
          "text": "The first one was very red at birth and covered with thick hair like a fur coat. So they named him Esau."
        },
        {
          "version": "ESV",
          "text": "The first came out red, all his body like a hairy cloak, so they called his name Esau."
        },
        {
          "version": "NKJV",
          "text": "And the first came out red. He was like a hairy garment all over; so they called his name Esau."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:11",
          "text": "Jacob answered his mother Rebekah, “Look, my brother Esau is a hairy man, but I am smooth-skinned."
        },
        {
          "reference": "Genesis 27:16",
          "text": "She also put the skins of the young goats on his hands and on the smooth part of his neck."
        },
        {
          "reference": "Genesis 27:23",
          "text": "Isaac did not recognize him, because his hands were hairy like those of his brother Esau; so he blessed him."
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 36:1",
          "text": "This is the account of Esau (that is, Edom)."
        },
        {
          "reference": "Genesis 36:8",
          "text": "So Esau (that is, Edom) settled in the area of Mount Seir."
        },
        {
          "reference": "Genesis 36:19",
          "text": "All these are the sons of Esau (that is, Edom), and they were their chiefs."
        },
        {
          "reference": "Genesis 36:43",
          "text": "Magdiel, and Iram. These were the chiefs of Edom, according to their settlements in the land they possessed. Esau was the father of the Edomites."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Obadiah 1:10",
          "text": "Because of the violence against your brother Jacob, you will be covered with shame and cut off forever."
        },
        {
          "reference": "Obadiah 1:18",
          "text": "Then the house of Jacob will be a blazing fire, and the house of Joseph a burning flame; but the house of Esau will be stubble—Jacob will set it ablaze and consume it. Therefore no survivor will remain from the house of Esau.” For the LORD has spoken."
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 11:20",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future."
        },
        {
          "reference": "Hebrews 12:16",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright."
        }
      ]
    },
    {
      "reference": "Genesis 25:26",
      "book": "Genesis",
      "chapter": 25,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "After this, his brother came out, with his hand grasping Esau’s heel; so he was named Jacob. Isaac was sixty years old when Rebekah gave birth to them."
        },
        {
          "version": "NLT",
          "text": "Then the other twin was born with his hand grasping Esau’s heel. So they named him Jacob. Isaac was sixty years old when the twins were born."
        },
        {
          "version": "ESV",
          "text": "Afterward his brother came out with his hand holding Esau’s heel, so his name was called Jacob. Isaac was sixty years old when she bore them."
        },
        {
          "version": "NKJV",
          "text": "Afterward his brother came out, and his hand took hold of Esau’s heel; so his name was called Jacob. Isaac was sixty years old when she bore them."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hosea 12:3",
          "text": "In the womb he grasped his brother’s heel, and in his vigor he wrestled with God."
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Genesis 27:36",
          "text": "So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 32:28",
          "text": "Then the man said, “Your name will no longer be Jacob, but Israel, because you have struggled with God and with men, and you have prevailed.”"
        },
        {
          "reference": "Genesis 33:1-3",
          "text": "Now Jacob looked up and saw Esau coming toward him with four hundred men. So he divided the children among Leah, Rachel, and the two maidservants. / He put the maidservants and their children in front, Leah and her children next, and Rachel and Joseph at the rear. / But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother."
        },
        {
          "reference": "Genesis 36:1",
          "text": "This is the account of Esau (that is, Edom)."
        },
        {
          "reference": "1 Chronicles 1:34",
          "text": "Abraham was the father of Isaac. The sons of Isaac: Esau and Israel."
        },
        {
          "reference": "Obadiah 1:10",
          "text": "Because of the violence against your brother Jacob, you will be covered with shame and cut off forever."
        },
        {
          "reference": "Obadiah 1:18",
          "text": "Then the house of Jacob will be a blazing fire, and the house of Joseph a burning flame; but the house of Esau will be stubble—Jacob will set it ablaze and consume it. Therefore no survivor will remain from the house of Esau.” For the LORD has spoken."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "2 Samuel 8:14",
          "text": "He placed garrisons throughout Edom, and all the Edomites were subject to David. So the LORD made David victorious wherever he went."
        },
        {
          "reference": "Jeremiah 49:10",
          "text": "But I will strip Esau bare; I will uncover his hiding places, and he will be unable to conceal himself. His descendants will be destroyed along with his relatives and neighbors, and he will be no more."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        }
      ]
    },
    {
      "reference": "Genesis 25:27",
      "book": "Genesis",
      "chapter": 25,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "The boys grew up, and Esau became a skillful hunter, a man of the open country, while Jacob was content to stay at home among the tents."
        },
        {
          "version": "NLT",
          "text": "As the boys grew up, Esau became a skillful hunter. He was an outdoorsman, but Jacob had a quiet temperament, preferring to stay at home."
        },
        {
          "version": "ESV",
          "text": "When the boys grew up, Esau was a skillful hunter, a man of the field, while Jacob was a quiet man, dwelling in tents."
        },
        {
          "version": "NKJV",
          "text": "So the boys grew. And Esau was a skillful hunter, a man of the field; but Jacob was a mild man, dwelling in tents."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 12:16",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Hebrews 11:20",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future."
        },
        {
          "reference": "Genesis 27:3-4",
          "text": "Take your weapons—your quiver and bow—and go out into the field to hunt some game for me. / Then prepare a tasty dish that I love and bring it to me to eat, so that I may bless you before I die.”"
        },
        {
          "reference": "Genesis 27:19",
          "text": "Jacob said to his father, “I am Esau, your firstborn. I have done as you told me. Please sit up and eat some of my game, so that you may bless me.”"
        },
        {
          "reference": "Genesis 27:30-33",
          "text": "As soon as Isaac had finished blessing him and Jacob had left his father’s presence, his brother Esau returned from the hunt. / He too made some tasty food, brought it to his father, and said to him, “My father, sit up and eat of your son’s game, so that you may bless me.” / But his father Isaac replied, “Who are you?” “I am Esau, your firstborn son,” he answered. ..."
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 33:1-3",
          "text": "Now Jacob looked up and saw Esau coming toward him with four hundred men. So he divided the children among Leah, Rachel, and the two maidservants. / He put the maidservants and their children in front, Leah and her children next, and Rachel and Joseph at the rear. / But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother."
        },
        {
          "reference": "Genesis 36:1",
          "text": "This is the account of Esau (that is, Edom)."
        },
        {
          "reference": "Genesis 49:19",
          "text": "Gad will be attacked by raiders, but he will attack their heels."
        },
        {
          "reference": "Obadiah 1:10",
          "text": "Because of the violence against your brother Jacob, you will be covered with shame and cut off forever."
        },
        {
          "reference": "Obadiah 1:18",
          "text": "Then the house of Jacob will be a blazing fire, and the house of Joseph a burning flame; but the house of Esau will be stubble—Jacob will set it ablaze and consume it. Therefore no survivor will remain from the house of Esau.” For the LORD has spoken."
        },
        {
          "reference": "1 Chronicles 1:34",
          "text": "Abraham was the father of Isaac. The sons of Isaac: Esau and Israel."
        }
      ]
    },
    {
      "reference": "Genesis 25:28",
      "book": "Genesis",
      "chapter": 25,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "Isaac, who had a taste for wild game, loved Esau, but Rebekah loved Jacob."
        },
        {
          "version": "NLT",
          "text": "Isaac loved Esau because he enjoyed eating the wild game Esau brought home, but Rebekah loved Jacob."
        },
        {
          "version": "ESV",
          "text": "Isaac loved Esau because he ate of his game, but Rebekah loved Jacob."
        },
        {
          "version": "NKJV",
          "text": "And Isaac loved Esau because he ate of his game, but Rebekah loved Jacob."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:1-29",
          "text": "When Isaac was old and his eyes were so weak that he could no longer see, he called his older son Esau and said to him, “My son.” “Here I am,” Esau replied. / “Look,” said Isaac, “I am now old, and I do not know the day of my death. / Take your weapons—your quiver and bow—and go out into the field to hunt some game for me. ..."
        },
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Genesis 29:30",
          "text": "Jacob slept with Rachel as well, and indeed, he loved Rachel more than Leah. So he worked for Laban another seven years."
        },
        {
          "reference": "Genesis 48:17-19",
          "text": "When Joseph saw that his father had placed his right hand on Ephraim’s head, he was displeased and took his father’s hand to move it from Ephraim’s head to Manasseh’s. / “Not so, my father!” Joseph said. “This one is the firstborn; put your right hand on his head.” / But his father refused. “I know, my son, I know!” he said. “He too shall become a people, and he too shall be great; nevertheless, his younger brother shall be greater than he, and his offspring shall become a multitude of nations.”"
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Samuel 1:4-5",
          "text": "And whenever the day came for Elkanah to present his sacrifice, he would give portions to his wife Peninnah and to all her sons and daughters. / But to Hannah he would give a double portion, for he loved her even though the LORD had closed her womb."
        },
        {
          "reference": "1 Samuel 16:6-13",
          "text": "When they arrived, Samuel saw Eliab and said, “Surely here before the LORD is His anointed.” / But the LORD said to Samuel, “Do not consider his appearance or height, for I have rejected him; the LORD does not see as man does. For man sees the outward appearance, but the LORD sees the heart.” / Then Jesse called Abinadab and presented him to Samuel, who said, “The LORD has not chosen this one either.” ..."
        },
        {
          "reference": "2 Samuel 13:21",
          "text": "When King David heard all this, he was furious."
        },
        {
          "reference": "1 Kings 11:1-3",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love. / He had seven hundred wives of royal birth and three hundred concubines—and his wives turned his heart away."
        },
        {
          "reference": "Proverbs 28:21",
          "text": "To show partiality is not good, yet a man will do wrong for a piece of bread."
        },
        {
          "reference": "Matthew 10:37",
          "text": "Anyone who loves his father or mother more than Me is not worthy of Me; anyone who loves his son or daughter more than Me is not worthy of Me;"
        },
        {
          "reference": "Luke 15:11-32",
          "text": "Then Jesus said, “There was a man who had two sons. / The younger son said to him, ‘Father, give me my share of the estate.’ So he divided his property between them. / After a few days, the younger son got everything together and journeyed to a distant country, where he squandered his wealth in wild living. ..."
        }
      ]
    },
    {
      "reference": "Genesis 25:29",
      "book": "Genesis",
      "chapter": 25,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "Once when Jacob was cooking some stew, Esau came in from the open country, famished."
        },
        {
          "version": "NLT",
          "text": "One day when Jacob was cooking some stew, Esau arrived home from the wilderness exhausted and hungry."
        },
        {
          "version": "ESV",
          "text": "Once when Jacob was cooking stew, Esau came in from the field, and he was exhausted."
        },
        {
          "version": "NKJV",
          "text": "Now Jacob cooked a stew; and Esau came in from the field, and he was weary."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 12:16",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Genesis 27:36",
          "text": "So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 27:30-34",
          "text": "As soon as Isaac had finished blessing him and Jacob had left his father’s presence, his brother Esau returned from the hunt. / He too made some tasty food, brought it to his father, and said to him, “My father, sit up and eat of your son’s game, so that you may bless me.” / But his father Isaac replied, “Who are you?” “I am Esau, your firstborn son,” he answered. ..."
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 28:6-9",
          "text": "Now Esau learned that Isaac had blessed Jacob and sent him to Paddan-aram to take a wife there, commanding him, “Do not marry a Canaanite woman,” / and that Jacob had obeyed his father and mother and gone to Paddan-aram. / And seeing that his father Isaac disapproved of the Canaanite women, ..."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 33:1-4",
          "text": "Now Jacob looked up and saw Esau coming toward him with four hundred men. So he divided the children among Leah, Rachel, and the two maidservants. / He put the maidservants and their children in front, Leah and her children next, and Rachel and Joseph at the rear. / But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother. ..."
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Obadiah 1:10-12",
          "text": "Because of the violence against your brother Jacob, you will be covered with shame and cut off forever. / On the day you stood aloof while strangers carried off his wealth and foreigners entered his gate and cast lots for Jerusalem, you were just like one of them. / But you should not gloat in that day, your brother’s day of misfortune, nor rejoice over the people of Judah in the day of their destruction, nor boast proudly in the day of their distress."
        },
        {
          "reference": "1 Chronicles 1:34",
          "text": "Abraham was the father of Isaac. The sons of Isaac: Esau and Israel."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Samuel 14:24-31",
          "text": "Now the men of Israel were in distress that day, for Saul had placed the troops under an oath, saying, “Cursed is the man who eats any food before evening, before I have taken vengeance on my enemies.” So none of the troops tasted any food. / Then all the troops entered the forest, and there was honey on the ground. / And when they entered the forest and saw the flowing honey, not one of them put his hand to his mouth, because they feared the oath. ..."
        }
      ]
    },
    {
      "reference": "Genesis 25:30",
      "book": "Genesis",
      "chapter": 25,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "He said to Jacob, “Quick, let me have some of that red stew! I’m famished!” (That is why he was also called Edom.)"
        },
        {
          "version": "NLT",
          "text": "Esau said to Jacob, “I’m starved! Give me some of that red stew!” (This is how Esau got his other name, Edom, which means “red.”)"
        },
        {
          "version": "ESV",
          "text": "And Esau said to Jacob, “Let me eat some of that red stew, for I am exhausted!” (Therefore his name was called Edom.)"
        },
        {
          "version": "NKJV",
          "text": "And Esau said to Jacob, “Please feed me with that same red stew, for I am weary.” Therefore his name was called Edom."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 12:16",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright."
        },
        {
          "reference": "Romans 9:13",
          "text": "So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Genesis 27:36",
          "text": "So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Obadiah 1:10",
          "text": "Because of the violence against your brother Jacob, you will be covered with shame and cut off forever."
        },
        {
          "reference": "Obadiah 1:18",
          "text": "Then the house of Jacob will be a blazing fire, and the house of Joseph a burning flame; but the house of Esau will be stubble—Jacob will set it ablaze and consume it. Therefore no survivor will remain from the house of Esau.” For the LORD has spoken."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly."
        },
        {
          "reference": "Amos 1:12",
          "text": "So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Psalm 137:7",
          "text": "Remember, O LORD, the sons of Edom on the day Jerusalem fell: “Destroy it,” they said, “tear it down to its foundations!”"
        }
      ]
    },
    {
      "reference": "Genesis 25:31",
      "book": "Genesis",
      "chapter": 25,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob replied, &#8220First sell me your birthright.”"
        },
        {
          "version": "NLT",
          "text": "“All right,” Jacob replied, “but trade me your rights as the firstborn son.”"
        },
        {
          "version": "ESV",
          "text": "Jacob said, “Sell me your birthright now.”"
        },
        {
          "version": "NKJV",
          "text": "But Jacob said, “Sell me your birthright as of this day.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 25:32",
      "book": "Genesis",
      "chapter": 25,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "“Look, I am about to die,” Esau said. “What good is the birthright to me?”"
        },
        {
          "version": "NLT",
          "text": "“Look, I’m dying of starvation!” said Esau. “What good is my birthright to me now?”"
        },
        {
          "version": "ESV",
          "text": "Esau said, “I am about to die; of what use is a birthright to me?”"
        },
        {
          "version": "NKJV",
          "text": "And Esau said, “Look, I am about to die; so what is this birthright to me?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 12:16",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Philippians 3:19",
          "text": "Their end is destruction, their god is their belly, and their glory is in their shame. Their minds are set on earthly things."
        },
        {
          "reference": "1 Corinthians 6:13",
          "text": "“Food for the stomach and the stomach for food,” but God will destroy them both. The body is not intended for sexual immorality, but for the Lord, and the Lord for the body."
        },
        {
          "reference": "Matthew 16:26",
          "text": "What will it profit a man if he gains the whole world, yet forfeits his soul? Or what can a man give in exchange for his soul?"
        },
        {
          "reference": "Luke 12:19-20",
          "text": "Then I will say to myself, “You have plenty of good things laid up for many years. Take it easy. Eat, drink, and be merry!”’ / But God said to him, ‘You fool! This very night your life will be required of you. Then who will own what you have accumulated?’"
        },
        {
          "reference": "2 Timothy 3:4",
          "text": "traitorous, reckless, conceited, lovers of pleasure rather than lovers of God,"
        },
        {
          "reference": "Proverbs 15:27",
          "text": "He who is greedy for unjust gain brings trouble on his household, but he who hates bribes will live."
        },
        {
          "reference": "Proverbs 20:21",
          "text": "An inheritance gained quickly will not be blessed in the end."
        },
        {
          "reference": "Proverbs 23:4-5",
          "text": "Do not wear yourself out to get rich; be wise enough to restrain yourself. / When you glance at wealth, it disappears, for it makes wings for itself and flies like an eagle to the sky."
        },
        {
          "reference": "Ecclesiastes 1:14",
          "text": "I have seen all the things that are done under the sun, and have found them all to be futile, a pursuit of the wind."
        },
        {
          "reference": "Ecclesiastes 2:11",
          "text": "Yet when I considered all the works that my hands had accomplished and what I had toiled to achieve, I found everything to be futile, a pursuit of the wind; there was nothing to be gained under the sun."
        },
        {
          "reference": "Ecclesiastes 5:10",
          "text": "He who loves money is never satisfied by money, and he who loves wealth is never satisfied by income. This too is futile."
        },
        {
          "reference": "Isaiah 55:2",
          "text": "Why spend money on that which is not bread, and your labor on that which does not satisfy? Listen carefully to Me, and eat what is good, and your soul will delight in the richest of foods."
        }
      ]
    },
    {
      "reference": "Genesis 25:33",
      "book": "Genesis",
      "chapter": 25,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "But Jacob said, “Swear to me first.” So he swore an oath to him, selling his birthright to Jacob."
        },
        {
          "version": "NLT",
          "text": "But Jacob said, “First you must swear that your birthright is mine.” So Esau swore an oath, thereby selling all his rights as the firstborn to his brother, Jacob."
        },
        {
          "version": "ESV",
          "text": "Jacob said, “Swear to me now.” So he swore to him and sold his birthright to Jacob."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob said, “Swear to me as of this day.” So he swore to him, and sold his birthright to Jacob."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 12:16",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright."
        },
        {
          "reference": "Romans 9:13",
          "text": "So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Genesis 27:36",
          "text": "So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 27:33-34",
          "text": "Isaac began to tremble violently and said, “Who was it, then, who hunted the game and brought it to me? Before you came in, I ate it all and blessed him—and indeed, he will be blessed!” / When Esau heard his father’s words, he let out a loud and bitter cry and said to his father, “Bless me too, O my father!”"
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 28:8-9",
          "text": "And seeing that his father Isaac disapproved of the Canaanite women, / Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 32:28",
          "text": "Then the man said, “Your name will no longer be Jacob, but Israel, because you have struggled with God and with men, and you have prevailed.”"
        },
        {
          "reference": "Genesis 33:4",
          "text": "Esau, however, ran to him and embraced him, threw his arms around his neck, and kissed him. And they both wept."
        },
        {
          "reference": "Genesis 36:1",
          "text": "This is the account of Esau (that is, Edom)."
        },
        {
          "reference": "Genesis 36:8",
          "text": "So Esau (that is, Edom) settled in the area of Mount Seir."
        },
        {
          "reference": "Genesis 36:43",
          "text": "Magdiel, and Iram. These were the chiefs of Edom, according to their settlements in the land they possessed. Esau was the father of the Edomites."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        }
      ]
    },
    {
      "reference": "Genesis 25:34",
      "book": "Genesis",
      "chapter": 25,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob gave Esau some bread and some lentil stew. He ate and drank, and then got up and left. So Esau despised his birthright."
        },
        {
          "version": "NLT",
          "text": "Then Jacob gave Esau some bread and lentil stew. Esau ate the meal, then got up and left. He showed contempt for his rights as the firstborn."
        },
        {
          "version": "ESV",
          "text": "Then Jacob gave Esau bread and lentil stew, and he ate and drank and rose and went his way. Thus Esau despised his birthright."
        },
        {
          "version": "NKJV",
          "text": "And Jacob gave Esau bread and stew of lentils; then he ate and drank, arose, and went his way. Thus Esau despised his birthright."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Philippians 3:19",
          "text": "Their end is destruction, their god is their belly, and their glory is in their shame. Their minds are set on earthly things."
        },
        {
          "reference": "1 Corinthians 15:32",
          "text": "If I fought wild beasts in Ephesus for human motives, what did I gain? If the dead are not raised, “Let us eat and drink, for tomorrow we die.”"
        },
        {
          "reference": "Matthew 16:26",
          "text": "What will it profit a man if he gains the whole world, yet forfeits his soul? Or what can a man give in exchange for his soul?"
        },
        {
          "reference": "Luke 16:25",
          "text": "But Abraham answered, ‘Child, remember that during your lifetime you received your good things, while Lazarus received bad things. But now he is comforted here, while you are in agony."
        },
        {
          "reference": "James 4:14",
          "text": "You do not even know what will happen tomorrow! What is your life? You are a mist that appears for a little while and then vanishes."
        },
        {
          "reference": "2 Timothy 3:4",
          "text": "traitorous, reckless, conceited, lovers of pleasure rather than lovers of God,"
        },
        {
          "reference": "Proverbs 1:32",
          "text": "For the waywardness of the simple will slay them, and the complacency of fools will destroy them."
        },
        {
          "reference": "Proverbs 15:27",
          "text": "He who is greedy for unjust gain brings trouble on his household, but he who hates bribes will live."
        },
        {
          "reference": "Ecclesiastes 8:15",
          "text": "So I commended the enjoyment of life, because there is nothing better for a man under the sun than to eat and drink and be merry. For this joy will accompany him in his labor during the days of his life that God gives him under the sun."
        },
        {
          "reference": "Isaiah 22:13",
          "text": "But look, there is joy and gladness, butchering of cattle and slaughtering of sheep, eating of meat and drinking of wine: “Let us eat and drink, for tomorrow we die!”"
        },
        {
          "reference": "Jeremiah 6:13",
          "text": "“For from the least of them to the greatest, all are greedy for gain; from prophet to priest, all practice deceit."
        },
        {
          "reference": "Ezekiel 16:49",
          "text": "Now this was the iniquity of your sister Sodom: She and her daughters were arrogant, overfed, and complacent; they did not help the poor and needy."
        }
      ]
    }
  ]
}