{
  "book": "genesis",
  "chapter": 29,
  "verses": [
    {
      "reference": "Genesis 29:1",
      "book": "Genesis",
      "chapter": 29,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob continued on his journey and came to the land of the eastern peoples."
        },
        {
          "version": "NLT",
          "text": "Then Jacob hurried on, finally arriving in the land of the east."
        },
        {
          "version": "ESV",
          "text": "Then Jacob went on his journey and came to the land of the people of the east."
        },
        {
          "version": "NKJV",
          "text": "So Jacob went on his journey and came to the land of the people of the East."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:10",
          "text": "Then the servant took ten of his master’s camels and departed with all manner of good things from his master in hand. And he set out for Nahor’s hometown in Aram-naharaim."
        },
        {
          "reference": "Genesis 28:5",
          "text": "So Isaac sent Jacob to Paddan-aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau."
        },
        {
          "reference": "Genesis 24:4",
          "text": "but will go to my country and my kindred to take a wife for my son Isaac.”"
        },
        {
          "reference": "Genesis 24:29",
          "text": "Now Rebekah had a brother named Laban, and he rushed out to the man at the spring."
        },
        {
          "reference": "Genesis 24:15",
          "text": "Before the servant had finished praying, Rebekah came out with her jar on her shoulder. She was the daughter of Bethuel son of Milcah, the wife of Abraham’s brother Nahor."
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:27",
          "text": "saying, “Blessed be the LORD, the God of my master Abraham, who has not withheld His kindness and faithfulness from my master. As for me, the LORD has led me on the journey to the house of my master’s relatives.”"
        },
        {
          "reference": "Genesis 24:38",
          "text": "but you shall go to my father’s house and to my kindred to take a wife for my son.’"
        },
        {
          "reference": "Genesis 24:42",
          "text": "So when I came to the spring today, I prayed: O LORD, God of my master Abraham, if only You would make my journey a success!"
        },
        {
          "reference": "Genesis 24:48",
          "text": "Then I bowed down and worshiped the LORD; and I blessed the LORD, the God of my master Abraham, who led me on the right road to take the granddaughter of my master’s brother for his son."
        },
        {
          "reference": "Genesis 24:51",
          "text": "Rebekah is here before you. Take her and go, and let her become the wife of your master’s son, just as the LORD has decreed.”"
        },
        {
          "reference": "Genesis 24:61",
          "text": "Then Rebekah and her servant girls got ready, mounted the camels, and followed the man. So the servant took Rebekah and left."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 30:25",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland."
        },
        {
          "reference": "Genesis 31:18",
          "text": "and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        }
      ]
    },
    {
      "reference": "Genesis 29:2",
      "book": "Genesis",
      "chapter": 29,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "There he saw a well in the open country, with three flocks of sheep lying near it because the flocks were watered from that well. The stone over the mouth of the well was large."
        },
        {
          "version": "NLT",
          "text": "He saw a well in the distance. Three flocks of sheep and goats lay in an open field beside it, waiting to be watered. But a heavy stone covered the mouth of the well."
        },
        {
          "version": "ESV",
          "text": "As he looked, he saw a well in the field, and behold, three flocks of sheep lying beside it, for out of that well the flocks were watered. The stone on the well’s mouth was large,"
        },
        {
          "version": "NKJV",
          "text": "And he looked, and saw a well in the field; and behold, there were three flocks of sheep lying by it; for out of that well they watered the flocks. A large stone was on the well’s mouth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 2:16-17",
          "text": "Now the priest of Midian had seven daughters, and they came to draw water and fill the troughs to water their father’s flock. / And when some shepherds came along and drove them away, Moses rose up to help them and watered their flock."
        },
        {
          "reference": "John 4:6-7",
          "text": "Since Jacob’s well was there, Jesus, weary from His journey, sat down by the well. It was about the sixth hour. / When a Samaritan woman came to draw water, Jesus said to her, “Give Me a drink.”"
        },
        {
          "reference": "Genesis 24:11-20",
          "text": "As evening approached, he made the camels kneel down near the well outside the town at the time when the women went out to draw water. / “O LORD, God of my master Abraham,” he prayed, “please grant me success today, and show kindness to my master Abraham. / Here I am, standing beside the spring, and the daughters of the townspeople are coming out to draw water. ..."
        },
        {
          "reference": "Numbers 20:1-11",
          "text": "In the first month, the whole congregation of Israel entered the Wilderness of Zin and stayed in Kadesh. There Miriam died and was buried. / Now there was no water for the congregation, so they gathered against Moses and Aaron. / The people quarreled with Moses and said, “If only we had perished with our brothers before the LORD! ..."
        },
        {
          "reference": "John 4:10-14",
          "text": "Jesus answered, “If you knew the gift of God and who is asking you for a drink, you would have asked Him, and He would have given you living water.” / “Sir,” the woman replied, “You have nothing to draw with and the well is deep. Where then will You get this living water? / Are You greater than our father Jacob, who gave us this well and drank from it himself, as did his sons and his livestock?” ..."
        },
        {
          "reference": "Genesis 30:38",
          "text": "Then he set the peeled branches in the watering troughs in front of the flocks coming in to drink. So when the flocks were in heat and came to drink,"
        },
        {
          "reference": "1 Samuel 9:11-12",
          "text": "And as they were climbing the hill to the city, they met some young women coming out to draw water and asked, “Is the seer here?” / “Yes, he is ahead of you,” they answered. “Hurry now, for today he has come to the city because the people have a sacrifice on the high place."
        },
        {
          "reference": "Isaiah 12:3",
          "text": "With joy you will draw water from the springs of salvation,"
        },
        {
          "reference": "John 7:37-38",
          "text": "On the last and greatest day of the feast, Jesus stood up and called out in a loud voice, “If anyone is thirsty, let him come to Me and drink. / Whoever believes in Me, as the Scripture has said: ‘Streams of living water will flow from within him.’”"
        },
        {
          "reference": "Genesis 26:19-22",
          "text": "Then Isaac’s servants dug in the valley and found a well of fresh water there. / But the herdsmen of Gerar quarreled with Isaac’s herdsmen and said, “The water is ours!” So he named the well Esek, because they contended with him. / Then they dug another well and quarreled over that one also; so he named it Sitnah. ..."
        },
        {
          "reference": "2 Kings 3:16-17",
          "text": "and he said, “This is what the LORD says: ‘Dig this valley full of ditches.’ / For the LORD says, ‘You will not see wind or rain, but the valley will be filled with water, and you will drink—you and your cattle and your animals.’"
        },
        {
          "reference": "John 4:28-29",
          "text": "Then the woman left her water jar, went back into the town, and said to the people, / “Come, see a man who told me everything I ever did. Could this be the Christ?”"
        },
        {
          "reference": "Genesis 21:19",
          "text": "Then God opened her eyes, and she saw a well of water. So she went and filled the skin with water and gave the boy a drink."
        },
        {
          "reference": "Revelation 7:17",
          "text": "For the Lamb in the center of the throne will be their shepherd. ‘He will lead them to springs of living water,’ and ‘God will wipe away every tear from their eyes.’”"
        },
        {
          "reference": "Genesis 33:13-14",
          "text": "But Jacob replied, “My lord knows that the children are frail, and I must care for sheep and cattle that are nursing their young. If they are driven hard for even a day, all the animals will die. / Please let my lord go ahead of his servant. I will continue on slowly, at a comfortable pace for the livestock and children, until I come to my lord at Seir.”"
        }
      ]
    },
    {
      "reference": "Genesis 29:3",
      "book": "Genesis",
      "chapter": 29,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "When all the flocks were gathered there, the shepherds would roll the stone away from the well’s mouth and water the sheep. Then they would return the stone to its place over the mouth of the well."
        },
        {
          "version": "NLT",
          "text": "It was the custom there to wait for all the flocks to arrive before removing the stone and watering the animals. Afterward the stone would be placed back over the mouth of the well."
        },
        {
          "version": "ESV",
          "text": "and when all the flocks were gathered there, the shepherds would roll the stone from the mouth of the well and water the sheep, and put the stone back in its place over the mouth of the well."
        },
        {
          "version": "NKJV",
          "text": "Now all the flocks would be gathered there; and they would roll the stone from the well’s mouth, water the sheep, and put the stone back in its place on the well’s mouth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 2:16-17",
          "text": "Now the priest of Midian had seven daughters, and they came to draw water and fill the troughs to water their father’s flock. / And when some shepherds came along and drove them away, Moses rose up to help them and watered their flock."
        },
        {
          "reference": "John 4:6-7",
          "text": "Since Jacob’s well was there, Jesus, weary from His journey, sat down by the well. It was about the sixth hour. / When a Samaritan woman came to draw water, Jesus said to her, “Give Me a drink.”"
        },
        {
          "reference": "1 Samuel 9:11",
          "text": "And as they were climbing the hill to the city, they met some young women coming out to draw water and asked, “Is the seer here?”"
        },
        {
          "reference": "John 10:3-4",
          "text": "The gatekeeper opens the gate for him, and the sheep listen for his voice. He calls his own sheep by name and leads them out. / When he has brought out all his own, he goes on ahead of them, and his sheep follow him because they know his voice."
        },
        {
          "reference": "Isaiah 40:11",
          "text": "He tends His flock like a shepherd; He gathers the lambs in His arms and carries them close to His heart. He gently leads the nursing ewes."
        },
        {
          "reference": "Psalm 23:1-2",
          "text": "A Psalm of David. The LORD is my shepherd; I shall not want. / He makes me lie down in green pastures; He leads me beside quiet waters."
        },
        {
          "reference": "Ezekiel 34:12-15",
          "text": "As a shepherd looks for his scattered sheep when he is among the flock, so I will look for My flock. I will rescue them from all the places to which they were scattered on a day of clouds and darkness. / I will bring them out from the peoples, gather them from the countries, and bring them into their own land. I will feed them on the mountains of Israel, in the ravines, and in all the settlements of the land. / I will feed them in good pasture, and the lofty mountains of Israel will be their grazing land. There they will lie down in a good grazing land; they will feed in rich pasture on the mountains of Israel. ..."
        },
        {
          "reference": "John 10:11",
          "text": "I am the good shepherd. The good shepherd lays down His life for the sheep."
        },
        {
          "reference": "Jeremiah 31:10",
          "text": "Hear, O nations, the word of the LORD, and proclaim it in distant coastlands: “The One who scattered Israel will gather them and keep them as a shepherd keeps his flock."
        },
        {
          "reference": "John 21:15-17",
          "text": "When they had finished eating, Jesus asked Simon Peter, “Simon son of John, do you love Me more than these?” “Yes, Lord,” he answered, “You know I love You.” Jesus replied, “Feed My lambs.” / Jesus asked a second time, “Simon son of John, do you love Me?” “Yes, Lord,” he answered, “You know I love You.” Jesus told him, “Shepherd My sheep.” / Jesus asked a third time, “Simon son of John, do you love Me?” Peter was deeply hurt that Jesus had asked him a third time, “Do you love Me?” “Lord, You know all things,” he replied. “You know I love You.” Jesus said to him, “Feed My sheep."
        },
        {
          "reference": "1 Peter 5:2-4",
          "text": "Be shepherds of God’s flock that is among you, watching over them not out of compulsion, but willingly, as God would have you; not out of greed, but out of eagerness; / not lording it over those entrusted to you, but being examples to the flock. / And when the Chief Shepherd appears, you will receive the crown of glory that will never fade away."
        },
        {
          "reference": "Luke 15:4-6",
          "text": "“What man among you, if he has a hundred sheep and loses one of them, does not leave the ninety-nine in the pasture and go after the one that is lost, until he finds it? / And when he finds it, he joyfully puts it on his shoulders, / comes home, and calls together his friends and neighbors to tell them, ‘Rejoice with me, for I have found my lost sheep!’"
        },
        {
          "reference": "Matthew 18:12-14",
          "text": "What do you think? If a man has a hundred sheep and one of them goes astray, will he not leave the ninety-nine on the hills and go out to search for the one that is lost? / And if he finds it, truly I tell you, he rejoices more over that one sheep than over the ninety-nine that did not go astray. / In the same way, your Father in heaven is not willing that any of these little ones should perish."
        },
        {
          "reference": "Revelation 7:17",
          "text": "For the Lamb in the center of the throne will be their shepherd. ‘He will lead them to springs of living water,’ and ‘God will wipe away every tear from their eyes.’”"
        },
        {
          "reference": "Micah 5:4",
          "text": "He will stand and shepherd His flock in the strength of the LORD, in the majestic name of the LORD His God. And they will dwell securely, for then His greatness will extend to the ends of the earth."
        }
      ]
    },
    {
      "reference": "Genesis 29:4",
      "book": "Genesis",
      "chapter": 29,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob asked the shepherds, “My brothers, where are you from?” “We’re from Harran,” they replied."
        },
        {
          "version": "NLT",
          "text": "Jacob went over to the shepherds and asked, “Where are you from, my friends?” “We are from Haran,” they answered."
        },
        {
          "version": "ESV",
          "text": "Jacob said to them, “My brothers, where do you come from?” They said, “We are from Haran.”"
        },
        {
          "version": "NKJV",
          "text": "And Jacob said to them, “My brethren, where are you from?” And they said, “We are from Haran.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:10-27",
          "text": "Then the servant took ten of his master’s camels and departed with all manner of good things from his master in hand. And he set out for Nahor’s hometown in Aram-naharaim. / As evening approached, he made the camels kneel down near the well outside the town at the time when the women went out to draw water. / “O LORD, God of my master Abraham,” he prayed, “please grant me success today, and show kindness to my master Abraham. ..."
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:11",
          "text": "As evening approached, he made the camels kneel down near the well outside the town at the time when the women went out to draw water."
        },
        {
          "reference": "Genesis 24:15-16",
          "text": "Before the servant had finished praying, Rebekah came out with her jar on her shoulder. She was the daughter of Bethuel son of Milcah, the wife of Abraham’s brother Nahor. / Now the girl was very beautiful, a virgin who had not had relations with any man. She went down to the spring, filled her jar, and came up again."
        },
        {
          "reference": "Genesis 24:29-31",
          "text": "Now Rebekah had a brother named Laban, and he rushed out to the man at the spring. / As soon as he saw the ring, and the bracelets on his sister’s wrists, and heard Rebekah’s words, “The man said this to me,” he went and found the man standing by the camels near the spring. / “Come, you who are blessed by the LORD,” said Laban. “Why are you standing out here? I have prepared the house and a place for the camels.”"
        },
        {
          "reference": "Genesis 24:42-44",
          "text": "So when I came to the spring today, I prayed: O LORD, God of my master Abraham, if only You would make my journey a success! / Here I am, standing beside this spring. Now if a maiden comes out to draw water and I say to her, ‘Please let me drink a little water from your jar,’ / and she replies, ‘Drink, and I will draw water for your camels as well,’ may she be the woman the LORD has appointed for my master’s son."
        },
        {
          "reference": "Genesis 24:62-67",
          "text": "Now Isaac had just returned from Beer-lahai-roi, for he was living in the Negev. / Early in the evening, Isaac went out to the field to meditate, and looking up, he saw the camels approaching. / And when Rebekah looked up and saw Isaac, she got down from her camel ..."
        },
        {
          "reference": "Exodus 2:15-21",
          "text": "When Pharaoh heard about this matter, he sought to kill Moses. But Moses fled from Pharaoh and settled in the land of Midian, where he sat down beside a well. / Now the priest of Midian had seven daughters, and they came to draw water and fill the troughs to water their father’s flock. / And when some shepherds came along and drove them away, Moses rose up to help them and watered their flock. ..."
        },
        {
          "reference": "Judges 18:3",
          "text": "And while they were near Micah’s house, they recognized the voice of the young Levite; so they went over and asked him, “Who brought you here? What are you doing in this place? Why are you here?”"
        },
        {
          "reference": "Ruth 2:4",
          "text": "Just then Boaz arrived from Bethlehem and said to the harvesters, “The LORD be with you.” “The LORD bless you,” they replied."
        },
        {
          "reference": "1 Samuel 9:11-13",
          "text": "And as they were climbing the hill to the city, they met some young women coming out to draw water and asked, “Is the seer here?” / “Yes, he is ahead of you,” they answered. “Hurry now, for today he has come to the city because the people have a sacrifice on the high place. / As soon as you enter the city, you will find him before he goes up to the high place to eat. The people will not eat until he comes, because he must bless the sacrifice; after that, the guests will eat. Go up at once; you will find him.”"
        },
        {
          "reference": "John 4:6-7",
          "text": "Since Jacob’s well was there, Jesus, weary from His journey, sat down by the well. It was about the sixth hour. / When a Samaritan woman came to draw water, Jesus said to her, “Give Me a drink.”"
        },
        {
          "reference": "John 4:9",
          "text": "“You are a Jew,” said the woman. “How can You ask for a drink from me, a Samaritan woman?” (For Jews do not associate with Samaritans.)"
        },
        {
          "reference": "John 4:16-18",
          "text": "Jesus told her, “Go, call your husband and come back.” / “I have no husband,” the woman replied. Jesus said to her, “You are correct to say that you have no husband. / In fact, you have had five husbands, and the man you now have is not your husband. You have spoken truthfully.”"
        },
        {
          "reference": "John 4:28-29",
          "text": "Then the woman left her water jar, went back into the town, and said to the people, / “Come, see a man who told me everything I ever did. Could this be the Christ?”"
        }
      ]
    },
    {
      "reference": "Genesis 29:5",
      "book": "Genesis",
      "chapter": 29,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "He said to them, &#8220Do you know Laban, Nahor’s grandson?” “Yes, we know him,” they answered."
        },
        {
          "version": "NLT",
          "text": "“Do you know a man there named Laban, the grandson of Nahor?” he asked. “Yes, we do,” they replied."
        },
        {
          "version": "ESV",
          "text": "He said to them, “Do you know Laban the son of Nahor?” They said, “We know him.”"
        },
        {
          "version": "NKJV",
          "text": "Then he said to them, “Do you know Laban the son of Nahor?” And they said, “We know him.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 29:6",
      "book": "Genesis",
      "chapter": 29,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob asked them, “Is he well?” “Yes, he is,” they said, &#8220and here comes his daughter Rachel with the sheep.”"
        },
        {
          "version": "NLT",
          "text": "“Is he doing well?” Jacob asked. “Yes, he’s well,” they answered. “Look, here comes his daughter Rachel with the flock now.”"
        },
        {
          "version": "ESV",
          "text": "He said to them, “Is it well with him?” They said, “It is well; and see, Rachel his daughter is coming with the sheep!”"
        },
        {
          "version": "NKJV",
          "text": "So he said to them, “Is he well?” And they said, “ He is well. And look, his daughter Rachel is coming with the sheep.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 29:7",
      "book": "Genesis",
      "chapter": 29,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "“Look,” he said, “the sun is still high; it is not time for the flocks to be gathered. Water the sheep and take them back to pasture.”"
        },
        {
          "version": "NLT",
          "text": "Jacob said, “Look, it’s still broad daylight—too early to round up the animals. Why don’t you water the sheep and goats so they can get back out to pasture?”"
        },
        {
          "version": "ESV",
          "text": "He said, “Behold, it is still high day; it is not time for the livestock to be gathered together. Water the sheep and go, pasture them.”"
        },
        {
          "version": "NKJV",
          "text": "Then he said, “Look, it is still high day; it is not time for the cattle to be gathered together. Water the sheep, and go and feed them. ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "John 4:35",
          "text": "Do you not say, ‘There are still four months until the harvest’? I tell you, lift up your eyes and look at the fields, for they are ripe for harvest."
        },
        {
          "reference": "Ruth 2:4",
          "text": "Just then Boaz arrived from Bethlehem and said to the harvesters, “The LORD be with you.” “The LORD bless you,” they replied."
        },
        {
          "reference": "Proverbs 10:5",
          "text": "He who gathers in summer is a wise son, but he who sleeps during harvest is a disgraceful son."
        },
        {
          "reference": "Matthew 9:37-38",
          "text": "Then He said to His disciples, “The harvest is plentiful, but the workers are few. / Ask the Lord of the harvest, therefore, to send out workers into His harvest.”"
        },
        {
          "reference": "James 5:7",
          "text": "Be patient, then, brothers, until the Lord’s coming. See how the farmer awaits the precious fruit of the soil—how patient he is for the fall and spring rains."
        },
        {
          "reference": "Exodus 2:17",
          "text": "And when some shepherds came along and drove them away, Moses rose up to help them and watered their flock."
        },
        {
          "reference": "1 Samuel 9:11",
          "text": "And as they were climbing the hill to the city, they met some young women coming out to draw water and asked, “Is the seer here?”"
        },
        {
          "reference": "Isaiah 28:24-26",
          "text": "Does the plowman plow for planting every day? Does he continuously loosen and harrow the soil? / When he has leveled its surface, does he not sow caraway and scatter cumin? He plants wheat in rows and barley in plots, and rye within its border. / For his God instructs and teaches him properly."
        },
        {
          "reference": "Luke 10:2",
          "text": "And He told them, “The harvest is plentiful, but the workers are few. Ask the Lord of the harvest, therefore, to send out workers into His harvest."
        },
        {
          "reference": "1 Corinthians 3:6-9",
          "text": "I planted the seed and Apollos watered it, but God made it grow. / So neither he who plants nor he who waters is anything, but only God, who makes things grow. / He who plants and he who waters are one in purpose, and each will be rewarded according to his own labor. ..."
        },
        {
          "reference": "2 Thessalonians 3:10",
          "text": "For even while we were with you, we gave you this command: “If anyone is unwilling to work, he shall not eat.”"
        },
        {
          "reference": "Jeremiah 8:20",
          "text": "“The harvest has passed, the summer has ended, but we have not been saved.”"
        },
        {
          "reference": "Mark 4:26-29",
          "text": "Jesus also said, “The kingdom of God is like a man who scatters seed on the ground. / Night and day he sleeps and wakes, and the seed sprouts and grows, though he knows not how. / All by itself the earth produces a crop—first the stalk, then the head, then grain that ripens within. ..."
        },
        {
          "reference": "Ecclesiastes 11:4",
          "text": "He who watches the wind will fail to sow, and he who observes the clouds will fail to reap."
        },
        {
          "reference": "Amos 4:7",
          "text": "“I also withheld the rain from you when the harvest was three months away. I sent rain on one city but withheld it from another. One field received rain; another without rain withered."
        }
      ]
    },
    {
      "reference": "Genesis 29:8",
      "book": "Genesis",
      "chapter": 29,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "“We can’t,” they replied, “until all the flocks are gathered and the stone has been rolled away from the mouth of the well. Then we will water the sheep.”"
        },
        {
          "version": "NLT",
          "text": "“We can’t water the animals until all the flocks have arrived,” they replied. “Then the shepherds move the stone from the mouth of the well, and we water all the sheep and goats.”"
        },
        {
          "version": "ESV",
          "text": "But they said, “We cannot until all the flocks are gathered together and the stone is rolled from the mouth of the well; then we water the sheep.”"
        },
        {
          "version": "NKJV",
          "text": "But they said, “We cannot until all the flocks are gathered together, and they have rolled the stone from the well’s mouth; then we water the sheep.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 2:17",
          "text": "And when some shepherds came along and drove them away, Moses rose up to help them and watered their flock."
        },
        {
          "reference": "John 4:6-7",
          "text": "Since Jacob’s well was there, Jesus, weary from His journey, sat down by the well. It was about the sixth hour. / When a Samaritan woman came to draw water, Jesus said to her, “Give Me a drink.”"
        },
        {
          "reference": "John 4:10-14",
          "text": "Jesus answered, “If you knew the gift of God and who is asking you for a drink, you would have asked Him, and He would have given you living water.” / “Sir,” the woman replied, “You have nothing to draw with and the well is deep. Where then will You get this living water? / Are You greater than our father Jacob, who gave us this well and drank from it himself, as did his sons and his livestock?” ..."
        },
        {
          "reference": "John 10:3-4",
          "text": "The gatekeeper opens the gate for him, and the sheep listen for his voice. He calls his own sheep by name and leads them out. / When he has brought out all his own, he goes on ahead of them, and his sheep follow him because they know his voice."
        },
        {
          "reference": "Isaiah 40:11",
          "text": "He tends His flock like a shepherd; He gathers the lambs in His arms and carries them close to His heart. He gently leads the nursing ewes."
        },
        {
          "reference": "Ezekiel 34:13-15",
          "text": "I will bring them out from the peoples, gather them from the countries, and bring them into their own land. I will feed them on the mountains of Israel, in the ravines, and in all the settlements of the land. / I will feed them in good pasture, and the lofty mountains of Israel will be their grazing land. There they will lie down in a good grazing land; they will feed in rich pasture on the mountains of Israel. / I will tend My flock and make them lie down, declares the Lord GOD."
        },
        {
          "reference": "Psalm 23:1-2",
          "text": "A Psalm of David. The LORD is my shepherd; I shall not want. / He makes me lie down in green pastures; He leads me beside quiet waters."
        },
        {
          "reference": "John 21:15-17",
          "text": "When they had finished eating, Jesus asked Simon Peter, “Simon son of John, do you love Me more than these?” “Yes, Lord,” he answered, “You know I love You.” Jesus replied, “Feed My lambs.” / Jesus asked a second time, “Simon son of John, do you love Me?” “Yes, Lord,” he answered, “You know I love You.” Jesus told him, “Shepherd My sheep.” / Jesus asked a third time, “Simon son of John, do you love Me?” Peter was deeply hurt that Jesus had asked him a third time, “Do you love Me?” “Lord, You know all things,” he replied. “You know I love You.” Jesus said to him, “Feed My sheep."
        },
        {
          "reference": "1 Samuel 16:11",
          "text": "And Samuel asked him, “Are these all the sons you have?” “There is still the youngest,” Jesse replied, “but he is tending the sheep.” “Send for him,” Samuel replied. “For we will not sit down to eat until he arrives.”"
        },
        {
          "reference": "1 Peter 5:2-4",
          "text": "Be shepherds of God’s flock that is among you, watching over them not out of compulsion, but willingly, as God would have you; not out of greed, but out of eagerness; / not lording it over those entrusted to you, but being examples to the flock. / And when the Chief Shepherd appears, you will receive the crown of glory that will never fade away."
        },
        {
          "reference": "Jeremiah 31:10",
          "text": "Hear, O nations, the word of the LORD, and proclaim it in distant coastlands: “The One who scattered Israel will gather them and keep them as a shepherd keeps his flock."
        },
        {
          "reference": "Luke 15:4-6",
          "text": "“What man among you, if he has a hundred sheep and loses one of them, does not leave the ninety-nine in the pasture and go after the one that is lost, until he finds it? / And when he finds it, he joyfully puts it on his shoulders, / comes home, and calls together his friends and neighbors to tell them, ‘Rejoice with me, for I have found my lost sheep!’"
        },
        {
          "reference": "Matthew 9:36",
          "text": "When He saw the crowds, He was moved with compassion for them, because they were harassed and helpless, like sheep without a shepherd."
        },
        {
          "reference": "Numbers 27:17",
          "text": "who will go out and come in before them, and who will lead them out and bring them in, so that the congregation of the LORD will not be like sheep without a shepherd.”"
        },
        {
          "reference": "Micah 5:4",
          "text": "He will stand and shepherd His flock in the strength of the LORD, in the majestic name of the LORD His God. And they will dwell securely, for then His greatness will extend to the ends of the earth."
        }
      ]
    },
    {
      "reference": "Genesis 29:9",
      "book": "Genesis",
      "chapter": 29,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "While he was still talking with them, Rachel came with her father’s sheep, for she was a shepherd."
        },
        {
          "version": "NLT",
          "text": "Jacob was still talking with them when Rachel arrived with her father’s flock, for she was a shepherd."
        },
        {
          "version": "ESV",
          "text": "While he was still speaking with them, Rachel came with her father’s sheep, for she was a shepherdess."
        },
        {
          "version": "NKJV",
          "text": "Now while he was still speaking with them, Rachel came with her father’s sheep, for she was a shepherdess."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:15-20",
          "text": "Before the servant had finished praying, Rebekah came out with her jar on her shoulder. She was the daughter of Bethuel son of Milcah, the wife of Abraham’s brother Nahor. / Now the girl was very beautiful, a virgin who had not had relations with any man. She went down to the spring, filled her jar, and came up again. / So the servant ran to meet her and said, “Please let me have a little water from your jar.” ..."
        },
        {
          "reference": "Exodus 2:16-21",
          "text": "Now the priest of Midian had seven daughters, and they came to draw water and fill the troughs to water their father’s flock. / And when some shepherds came along and drove them away, Moses rose up to help them and watered their flock. / When the daughters returned to their father Reuel, he asked them, “Why have you returned so early today?” ..."
        },
        {
          "reference": "Ruth 2:5-9",
          "text": "And Boaz asked the foreman of his harvesters, “Whose young woman is this?” / The foreman answered, “She is the Moabitess who returned with Naomi from the land of Moab. / She has said, ‘Please let me glean and gather among the sheaves after the harvesters.’ So she came out and has continued from morning until now, except that she rested a short time in the shelter.” ..."
        },
        {
          "reference": "John 4:7-14",
          "text": "When a Samaritan woman came to draw water, Jesus said to her, “Give Me a drink.” / (His disciples had gone into the town to buy food.) / “You are a Jew,” said the woman. “How can You ask for a drink from me, a Samaritan woman?” (For Jews do not associate with Samaritans.) ..."
        },
        {
          "reference": "Genesis 24:43-46",
          "text": "Here I am, standing beside this spring. Now if a maiden comes out to draw water and I say to her, ‘Please let me drink a little water from your jar,’ / and she replies, ‘Drink, and I will draw water for your camels as well,’ may she be the woman the LORD has appointed for my master’s son. / And before I had finished praying in my heart, there was Rebekah coming out with her jar on her shoulder, and she went down to the spring and drew water. So I said to her, ‘Please give me a drink.’ ..."
        },
        {
          "reference": "1 Samuel 9:11-13",
          "text": "And as they were climbing the hill to the city, they met some young women coming out to draw water and asked, “Is the seer here?” / “Yes, he is ahead of you,” they answered. “Hurry now, for today he has come to the city because the people have a sacrifice on the high place. / As soon as you enter the city, you will find him before he goes up to the high place to eat. The people will not eat until he comes, because he must bless the sacrifice; after that, the guests will eat. Go up at once; you will find him.”"
        },
        {
          "reference": "Genesis 30:25-30",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” ..."
        },
        {
          "reference": "Genesis 24:11-14",
          "text": "As evening approached, he made the camels kneel down near the well outside the town at the time when the women went out to draw water. / “O LORD, God of my master Abraham,” he prayed, “please grant me success today, and show kindness to my master Abraham. / Here I am, standing beside the spring, and the daughters of the townspeople are coming out to draw water. ..."
        },
        {
          "reference": "Genesis 33:13-14",
          "text": "But Jacob replied, “My lord knows that the children are frail, and I must care for sheep and cattle that are nursing their young. If they are driven hard for even a day, all the animals will die. / Please let my lord go ahead of his servant. I will continue on slowly, at a comfortable pace for the livestock and children, until I come to my lord at Seir.”"
        },
        {
          "reference": "Genesis 24:62-67",
          "text": "Now Isaac had just returned from Beer-lahai-roi, for he was living in the Negev. / Early in the evening, Isaac went out to the field to meditate, and looking up, he saw the camels approaching. / And when Rebekah looked up and saw Isaac, she got down from her camel ..."
        },
        {
          "reference": "Genesis 28:1-5",
          "text": "So Isaac called for Jacob and blessed him. “Do not take a wife from the Canaanite women,” he commanded. / “Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother. / May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples. ..."
        },
        {
          "reference": "Genesis 26:12-14",
          "text": "Now Isaac sowed seed in the land, and that very year he reaped a hundredfold. And the LORD blessed him, / and he became richer and richer, until he was exceedingly wealthy. / He owned so many flocks and herds and servants that the Philistines envied him."
        },
        {
          "reference": "Genesis 31:4-13",
          "text": "So Jacob sent word and called Rachel and Leah to the field where his flocks were, / and he told them, “I can see from your father’s countenance that his attitude toward me has changed; but the God of my father has been with me. / You know that I have served your father with all my strength. ..."
        },
        {
          "reference": "Genesis 24:1-4",
          "text": "By now Abraham was old and well along in years, and the LORD had blessed him in every way. / So Abraham instructed the chief servant of his household, who managed all he owned, “Place your hand under my thigh, / and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling, ..."
        },
        {
          "reference": "Genesis 30:1-3",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?” / Then she said, “Here is my maidservant Bilhah. Sleep with her, that she may bear children for me, so that through her I too can build a family.”"
        }
      ]
    },
    {
      "reference": "Genesis 29:10",
      "book": "Genesis",
      "chapter": 29,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "When Jacob saw Rachel daughter of his uncle Laban, and Laban’s sheep, he went over and rolled the stone away from the mouth of the well and watered his uncle’s sheep."
        },
        {
          "version": "NLT",
          "text": "And because Rachel was his cousin—the daughter of Laban, his mother’s brother—and because the sheep and goats belonged to his uncle Laban, Jacob went over to the well and moved the stone from its mouth and watered his uncle’s flock."
        },
        {
          "version": "ESV",
          "text": "Now as soon as Jacob saw Rachel the daughter of Laban his mother’s brother, and the sheep of Laban his mother’s brother, Jacob came near and rolled the stone from the well’s mouth and watered the flock of Laban his mother’s brother."
        },
        {
          "version": "NKJV",
          "text": "And it came to pass, when Jacob saw Rachel the daughter of Laban his mother’s brother, and the sheep of Laban his mother’s brother, that Jacob went near and rolled the stone from the well’s mouth, and watered the flock of Laban his mother’s brother."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:10-20",
          "text": "Then the servant took ten of his master’s camels and departed with all manner of good things from his master in hand. And he set out for Nahor’s hometown in Aram-naharaim. / As evening approached, he made the camels kneel down near the well outside the town at the time when the women went out to draw water. / “O LORD, God of my master Abraham,” he prayed, “please grant me success today, and show kindness to my master Abraham. ..."
        },
        {
          "reference": "Exodus 2:16-21",
          "text": "Now the priest of Midian had seven daughters, and they came to draw water and fill the troughs to water their father’s flock. / And when some shepherds came along and drove them away, Moses rose up to help them and watered their flock. / When the daughters returned to their father Reuel, he asked them, “Why have you returned so early today?” ..."
        },
        {
          "reference": "Genesis 24:29-31",
          "text": "Now Rebekah had a brother named Laban, and he rushed out to the man at the spring. / As soon as he saw the ring, and the bracelets on his sister’s wrists, and heard Rebekah’s words, “The man said this to me,” he went and found the man standing by the camels near the spring. / “Come, you who are blessed by the LORD,” said Laban. “Why are you standing out here? I have prepared the house and a place for the camels.”"
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:11",
          "text": "As evening approached, he made the camels kneel down near the well outside the town at the time when the women went out to draw water."
        },
        {
          "reference": "Genesis 30:25-30",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” ..."
        },
        {
          "reference": "Genesis 33:13-14",
          "text": "But Jacob replied, “My lord knows that the children are frail, and I must care for sheep and cattle that are nursing their young. If they are driven hard for even a day, all the animals will die. / Please let my lord go ahead of his servant. I will continue on slowly, at a comfortable pace for the livestock and children, until I come to my lord at Seir.”"
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 31:17-18",
          "text": "Then Jacob got up and put his children and his wives on camels, / and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Genesis 12:5",
          "text": "And Abram took his wife Sarai, his nephew Lot, and all the possessions and people they had acquired in Haran, and set out for the land of Canaan. When they came to the land of Canaan,"
        },
        {
          "reference": "Genesis 46:31-34",
          "text": "Joseph said to his brothers and to his father’s household, “I will go up and inform Pharaoh: ‘My brothers and my father’s household from the land of Canaan have come to me. / The men are shepherds; they raise livestock, and they have brought their flocks and herds and all that they own.’ / When Pharaoh summons you and asks, ‘What is your occupation?’ ..."
        },
        {
          "reference": "Genesis 48:7",
          "text": "Now as for me, when I was returning from Paddan, to my sorrow Rachel died along the way in the land of Canaan, some distance from Ephrath. So I buried her there beside the road to Ephrath” (that is, Bethlehem)."
        },
        {
          "reference": "John 4:6-7",
          "text": "Since Jacob’s well was there, Jesus, weary from His journey, sat down by the well. It was about the sixth hour. / When a Samaritan woman came to draw water, Jesus said to her, “Give Me a drink.”"
        },
        {
          "reference": "John 4:16-18",
          "text": "Jesus told her, “Go, call your husband and come back.” / “I have no husband,” the woman replied. Jesus said to her, “You are correct to say that you have no husband. / In fact, you have had five husbands, and the man you now have is not your husband. You have spoken truthfully.”"
        }
      ]
    },
    {
      "reference": "Genesis 29:11",
      "book": "Genesis",
      "chapter": 29,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob kissed Rachel and began to weep aloud."
        },
        {
          "version": "NLT",
          "text": "Then Jacob kissed Rachel, and he wept aloud."
        },
        {
          "version": "ESV",
          "text": "Then Jacob kissed Rachel and wept aloud."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob kissed Rachel, and lifted up his voice and wept."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 33:4",
          "text": "Esau, however, ran to him and embraced him, threw his arms around his neck, and kissed him. And they both wept."
        },
        {
          "reference": "Exodus 2:16-17",
          "text": "Now the priest of Midian had seven daughters, and they came to draw water and fill the troughs to water their father’s flock. / And when some shepherds came along and drove them away, Moses rose up to help them and watered their flock."
        },
        {
          "reference": "Ruth 1:9",
          "text": "May the LORD enable each of you to find rest in the home of your new husband.” And she kissed them as they wept aloud"
        },
        {
          "reference": "Ruth 1:14",
          "text": "Again they wept aloud, and Orpah kissed her mother-in-law goodbye, but Ruth clung to her."
        },
        {
          "reference": "1 Samuel 20:41",
          "text": "When the young man had gone, David got up from the south side of the stone, fell facedown, and bowed three times. Then he and Jonathan kissed each other and wept together—though David wept more."
        },
        {
          "reference": "2 Samuel 14:33",
          "text": "So Joab went and told the king, and David summoned Absalom, who came to him and bowed facedown before him. Then the king kissed Absalom."
        },
        {
          "reference": "2 Kings 4:27",
          "text": "When she reached the man of God at the mountain, she clung to his feet. Gehazi came over to push her away, but the man of God said, “Leave her alone, for her soul is in deep distress, and the LORD has hidden it from me and has not told me.”"
        },
        {
          "reference": "Song of Solomon 1:2",
          "text": "Let him kiss me with the kisses of his mouth! For your love is more delightful than wine."
        },
        {
          "reference": "Isaiah 49:15",
          "text": "“Can a woman forget her nursing child, or lack compassion for the son of her womb? Even if she could forget, I will not forget you!"
        },
        {
          "reference": "Jeremiah 31:9",
          "text": "They will come with weeping, and by their supplication I will lead them; I will make them walk beside streams of waters, on a level path where they will not stumble. For I am Israel’s Father, and Ephraim is My firstborn.”"
        },
        {
          "reference": "Luke 7:38",
          "text": "As she stood behind Him at His feet weeping, she began to wet His feet with her tears and wipe them with her hair. Then she kissed His feet and anointed them with the perfume."
        },
        {
          "reference": "Luke 15:20",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him."
        },
        {
          "reference": "John 11:35",
          "text": "Jesus wept."
        },
        {
          "reference": "Acts 20:37",
          "text": "They all wept openly as they embraced Paul and kissed him."
        }
      ]
    },
    {
      "reference": "Genesis 29:12",
      "book": "Genesis",
      "chapter": 29,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "He had told Rachel that he was a relative of her father and a son of Rebekah. So she ran and told her father."
        },
        {
          "version": "NLT",
          "text": "He explained to Rachel that he was her cousin on her father’s side—the son of her aunt Rebekah. So Rachel quickly ran and told her father, Laban."
        },
        {
          "version": "ESV",
          "text": "And Jacob told Rachel that he was her father’s kinsman, and that he was Rebekah’s son, and she ran and told her father."
        },
        {
          "version": "NKJV",
          "text": "And Jacob told Rachel that he was her father’s relative and that he was Rebekah’s son. So she ran and told her father."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:24-28",
          "text": "She replied, “I am the daughter of Bethuel, the son that Milcah bore to Nahor.” / Then she added, “We have plenty of straw and feed, as well as a place for you to spend the night.” / Then the man bowed down and worshiped the LORD, ..."
        },
        {
          "reference": "Genesis 24:10-15",
          "text": "Then the servant took ten of his master’s camels and departed with all manner of good things from his master in hand. And he set out for Nahor’s hometown in Aram-naharaim. / As evening approached, he made the camels kneel down near the well outside the town at the time when the women went out to draw water. / “O LORD, God of my master Abraham,” he prayed, “please grant me success today, and show kindness to my master Abraham. ..."
        },
        {
          "reference": "Genesis 24:34-38",
          "text": "“I am Abraham’s servant,” he replied. / “The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys. / My master’s wife Sarah has borne him a son in her old age, and my master has given him everything he owns. ..."
        },
        {
          "reference": "Genesis 24:50-51",
          "text": "Laban and Bethuel answered, “This is from the LORD; we have no choice in the matter. / Rebekah is here before you. Take her and go, and let her become the wife of your master’s son, just as the LORD has decreed.”"
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 30:25-28",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” ..."
        },
        {
          "reference": "Genesis 31:3-5",
          "text": "Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.” / So Jacob sent word and called Rachel and Leah to the field where his flocks were, / and he told them, “I can see from your father’s countenance that his attitude toward me has changed; but the God of my father has been with me."
        },
        {
          "reference": "Genesis 31:13",
          "text": "I am the God of Bethel, where you anointed the pillar and made a solemn vow to Me. Now get up, leave this land at once, and return to your native land.’”"
        },
        {
          "reference": "Genesis 31:55",
          "text": "Early the next morning, Laban got up and kissed his grandchildren and daughters and blessed them. Then he left to return home."
        },
        {
          "reference": "Genesis 24:4",
          "text": "but will go to my country and my kindred to take a wife for my son Isaac.”"
        },
        {
          "reference": "Genesis 25:20",
          "text": "and Isaac was forty years old when he married Rebekah, the daughter of Bethuel the Aramean from Paddan-aram and the sister of Laban the Aramean."
        },
        {
          "reference": "Genesis 27:43",
          "text": "So now, my son, obey my voice and flee at once to my brother Laban in Haran."
        },
        {
          "reference": "Genesis 28:5",
          "text": "So Isaac sent Jacob to Paddan-aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau."
        },
        {
          "reference": "Genesis 35:9-12",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him. / And God said to him, “Though your name is Jacob, you will no longer be called Jacob. Instead, your name will be Israel.” So God named him Israel. / And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. ..."
        }
      ]
    },
    {
      "reference": "Genesis 29:13",
      "book": "Genesis",
      "chapter": 29,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "As soon as Laban heard the news about Jacob, his sister’s son, he hurried to meet him. He embraced him and kissed him and brought him to his home, and there Jacob told him all these things."
        },
        {
          "version": "NLT",
          "text": "As soon as Laban heard that his nephew Jacob had arrived, he ran out to meet him. He embraced and kissed him and brought him home. When Jacob had told him his story,"
        },
        {
          "version": "ESV",
          "text": "As soon as Laban heard the news about Jacob, his sister’s son, he ran to meet him and embraced him and kissed him and brought him to his house. Jacob told Laban all these things,"
        },
        {
          "version": "NKJV",
          "text": "Then it came to pass, when Laban heard the report about Jacob his sister’s son, that he ran to meet him, and embraced him and kissed him, and brought him to his house. So he told Laban all these things."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:29-31",
          "text": "Now Rebekah had a brother named Laban, and he rushed out to the man at the spring. / As soon as he saw the ring, and the bracelets on his sister’s wrists, and heard Rebekah’s words, “The man said this to me,” he went and found the man standing by the camels near the spring. / “Come, you who are blessed by the LORD,” said Laban. “Why are you standing out here? I have prepared the house and a place for the camels.”"
        },
        {
          "reference": "Genesis 33:4",
          "text": "Esau, however, ran to him and embraced him, threw his arms around his neck, and kissed him. And they both wept."
        },
        {
          "reference": "Exodus 18:7",
          "text": "So Moses went out to meet his father-in-law and bowed down and kissed him. They greeted each other and went into the tent."
        },
        {
          "reference": "Luke 15:20",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him."
        },
        {
          "reference": "Acts 10:25-26",
          "text": "As Peter was about to enter, Cornelius met him and fell at his feet to worship him. / But Peter helped him up. “Stand up,” he said, “I am only a man myself.”"
        },
        {
          "reference": "2 Kings 4:29",
          "text": "So Elisha said to Gehazi, “Tie up your garment, take my staff in your hand, and go! If you meet anyone, do not greet him, and if anyone greets you, do not answer him. Then lay my staff on the boy’s face.”"
        },
        {
          "reference": "1 Samuel 20:41",
          "text": "When the young man had gone, David got up from the south side of the stone, fell facedown, and bowed three times. Then he and Jonathan kissed each other and wept together—though David wept more."
        },
        {
          "reference": "2 Samuel 19:39",
          "text": "So all the people crossed the Jordan, and then the king crossed over. The king kissed Barzillai and blessed him, and Barzillai returned home."
        },
        {
          "reference": "Ruth 1:9",
          "text": "May the LORD enable each of you to find rest in the home of your new husband.” And she kissed them as they wept aloud"
        },
        {
          "reference": "1 Kings 2:19",
          "text": "So Bathsheba went to King Solomon to speak to him for Adonijah. The king stood up to greet her, bowed to her, and sat down on his throne. Then the king had a throne brought for his mother, who sat down at his right hand."
        },
        {
          "reference": "2 Kings 10:15",
          "text": "When he left there, he found Jehonadab son of Rechab, who was coming to meet him. Jehu greeted him and asked, “Is your heart as true to mine as my heart is to yours?” “It is!” Jehonadab replied. “If it is,” said Jehu, “give me your hand.” So he gave him his hand, and Jehu helped him into his chariot,"
        },
        {
          "reference": "Matthew 26:49",
          "text": "Going directly to Jesus, he said, “Greetings, Rabbi!” and kissed Him."
        },
        {
          "reference": "Romans 16:16",
          "text": "Greet one another with a holy kiss. All the churches of Christ send you greetings."
        },
        {
          "reference": "1 Thessalonians 5:26",
          "text": "Greet all the brothers with a holy kiss."
        },
        {
          "reference": "2 Corinthians 13:12",
          "text": "Greet one another with a holy kiss."
        }
      ]
    },
    {
      "reference": "Genesis 29:14",
      "book": "Genesis",
      "chapter": 29,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Laban said to him, “You are my own flesh and blood.” After Jacob had stayed with him for a whole month,"
        },
        {
          "version": "NLT",
          "text": "Laban exclaimed, “You really are my own flesh and blood!” After Jacob had stayed with Laban for about a month,"
        },
        {
          "version": "ESV",
          "text": "and Laban said to him, “Surely you are my bone and my flesh!” And he stayed with him a month."
        },
        {
          "version": "NKJV",
          "text": "And Laban said to him, “Surely you are my bone and my flesh.” And he stayed with him for a month."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 9:2",
          "text": "“Please ask all the leaders of Shechem, ‘Is it better for you that seventy men, all the sons of Jerubbaal, rule over you, or just one man?’ Remember that I am your own flesh and blood.”"
        },
        {
          "reference": "2 Samuel 5:1",
          "text": "Then all the tribes of Israel came to David at Hebron and said, “Here we are, your own flesh and blood."
        },
        {
          "reference": "1 Chronicles 11:1",
          "text": "Then all Israel came together to David at Hebron and said, “Here we are, your own flesh and blood."
        },
        {
          "reference": "Genesis 2:23",
          "text": "And the man said: “This is now bone of my bones and flesh of my flesh; she shall be called ‘woman,’ for out of man she was taken.”"
        },
        {
          "reference": "Genesis 13:8",
          "text": "So Abram said to Lot, “Please let there be no contention between you and me, or between your herdsmen and my herdsmen. After all, we are kinsmen."
        },
        {
          "reference": "Genesis 37:27",
          "text": "Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed."
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 45:4",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt!"
        },
        {
          "reference": "Genesis 46:26",
          "text": "All those belonging to Jacob who came to Egypt—his direct descendants, besides the wives of Jacob’s sons—numbered sixty-six persons."
        },
        {
          "reference": "Exodus 2:11",
          "text": "One day, after Moses had grown up, he went out to his own people and observed their hard labor. He saw an Egyptian beating a Hebrew, one of his own people."
        },
        {
          "reference": "Leviticus 25:49",
          "text": "either his uncle or cousin or any close relative from his clan may redeem him. Or if he prospers, he may redeem himself."
        },
        {
          "reference": "Ruth 2:20",
          "text": "Then Naomi said to her daughter-in-law, “May he be blessed by the LORD, who has not withdrawn His kindness from the living or the dead.” Naomi continued, “The man is a close relative. He is one of our kinsman-redeemers.”"
        },
        {
          "reference": "1 Samuel 18:18",
          "text": "And David said to Saul, “Who am I, and what is my family or my father’s clan in Israel, that I should become the son-in-law of the king?”"
        },
        {
          "reference": "2 Samuel 19:12-13",
          "text": "You are my brothers, my own flesh and blood. So why should you be the last to restore the king?’ / And say to Amasa, ‘Aren’t you my flesh and blood? May God punish me, and ever so severely, if from now on you are not the commander of my army in place of Joab!’”"
        },
        {
          "reference": "Job 19:14",
          "text": "My kinsmen have failed me, and my friends have forgotten me."
        }
      ]
    },
    {
      "reference": "Genesis 29:15",
      "book": "Genesis",
      "chapter": 29,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "Laban said to him, “Just because you are a relative of mine, should you work for me for nothing? Tell me what your wages should be.”"
        },
        {
          "version": "NLT",
          "text": "Laban said to him, “You shouldn’t work for me without pay just because we are relatives. Tell me how much your wages should be.”"
        },
        {
          "version": "ESV",
          "text": "Then Laban said to Jacob, “Because you are my kinsman, should you therefore serve me for nothing? Tell me, what shall your wages be?”"
        },
        {
          "version": "NKJV",
          "text": "Then Laban said to Jacob, “Because you are my relative, should you therefore serve me for nothing? Tell me, what should your wages be? ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 30:25-28",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” ..."
        },
        {
          "reference": "Genesis 31:7",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:38-40",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes."
        },
        {
          "reference": "Exodus 2:21",
          "text": "Moses agreed to stay with the man, and he gave his daughter Zipporah to Moses in marriage."
        },
        {
          "reference": "Exodus 21:2",
          "text": "If you buy a Hebrew servant, he is to serve you for six years. But in the seventh year, he shall go free without paying anything."
        },
        {
          "reference": "Leviticus 25:50",
          "text": "He and his purchaser will then count the time from the year he sold himself up to the Year of Jubilee. The price of his sale will be determined by the number of years, based on the daily wages of a hired hand."
        },
        {
          "reference": "Deuteronomy 15:12",
          "text": "If a fellow Hebrew, a man or a woman, is sold to you and serves you six years, then in the seventh year you must set him free."
        },
        {
          "reference": "Judges 17:10",
          "text": "“Stay with me,” Micah said to him, “and be my father and priest, and I will give you ten shekels of silver per year, a suit of clothes, and your provisions.” So the Levite went in"
        },
        {
          "reference": "Ruth 4:5",
          "text": "Then Boaz said, “On the day you buy the land from Naomi and also from Ruth the Moabitess, you must also acquire the widow of the deceased in order to raise up the name of the deceased on his inheritance.”"
        },
        {
          "reference": "1 Samuel 18:17-27",
          "text": "Then Saul said to David, “Here is my older daughter Merab. I will give her to you in marriage. Only be valiant for me and fight the LORD’s battles.” But Saul was thinking, “I need not raise my hand against him; let the hand of the Philistines be against him.” / And David said to Saul, “Who am I, and what is my family or my father’s clan in Israel, that I should become the son-in-law of the king?” / So when it was time to give Saul’s daughter Merab to David, she was given in marriage to Adriel of Meholah. ..."
        },
        {
          "reference": "1 Kings 11:28",
          "text": "Now Jeroboam was a mighty man of valor. So when Solomon noticed that the young man was industrious, he put him in charge of the whole labor force of the house of Joseph."
        },
        {
          "reference": "2 Chronicles 2:10",
          "text": "I will pay your servants, the woodcutters, 20,000 cors of ground wheat, 20,000 cors of barley, 20,000 baths of wine, and 20,000 baths of olive oil.”"
        },
        {
          "reference": "Matthew 20:1-16",
          "text": "“For the kingdom of heaven is like a landowner who went out early in the morning to hire workers for his vineyard. / He agreed to pay them a denarius for the day and sent them into his vineyard. / About the third hour he went out and saw others standing in the marketplace doing nothing. ..."
        },
        {
          "reference": "Luke 15:19",
          "text": "I am no longer worthy to be called your son. Make me like one of your hired servants.”’"
        }
      ]
    },
    {
      "reference": "Genesis 29:16",
      "book": "Genesis",
      "chapter": 29,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Laban had two daughters; the name of the older was Leah, and the name of the younger was Rachel."
        },
        {
          "version": "NLT",
          "text": "Now Laban had two daughters. The older daughter was named Leah, and the younger one was Rachel."
        },
        {
          "version": "ESV",
          "text": "Now Laban had two daughters. The name of the older was Leah, and the name of the younger was Rachel."
        },
        {
          "version": "NKJV",
          "text": "Now Laban had two daughters: the name of the elder was Leah, and the name of the younger was Rachel."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:29-31",
          "text": "Now Rebekah had a brother named Laban, and he rushed out to the man at the spring. / As soon as he saw the ring, and the bracelets on his sister’s wrists, and heard Rebekah’s words, “The man said this to me,” he went and found the man standing by the camels near the spring. / “Come, you who are blessed by the LORD,” said Laban. “Why are you standing out here? I have prepared the house and a place for the camels.”"
        },
        {
          "reference": "Genesis 30:26-28",
          "text": "Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” / And he added, “Name your wages, and I will pay them.”"
        },
        {
          "reference": "Genesis 24:50-51",
          "text": "Laban and Bethuel answered, “This is from the LORD; we have no choice in the matter. / Rebekah is here before you. Take her and go, and let her become the wife of your master’s son, just as the LORD has decreed.”"
        },
        {
          "reference": "Genesis 31:14-16",
          "text": "And Rachel and Leah replied, “Do we have any portion or inheritance left in our father’s house? / Are we not regarded by him as outsiders? Not only has he sold us, but he has certainly squandered what was paid for us. / Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 24:15-16",
          "text": "Before the servant had finished praying, Rebekah came out with her jar on her shoulder. She was the daughter of Bethuel son of Milcah, the wife of Abraham’s brother Nahor. / Now the girl was very beautiful, a virgin who had not had relations with any man. She went down to the spring, filled her jar, and came up again."
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:60",
          "text": "And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.”"
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 24:10",
          "text": "Then the servant took ten of his master’s camels and departed with all manner of good things from his master in hand. And he set out for Nahor’s hometown in Aram-naharaim."
        },
        {
          "reference": "Genesis 25:20",
          "text": "and Isaac was forty years old when he married Rebekah, the daughter of Bethuel the Aramean from Paddan-aram and the sister of Laban the Aramean."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 31:1-3",
          "text": "Now Jacob heard that Laban’s sons were saying, “Jacob has taken away all that belonged to our father and built all this wealth at our father’s expense.” / And Jacob saw from the countenance of Laban that his attitude toward him had changed. / Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 24:3-4",
          "text": "and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling, / but will go to my country and my kindred to take a wife for my son Isaac.”"
        },
        {
          "reference": "Genesis 31:19",
          "text": "Now while Laban was out shearing his sheep, Rachel stole her father’s household idols."
        },
        {
          "reference": "Genesis 24:35",
          "text": "“The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys."
        }
      ]
    },
    {
      "reference": "Genesis 29:17",
      "book": "Genesis",
      "chapter": 29,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Leah had weak eyes, but Rachel had a lovely figure and was beautiful."
        },
        {
          "version": "NLT",
          "text": "There was no sparkle in Leah’s eyes, but Rachel had a beautiful figure and a lovely face."
        },
        {
          "version": "ESV",
          "text": "Leah’s eyes were weak, but Rachel was beautiful in form and appearance."
        },
        {
          "version": "NKJV",
          "text": "Leah’s eyes were delicate, but Rachel was beautiful of form and appearance."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Song of Solomon 4:1",
          "text": "How beautiful you are, my darling—how very beautiful! Your eyes are like doves behind your veil. Your hair is like a flock of goats streaming down Mount Gilead."
        },
        {
          "reference": "Song of Solomon 1:15",
          "text": "How beautiful you are, my darling! Oh, how very beautiful! Your eyes are like doves."
        },
        {
          "reference": "Proverbs 31:30",
          "text": "Charm is deceptive and beauty is fleeting, but a woman who fears the LORD is to be praised."
        },
        {
          "reference": "1 Samuel 16:12",
          "text": "So Jesse sent for his youngest son and brought him in. He was ruddy, with beautiful eyes and a handsome appearance. And the LORD said, “Rise and anoint him, for he is the one.”"
        },
        {
          "reference": "1 Peter 3:3-4",
          "text": "Your beauty should not come from outward adornment, such as braided hair or gold jewelry or fine clothes, / but from the inner disposition of your heart, the unfading beauty of a gentle and quiet spirit, which is precious in God’s sight."
        },
        {
          "reference": "1 Samuel 25:3",
          "text": "His name was Nabal, and his wife’s name was Abigail. She was an intelligent and beautiful woman, but her husband, a Calebite, was harsh and evil in his dealings."
        },
        {
          "reference": "Esther 2:7",
          "text": "And Mordecai had brought up Hadassah (that is, Esther), the daughter of his uncle, because she did not have a father or mother. The young woman was lovely in form and appearance, and when her father and mother had died, Mordecai had taken her as his own daughter."
        },
        {
          "reference": "1 Timothy 2:9-10",
          "text": "Likewise, I want the women to adorn themselves with respectable apparel, with modesty, and with self-control, not with braided hair or gold or pearls or expensive clothes, / but with good deeds, as is proper for women who profess to worship God."
        },
        {
          "reference": "1 Corinthians 11:15",
          "text": "but that if a woman has long hair, it is her glory? For long hair is given to her as a covering."
        },
        {
          "reference": "Isaiah 53:2",
          "text": "He grew up before Him like a tender shoot, and like a root out of dry ground. He had no stately form or majesty to attract us, no beauty that we should desire Him."
        },
        {
          "reference": "1 Samuel 9:2",
          "text": "And he had a son named Saul, choice and handsome, without equal among the Israelites—a head taller than any of the people."
        },
        {
          "reference": "1 Kings 1:3-4",
          "text": "Then they searched throughout Israel for a beautiful girl, and they found Abishag the Shunammite and brought her to the king. / The girl was unsurpassed in beauty; she cared for the king and served him, but he had no relations with her."
        },
        {
          "reference": "1 Peter 3:5-6",
          "text": "For this is how the holy women of the past adorned themselves. They put their hope in God and were submissive to their husbands, / just as Sarah obeyed Abraham and called him lord. And you are her children if you do what is right and refuse to give way to fear."
        },
        {
          "reference": "2 Samuel 14:25",
          "text": "Now there was not a man in all Israel as handsome and highly praised as Absalom. From the sole of his foot to the top of his head, he did not have a single flaw."
        },
        {
          "reference": "1 Corinthians 7:36",
          "text": "However, if someone thinks he is acting inappropriately toward his betrothed, and if she is beyond her youth and they ought to marry, let him do as he wishes; he is not sinning; they should get married."
        }
      ]
    },
    {
      "reference": "Genesis 29:18",
      "book": "Genesis",
      "chapter": 29,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob was in love with Rachel and said, “I’ll work for you seven years in return for your younger daughter Rachel.”"
        },
        {
          "version": "NLT",
          "text": "Since Jacob was in love with Rachel, he told her father, “I’ll work for you for seven years if you’ll give me Rachel, your younger daughter, as my wife.”"
        },
        {
          "version": "ESV",
          "text": "Jacob loved Rachel. And he said, “I will serve you seven years for your younger daughter Rachel.”"
        },
        {
          "version": "NKJV",
          "text": "Now Jacob loved Rachel; so he said, “I will serve you seven years for Rachel your younger daughter.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 30:26",
          "text": "Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.”"
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Exodus 21:2-4",
          "text": "If you buy a Hebrew servant, he is to serve you for six years. But in the seventh year, he shall go free without paying anything. / If he arrived alone, he is to leave alone; if he arrived with a wife, she is to leave with him. / If his master gives him a wife and she bears him sons or daughters, the woman and her children shall belong to her master, and only the man shall go free."
        },
        {
          "reference": "Hosea 12:12",
          "text": "Jacob fled to the land of Aram and Israel worked for a wife—for a wife he tended sheep."
        },
        {
          "reference": "Ruth 4:10",
          "text": "Moreover, I have acquired Ruth the Moabitess, Mahlon’s widow, as my wife, to raise up the name of the deceased through his inheritance, so that his name will not disappear from among his brothers or from the gate of his home. You are witnesses today.”"
        },
        {
          "reference": "1 Samuel 18:25-27",
          "text": "Saul replied, “Say to David, ‘The king desires no other dowry but a hundred Philistine foreskins as revenge on his enemies.’” But Saul intended to cause David’s death at the hands of the Philistines. / When the servants reported these terms to David, he was pleased to become the king’s son-in-law. Before the wedding day arrived, / David and his men went out and killed two hundred Philistines. He brought their foreskins and presented them as payment in full to become the king’s son-in-law. Then Saul gave his daughter Michal to David in marriage."
        },
        {
          "reference": "Judges 14:12-14",
          "text": "“Let me tell you a riddle,” Samson said to them. “If you can solve it for me within the seven days of the feast, I will give you thirty linen garments and thirty sets of clothes. / But if you cannot solve it, you must give me thirty linen garments and thirty sets of clothes.” “Tell us your riddle,” they replied. “Let us hear it.” / So he said to them: “Out of the eater came something to eat, and out of the strong came something sweet.” For three days they were unable to explain the riddle."
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Proverbs 18:22",
          "text": "He who finds a wife finds a good thing and obtains favor from the LORD."
        },
        {
          "reference": "Proverbs 31:10",
          "text": "A wife of noble character, who can find? She is far more precious than rubies."
        },
        {
          "reference": "Song of Solomon 8:7",
          "text": "Mighty waters cannot quench love; rivers cannot sweep it away. If a man were to give all the wealth of his house for love, his offer would be utterly scorned."
        },
        {
          "reference": "Matthew 13:44-46",
          "text": "The kingdom of heaven is like treasure hidden in a field. When a man found it, he hid it again, and in his joy he went and sold all he had and bought that field. / Again, the kingdom of heaven is like a merchant in search of fine pearls. / When he found one very precious pearl, he went away and sold all he had and bought it."
        },
        {
          "reference": "Matthew 20:1-16",
          "text": "“For the kingdom of heaven is like a landowner who went out early in the morning to hire workers for his vineyard. / He agreed to pay them a denarius for the day and sent them into his vineyard. / About the third hour he went out and saw others standing in the marketplace doing nothing. ..."
        },
        {
          "reference": "Luke 15:25-32",
          "text": "Meanwhile the older son was in the field, and as he approached the house, he heard music and dancing. / So he called one of the servants and asked what was going on. / ‘Your brother has returned,’ he said, ‘and your father has killed the fattened calf, because he has him back safe and sound.’ ..."
        }
      ]
    },
    {
      "reference": "Genesis 29:19",
      "book": "Genesis",
      "chapter": 29,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "Laban said, “It’s better that I give her to you than to some other man. Stay here with me.”"
        },
        {
          "version": "NLT",
          "text": "“Agreed!” Laban replied. “I’d rather give her to you than to anyone else. Stay and work with me.”"
        },
        {
          "version": "ESV",
          "text": "Laban said, “It is better that I give her to you than that I should give her to any other man; stay with me.”"
        },
        {
          "version": "NKJV",
          "text": "And Laban said, “ It is better that I give her to you than that I should give her to another man. Stay with me.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:51",
          "text": "Rebekah is here before you. Take her and go, and let her become the wife of your master’s son, just as the LORD has decreed.”"
        },
        {
          "reference": "Genesis 24:58-60",
          "text": "They called Rebekah and asked her, “Will you go with this man?” “I will go,” she replied. / So they sent their sister Rebekah on her way, along with her nurse and Abraham’s servant and his men. / And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.”"
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 31:15",
          "text": "Are we not regarded by him as outsiders? Not only has he sold us, but he has certainly squandered what was paid for us."
        },
        {
          "reference": "Genesis 2:24",
          "text": "For this reason a man will leave his father and mother and be united to his wife, and they will become one flesh."
        },
        {
          "reference": "Genesis 34:12",
          "text": "Demand a high dowry and an expensive gift, and I will give you whatever you ask. Only give me the girl as my wife!”"
        },
        {
          "reference": "Exodus 2:21",
          "text": "Moses agreed to stay with the man, and he gave his daughter Zipporah to Moses in marriage."
        },
        {
          "reference": "Ruth 4:10",
          "text": "Moreover, I have acquired Ruth the Moabitess, Mahlon’s widow, as my wife, to raise up the name of the deceased through his inheritance, so that his name will not disappear from among his brothers or from the gate of his home. You are witnesses today.”"
        },
        {
          "reference": "1 Samuel 18:17",
          "text": "Then Saul said to David, “Here is my older daughter Merab. I will give her to you in marriage. Only be valiant for me and fight the LORD’s battles.” But Saul was thinking, “I need not raise my hand against him; let the hand of the Philistines be against him.”"
        },
        {
          "reference": "1 Samuel 18:27",
          "text": "David and his men went out and killed two hundred Philistines. He brought their foreskins and presented them as payment in full to become the king’s son-in-law. Then Saul gave his daughter Michal to David in marriage."
        },
        {
          "reference": "1 Samuel 25:40-41",
          "text": "When his servants came to Abigail at Carmel, they said, “David has sent us to take you as his wife.” / She arose, bowed facedown, and said, “Here is your servant, ready to serve and to wash the feet of my lord’s servants.”"
        },
        {
          "reference": "2 Samuel 3:14",
          "text": "Then David sent messengers to say to Ish-bosheth son of Saul, “Give me back my wife, Michal, whom I betrothed to myself for a hundred Philistine foreskins.”"
        },
        {
          "reference": "Matthew 1:18-20",
          "text": "This is how the birth of Jesus Christ came about: His mother Mary was pledged in marriage to Joseph, but before they came together, she was found to be with child through the Holy Spirit. / Because Joseph her husband was a righteous man and was unwilling to disgrace her publicly, he resolved to divorce her quietly. / But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit."
        },
        {
          "reference": "Matthew 22:2",
          "text": "“The kingdom of heaven is like a king who prepared a wedding banquet for his son."
        }
      ]
    },
    {
      "reference": "Genesis 29:20",
      "book": "Genesis",
      "chapter": 29,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "So Jacob served seven years to get Rachel, but they seemed like only a few days to him because of his love for her."
        },
        {
          "version": "NLT",
          "text": "So Jacob worked seven years to pay for Rachel. But his love for her was so strong that it seemed to him but a few days."
        },
        {
          "version": "ESV",
          "text": "So Jacob served seven years for Rachel, and they seemed to him but a few days because of the love he had for her."
        },
        {
          "version": "NKJV",
          "text": "So Jacob served seven years for Rachel, and they seemed only a few days to him because of the love he had for her."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hosea 12:12",
          "text": "Jacob fled to the land of Aram and Israel worked for a wife—for a wife he tended sheep."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 30:26",
          "text": "Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.”"
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Exodus 21:2",
          "text": "If you buy a Hebrew servant, he is to serve you for six years. But in the seventh year, he shall go free without paying anything."
        },
        {
          "reference": "Judges 14:12",
          "text": "“Let me tell you a riddle,” Samson said to them. “If you can solve it for me within the seven days of the feast, I will give you thirty linen garments and thirty sets of clothes."
        },
        {
          "reference": "1 Samuel 18:25-27",
          "text": "Saul replied, “Say to David, ‘The king desires no other dowry but a hundred Philistine foreskins as revenge on his enemies.’” But Saul intended to cause David’s death at the hands of the Philistines. / When the servants reported these terms to David, he was pleased to become the king’s son-in-law. Before the wedding day arrived, / David and his men went out and killed two hundred Philistines. He brought their foreskins and presented them as payment in full to become the king’s son-in-law. Then Saul gave his daughter Michal to David in marriage."
        },
        {
          "reference": "1 Samuel 18:17",
          "text": "Then Saul said to David, “Here is my older daughter Merab. I will give her to you in marriage. Only be valiant for me and fight the LORD’s battles.” But Saul was thinking, “I need not raise my hand against him; let the hand of the Philistines be against him.”"
        },
        {
          "reference": "Ruth 4:11",
          "text": "“We are witnesses,” said the elders and all the people at the gate. “May the LORD make the woman entering your home like Rachel and Leah, who together built up the house of Israel. May you be prosperous in Ephrathah and famous in Bethlehem."
        },
        {
          "reference": "Song of Solomon 8:7",
          "text": "Mighty waters cannot quench love; rivers cannot sweep it away. If a man were to give all the wealth of his house for love, his offer would be utterly scorned."
        },
        {
          "reference": "Song of Solomon 8:6",
          "text": "Set me as a seal over your heart, as a seal upon your arm. For love is as strong as death, its jealousy as unrelenting as Sheol. Its sparks are fiery flames, the fiercest blaze of all."
        },
        {
          "reference": "Proverbs 31:10",
          "text": "A wife of noble character, who can find? She is far more precious than rubies."
        },
        {
          "reference": "Matthew 13:44",
          "text": "The kingdom of heaven is like treasure hidden in a field. When a man found it, he hid it again, and in his joy he went and sold all he had and bought that field."
        },
        {
          "reference": "Matthew 20:1-16",
          "text": "“For the kingdom of heaven is like a landowner who went out early in the morning to hire workers for his vineyard. / He agreed to pay them a denarius for the day and sent them into his vineyard. / About the third hour he went out and saw others standing in the marketplace doing nothing. ..."
        },
        {
          "reference": "Luke 15:25-32",
          "text": "Meanwhile the older son was in the field, and as he approached the house, he heard music and dancing. / So he called one of the servants and asked what was going on. / ‘Your brother has returned,’ he said, ‘and your father has killed the fattened calf, because he has him back safe and sound.’ ..."
        }
      ]
    },
    {
      "reference": "Genesis 29:21",
      "book": "Genesis",
      "chapter": 29,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob said to Laban, “Give me my wife. My time is completed, and I want to make love to her.”"
        },
        {
          "version": "NLT",
          "text": "Finally, the time came for him to marry her. “I have fulfilled my agreement,” Jacob said to Laban. “Now give me my wife so I can sleep with her.”"
        },
        {
          "version": "ESV",
          "text": "Then Jacob said to Laban, “Give me my wife that I may go in to her, for my time is completed.”"
        },
        {
          "version": "NKJV",
          "text": "Then Jacob said to Laban, “Give me my wife, for my days are fulfilled, that I may go in to her.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 30:3-4",
          "text": "Then she said, “Here is my maidservant Bilhah. Sleep with her, that she may bear children for me, so that through her I too can build a family.” / So Rachel gave Jacob her servant Bilhah as a wife, and he slept with her,"
        },
        {
          "reference": "Genesis 16:2",
          "text": "So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 38:8",
          "text": "Then Judah said to Onan, “Sleep with your brother’s wife. Perform your duty as her brother-in-law and raise up offspring for your brother.”"
        },
        {
          "reference": "Exodus 21:10",
          "text": "If he takes another wife, he must not reduce the food, clothing, or marital rights of his first wife."
        },
        {
          "reference": "Deuteronomy 25:5",
          "text": "When brothers dwell together and one of them dies without a son, the widow must not marry outside the family. Her husband’s brother is to take her as his wife and fulfill the duty of a brother-in-law for her."
        },
        {
          "reference": "Judges 14:10",
          "text": "Then his father went to visit the woman, and Samson prepared a feast there, as was customary for the bridegroom."
        },
        {
          "reference": "Ruth 4:13",
          "text": "So Boaz took Ruth, and she became his wife. And when he had relations with her, the LORD enabled her to conceive, and she gave birth to a son."
        },
        {
          "reference": "1 Samuel 18:27",
          "text": "David and his men went out and killed two hundred Philistines. He brought their foreskins and presented them as payment in full to become the king’s son-in-law. Then Saul gave his daughter Michal to David in marriage."
        },
        {
          "reference": "2 Samuel 11:27",
          "text": "And when the time of mourning was over, David had her brought to his house, and she became his wife and bore him a son. But the thing that David had done was evil in the sight of the LORD."
        },
        {
          "reference": "1 Kings 11:3",
          "text": "He had seven hundred wives of royal birth and three hundred concubines—and his wives turned his heart away."
        },
        {
          "reference": "Matthew 1:24",
          "text": "When Joseph woke up, he did as the angel of the Lord had commanded him and embraced Mary as his wife."
        },
        {
          "reference": "Matthew 22:2",
          "text": "“The kingdom of heaven is like a king who prepared a wedding banquet for his son."
        },
        {
          "reference": "Matthew 25:1",
          "text": "“At that time the kingdom of heaven will be like ten virgins who took their lamps and went out to meet the bridegroom."
        },
        {
          "reference": "John 2:1-2",
          "text": "On the third day a wedding took place at Cana in Galilee. Jesus’ mother was there, / and Jesus and His disciples had also been invited to the wedding."
        }
      ]
    },
    {
      "reference": "Genesis 29:22",
      "book": "Genesis",
      "chapter": 29,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "So Laban brought together all the people of the place and gave a feast."
        },
        {
          "version": "NLT",
          "text": "So Laban invited everyone in the neighborhood and prepared a wedding feast."
        },
        {
          "version": "ESV",
          "text": "So Laban gathered together all the people of the place and made a feast."
        },
        {
          "version": "NKJV",
          "text": "And Laban gathered together all the men of the place and made a feast."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:53",
          "text": "Then he brought out jewels of silver and gold, and articles of clothing, and he gave them to Rebekah. He also gave precious gifts to her brother and her mother."
        },
        {
          "reference": "Genesis 24:59-60",
          "text": "So they sent their sister Rebekah on her way, along with her nurse and Abraham’s servant and his men. / And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.”"
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 31:22-23",
          "text": "On the third day Laban was informed that Jacob had fled. / So he took his relatives with him, pursued Jacob for seven days, and overtook him in the hill country of Gilead."
        },
        {
          "reference": "Genesis 24:29-31",
          "text": "Now Rebekah had a brother named Laban, and he rushed out to the man at the spring. / As soon as he saw the ring, and the bracelets on his sister’s wrists, and heard Rebekah’s words, “The man said this to me,” he went and found the man standing by the camels near the spring. / “Come, you who are blessed by the LORD,” said Laban. “Why are you standing out here? I have prepared the house and a place for the camels.”"
        },
        {
          "reference": "Genesis 24:50-51",
          "text": "Laban and Bethuel answered, “This is from the LORD; we have no choice in the matter. / Rebekah is here before you. Take her and go, and let her become the wife of your master’s son, just as the LORD has decreed.”"
        },
        {
          "reference": "Genesis 31:54",
          "text": "Then Jacob offered a sacrifice on the mountain and invited his relatives to eat a meal. And after they had eaten, they spent the night on the mountain."
        },
        {
          "reference": "Genesis 24:33",
          "text": "Then a meal was set before the man, but he said, “I will not eat until I have told you what I came to say.” So Laban said, “Please speak.”"
        },
        {
          "reference": "Genesis 24:54",
          "text": "Then he and the men with him ate and drank and spent the night there. When they got up the next morning, he said, “Send me on my way to my master.”"
        },
        {
          "reference": "Judges 14:10",
          "text": "Then his father went to visit the woman, and Samson prepared a feast there, as was customary for the bridegroom."
        },
        {
          "reference": "Ruth 4:10-11",
          "text": "Moreover, I have acquired Ruth the Moabitess, Mahlon’s widow, as my wife, to raise up the name of the deceased through his inheritance, so that his name will not disappear from among his brothers or from the gate of his home. You are witnesses today.” / “We are witnesses,” said the elders and all the people at the gate. “May the LORD make the woman entering your home like Rachel and Leah, who together built up the house of Israel. May you be prosperous in Ephrathah and famous in Bethlehem."
        },
        {
          "reference": "1 Samuel 25:42",
          "text": "So Abigail hurried and got on a donkey, and attended by five of her maidens, she followed David’s messengers and became his wife."
        },
        {
          "reference": "Matthew 22:2",
          "text": "“The kingdom of heaven is like a king who prepared a wedding banquet for his son."
        },
        {
          "reference": "John 2:1-2",
          "text": "On the third day a wedding took place at Cana in Galilee. Jesus’ mother was there, / and Jesus and His disciples had also been invited to the wedding."
        }
      ]
    },
    {
      "reference": "Genesis 29:23",
      "book": "Genesis",
      "chapter": 29,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "But when evening came, he took his daughter Leah and brought her to Jacob, and Jacob made love to her."
        },
        {
          "version": "NLT",
          "text": "But that night, when it was dark, Laban took Leah to Jacob, and he slept with her."
        },
        {
          "version": "ESV",
          "text": "But in the evening he took his daughter Leah and brought her to Jacob, and he went in to her."
        },
        {
          "version": "NKJV",
          "text": "Now it came to pass in the evening, that he took Leah his daughter and brought her to Jacob; and he went in to her."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:35-36",
          "text": "But Isaac replied, “Your brother came deceitfully and took your blessing.” / So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 24:65",
          "text": "and asked the servant, “Who is that man in the field coming to meet us?” “It is my master,” the servant answered. So she took her veil and covered herself."
        },
        {
          "reference": "Genesis 38:14-25",
          "text": "she removed her widow’s garments, covered her face with a veil to disguise herself, and sat at the entrance to Enaim, which is on the way to Timnah. For she saw that although Shelah had grown up, she had not been given to him as a wife. / When Judah saw her, he thought she was a prostitute because she had covered her face. / Not realizing that she was his daughter-in-law, he went over to her and said, “Come now, let me sleep with you.” “What will you give me for sleeping with you?” she inquired. ..."
        },
        {
          "reference": "Judges 14:12-20",
          "text": "“Let me tell you a riddle,” Samson said to them. “If you can solve it for me within the seven days of the feast, I will give you thirty linen garments and thirty sets of clothes. / But if you cannot solve it, you must give me thirty linen garments and thirty sets of clothes.” “Tell us your riddle,” they replied. “Let us hear it.” / So he said to them: “Out of the eater came something to eat, and out of the strong came something sweet.” For three days they were unable to explain the riddle. ..."
        },
        {
          "reference": "1 Samuel 25:44",
          "text": "But Saul had given his daughter Michal, David’s wife, to Palti son of Laish, who was from Gallim."
        },
        {
          "reference": "2 Samuel 11:2-4",
          "text": "One evening David got up from his bed and strolled around on the roof of the palace. And from the roof he saw a woman bathing—a very beautiful woman. / So David sent and inquired about the woman, and he was told, “This is Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite.” / Then David sent messengers to get her, and when she came to him, he slept with her. (Now she had just purified herself from her uncleanness.) Then she returned home."
        },
        {
          "reference": "2 Samuel 13:11-14",
          "text": "And when she had brought them to him to eat, he took hold of her and said, “Come lie with me, my sister!” / “No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” ..."
        },
        {
          "reference": "1 Kings 2:22",
          "text": "King Solomon answered his mother, “Why do you request Abishag the Shunammite for Adonijah? Since he is my older brother, you might as well request the kingdom for him and for Abiathar the priest and for Joab son of Zeruiah!”"
        },
        {
          "reference": "Esther 2:14",
          "text": "She would go there in the evening, and in the morning she would return to a second harem under the care of Shaashgaz, the king’s eunuch in charge of the concubines. She would not return to the king unless he delighted in her and summoned her by name."
        },
        {
          "reference": "Hosea 12:3",
          "text": "In the womb he grasped his brother’s heel, and in his vigor he wrestled with God."
        },
        {
          "reference": "Matthew 1:18-20",
          "text": "This is how the birth of Jesus Christ came about: His mother Mary was pledged in marriage to Joseph, but before they came together, she was found to be with child through the Holy Spirit. / Because Joseph her husband was a righteous man and was unwilling to disgrace her publicly, he resolved to divorce her quietly. / But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit."
        },
        {
          "reference": "Matthew 25:1-13",
          "text": "“At that time the kingdom of heaven will be like ten virgins who took their lamps and went out to meet the bridegroom. / Five of them were foolish, and five were wise. / The foolish ones took their lamps but did not take along any extra oil. ..."
        },
        {
          "reference": "Mark 12:19-23",
          "text": "“Teacher, Moses wrote for us that if a man’s brother dies and leaves a wife but no children, the man is to marry his brother’s widow and raise up offspring for him. / Now there were seven brothers. The first one married and died, leaving no children. / Then the second one married the widow, but he also died and left no children. And the third did likewise. ..."
        },
        {
          "reference": "Luke 20:34-35",
          "text": "Jesus answered, “The sons of this age marry and are given in marriage. / But those who are considered worthy to share in the age to come and in the resurrection from the dead will neither marry nor be given in marriage."
        },
        {
          "reference": "John 3:29",
          "text": "The bride belongs to the bridegroom. The friend of the bridegroom stands and listens for him, and is overjoyed to hear the bridegroom’s voice. That joy is mine, and it is now complete."
        }
      ]
    },
    {
      "reference": "Genesis 29:24",
      "book": "Genesis",
      "chapter": 29,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "And Laban gave his servant Zilpah to his daughter as her attendant."
        },
        {
          "version": "NLT",
          "text": "(Laban had given Leah a servant, Zilpah, to be her maid.)"
        },
        {
          "version": "ESV",
          "text": "(Laban gave his female servant Zilpah to his daughter Leah to be her servant.)"
        },
        {
          "version": "NKJV",
          "text": "And Laban gave his maid Zilpah to his daughter Leah as a maid."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:59-61",
          "text": "So they sent their sister Rebekah on her way, along with her nurse and Abraham’s servant and his men. / And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.” / Then Rebekah and her servant girls got ready, mounted the camels, and followed the man. So the servant took Rebekah and left."
        },
        {
          "reference": "Genesis 31:15",
          "text": "Are we not regarded by him as outsiders? Not only has he sold us, but he has certainly squandered what was paid for us."
        },
        {
          "reference": "Genesis 24:61",
          "text": "Then Rebekah and her servant girls got ready, mounted the camels, and followed the man. So the servant took Rebekah and left."
        },
        {
          "reference": "Genesis 30:9",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife."
        },
        {
          "reference": "Genesis 16:1-3",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai. / So after he had lived in Canaan for ten years, his wife Sarai took her Egyptian maidservant Hagar and gave her to Abram to be his wife."
        },
        {
          "reference": "Genesis 21:10",
          "text": "and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!”"
        },
        {
          "reference": "Genesis 24:35",
          "text": "“The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys."
        },
        {
          "reference": "Genesis 25:6",
          "text": "But while he was still alive, Abraham gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east."
        },
        {
          "reference": "Genesis 30:3-4",
          "text": "Then she said, “Here is my maidservant Bilhah. Sleep with her, that she may bear children for me, so that through her I too can build a family.” / So Rachel gave Jacob her servant Bilhah as a wife, and he slept with her,"
        },
        {
          "reference": "Genesis 31:50",
          "text": "If you mistreat my daughters or take other wives, although no one is with us, remember that God is a witness between you and me.”"
        },
        {
          "reference": "Genesis 16:5",
          "text": "Then Sarai said to Abram, “May the wrong done to me be upon you! I delivered my servant into your arms, and ever since she saw that she was pregnant, she has treated me with contempt. May the LORD judge between you and me.”"
        },
        {
          "reference": "Genesis 21:14",
          "text": "Early in the morning, Abraham got up, took bread and a skin of water, put them on Hagar’s shoulders, and sent her away with the boy. She left and wandered in the Wilderness of Beersheba."
        },
        {
          "reference": "Genesis 30:18",
          "text": "Then Leah said, “God has rewarded me for giving my maidservant to my husband.” So she named him Issachar."
        },
        {
          "reference": "Genesis 31:7",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        }
      ]
    },
    {
      "reference": "Genesis 29:25",
      "book": "Genesis",
      "chapter": 29,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "When morning came, there was Leah! So Jacob said to Laban, “What is this you have done to me? I served you for Rachel, didn’t I? Why have you deceived me?”"
        },
        {
          "version": "NLT",
          "text": "But when Jacob woke up in the morning—it was Leah! “What have you done to me?” Jacob raged at Laban. “I worked seven years for Rachel! Why have you tricked me?”"
        },
        {
          "version": "ESV",
          "text": "And in the morning, behold, it was Leah! And Jacob said to Laban, “What is this you have done to me? Did I not serve with you for Rachel? Why then have you deceived me?”"
        },
        {
          "version": "NKJV",
          "text": "So it came to pass in the morning, that behold, it was Leah. And he said to Laban, “What is this you have done to me? Was it not for Rachel that I served you? Why then have you deceived me?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:35",
          "text": "But Isaac replied, “Your brother came deceitfully and took your blessing.”"
        },
        {
          "reference": "Genesis 31:7",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 30:25-28",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” ..."
        },
        {
          "reference": "Genesis 24:50-51",
          "text": "Laban and Bethuel answered, “This is from the LORD; we have no choice in the matter. / Rebekah is here before you. Take her and go, and let her become the wife of your master’s son, just as the LORD has decreed.”"
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 24:29-31",
          "text": "Now Rebekah had a brother named Laban, and he rushed out to the man at the spring. / As soon as he saw the ring, and the bracelets on his sister’s wrists, and heard Rebekah’s words, “The man said this to me,” he went and found the man standing by the camels near the spring. / “Come, you who are blessed by the LORD,” said Laban. “Why are you standing out here? I have prepared the house and a place for the camels.”"
        },
        {
          "reference": "Genesis 25:29-34",
          "text": "One day, while Jacob was cooking some stew, Esau came in from the field and was famished. / He said to Jacob, “Let me eat some of that red stew, for I am famished.” (That is why he was also called Edom.) / “First sell me your birthright,” Jacob replied. ..."
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 27:36",
          "text": "So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 31:14-16",
          "text": "And Rachel and Leah replied, “Do we have any portion or inheritance left in our father’s house? / Are we not regarded by him as outsiders? Not only has he sold us, but he has certainly squandered what was paid for us. / Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 32:28",
          "text": "Then the man said, “Your name will no longer be Jacob, but Israel, because you have struggled with God and with men, and you have prevailed.”"
        },
        {
          "reference": "Genesis 33:1-4",
          "text": "Now Jacob looked up and saw Esau coming toward him with four hundred men. So he divided the children among Leah, Rachel, and the two maidservants. / He put the maidservants and their children in front, Leah and her children next, and Rachel and Joseph at the rear. / But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother. ..."
        }
      ]
    },
    {
      "reference": "Genesis 29:26",
      "book": "Genesis",
      "chapter": 29,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "Laban replied, “It is not our custom here to give the younger daughter in marriage before the older one."
        },
        {
          "version": "NLT",
          "text": "“It’s not our custom here to marry off a younger daughter ahead of the firstborn,” Laban replied."
        },
        {
          "version": "ESV",
          "text": "Laban said, “It is not so done in our country, to give the younger before the firstborn."
        },
        {
          "version": "NKJV",
          "text": "And Laban said, “It must not be done so in our country, to give the younger before the firstborn."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:50-51",
          "text": "Laban and Bethuel answered, “This is from the LORD; we have no choice in the matter. / Rebekah is here before you. Take her and go, and let her become the wife of your master’s son, just as the LORD has decreed.”"
        },
        {
          "reference": "Genesis 31:14-16",
          "text": "And Rachel and Leah replied, “Do we have any portion or inheritance left in our father’s house? / Are we not regarded by him as outsiders? Not only has he sold us, but he has certainly squandered what was paid for us. / Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 24:33",
          "text": "Then a meal was set before the man, but he said, “I will not eat until I have told you what I came to say.” So Laban said, “Please speak.”"
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:58-60",
          "text": "They called Rebekah and asked her, “Will you go with this man?” “I will go,” she replied. / So they sent their sister Rebekah on her way, along with her nurse and Abraham’s servant and his men. / And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.”"
        },
        {
          "reference": "Judges 14:10-12",
          "text": "Then his father went to visit the woman, and Samson prepared a feast there, as was customary for the bridegroom. / And when the Philistines saw him, they selected thirty men to accompany him. / “Let me tell you a riddle,” Samson said to them. “If you can solve it for me within the seven days of the feast, I will give you thirty linen garments and thirty sets of clothes."
        },
        {
          "reference": "Ruth 4:11",
          "text": "“We are witnesses,” said the elders and all the people at the gate. “May the LORD make the woman entering your home like Rachel and Leah, who together built up the house of Israel. May you be prosperous in Ephrathah and famous in Bethlehem."
        },
        {
          "reference": "1 Samuel 18:17-19",
          "text": "Then Saul said to David, “Here is my older daughter Merab. I will give her to you in marriage. Only be valiant for me and fight the LORD’s battles.” But Saul was thinking, “I need not raise my hand against him; let the hand of the Philistines be against him.” / And David said to Saul, “Who am I, and what is my family or my father’s clan in Israel, that I should become the son-in-law of the king?” / So when it was time to give Saul’s daughter Merab to David, she was given in marriage to Adriel of Meholah."
        },
        {
          "reference": "Exodus 2:21",
          "text": "Moses agreed to stay with the man, and he gave his daughter Zipporah to Moses in marriage."
        },
        {
          "reference": "1 Samuel 25:39-42",
          "text": "On hearing that Nabal was dead, David said, “Blessed be the LORD, who has upheld my cause against the reproach of Nabal and has restrained His servant from evil. For the LORD has brought the wickedness of Nabal down upon his own head.” Then David sent word to Abigail, asking her to become his wife. / When his servants came to Abigail at Carmel, they said, “David has sent us to take you as his wife.” / She arose, bowed facedown, and said, “Here is your servant, ready to serve and to wash the feet of my lord’s servants.” ..."
        },
        {
          "reference": "Matthew 1:18-19",
          "text": "This is how the birth of Jesus Christ came about: His mother Mary was pledged in marriage to Joseph, but before they came together, she was found to be with child through the Holy Spirit. / Because Joseph her husband was a righteous man and was unwilling to disgrace her publicly, he resolved to divorce her quietly."
        },
        {
          "reference": "Matthew 22:2-3",
          "text": "“The kingdom of heaven is like a king who prepared a wedding banquet for his son. / He sent his servants to call those he had invited to the banquet, but they refused to come."
        },
        {
          "reference": "Matthew 25:1-10",
          "text": "“At that time the kingdom of heaven will be like ten virgins who took their lamps and went out to meet the bridegroom. / Five of them were foolish, and five were wise. / The foolish ones took their lamps but did not take along any extra oil. ..."
        },
        {
          "reference": "John 2:1-2",
          "text": "On the third day a wedding took place at Cana in Galilee. Jesus’ mother was there, / and Jesus and His disciples had also been invited to the wedding."
        },
        {
          "reference": "2 Corinthians 11:2",
          "text": "I am jealous for you with a godly jealousy. For I promised you to one husband, to present you as a pure virgin to Christ."
        }
      ]
    },
    {
      "reference": "Genesis 29:27",
      "book": "Genesis",
      "chapter": 29,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "Finish this daughter’s bridal week; then we will give you the younger one also, in return for another seven years of work.”"
        },
        {
          "version": "NLT",
          "text": "“But wait until the bridal week is over; then we’ll give you Rachel, too—provided you promise to work another seven years for me.”"
        },
        {
          "version": "ESV",
          "text": "Complete the week of this one, and we will give you the other also in return for serving me another seven years.”"
        },
        {
          "version": "NKJV",
          "text": "Fulfill her week, and we will give you this one also for the service which you will serve with me still another seven years.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 30:26-28",
          "text": "Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” / And he added, “Name your wages, and I will pay them.”"
        },
        {
          "reference": "Genesis 24:55",
          "text": "But her brother and mother said, “Let the girl remain with us ten days or so. After that, she may go.”"
        },
        {
          "reference": "Genesis 2:24",
          "text": "For this reason a man will leave his father and mother and be united to his wife, and they will become one flesh."
        },
        {
          "reference": "Genesis 25:20",
          "text": "and Isaac was forty years old when he married Rebekah, the daughter of Bethuel the Aramean from Paddan-aram and the sister of Laban the Aramean."
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 31:7",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:38",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock."
        },
        {
          "reference": "Exodus 21:2",
          "text": "If you buy a Hebrew servant, he is to serve you for six years. But in the seventh year, he shall go free without paying anything."
        },
        {
          "reference": "Leviticus 18:18",
          "text": "You must not take your wife’s sister as a rival wife and have sexual relations with her while your wife is still alive."
        },
        {
          "reference": "Deuteronomy 25:5",
          "text": "When brothers dwell together and one of them dies without a son, the widow must not marry outside the family. Her husband’s brother is to take her as his wife and fulfill the duty of a brother-in-law for her."
        },
        {
          "reference": "Ruth 4:10",
          "text": "Moreover, I have acquired Ruth the Moabitess, Mahlon’s widow, as my wife, to raise up the name of the deceased through his inheritance, so that his name will not disappear from among his brothers or from the gate of his home. You are witnesses today.”"
        },
        {
          "reference": "1 Samuel 18:27",
          "text": "David and his men went out and killed two hundred Philistines. He brought their foreskins and presented them as payment in full to become the king’s son-in-law. Then Saul gave his daughter Michal to David in marriage."
        },
        {
          "reference": "1 Samuel 25:44",
          "text": "But Saul had given his daughter Michal, David’s wife, to Palti son of Laish, who was from Gallim."
        }
      ]
    },
    {
      "reference": "Genesis 29:28",
      "book": "Genesis",
      "chapter": 29,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "And Jacob did so. He finished the week with Leah, and then Laban gave him his daughter Rachel to be his wife."
        },
        {
          "version": "NLT",
          "text": "So Jacob agreed to work seven more years. A week after Jacob had married Leah, Laban gave him Rachel, too."
        },
        {
          "version": "ESV",
          "text": "Jacob did so, and completed her week. Then Laban gave him his daughter Rachel to be his wife."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob did so and fulfilled her week. So he gave him his daughter Rachel as wife also."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 2:24",
          "text": "For this reason a man will leave his father and mother and be united to his wife, and they will become one flesh."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 30:4",
          "text": "So Rachel gave Jacob her servant Bilhah as a wife, and he slept with her,"
        },
        {
          "reference": "Genesis 30:9",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife."
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 24:51",
          "text": "Rebekah is here before you. Take her and go, and let her become the wife of your master’s son, just as the LORD has decreed.”"
        },
        {
          "reference": "Genesis 25:20",
          "text": "and Isaac was forty years old when he married Rebekah, the daughter of Bethuel the Aramean from Paddan-aram and the sister of Laban the Aramean."
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 28:5",
          "text": "So Isaac sent Jacob to Paddan-aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau."
        },
        {
          "reference": "Genesis 28:6",
          "text": "Now Esau learned that Isaac had blessed Jacob and sent him to Paddan-aram to take a wife there, commanding him, “Do not marry a Canaanite woman,”"
        },
        {
          "reference": "Genesis 28:7",
          "text": "and that Jacob had obeyed his father and mother and gone to Paddan-aram."
        },
        {
          "reference": "Genesis 28:8",
          "text": "And seeing that his father Isaac disapproved of the Canaanite women,"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 28:10",
          "text": "Meanwhile Jacob left Beersheba and set out for Haran."
        },
        {
          "reference": "Genesis 28:11",
          "text": "On reaching a certain place, he spent the night there because the sun had set. And taking one of the stones from that place, he put it under his head and lay down to sleep."
        }
      ]
    },
    {
      "reference": "Genesis 29:29",
      "book": "Genesis",
      "chapter": 29,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "Laban gave his servant Bilhah to his daughter Rachel as her attendant."
        },
        {
          "version": "NLT",
          "text": "(Laban gave Rachel a servant, Bilhah, to be her maid.)"
        },
        {
          "version": "ESV",
          "text": "(Laban gave his female servant Bilhah to his daughter Rachel to be her servant.)"
        },
        {
          "version": "NKJV",
          "text": "And Laban gave his maid Bilhah to his daughter Rachel as a maid."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 30:9",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife."
        },
        {
          "reference": "Genesis 16:1-3",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai. / So after he had lived in Canaan for ten years, his wife Sarai took her Egyptian maidservant Hagar and gave her to Abram to be his wife."
        },
        {
          "reference": "Genesis 24:59-61",
          "text": "So they sent their sister Rebekah on her way, along with her nurse and Abraham’s servant and his men. / And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.” / Then Rebekah and her servant girls got ready, mounted the camels, and followed the man. So the servant took Rebekah and left."
        },
        {
          "reference": "Genesis 30:3-4",
          "text": "Then she said, “Here is my maidservant Bilhah. Sleep with her, that she may bear children for me, so that through her I too can build a family.” / So Rachel gave Jacob her servant Bilhah as a wife, and he slept with her,"
        },
        {
          "reference": "Genesis 35:22-26",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons: / The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. ..."
        },
        {
          "reference": "Genesis 46:18",
          "text": "These are the sons of Jacob born to Zilpah—whom Laban gave to his daughter Leah—sixteen in all."
        },
        {
          "reference": "Genesis 21:10-12",
          "text": "and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!” / Now this matter distressed Abraham greatly because it concerned his son Ishmael. / But God said to Abraham, “Do not be distressed about the boy and your maidservant. Listen to everything that Sarah tells you, for through Isaac your offspring will be reckoned."
        },
        {
          "reference": "Genesis 25:6",
          "text": "But while he was still alive, Abraham gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east."
        },
        {
          "reference": "Exodus 21:7-11",
          "text": "And if a man sells his daughter as a servant, she is not to go free as the menservants do. / If she is displeasing in the eyes of her master who had designated her for himself, he must allow her to be redeemed. He has no right to sell her to foreigners, since he has broken faith with her. / And if he chooses her for his son, he must deal with her as with a daughter. ..."
        },
        {
          "reference": "Ruth 4:11",
          "text": "“We are witnesses,” said the elders and all the people at the gate. “May the LORD make the woman entering your home like Rachel and Leah, who together built up the house of Israel. May you be prosperous in Ephrathah and famous in Bethlehem."
        },
        {
          "reference": "1 Samuel 1:2",
          "text": "He had two wives, one named Hannah and the other Peninnah. And Peninnah had children, but Hannah had none."
        },
        {
          "reference": "1 Chronicles 2:46-48",
          "text": "Caleb’s concubine Ephah was the mother of Haran, Moza, and Gazez. Haran was the father of Gazez. / The sons of Jahdai: Regem, Jotham, Geshan, Pelet, Ephah, and Shaaph. / Caleb’s concubine Maacah was the mother of Sheber and Tirhanah."
        },
        {
          "reference": "1 Chronicles 7:13",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum—the descendants of Bilhah."
        },
        {
          "reference": "Matthew 1:2",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Luke 3:34",
          "text": "the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor,"
        }
      ]
    },
    {
      "reference": "Genesis 29:30",
      "book": "Genesis",
      "chapter": 29,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob made love to Rachel also, and his love for Rachel was greater than his love for Leah. And he worked for Laban another seven years."
        },
        {
          "version": "NLT",
          "text": "So Jacob slept with Rachel, too, and he loved her much more than Leah. He then stayed and worked for Laban the additional seven years."
        },
        {
          "version": "ESV",
          "text": "So Jacob went in to Rachel also, and he loved Rachel more than Leah, and served Laban for another seven years."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob also went in to Rachel, and he also loved Rachel more than Leah. And he served with Laban still another seven years."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 2:24",
          "text": "For this reason a man will leave his father and mother and be united to his wife, and they will become one flesh."
        },
        {
          "reference": "Genesis 30:26-28",
          "text": "Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” / And he added, “Name your wages, and I will pay them.”"
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 16:4-5",
          "text": "And he slept with Hagar, and she conceived. But when Hagar realized that she was pregnant, she began to despise her mistress. / Then Sarai said to Abram, “May the wrong done to me be upon you! I delivered my servant into your arms, and ever since she saw that she was pregnant, she has treated me with contempt. May the LORD judge between you and me.”"
        },
        {
          "reference": "Exodus 21:10",
          "text": "If he takes another wife, he must not reduce the food, clothing, or marital rights of his first wife."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Samuel 1:2",
          "text": "He had two wives, one named Hannah and the other Peninnah. And Peninnah had children, but Hannah had none."
        },
        {
          "reference": "1 Kings 11:1-3",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love. / He had seven hundred wives of royal birth and three hundred concubines—and his wives turned his heart away."
        },
        {
          "reference": "Malachi 2:14-15",
          "text": "Yet you ask, “Why?” It is because the LORD has been a witness between you and the wife of your youth, against whom you have broken faith, though she is your companion and your wife by covenant. / Has not the LORD made them one, having a portion of the Spirit? And why one? Because He seeks godly offspring. So guard yourselves in your spirit and do not break faith with the wife of your youth."
        },
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Mark 10:6-9",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh. ..."
        },
        {
          "reference": "Luke 16:18",
          "text": "Anyone who divorces his wife and marries another woman commits adultery, and he who marries a divorced woman commits adultery."
        },
        {
          "reference": "John 4:16-18",
          "text": "Jesus told her, “Go, call your husband and come back.” / “I have no husband,” the woman replied. Jesus said to her, “You are correct to say that you have no husband. / In fact, you have had five husbands, and the man you now have is not your husband. You have spoken truthfully.”"
        },
        {
          "reference": "Romans 7:2-3",
          "text": "For instance, a married woman is bound by law to her husband as long as he lives. But if her husband dies, she is released from the law of marriage. / So then, if she is joined to another man while her husband is still alive, she is called an adulteress; but if her husband dies, she is free from that law and is not an adulteress if she marries another man."
        }
      ]
    },
    {
      "reference": "Genesis 29:31",
      "book": "Genesis",
      "chapter": 29,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "When the LORD saw that Leah was not loved, he enabled her to conceive, but Rachel remained childless."
        },
        {
          "version": "NLT",
          "text": "When the LORD saw that Leah was unloved, he enabled her to have children, but Rachel could not conceive."
        },
        {
          "version": "ESV",
          "text": "When the LORD saw that Leah was hated, he opened her womb, but Rachel was barren."
        },
        {
          "version": "NKJV",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Samuel 1:5-6",
          "text": "But to Hannah he would give a double portion, for he loved her even though the LORD had closed her womb. / Because the LORD had closed Hannah’s womb, her rival would provoke her viciously to taunt her."
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 16:1-2",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "Genesis 30:22",
          "text": "Then God remembered Rachel. He listened to her and opened her womb,"
        },
        {
          "reference": "Exodus 3:7",
          "text": "The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings."
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "Luke 1:13",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        },
        {
          "reference": "Luke 1:24-25",
          "text": "After these days, his wife Elizabeth became pregnant and for five months remained in seclusion. She declared, / “The Lord has done this for me. In these days He has shown me favor and taken away my disgrace among the people.”"
        },
        {
          "reference": "Romans 9:10-12",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.”"
        },
        {
          "reference": "1 Corinthians 1:27-29",
          "text": "But God chose the foolish things of the world to shame the wise; God chose the weak things of the world to shame the strong. / He chose the lowly and despised things of the world, and the things that are not, to nullify the things that are, / so that no one may boast in His presence."
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        }
      ]
    },
    {
      "reference": "Genesis 29:32",
      "book": "Genesis",
      "chapter": 29,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "Leah became pregnant and gave birth to a son. She named him Reuben, for she said, “It is because the LORD has seen my misery. Surely my husband will love me now.”"
        },
        {
          "version": "NLT",
          "text": "So Leah became pregnant and gave birth to a son. She named him Reuben, for she said, “The LORD has noticed my misery, and now my husband will love me.”"
        },
        {
          "version": "ESV",
          "text": "And Leah conceived and bore a son, and she called his name Reuben, for she said, “Because the LORD has looked upon my affliction; for now my husband will love me.”"
        },
        {
          "version": "NKJV",
          "text": "So Leah conceived and bore a son, and she called his name Reuben; for she said, “The LORD has surely looked on my affliction. Now therefore, my husband will love me.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 30:18",
          "text": "Then Leah said, “God has rewarded me for giving my maidservant to my husband.” So she named him Issachar."
        },
        {
          "reference": "Genesis 49:3-4",
          "text": "Reuben, you are my firstborn, my might, and the beginning of my strength, excelling in honor, excelling in power. / Uncontrolled as the waters, you will no longer excel, because you went up to your father’s bed, onto my couch, and defiled it."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Exodus 1:1-2",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah;"
        },
        {
          "reference": "Judges 8:22-23",
          "text": "Then the Israelites said to Gideon, “Rule over us—you and your son and grandson—for you have saved us from the hand of Midian.” / But Gideon replied, “I will not rule over you, nor will my son. The LORD shall rule over you.”"
        },
        {
          "reference": "1 Samuel 1:20",
          "text": "So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "1 Samuel 2:21",
          "text": "So the LORD attended to Hannah, and she conceived and gave birth to three sons and two daughters. Meanwhile, the boy Samuel grew up in the presence of the LORD."
        },
        {
          "reference": "1 Kings 8:16",
          "text": "‘Since the day I brought My people Israel out of Egypt, I have not chosen a city from any tribe of Israel in which to build a house so that My Name would be there. But I have chosen David to be over My people Israel.’"
        },
        {
          "reference": "2 Kings 14:27",
          "text": "and since the LORD had said that He would not blot out the name of Israel from under heaven, He saved them by the hand of Jeroboam son of Jehoash."
        },
        {
          "reference": "Matthew 1:2",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Luke 3:33",
          "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah,"
        },
        {
          "reference": "John 4:22",
          "text": "You worship what you do not know; we worship what we do know, for salvation is from the Jews."
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Romans 11:1",
          "text": "I ask then, did God reject His people? Certainly not! I am an Israelite myself, a descendant of Abraham, from the tribe of Benjamin."
        }
      ]
    },
    {
      "reference": "Genesis 29:33",
      "book": "Genesis",
      "chapter": 29,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "She conceived again, and when she gave birth to a son she said, &#8220Because the LORD heard that I am not loved, he gave me this one too.” So she named him Simeon."
        },
        {
          "version": "NLT",
          "text": "She soon became pregnant again and gave birth to another son. She named him Simeon, for she said, “The LORD heard that I was unloved and has given me another son.”"
        },
        {
          "version": "ESV",
          "text": "She conceived again and bore a son, and said, “Because the LORD has heard that I am hated, he has given me this son also.” And she called his name Simeon."
        },
        {
          "version": "NKJV",
          "text": "Then she conceived again and bore a son, and said, “Because the LORD has heard that I am unloved, He has therefore given me this son also.” And she called his name Simeon."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 29:34",
      "book": "Genesis",
      "chapter": 29,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "Again she conceived, and when she gave birth to a son she said, “Now at last my husband will become attached to me, because I have borne him three sons.” So he was named Levi."
        },
        {
          "version": "NLT",
          "text": "Then she became pregnant a third time and gave birth to another son. He was named Levi, for she said, “Surely this time my husband will feel affection for me, since I have given him three sons!”"
        },
        {
          "version": "ESV",
          "text": "Again she conceived and bore a son, and said, “Now this time my husband will be attached to me, because I have borne him three sons.” Therefore his name was called Levi."
        },
        {
          "version": "NKJV",
          "text": "She conceived again and bore a son, and said, “Now this time my husband will become attached to me, because I have borne him three sons.” Therefore his name was called Levi."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Genesis 34:25-30",
          "text": "Three days later, while they were still in pain, two of Jacob’s sons (Dinah’s brothers Simeon and Levi) took their swords, went into the unsuspecting city, and slaughtered every male. / They killed Hamor and his son Shechem with their swords, took Dinah out of Shechem’s house, and went away. / Jacob’s other sons came upon the slaughter and looted the city, because their sister had been defiled. ..."
        },
        {
          "reference": "Genesis 35:22-26",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons: / The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. ..."
        },
        {
          "reference": "Genesis 46:8-27",
          "text": "Now these are the names of the sons of Israel (Jacob and his descendants) who went to Egypt: Reuben, Jacob’s firstborn. / The sons of Reuben: Hanoch, Pallu, Hezron, and Carmi. / The sons of Simeon: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul the son of a Canaanite woman. ..."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Numbers 1:5-15",
          "text": "These are the names of the men who are to assist you: From the tribe of Reuben, Elizur son of Shedeur; / from Simeon, Shelumiel son of Zurishaddai; / from Judah, Nahshon son of Amminadab; ..."
        },
        {
          "reference": "Numbers 26:5-14",
          "text": "Reuben was the firstborn of Israel. These were the descendants of Reuben: The Hanochite clan from Hanoch, the Palluite clan from Pallu, / the Hezronite clan from Hezron, and the Carmite clan from Carmi. / These were the clans of Reuben, and their registration numbered 43,730. ..."
        },
        {
          "reference": "Deuteronomy 33:8-11",
          "text": "Concerning Levi he said: “Give Your Thummim to Levi and Your Urim to Your godly one, whom You tested at Massah and contested at the waters of Meribah. / He said of his father and mother, ‘I do not consider them.’ He disregarded his brothers and did not know his own sons, for he kept Your word and maintained Your covenant. / He will teach Your ordinances to Jacob and Your law to Israel; he will set incense before You and whole burnt offerings on Your altar. ..."
        },
        {
          "reference": "1 Chronicles 2:1-2",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, / Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."
        },
        {
          "reference": "1 Chronicles 6:1-2",
          "text": "The sons of Levi: Gershon, Kohath, and Merari. / The sons of Kohath: Amram, Izhar, Hebron, and Uzziel."
        },
        {
          "reference": "Matthew 1:2",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Luke 3:33-34",
          "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah, / the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor,"
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Romans 9:6-13",
          "text": "It is not as though God’s word has failed. For not all who are descended from Israel are Israel. / Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. ..."
        },
        {
          "reference": "Hebrews 7:14",
          "text": "For it is clear that our Lord descended from Judah, a tribe as to which Moses said nothing about priests."
        }
      ]
    },
    {
      "reference": "Genesis 29:35",
      "book": "Genesis",
      "chapter": 29,
      "verse": 35,
      "translations": [
        {
          "version": "NIV",
          "text": "She conceived again, and when she gave birth to a son she said, “This time I will praise the LORD.” So she named him Judah. Then she stopped having children."
        },
        {
          "version": "NLT",
          "text": "Once again Leah became pregnant and gave birth to another son. She named him Judah, for she said, “Now I will praise the LORD!” And then she stopped having children."
        },
        {
          "version": "ESV",
          "text": "And she conceived again and bore a son, and said, “This time I will praise the LORD.” Therefore she called his name Judah. Then she ceased bearing."
        },
        {
          "version": "NKJV",
          "text": "And she conceived again and bore a son, and said, “Now I will praise the LORD.” Therefore she called his name Judah. Then she stopped bearing."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:8-10",
          "text": "Judah, your brothers shall praise you. Your hand shall be on the necks of your enemies; your father’s sons shall bow down to you. / Judah is a young lion—my son, you return from the prey. Like a lion he crouches and lies down; like a lioness, who dares to rouse him? / The scepter will not depart from Judah, nor the staff from between his feet, until Shiloh comes and the allegiance of the nations is his."
        },
        {
          "reference": "Matthew 1:2-3",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers. / Judah was the father of Perez and Zerah by Tamar, Perez the father of Hezron, and Hezron the father of Ram."
        },
        {
          "reference": "Revelation 5:5",
          "text": "Then one of the elders said to me, “Do not weep! Behold, the Lion of the tribe of Judah, the Root of David, has triumphed to open the scroll and its seven seals.”"
        },
        {
          "reference": "Hebrews 7:14",
          "text": "For it is clear that our Lord descended from Judah, a tribe as to which Moses said nothing about priests."
        },
        {
          "reference": "1 Chronicles 5:2",
          "text": "And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Micah 5:2",
          "text": "But you, Bethlehem Ephrathah, who are small among the clans of Judah, out of you will come forth for Me One to be ruler over Israel—One whose origins are of old, from the days of eternity."
        },
        {
          "reference": "Luke 3:33",
          "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah,"
        },
        {
          "reference": "Ruth 4:12",
          "text": "And may your house become like the house of Perez, whom Tamar bore to Judah, because of the offspring the LORD will give you by this young woman.”"
        },
        {
          "reference": "Psalm 78:68-70",
          "text": "But He chose the tribe of Judah, Mount Zion, which He loved. / He built His sanctuary like the heights, like the earth He has established forever. / He chose David His servant and took him from the sheepfolds;"
        },
        {
          "reference": "Isaiah 11:1",
          "text": "Then a shoot will spring up from the stump of Jesse, and a Branch from his roots will bear fruit."
        },
        {
          "reference": "Numbers 24:17",
          "text": "I see him, but not now; I behold him, but not near. A star will come forth from Jacob, and a scepter will arise from Israel. He will crush the skulls of Moab and strike down all the sons of Sheth."
        },
        {
          "reference": "2 Samuel 7:12-16",
          "text": "And when your days are fulfilled and you rest with your fathers, I will raise up your descendant after you, who will come from your own body, and I will establish his kingdom. / He will build a house for My Name, and I will establish the throne of his kingdom forever. / I will be his Father, and he will be My son. When he does wrong, I will discipline him with the rod of men and with the blows of the sons of men. ..."
        },
        {
          "reference": "Jeremiah 23:5-6",
          "text": "Behold, the days are coming, declares the LORD, when I will raise up for David a righteous Branch, and He will reign wisely as King and will administer justice and righteousness in the land. / In His days Judah will be saved, and Israel will dwell securely. And this is His name by which He will be called: The LORD Our Righteousness."
        },
        {
          "reference": "Zechariah 9:9",
          "text": "Rejoice greatly, O Daughter of Zion! Shout in triumph, O Daughter of Jerusalem! See, your King comes to you, righteous and victorious, humble and riding on a donkey, on a colt, the foal of a donkey."
        },
        {
          "reference": "John 7:42",
          "text": "Doesn’t the Scripture say that the Christ will come from the line of David and from Bethlehem, the village where David lived?”"
        }
      ]
    }
  ]
}