{
  "book": "genesis",
  "chapter": 30,
  "verses": [
    {
      "reference": "Genesis 30:1",
      "book": "Genesis",
      "chapter": 30,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "When Rachel saw that she was not bearing Jacob any children, she became jealous of her sister. So she said to Jacob, “Give me children, or I’ll die!”"
        },
        {
          "version": "NLT",
          "text": "When Rachel saw that she wasn’t having any children for Jacob, she became jealous of her sister. She pleaded with Jacob, “Give me children, or I’ll die!”"
        },
        {
          "version": "ESV",
          "text": "When Rachel saw that she bore Jacob no children, she envied her sister. She said to Jacob, “Give me children, or I shall die!”"
        },
        {
          "version": "NKJV",
          "text": "Now when Rachel saw that she bore Jacob no children, Rachel envied her sister, and said to Jacob, “Give me children, or else I die!”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Samuel 1:5-6",
          "text": "But to Hannah he would give a double portion, for he loved her even though the LORD had closed her womb. / Because the LORD had closed Hannah’s womb, her rival would provoke her viciously to taunt her."
        },
        {
          "reference": "Genesis 16:1-2",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 11:30",
          "text": "But Sarai was barren; she had no children."
        },
        {
          "reference": "Genesis 20:18",
          "text": "for on account of Abraham’s wife Sarah, the LORD had completely closed all the wombs in Abimelech’s household."
        },
        {
          "reference": "Genesis 15:2-3",
          "text": "But Abram replied, “O Lord GOD, what can You give me, since I remain childless, and the heir of my house is Eliezer of Damascus?” / Abram continued, “Behold, You have given me no offspring, so a servant in my household will be my heir.”"
        },
        {
          "reference": "Genesis 18:10-14",
          "text": "Then the LORD said, “I will surely return to you at this time next year, and your wife Sarah will have a son!” Now Sarah was behind him, listening at the entrance to the tent. / And Abraham and Sarah were already old and well along in years; Sarah had passed the age of childbearing. / So she laughed to herself, saying, “After I am worn out and my master is old, will I now have this pleasure?” ..."
        },
        {
          "reference": "Genesis 24:60",
          "text": "And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.”"
        },
        {
          "reference": "Luke 1:7",
          "text": "But they had no children, because Elizabeth was barren, and they were both well along in years."
        },
        {
          "reference": "Luke 1:36-37",
          "text": "Look, even Elizabeth your relative has conceived a son in her old age, and she who was called barren is in her sixth month. / For no word from God will ever fail.”"
        },
        {
          "reference": "Luke 1:25",
          "text": "“The Lord has done this for me. In these days He has shown me favor and taken away my disgrace among the people.”"
        },
        {
          "reference": "Romans 9:10-12",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.”"
        },
        {
          "reference": "Romans 4:19-21",
          "text": "Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. / Yet he did not waver through disbelief in the promise of God, but was strengthened in his faith and gave glory to God, / being fully persuaded that God was able to do what He had promised."
        }
      ]
    },
    {
      "reference": "Genesis 30:2",
      "book": "Genesis",
      "chapter": 30,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob became angry with her and said, &#8220Am I in the place of God, who has kept you from having children?”"
        },
        {
          "version": "NLT",
          "text": "Then Jacob became furious with Rachel. “Am I God?” he asked. “He’s the one who has kept you from having children!”"
        },
        {
          "version": "ESV",
          "text": "Jacob’s anger was kindled against Rachel, and he said, “Am I in the place of God, who has withheld from you the fruit of the womb?”"
        },
        {
          "version": "NKJV",
          "text": "And Jacob’s anger was aroused against Rachel, and he said, “ Am I in the place of God, who has withheld from you the fruit of the womb?”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 30:3",
      "book": "Genesis",
      "chapter": 30,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Then she said, “Here is Bilhah, my servant. Sleep with her so that she can bear children for me and I too can build a family through her.”"
        },
        {
          "version": "NLT",
          "text": "Then Rachel told him, “Take my maid, Bilhah, and sleep with her. She will bear children for me, and through her I can have a family, too.”"
        },
        {
          "version": "ESV",
          "text": "Then she said, “Here is my servant Bilhah; go in to her, so that she may give birth on my behalf, that even I may have children through her.”"
        },
        {
          "version": "NKJV",
          "text": "So she said, “Here is my maid Bilhah; go in to her, and she will bear a child on my knees, that I also may have children by her.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 16:2",
          "text": "So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 29:24",
          "text": "And Laban gave his servant girl Zilpah to his daughter Leah as her maidservant."
        },
        {
          "reference": "Genesis 29:29",
          "text": "Laban also gave his servant girl Bilhah to his daughter Rachel as her maidservant."
        },
        {
          "reference": "Genesis 35:22",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons:"
        },
        {
          "reference": "Genesis 16:1-4",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai. / So after he had lived in Canaan for ten years, his wife Sarai took her Egyptian maidservant Hagar and gave her to Abram to be his wife. ..."
        },
        {
          "reference": "Genesis 21:10-12",
          "text": "and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!” / Now this matter distressed Abraham greatly because it concerned his son Ishmael. / But God said to Abraham, “Do not be distressed about the boy and your maidservant. Listen to everything that Sarah tells you, for through Isaac your offspring will be reckoned."
        },
        {
          "reference": "Genesis 25:1-6",
          "text": "Now Abraham had taken another wife, named Keturah, / and she bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. / Jokshan was the father of Sheba and Dedan. And the sons of Dedan were the Asshurites, the Letushites, and the Leummites. ..."
        },
        {
          "reference": "Genesis 38:8",
          "text": "Then Judah said to Onan, “Sleep with your brother’s wife. Perform your duty as her brother-in-law and raise up offspring for your brother.”"
        },
        {
          "reference": "Exodus 21:7-11",
          "text": "And if a man sells his daughter as a servant, she is not to go free as the menservants do. / If she is displeasing in the eyes of her master who had designated her for himself, he must allow her to be redeemed. He has no right to sell her to foreigners, since he has broken faith with her. / And if he chooses her for his son, he must deal with her as with a daughter. ..."
        },
        {
          "reference": "1 Samuel 1:1-2",
          "text": "Now there was a man named Elkanah who was from Ramathaim-zophim in the hill country of Ephraim. He was the son of Jeroham, the son of Elihu, the son of Tohu, the son of Zuph, an Ephraimite. / He had two wives, one named Hannah and the other Peninnah. And Peninnah had children, but Hannah had none."
        },
        {
          "reference": "1 Samuel 1:10-11",
          "text": "In her bitter distress, Hannah prayed to the LORD and wept with many tears. / And she made a vow, saying, “O LORD of Hosts, if only You will look upon the affliction of Your maidservant and remember me, not forgetting Your maidservant but giving her a son, then I will dedicate him to the LORD all the days of his life, and no razor shall ever touch his head.”"
        },
        {
          "reference": "1 Samuel 2:20-21",
          "text": "And Eli would bless Elkanah and his wife, saying, “May the LORD give you children by this woman in place of the one she dedicated to the LORD.” Then they would go home. / So the LORD attended to Hannah, and she conceived and gave birth to three sons and two daughters. Meanwhile, the boy Samuel grew up in the presence of the LORD."
        },
        {
          "reference": "Ruth 4:11",
          "text": "“We are witnesses,” said the elders and all the people at the gate. “May the LORD make the woman entering your home like Rachel and Leah, who together built up the house of Israel. May you be prosperous in Ephrathah and famous in Bethlehem."
        },
        {
          "reference": "Job 3:12",
          "text": "Why were there knees to receive me, and breasts that I should be nursed?"
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        }
      ]
    },
    {
      "reference": "Genesis 30:4",
      "book": "Genesis",
      "chapter": 30,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "So she gave him her servant Bilhah as a wife. Jacob slept with her,"
        },
        {
          "version": "NLT",
          "text": "So Rachel gave her servant, Bilhah, to Jacob as a wife, and he slept with her."
        },
        {
          "version": "ESV",
          "text": "So she gave him her servant Bilhah as a wife, and Jacob went in to her."
        },
        {
          "version": "NKJV",
          "text": "Then she gave him Bilhah her maid as wife, and Jacob went in to her."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 16:2",
          "text": "So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 16:3",
          "text": "So after he had lived in Canaan for ten years, his wife Sarai took her Egyptian maidservant Hagar and gave her to Abram to be his wife."
        },
        {
          "reference": "Genesis 29:24",
          "text": "And Laban gave his servant girl Zilpah to his daughter Leah as her maidservant."
        },
        {
          "reference": "Genesis 29:29",
          "text": "Laban also gave his servant girl Bilhah to his daughter Rachel as her maidservant."
        },
        {
          "reference": "Genesis 35:22",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons:"
        },
        {
          "reference": "Genesis 16:4",
          "text": "And he slept with Hagar, and she conceived. But when Hagar realized that she was pregnant, she began to despise her mistress."
        },
        {
          "reference": "Genesis 21:10",
          "text": "and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!”"
        },
        {
          "reference": "Genesis 25:6",
          "text": "But while he was still alive, Abraham gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east."
        },
        {
          "reference": "Genesis 38:18",
          "text": "“What pledge should I give you?” he asked. She answered, “Your seal and your cord, and the staff in your hand.” So he gave them to her and slept with her, and she became pregnant by him."
        },
        {
          "reference": "Genesis 38:25",
          "text": "As she was being brought out, Tamar sent a message to her father-in-law: “I am pregnant by the man to whom these items belong.” And she added, “Please examine them. Whose seal and cord and staff are these?”"
        },
        {
          "reference": "Exodus 21:7-11",
          "text": "And if a man sells his daughter as a servant, she is not to go free as the menservants do. / If she is displeasing in the eyes of her master who had designated her for himself, he must allow her to be redeemed. He has no right to sell her to foreigners, since he has broken faith with her. / And if he chooses her for his son, he must deal with her as with a daughter. ..."
        },
        {
          "reference": "Judges 19:24",
          "text": "Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.”"
        },
        {
          "reference": "Ruth 4:11",
          "text": "“We are witnesses,” said the elders and all the people at the gate. “May the LORD make the woman entering your home like Rachel and Leah, who together built up the house of Israel. May you be prosperous in Ephrathah and famous in Bethlehem."
        },
        {
          "reference": "1 Samuel 1:2",
          "text": "He had two wives, one named Hannah and the other Peninnah. And Peninnah had children, but Hannah had none."
        },
        {
          "reference": "2 Samuel 5:13",
          "text": "After he had arrived from Hebron, David took more concubines and wives from Jerusalem, and more sons and daughters were born to him."
        }
      ]
    },
    {
      "reference": "Genesis 30:5",
      "book": "Genesis",
      "chapter": 30,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "and she became pregnant and bore him a son."
        },
        {
          "version": "NLT",
          "text": "Bilhah became pregnant and presented him with a son."
        },
        {
          "version": "ESV",
          "text": "And Bilhah conceived and bore Jacob a son."
        },
        {
          "version": "NKJV",
          "text": "And Bilhah conceived and bore Jacob a son."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "Genesis 16:1-2",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 49:25",
          "text": "by the God of your father who helps you, and by the Almighty who blesses you, with blessings of the heavens above, with blessings of the depths below, with blessings of the breasts and womb."
        },
        {
          "reference": "1 Samuel 1:19-20",
          "text": "The next morning they got up early to bow in worship before the LORD, and then they returned home to Ramah. And Elkanah had relations with his wife Hannah, and the LORD remembered her. / So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "Ruth 4:13",
          "text": "So Boaz took Ruth, and she became his wife. And when he had relations with her, the LORD enabled her to conceive, and she gave birth to a son."
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Psalm 113:9",
          "text": "He settles the barren woman in her home as a joyful mother to her children. Hallelujah!"
        },
        {
          "reference": "Isaiah 66:9",
          "text": "Shall I bring a baby to the point of birth and not deliver it?” says the LORD. “Or will I who deliver close the womb?” says your God."
        },
        {
          "reference": "Luke 1:13",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        },
        {
          "reference": "Luke 1:24-25",
          "text": "After these days, his wife Elizabeth became pregnant and for five months remained in seclusion. She declared, / “The Lord has done this for me. In these days He has shown me favor and taken away my disgrace among the people.”"
        },
        {
          "reference": "Luke 1:57",
          "text": "When the time came for Elizabeth to have her child, she gave birth to a son."
        },
        {
          "reference": "Matthew 1:18",
          "text": "This is how the birth of Jesus Christ came about: His mother Mary was pledged in marriage to Joseph, but before they came together, she was found to be with child through the Holy Spirit."
        },
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        }
      ]
    },
    {
      "reference": "Genesis 30:6",
      "book": "Genesis",
      "chapter": 30,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Rachel said, “God has vindicated me; he has listened to my plea and given me a son.” Because of this she named him Dan."
        },
        {
          "version": "NLT",
          "text": "Rachel named him Dan, for she said, “God has vindicated me! He has heard my request and given me a son.”"
        },
        {
          "version": "ESV",
          "text": "Then Rachel said, “God has judged me, and has also heard my voice and given me a son.” Therefore she called his name Dan."
        },
        {
          "version": "NKJV",
          "text": "Then Rachel said, “God has judged my case; and He has also heard my voice and given me a son.” Therefore she called his name Dan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:32",
          "text": "And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.”"
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 16:11",
          "text": "The angel of the LORD proceeded: “Behold, you have conceived and will bear a son. And you shall name him Ishmael, for the LORD has heard your cry of affliction."
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "Genesis 49:18",
          "text": "I await Your salvation, O LORD."
        },
        {
          "reference": "1 Samuel 1:20",
          "text": "So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "Psalm 118:21",
          "text": "I will give You thanks, for You have answered me, and You have become my salvation."
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Psalm 37:4",
          "text": "Delight yourself in the LORD, and He will give you the desires of your heart."
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "Exodus 2:24",
          "text": "So God heard their groaning, and He remembered His covenant with Abraham, Isaac, and Jacob."
        },
        {
          "reference": "1 Samuel 2:1",
          "text": "At that time Hannah prayed: “My heart rejoices in the LORD; my horn is exalted in the LORD. My mouth speaks boldly against my enemies, for I rejoice in Your salvation."
        },
        {
          "reference": "Luke 1:13",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        },
        {
          "reference": "Luke 1:25",
          "text": "“The Lord has done this for me. In these days He has shown me favor and taken away my disgrace among the people.”"
        },
        {
          "reference": "Luke 1:46-48",
          "text": "Then Mary said: “My soul magnifies the Lord, / and my spirit rejoices in God my Savior! / For He has looked with favor on the humble state of His servant. From now on all generations will call me blessed."
        }
      ]
    },
    {
      "reference": "Genesis 30:7",
      "book": "Genesis",
      "chapter": 30,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Rachel’s servant Bilhah conceived again and bore Jacob a second son."
        },
        {
          "version": "NLT",
          "text": "Then Bilhah became pregnant again and gave Jacob a second son."
        },
        {
          "version": "ESV",
          "text": "Rachel’s servant Bilhah conceived again and bore Jacob a second son."
        },
        {
          "version": "NKJV",
          "text": "And Rachel’s maid Bilhah conceived again and bore Jacob a second son."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 16:1-2",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "Genesis 49:25",
          "text": "by the God of your father who helps you, and by the Almighty who blesses you, with blessings of the heavens above, with blessings of the depths below, with blessings of the breasts and womb."
        },
        {
          "reference": "1 Samuel 1:19-20",
          "text": "The next morning they got up early to bow in worship before the LORD, and then they returned home to Ramah. And Elkanah had relations with his wife Hannah, and the LORD remembered her. / So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "Luke 1:13",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        },
        {
          "reference": "Luke 1:24-25",
          "text": "After these days, his wife Elizabeth became pregnant and for five months remained in seclusion. She declared, / “The Lord has done this for me. In these days He has shown me favor and taken away my disgrace among the people.”"
        },
        {
          "reference": "Luke 1:36-37",
          "text": "Look, even Elizabeth your relative has conceived a son in her old age, and she who was called barren is in her sixth month. / For no word from God will ever fail.”"
        },
        {
          "reference": "Romans 9:10-12",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.”"
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        }
      ]
    },
    {
      "reference": "Genesis 30:8",
      "book": "Genesis",
      "chapter": 30,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Rachel said, “I have had a great struggle with my sister, and I have won.” So she named him Naphtali."
        },
        {
          "version": "NLT",
          "text": "Rachel named him Naphtali, for she said, “I have struggled hard with my sister, and I’m winning!”"
        },
        {
          "version": "ESV",
          "text": "Then Rachel said, “With mighty wrestlings I have wrestled with my sister and have prevailed.” So she called his name Naphtali."
        },
        {
          "version": "NKJV",
          "text": "Then Rachel said, “With great wrestlings I have wrestled with my sister, and indeed I have prevailed.” So she called his name Naphtali."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:30-31",
          "text": "Jacob slept with Rachel as well, and indeed, he loved Rachel more than Leah. So he worked for Laban another seven years. / When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 16:2",
          "text": "So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 21:6-7",
          "text": "Then Sarah said, “God has made me laugh, and everyone who hears of this will laugh with me.” / She added, “Who would have told Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.”"
        },
        {
          "reference": "Genesis 25:21-22",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived. / But the children inside her struggled with each other, and she said, “Why is this happening to me?” So Rebekah went to inquire of the LORD,"
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "Exodus 1:12",
          "text": "But the more they were oppressed, the more they multiplied and flourished; so the Egyptians came to dread the Israelites."
        },
        {
          "reference": "1 Samuel 1:5-6",
          "text": "But to Hannah he would give a double portion, for he loved her even though the LORD had closed her womb. / Because the LORD had closed Hannah’s womb, her rival would provoke her viciously to taunt her."
        },
        {
          "reference": "1 Samuel 2:5",
          "text": "The well-fed hire themselves out for food, but the starving hunger no more. The barren woman gives birth to seven, but she who has many sons pines away."
        },
        {
          "reference": "Psalm 113:9",
          "text": "He settles the barren woman in her home as a joyful mother to her children. Hallelujah!"
        },
        {
          "reference": "Psalm 127:3-5",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward. / Like arrows in the hand of a warrior, so are children born in one’s youth. / Blessed is the man whose quiver is full of them. He will not be put to shame when he confronts the enemies at the gate."
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "Romans 9:10-12",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.”"
        },
        {
          "reference": "Romans 9:7-9",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.”"
        },
        {
          "reference": "Galatians 4:22-23",
          "text": "For it is written that Abraham had two sons, one by the slave woman and the other by the free woman. / His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "Galatians 4:27",
          "text": "For it is written: “Rejoice, O barren woman, who bears no children; break forth and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband.”"
        }
      ]
    },
    {
      "reference": "Genesis 30:9",
      "book": "Genesis",
      "chapter": 30,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "When Leah saw that she had stopped having children, she took her servant Zilpah and gave her to Jacob as a wife."
        },
        {
          "version": "NLT",
          "text": "Meanwhile, Leah realized that she wasn’t getting pregnant anymore, so she took her servant, Zilpah, and gave her to Jacob as a wife."
        },
        {
          "version": "ESV",
          "text": "When Leah saw that she had ceased bearing children, she took her servant Zilpah and gave her to Jacob as a wife."
        },
        {
          "version": "NKJV",
          "text": "When Leah saw that she had stopped bearing, she took Zilpah her maid and gave her to Jacob as wife."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 16:1-4",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai. / So after he had lived in Canaan for ten years, his wife Sarai took her Egyptian maidservant Hagar and gave her to Abram to be his wife. ..."
        },
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 35:22-26",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons: / The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. ..."
        },
        {
          "reference": "Genesis 49:13",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon."
        },
        {
          "reference": "Genesis 21:10-13",
          "text": "and she said to Abraham, “Expel the slave woman and her son, for the slave woman’s son will never share in the inheritance with my son Isaac!” / Now this matter distressed Abraham greatly because it concerned his son Ishmael. / But God said to Abraham, “Do not be distressed about the boy and your maidservant. Listen to everything that Sarah tells you, for through Isaac your offspring will be reckoned. ..."
        },
        {
          "reference": "Genesis 25:1-6",
          "text": "Now Abraham had taken another wife, named Keturah, / and she bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. / Jokshan was the father of Sheba and Dedan. And the sons of Dedan were the Asshurites, the Letushites, and the Leummites. ..."
        },
        {
          "reference": "Genesis 16:15",
          "text": "And Hagar bore Abram a son, and Abram gave the name Ishmael to the son she had borne."
        },
        {
          "reference": "Genesis 21:1-3",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised. / And Abraham gave the name Isaac to the son Sarah bore to him."
        },
        {
          "reference": "Genesis 24:60",
          "text": "And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.”"
        },
        {
          "reference": "Genesis 29:24",
          "text": "And Laban gave his servant girl Zilpah to his daughter Leah as her maidservant."
        },
        {
          "reference": "Genesis 29:29",
          "text": "Laban also gave his servant girl Bilhah to his daughter Rachel as her maidservant."
        },
        {
          "reference": "Exodus 1:7",
          "text": "but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "1 Samuel 1:2",
          "text": "He had two wives, one named Hannah and the other Peninnah. And Peninnah had children, but Hannah had none."
        },
        {
          "reference": "1 Samuel 1:20",
          "text": "So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "1 Chronicles 7:13",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum—the descendants of Bilhah."
        }
      ]
    },
    {
      "reference": "Genesis 30:10",
      "book": "Genesis",
      "chapter": 30,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "Leah’s servant Zilpah bore Jacob a son."
        },
        {
          "version": "NLT",
          "text": "Soon Zilpah presented him with a son."
        },
        {
          "version": "ESV",
          "text": "Then Leah’s servant Zilpah bore Jacob a son."
        },
        {
          "version": "NKJV",
          "text": "And Leah’s maid Zilpah bore Jacob a son."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 16:1-4",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai. / So after he had lived in Canaan for ten years, his wife Sarai took her Egyptian maidservant Hagar and gave her to Abram to be his wife. ..."
        },
        {
          "reference": "Genesis 29:24",
          "text": "And Laban gave his servant girl Zilpah to his daughter Leah as her maidservant."
        },
        {
          "reference": "Genesis 35:22",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons:"
        },
        {
          "reference": "Genesis 49:3-4",
          "text": "Reuben, you are my firstborn, my might, and the beginning of my strength, excelling in honor, excelling in power. / Uncontrolled as the waters, you will no longer excel, because you went up to your father’s bed, onto my couch, and defiled it."
        },
        {
          "reference": "Exodus 21:7-11",
          "text": "And if a man sells his daughter as a servant, she is not to go free as the menservants do. / If she is displeasing in the eyes of her master who had designated her for himself, he must allow her to be redeemed. He has no right to sell her to foreigners, since he has broken faith with her. / And if he chooses her for his son, he must deal with her as with a daughter. ..."
        },
        {
          "reference": "1 Samuel 1:1-2",
          "text": "Now there was a man named Elkanah who was from Ramathaim-zophim in the hill country of Ephraim. He was the son of Jeroham, the son of Elihu, the son of Tohu, the son of Zuph, an Ephraimite. / He had two wives, one named Hannah and the other Peninnah. And Peninnah had children, but Hannah had none."
        },
        {
          "reference": "1 Samuel 1:10-11",
          "text": "In her bitter distress, Hannah prayed to the LORD and wept with many tears. / And she made a vow, saying, “O LORD of Hosts, if only You will look upon the affliction of Your maidservant and remember me, not forgetting Your maidservant but giving her a son, then I will dedicate him to the LORD all the days of his life, and no razor shall ever touch his head.”"
        },
        {
          "reference": "2 Samuel 5:13",
          "text": "After he had arrived from Hebron, David took more concubines and wives from Jerusalem, and more sons and daughters were born to him."
        },
        {
          "reference": "1 Kings 11:3",
          "text": "He had seven hundred wives of royal birth and three hundred concubines—and his wives turned his heart away."
        },
        {
          "reference": "1 Chronicles 7:13",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum—the descendants of Bilhah."
        },
        {
          "reference": "1 Chronicles 2:46-48",
          "text": "Caleb’s concubine Ephah was the mother of Haran, Moza, and Gazez. Haran was the father of Gazez. / The sons of Jahdai: Regem, Jotham, Geshan, Pelet, Ephah, and Shaaph. / Caleb’s concubine Maacah was the mother of Sheber and Tirhanah."
        },
        {
          "reference": "Matthew 1:2",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Matthew 1:20-21",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit. / She will give birth to a Son, and you are to give Him the name Jesus, because He will save His people from their sins.”"
        },
        {
          "reference": "Luke 3:34",
          "text": "the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor,"
        },
        {
          "reference": "John 4:5-6",
          "text": "So He came to a town of Samaria called Sychar, near the plot of ground that Jacob had given to his son Joseph. / Since Jacob’s well was there, Jesus, weary from His journey, sat down by the well. It was about the sixth hour."
        }
      ]
    },
    {
      "reference": "Genesis 30:11",
      "book": "Genesis",
      "chapter": 30,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Leah said, “What good fortune!” So she named him Gad."
        },
        {
          "version": "NLT",
          "text": "Leah named him Gad, for she said, “How fortunate I am!”"
        },
        {
          "version": "ESV",
          "text": "And Leah said, “Good fortune has come!” so she called his name Gad."
        },
        {
          "version": "NKJV",
          "text": "Then Leah said, “A troop comes!” So she called his name Gad."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:19",
          "text": "Gad will be attacked by raiders, but he will attack their heels."
        },
        {
          "reference": "Deuteronomy 33:20",
          "text": "Concerning Gad he said: “Blessed is he who enlarges the domain of Gad! He lies down like a lion and tears off an arm or a head."
        },
        {
          "reference": "Judges 11:1-2",
          "text": "Now Jephthah the Gileadite was a mighty man of valor; he was the son of a prostitute, and Gilead was his father. / And Gilead’s wife bore him sons who grew up, drove Jephthah out, and said to him, “You shall have no inheritance in our father’s house, because you are the son of another woman.”"
        },
        {
          "reference": "1 Chronicles 12:8",
          "text": "Some Gadites defected to David at his stronghold in the wilderness. They were mighty men of valor, trained for battle, experts with the shield and spear, whose faces were like the faces of lions and who were as swift as gazelles on the mountains:"
        },
        {
          "reference": "2 Kings 7:3-5",
          "text": "Now there were four men with leprosy at the entrance of the city gate, and they said to one another, “Why just sit here until we die? / If we say, ‘Let us go into the city,’ we will die there from the famine in the city; but if we sit here, we will also die. So come now, let us go over to the camp of the Arameans. If they let us live, we will live; if they kill us, we will die.” / So they arose at twilight and went to the camp of the Arameans. But when they came to the outskirts of the camp, there was not a man to be found."
        },
        {
          "reference": "Isaiah 65:11",
          "text": "But you who forsake the LORD, who forget My holy mountain, who set a table for Fortune and fill bowls of mixed wine for Destiny,"
        },
        {
          "reference": "Jeremiah 49:1",
          "text": "Concerning the Ammonites, this is what the LORD says: “Has Israel no sons? Is he without heir? Why then has Milcom taken possession of Gad? Why have his people settled in their cities?"
        },
        {
          "reference": "Hosea 9:1",
          "text": "Do not rejoice, O Israel, with exultation like the nations, for you have played the harlot against your God; you have made love for hire on every threshing floor."
        },
        {
          "reference": "Matthew 1:3",
          "text": "Judah was the father of Perez and Zerah by Tamar, Perez the father of Hezron, and Hezron the father of Ram."
        },
        {
          "reference": "Luke 3:33",
          "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah,"
        },
        {
          "reference": "John 1:45-46",
          "text": "Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.” / “Can anything good come from Nazareth?” Nathanael asked. “Come and see,” said Philip."
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Galatians 4:23",
          "text": "His son by the slave woman was born according to the flesh, but his son by the free woman was born through the promise."
        },
        {
          "reference": "Hebrews 11:20-21",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future. / By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        }
      ]
    },
    {
      "reference": "Genesis 30:12",
      "book": "Genesis",
      "chapter": 30,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "Leah’s servant Zilpah bore Jacob a second son."
        },
        {
          "version": "NLT",
          "text": "Then Zilpah gave Jacob a second son."
        },
        {
          "version": "ESV",
          "text": "Leah’s servant Zilpah bore Jacob a second son."
        },
        {
          "version": "NKJV",
          "text": "And Leah’s maid Zilpah bore Jacob a second son."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:24",
          "text": "And Laban gave his servant girl Zilpah to his daughter Leah as her maidservant."
        },
        {
          "reference": "Genesis 29:29",
          "text": "Laban also gave his servant girl Bilhah to his daughter Rachel as her maidservant."
        },
        {
          "reference": "Genesis 35:22-26",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons: / The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. ..."
        },
        {
          "reference": "Genesis 46:17",
          "text": "The children of Asher: Imnah, Ishvah, Ishvi, Beriah, and their sister Serah. The sons of Beriah: Heber and Malchiel."
        },
        {
          "reference": "Genesis 49:13",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon."
        },
        {
          "reference": "Numbers 26:26",
          "text": "These were the descendants of Zebulun by their clans: The Seredite clan from Sered, the Elonite clan from Elon, and the Jahleelite clan from Jahleel."
        },
        {
          "reference": "Deuteronomy 33:18",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents."
        },
        {
          "reference": "Joshua 19:10-16",
          "text": "The third lot came up for the clans of the tribe of Zebulun: The border of their inheritance stretched as far as Sarid. / It went up westward to Maralah, reached Dabbesheth, and met the brook east of Jokneam. / From Sarid it turned eastward along the border of Chisloth-tabor and went on to Daberath and up to Japhia. ..."
        },
        {
          "reference": "Judges 5:17",
          "text": "Gilead remained beyond the Jordan. Dan, why did you linger by the ships? Asher stayed at the coast and remained in his harbors."
        },
        {
          "reference": "1 Chronicles 7:13",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum—the descendants of Bilhah."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-15",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles—"
        },
        {
          "reference": "John 1:45",
          "text": "Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.”"
        },
        {
          "reference": "John 21:2",
          "text": "Simon Peter, Thomas called Didymus, Nathanael from Cana in Galilee, the sons of Zebedee, and two other disciples were together."
        },
        {
          "reference": "Acts 1:13",
          "text": "When they arrived, they went to the upper room where they were staying: Peter and John, James and Andrew, Philip and Thomas, Bartholomew and Matthew, James son of Alphaeus, Simon the Zealot, and Judas son of James."
        }
      ]
    },
    {
      "reference": "Genesis 30:13",
      "book": "Genesis",
      "chapter": 30,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Leah said, “How happy I am! The women will call me happy.” So she named him Asher."
        },
        {
          "version": "NLT",
          "text": "And Leah named him Asher, for she said, “What joy is mine! Now the other women will celebrate with me.”"
        },
        {
          "version": "ESV",
          "text": "And Leah said, “Happy am I! For women have called me happy.” So she called his name Asher."
        },
        {
          "version": "NKJV",
          "text": "Then Leah said, “I am happy, for the daughters will call me blessed.” So she called his name Asher."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:13",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon."
        },
        {
          "reference": "Deuteronomy 33:18",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents."
        },
        {
          "reference": "Isaiah 65:18-19",
          "text": "But be glad and rejoice forever in what I create; for I will create Jerusalem to be a joy and its people to be a delight. / I will rejoice in Jerusalem and take delight in My people. The sounds of weeping and crying will no longer be heard in her."
        },
        {
          "reference": "Luke 1:48",
          "text": "For He has looked with favor on the humble state of His servant. From now on all generations will call me blessed."
        },
        {
          "reference": "Ruth 4:14",
          "text": "Then the women said to Naomi, “Blessed be the LORD, who has not left you this day without a kinsman-redeemer. May his name become famous in Israel."
        },
        {
          "reference": "Proverbs 31:28",
          "text": "Her children rise up and call her blessed; her husband praises her as well:"
        },
        {
          "reference": "Psalm 127:3-5",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward. / Like arrows in the hand of a warrior, so are children born in one’s youth. / Blessed is the man whose quiver is full of them. He will not be put to shame when he confronts the enemies at the gate."
        },
        {
          "reference": "Psalm 128:1-4",
          "text": "A song of ascents. Blessed are all who fear the LORD, who walk in His ways! / For when you eat the fruit of your labor, blessings and prosperity will be yours. / Your wife will be like a fruitful vine flourishing within your house, your sons like olive shoots sitting around your table. ..."
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "1 Samuel 2:1",
          "text": "At that time Hannah prayed: “My heart rejoices in the LORD; my horn is exalted in the LORD. My mouth speaks boldly against my enemies, for I rejoice in Your salvation."
        },
        {
          "reference": "1 Samuel 2:21",
          "text": "So the LORD attended to Hannah, and she conceived and gave birth to three sons and two daughters. Meanwhile, the boy Samuel grew up in the presence of the LORD."
        },
        {
          "reference": "Job 29:11",
          "text": "For those who heard me called me blessed, and those who saw me commended me,"
        },
        {
          "reference": "Jeremiah 31:7",
          "text": "For this is what the LORD says: “Sing with joy for Jacob; shout for the foremost of the nations! Make your praises heard, and say, ‘O LORD, save Your people, the remnant of Israel!’"
        },
        {
          "reference": "Matthew 5:3-12",
          "text": "“Blessed are the poor in spirit, for theirs is the kingdom of heaven. / Blessed are those who mourn, for they will be comforted. / Blessed are the meek, for they will inherit the earth. ..."
        },
        {
          "reference": "Luke 6:20-23",
          "text": "Looking up at His disciples, Jesus said: “Blessed are you who are poor, for yours is the kingdom of God. / Blessed are you who hunger now, for you will be filled. Blessed are you who weep now, for you will laugh. / Blessed are you when people hate you, and when they exclude you and insult you and reject your name as evil because of the Son of Man. ..."
        }
      ]
    },
    {
      "reference": "Genesis 30:14",
      "book": "Genesis",
      "chapter": 30,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "During wheat harvest, Reuben went out into the fields and found some mandrake plants, which he brought to his mother Leah. Rachel said to Leah, “Please give me some of your son’s mandrakes.”"
        },
        {
          "version": "NLT",
          "text": "One day during the wheat harvest, Reuben found some mandrakes growing in a field and brought them to his mother, Leah. Rachel begged Leah, “Please give me some of your son’s mandrakes.”"
        },
        {
          "version": "ESV",
          "text": "In the days of wheat harvest Reuben went and found mandrakes in the field and brought them to his mother Leah. Then Rachel said to Leah, “Please give me some of your son’s mandrakes.”"
        },
        {
          "version": "NKJV",
          "text": "Now Reuben went in the days of wheat harvest and found mandrakes in the field, and brought them to his mother Leah. Then Rachel said to Leah, “Please give me some of your son’s mandrakes.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Numbers 11:5",
          "text": "We remember the fish we ate freely in Egypt, along with the cucumbers, melons, leeks, onions, and garlic."
        },
        {
          "reference": "Deuteronomy 33:14",
          "text": "with the bountiful harvest from the sun and the abundant yield of the seasons,"
        },
        {
          "reference": "Song of Solomon 7:13",
          "text": "The mandrakes send forth a fragrance, and at our door is every delicacy, new as well as old, that I have treasured up for you, my beloved."
        },
        {
          "reference": "2 Kings 4:39",
          "text": "One of them went out to the field to gather herbs, and he found a wild vine from which he gathered as many wild gourds as his garment could hold. Then he came back and cut them up into the pot of stew, though no one knew what they were."
        },
        {
          "reference": "Ruth 2:17",
          "text": "So Ruth gathered grain in the field until evening. And when she beat out what she had gleaned, it was about an ephah of barley."
        },
        {
          "reference": "Exodus 16:31",
          "text": "Now the house of Israel called the bread manna. It was white like coriander seed and tasted like wafers made with honey."
        },
        {
          "reference": "1 Samuel 25:18",
          "text": "Then Abigail hurried and took two hundred loaves of bread, two skins of wine, five butchered sheep, five seahs of roasted grain, a hundred clusters of raisins, and two hundred cakes of figs. She loaded them on donkeys"
        },
        {
          "reference": "2 Samuel 17:28-29",
          "text": "They brought beds, basins, and earthen vessels, as well as wheat, barley, flour, roasted grain, beans, lentils, / honey, curds, sheep, and cheese from the herd for David and his people to eat. For they said, “The people have become hungry, exhausted, and thirsty in the wilderness.”"
        },
        {
          "reference": "Ezekiel 47:12",
          "text": "Along both banks of the river, fruit trees of all kinds will grow. Their leaves will not wither, and their fruit will not fail. Each month they will bear fruit, because the water from the sanctuary flows to them. Their fruit will be used for food and their leaves for healing.”"
        },
        {
          "reference": "Isaiah 17:10-11",
          "text": "For you have forgotten the God of your salvation and failed to remember the Rock of your refuge. Therefore, though you cultivate delightful plots and set out cuttings from exotic vines— / though on the day you plant you make them grow, and on that morning you help your seed sprout—yet the harvest will vanish on the day of disease and incurable pain."
        },
        {
          "reference": "Matthew 13:44",
          "text": "The kingdom of heaven is like treasure hidden in a field. When a man found it, he hid it again, and in his joy he went and sold all he had and bought that field."
        },
        {
          "reference": "John 6:31",
          "text": "Our fathers ate the manna in the wilderness, as it is written: ‘He gave them bread from heaven to eat.’”"
        },
        {
          "reference": "John 6:49-51",
          "text": "Your fathers ate the manna in the wilderness, yet they died. / This is the bread that comes down from heaven, so that anyone may eat of it and not die. / I am the living bread that came down from heaven. If anyone eats of this bread, he will live forever. And this bread, which I will give for the life of the world, is My flesh.”"
        },
        {
          "reference": "Acts 7:11-12",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit."
        },
        {
          "reference": "Romans 14:17",
          "text": "For the kingdom of God is not a matter of eating and drinking, but of righteousness, peace, and joy in the Holy Spirit."
        }
      ]
    },
    {
      "reference": "Genesis 30:15",
      "book": "Genesis",
      "chapter": 30,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "But she said to her, “Wasn’t it enough that you took away my husband? Will you take my son’s mandrakes too?” “Very well,” Rachel said, “he can sleep with you tonight in return for your son’s mandrakes.”"
        },
        {
          "version": "NLT",
          "text": "But Leah angrily replied, “Wasn’t it enough that you stole my husband? Now will you steal my son’s mandrakes, too?” Rachel answered, “I will let Jacob sleep with you tonight if you give me some of the mandrakes.”"
        },
        {
          "version": "ESV",
          "text": "But she said to her, “Is it a small matter that you have taken away my husband? Would you take away my son’s mandrakes also?” Rachel said, “Then he may lie with you tonight in exchange for your son’s mandrakes.”"
        },
        {
          "version": "NKJV",
          "text": "But she said to her, “ Is it a small matter that you have taken away my husband? Would you take away my son’s mandrakes also?” And Rachel said, “Therefore he will lie with you tonight for your son’s mandrakes.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 16:2",
          "text": "So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "Genesis 29:18-20",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.” / Laban replied, “Better that I give her to you than to another. Stay here with me.” / So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 29:30",
          "text": "Jacob slept with Rachel as well, and indeed, he loved Rachel more than Leah. So he worked for Laban another seven years."
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 30:8",
          "text": "Then Rachel said, “In my great struggles, I have wrestled with my sister and won.” So she named him Naphtali."
        },
        {
          "reference": "Genesis 30:14",
          "text": "Now during the wheat harvest, Reuben went out and found some mandrakes in the field. When he brought them to his mother, Rachel begged Leah, “Please give me some of your son’s mandrakes.”"
        },
        {
          "reference": "Genesis 35:22",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons:"
        },
        {
          "reference": "Exodus 21:10",
          "text": "If he takes another wife, he must not reduce the food, clothing, or marital rights of his first wife."
        },
        {
          "reference": "Leviticus 18:18",
          "text": "You must not take your wife’s sister as a rival wife and have sexual relations with her while your wife is still alive."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Samuel 1:5-6",
          "text": "But to Hannah he would give a double portion, for he loved her even though the LORD had closed her womb. / Because the LORD had closed Hannah’s womb, her rival would provoke her viciously to taunt her."
        },
        {
          "reference": "1 Samuel 1:19-20",
          "text": "The next morning they got up early to bow in worship before the LORD, and then they returned home to Ramah. And Elkanah had relations with his wife Hannah, and the LORD remembered her. / So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "Ruth 4:13",
          "text": "So Boaz took Ruth, and she became his wife. And when he had relations with her, the LORD enabled her to conceive, and she gave birth to a son."
        }
      ]
    },
    {
      "reference": "Genesis 30:16",
      "book": "Genesis",
      "chapter": 30,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "So when Jacob came in from the fields that evening, Leah went out to meet him. “You must sleep with me,” she said. “I have hired you with my son’s mandrakes.” So he slept with her that night."
        },
        {
          "version": "NLT",
          "text": "So that evening, as Jacob was coming home from the fields, Leah went out to meet him. “You must come and sleep with me tonight!” she said. “I have paid for you with some mandrakes that my son found.” So that night he slept with Leah."
        },
        {
          "version": "ESV",
          "text": "When Jacob came from the field in the evening, Leah went out to meet him and said, “You must come in to me, for I have hired you with my son’s mandrakes.” So he lay with her that night."
        },
        {
          "version": "NKJV",
          "text": "When Jacob came out of the field in the evening, Leah went out to meet him and said, “You must come in to me, for I have surely hired you with my son’s mandrakes.” And he lay with her that night."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:32-35",
          "text": "And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.” / Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon. / Once again Leah conceived and gave birth to a son, and she said, “Now at last my husband will become attached to me, because I have borne him three sons.” So he was named Levi. ..."
        },
        {
          "reference": "Genesis 16:2-4",
          "text": "So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai. / So after he had lived in Canaan for ten years, his wife Sarai took her Egyptian maidservant Hagar and gave her to Abram to be his wife. / And he slept with Hagar, and she conceived. But when Hagar realized that she was pregnant, she began to despise her mistress."
        },
        {
          "reference": "Genesis 25:21-22",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived. / But the children inside her struggled with each other, and she said, “Why is this happening to me?” So Rebekah went to inquire of the LORD,"
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 38:8-10",
          "text": "Then Judah said to Onan, “Sleep with your brother’s wife. Perform your duty as her brother-in-law and raise up offspring for your brother.” / But Onan knew that the offspring would not belong to him; so whenever he would sleep with his brother’s wife, he would spill his seed on the ground so that he would not produce offspring for his brother. / What he did was wicked in the sight of the LORD, so He put Onan to death as well."
        },
        {
          "reference": "Genesis 49:3-4",
          "text": "Reuben, you are my firstborn, my might, and the beginning of my strength, excelling in honor, excelling in power. / Uncontrolled as the waters, you will no longer excel, because you went up to your father’s bed, onto my couch, and defiled it."
        },
        {
          "reference": "Exodus 21:10",
          "text": "If he takes another wife, he must not reduce the food, clothing, or marital rights of his first wife."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Samuel 1:19-20",
          "text": "The next morning they got up early to bow in worship before the LORD, and then they returned home to Ramah. And Elkanah had relations with his wife Hannah, and the LORD remembered her. / So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "1 Samuel 2:5",
          "text": "The well-fed hire themselves out for food, but the starving hunger no more. The barren woman gives birth to seven, but she who has many sons pines away."
        },
        {
          "reference": "Ruth 4:13",
          "text": "So Boaz took Ruth, and she became his wife. And when he had relations with her, the LORD enabled her to conceive, and she gave birth to a son."
        },
        {
          "reference": "2 Samuel 12:24",
          "text": "Then David comforted his wife Bathsheba, and he went to her and lay with her. So she gave birth to a son, and they named him Solomon. Now the LORD loved the child"
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "Matthew 1:18-25",
          "text": "This is how the birth of Jesus Christ came about: His mother Mary was pledged in marriage to Joseph, but before they came together, she was found to be with child through the Holy Spirit. / Because Joseph her husband was a righteous man and was unwilling to disgrace her publicly, he resolved to divorce her quietly. / But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit. ..."
        }
      ]
    },
    {
      "reference": "Genesis 30:17",
      "book": "Genesis",
      "chapter": 30,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "God listened to Leah, and she became pregnant and bore Jacob a fifth son."
        },
        {
          "version": "NLT",
          "text": "And God answered Leah’s prayers. She became pregnant again and gave birth to a fifth son for Jacob."
        },
        {
          "version": "ESV",
          "text": "And God listened to Leah, and she conceived and bore Jacob a fifth son."
        },
        {
          "version": "NKJV",
          "text": "And God listened to Leah, and she conceived and bore Jacob a fifth son."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "1 Samuel 1:19-20",
          "text": "The next morning they got up early to bow in worship before the LORD, and then they returned home to Ramah. And Elkanah had relations with his wife Hannah, and the LORD remembered her. / So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Genesis 16:11",
          "text": "The angel of the LORD proceeded: “Behold, you have conceived and will bear a son. And you shall name him Ishmael, for the LORD has heard your cry of affliction."
        },
        {
          "reference": "Genesis 33:5",
          "text": "When Esau looked up and saw the women and children, he asked, “Who are these with you?” Jacob answered, “These are the children God has graciously given your servant.”"
        },
        {
          "reference": "Genesis 49:25",
          "text": "by the God of your father who helps you, and by the Almighty who blesses you, with blessings of the heavens above, with blessings of the depths below, with blessings of the breasts and womb."
        },
        {
          "reference": "Ruth 4:13",
          "text": "So Boaz took Ruth, and she became his wife. And when he had relations with her, the LORD enabled her to conceive, and she gave birth to a son."
        },
        {
          "reference": "1 Samuel 2:21",
          "text": "So the LORD attended to Hannah, and she conceived and gave birth to three sons and two daughters. Meanwhile, the boy Samuel grew up in the presence of the LORD."
        },
        {
          "reference": "Luke 1:13",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        },
        {
          "reference": "Luke 1:24-25",
          "text": "After these days, his wife Elizabeth became pregnant and for five months remained in seclusion. She declared, / “The Lord has done this for me. In these days He has shown me favor and taken away my disgrace among the people.”"
        },
        {
          "reference": "Luke 1:36-37",
          "text": "Look, even Elizabeth your relative has conceived a son in her old age, and she who was called barren is in her sixth month. / For no word from God will ever fail.”"
        },
        {
          "reference": "Hebrews 11:11",
          "text": "By faith Sarah, even though she was barren and beyond the proper age, was enabled to conceive a child, because she considered Him faithful who had promised."
        },
        {
          "reference": "Romans 9:10-12",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.”"
        }
      ]
    },
    {
      "reference": "Genesis 30:18",
      "book": "Genesis",
      "chapter": 30,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Leah said, “God has rewarded me for giving my servant to my husband.” So she named him Issachar."
        },
        {
          "version": "NLT",
          "text": "She named him Issachar, for she said, “God has rewarded me for giving my servant to my husband as a wife.”"
        },
        {
          "version": "ESV",
          "text": "Leah said, “God has given me my wages because I gave my servant to my husband.” So she called his name Issachar."
        },
        {
          "version": "NKJV",
          "text": "Leah said, “God has given me my wages, because I have given my maid to my husband.” So she called his name Issachar."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:32",
          "text": "And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.”"
        },
        {
          "reference": "Genesis 49:13",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon."
        },
        {
          "reference": "Deuteronomy 33:18",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents."
        },
        {
          "reference": "Judges 5:18",
          "text": "Zebulun was a people who risked their lives; Naphtali, too, on the heights of the battlefield."
        },
        {
          "reference": "1 Chronicles 12:32",
          "text": "From Issachar, men who understood the times and knew what Israel should do: 200 chiefs with all their kinsmen at their command."
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Ruth 4:13-17",
          "text": "So Boaz took Ruth, and she became his wife. And when he had relations with her, the LORD enabled her to conceive, and she gave birth to a son. / Then the women said to Naomi, “Blessed be the LORD, who has not left you this day without a kinsman-redeemer. May his name become famous in Israel. / He will renew your life and sustain you in your old age. For your daughter-in-law, who loves you and is better to you than seven sons, has given him birth.” ..."
        },
        {
          "reference": "1 Samuel 1:20",
          "text": "So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "1 Samuel 2:21",
          "text": "So the LORD attended to Hannah, and she conceived and gave birth to three sons and two daughters. Meanwhile, the boy Samuel grew up in the presence of the LORD."
        },
        {
          "reference": "Isaiah 8:18",
          "text": "Here am I, and the children the LORD has given me as signs and symbols in Israel from the LORD of Hosts, who dwells on Mount Zion."
        },
        {
          "reference": "Matthew 1:2",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Luke 1:57-58",
          "text": "When the time came for Elizabeth to have her child, she gave birth to a son. / Her neighbors and relatives heard that the Lord had shown her great mercy, and they rejoiced with her."
        },
        {
          "reference": "Luke 1:13-14",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John. / He will be a joy and delight to you, and many will rejoice at his birth,"
        },
        {
          "reference": "John 16:21",
          "text": "A woman has pain in childbirth because her time has come; but when she brings forth her child, she forgets her anguish because of her joy that a child has been born into the world."
        },
        {
          "reference": "Romans 9:7-8",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        }
      ]
    },
    {
      "reference": "Genesis 30:19",
      "book": "Genesis",
      "chapter": 30,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "Leah conceived again and bore Jacob a sixth son."
        },
        {
          "version": "NLT",
          "text": "Then Leah became pregnant again and gave birth to a sixth son for Jacob."
        },
        {
          "version": "ESV",
          "text": "And Leah conceived again, and she bore Jacob a sixth son."
        },
        {
          "version": "NKJV",
          "text": "Then Leah conceived again and bore Jacob a sixth son."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:32-35",
          "text": "And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.” / Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon. / Once again Leah conceived and gave birth to a son, and she said, “Now at last my husband will become attached to me, because I have borne him three sons.” So he was named Levi. ..."
        },
        {
          "reference": "Genesis 35:23-26",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. / The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. ..."
        },
        {
          "reference": "Genesis 49:13-15",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon. / Issachar is a strong donkey, lying down between the sheepfolds. / He saw that his resting place was good and that his land was pleasant, so he bent his shoulder to the burden and submitted to labor as a servant."
        },
        {
          "reference": "Deuteronomy 33:18-19",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents. / They will call the peoples to a mountain; there they will offer sacrifices of righteousness. For they will feast on the abundance of the seas and the hidden treasures of the sand.”"
        },
        {
          "reference": "Joshua 19:10-16",
          "text": "The third lot came up for the clans of the tribe of Zebulun: The border of their inheritance stretched as far as Sarid. / It went up westward to Maralah, reached Dabbesheth, and met the brook east of Jokneam. / From Sarid it turned eastward along the border of Chisloth-tabor and went on to Daberath and up to Japhia. ..."
        },
        {
          "reference": "Judges 5:14-18",
          "text": "Some came from Ephraim, with their roots in Amalek; Benjamin came with your people after you. The commanders came down from Machir, the bearers of the marshal’s staff from Zebulun. / The princes of Issachar were with Deborah, and Issachar was with Barak, rushing into the valley at his heels. In the clans of Reuben there was great indecision. / Why did you sit among the sheepfolds to hear the whistling for the flocks? In the clans of Reuben there was great indecision. ..."
        },
        {
          "reference": "1 Chronicles 12:32-40",
          "text": "From Issachar, men who understood the times and knew what Israel should do: 200 chiefs with all their kinsmen at their command. / From Zebulun: 50,000 fit for service, trained for battle with all kinds of weapons of war, who with one purpose were devoted to David. / From Naphtali: 1,000 commanders, accompanied by 37,000 men with shield and spear. ..."
        },
        {
          "reference": "1 Chronicles 2:1-2",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, / Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Ezekiel 48:13-14",
          "text": "Bordering the territory of the priests, the Levites shall have an area 25,000 cubits long and 10,000 cubits wide. The whole length will be 25,000 cubits, and the width 10,000 cubits. / They must not sell or exchange any of it, and they must not transfer this best part of the land, for it is holy to the LORD."
        },
        {
          "reference": "Matthew 4:13-15",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles—"
        },
        {
          "reference": "Luke 2:36-38",
          "text": "There was also a prophetess named Anna, the daughter of Phanuel, of the tribe of Asher, who was well along in years. She had been married for seven years, / and then was a widow to the age of eighty-four. She never left the temple, but worshiped night and day, fasting and praying. / Coming forward at that moment, she gave thanks to God and spoke about the Child to all who were waiting for the redemption of Jerusalem."
        },
        {
          "reference": "John 1:45-46",
          "text": "Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.” / “Can anything good come from Nazareth?” Nathanael asked. “Come and see,” said Philip."
        },
        {
          "reference": "Acts 13:21-23",
          "text": "Then the people asked for a king, and God gave them Saul son of Kish, from the tribe of Benjamin, who ruled forty years. / After removing Saul, He raised up David as their king and testified about him: ‘I have found David son of Jesse a man after My own heart; he will carry out My will in its entirety.’ / From the descendants of this man, God has brought to Israel the Savior Jesus, as He promised."
        },
        {
          "reference": "Romans 11:1-2",
          "text": "I ask then, did God reject His people? Certainly not! I am an Israelite myself, a descendant of Abraham, from the tribe of Benjamin. / God did not reject His people, whom He foreknew. Do you not know what the Scripture says about Elijah, how he appealed to God against Israel:"
        }
      ]
    },
    {
      "reference": "Genesis 30:20",
      "book": "Genesis",
      "chapter": 30,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Leah said, “God has presented me with a precious gift. This time my husband will treat me with honor, because I have borne him six sons.” So she named him Zebulun."
        },
        {
          "version": "NLT",
          "text": "She named him Zebulun, for she said, “God has given me a good reward. Now my husband will treat me with respect, for I have given him six sons.”"
        },
        {
          "version": "ESV",
          "text": "Then Leah said, “God has endowed me with a good endowment; now my husband will honor me, because I have borne him six sons.” So she called his name Zebulun."
        },
        {
          "version": "NKJV",
          "text": "And Leah said, “God has endowed me with a good endowment; now my husband will dwell with me, because I have borne him six sons.” So she called his name Zebulun."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:32",
          "text": "And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.”"
        },
        {
          "reference": "Genesis 35:23",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun."
        },
        {
          "reference": "Genesis 49:13",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon."
        },
        {
          "reference": "Deuteronomy 33:18",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents."
        },
        {
          "reference": "Joshua 19:10-16",
          "text": "The third lot came up for the clans of the tribe of Zebulun: The border of their inheritance stretched as far as Sarid. / It went up westward to Maralah, reached Dabbesheth, and met the brook east of Jokneam. / From Sarid it turned eastward along the border of Chisloth-tabor and went on to Daberath and up to Japhia. ..."
        },
        {
          "reference": "Judges 5:18",
          "text": "Zebulun was a people who risked their lives; Naphtali, too, on the heights of the battlefield."
        },
        {
          "reference": "1 Chronicles 12:33",
          "text": "From Zebulun: 50,000 fit for service, trained for battle with all kinds of weapons of war, who with one purpose were devoted to David."
        },
        {
          "reference": "1 Chronicles 12:40",
          "text": "And their neighbors from as far away as Issachar, Zebulun, and Naphtali came bringing food on donkeys, camels, mules, and oxen—abundant supplies of flour, fig cakes and raisin cakes, wine and oil, oxen and sheep. Indeed, there was joy in Israel."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-15",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles—"
        },
        {
          "reference": "John 1:45",
          "text": "Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.”"
        },
        {
          "reference": "John 21:2",
          "text": "Simon Peter, Thomas called Didymus, Nathanael from Cana in Galilee, the sons of Zebedee, and two other disciples were together."
        },
        {
          "reference": "Revelation 7:5",
          "text": "From the tribe of Judah 12,000 were sealed, from the tribe of Reuben 12,000, from the tribe of Gad 12,000,"
        },
        {
          "reference": "Genesis 49:19",
          "text": "Gad will be attacked by raiders, but he will attack their heels."
        },
        {
          "reference": "Deuteronomy 33:20",
          "text": "Concerning Gad he said: “Blessed is he who enlarges the domain of Gad! He lies down like a lion and tears off an arm or a head."
        }
      ]
    },
    {
      "reference": "Genesis 30:21",
      "book": "Genesis",
      "chapter": 30,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "Some time later she gave birth to a daughter and named her Dinah."
        },
        {
          "version": "NLT",
          "text": "Later she gave birth to a daughter and named her Dinah."
        },
        {
          "version": "ESV",
          "text": "Afterward she bore a daughter and called her name Dinah."
        },
        {
          "version": "NKJV",
          "text": "Afterward she bore a daughter, and called her name Dinah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:32-35",
          "text": "And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.” / Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon. / Once again Leah conceived and gave birth to a son, and she said, “Now at last my husband will become attached to me, because I have borne him three sons.” So he was named Levi. ..."
        },
        {
          "reference": "Genesis 35:23-26",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. / The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. ..."
        },
        {
          "reference": "Genesis 46:15",
          "text": "These are the sons of Leah born to Jacob in Paddan-aram, in addition to his daughter Dinah. The total number of sons and daughters was thirty-three."
        },
        {
          "reference": "Genesis 49:13-21",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon. / Issachar is a strong donkey, lying down between the sheepfolds. / He saw that his resting place was good and that his land was pleasant, so he bent his shoulder to the burden and submitted to labor as a servant. ..."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Numbers 26:22-27",
          "text": "These were the clans of Judah, and their registration numbered 76,500. / These were the descendants of Issachar by their clans: The Tolaite clan from Tola, the Punite clan from Puvah, / the Jashubite clan from Jashub, and the Shimronite clan from Shimron. ..."
        },
        {
          "reference": "Deuteronomy 33:18-19",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents. / They will call the peoples to a mountain; there they will offer sacrifices of righteousness. For they will feast on the abundance of the seas and the hidden treasures of the sand.”"
        },
        {
          "reference": "Joshua 19:10-16",
          "text": "The third lot came up for the clans of the tribe of Zebulun: The border of their inheritance stretched as far as Sarid. / It went up westward to Maralah, reached Dabbesheth, and met the brook east of Jokneam. / From Sarid it turned eastward along the border of Chisloth-tabor and went on to Daberath and up to Japhia. ..."
        },
        {
          "reference": "Judges 5:17",
          "text": "Gilead remained beyond the Jordan. Dan, why did you linger by the ships? Asher stayed at the coast and remained in his harbors."
        },
        {
          "reference": "1 Chronicles 2:1-2",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, / Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."
        },
        {
          "reference": "1 Chronicles 7:13",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum—the descendants of Bilhah."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-15",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles—"
        },
        {
          "reference": "Luke 2:36",
          "text": "There was also a prophetess named Anna, the daughter of Phanuel, of the tribe of Asher, who was well along in years. She had been married for seven years,"
        },
        {
          "reference": "John 1:45-46",
          "text": "Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.” / “Can anything good come from Nazareth?” Nathanael asked. “Come and see,” said Philip."
        }
      ]
    },
    {
      "reference": "Genesis 30:22",
      "book": "Genesis",
      "chapter": 30,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "Then God remembered Rachel; he listened to her and enabled her to conceive."
        },
        {
          "version": "NLT",
          "text": "Then God remembered Rachel’s plight and answered her prayers by enabling her to have children."
        },
        {
          "version": "ESV",
          "text": "Then God remembered Rachel, and God listened to her and opened her womb."
        },
        {
          "version": "NKJV",
          "text": "Then God remembered Rachel, and God listened to her and opened her womb."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Samuel 1:19-20",
          "text": "The next morning they got up early to bow in worship before the LORD, and then they returned home to Ramah. And Elkanah had relations with his wife Hannah, and the LORD remembered her. / So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Psalm 113:9",
          "text": "He settles the barren woman in her home as a joyful mother to her children. Hallelujah!"
        },
        {
          "reference": "Luke 1:13",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John."
        },
        {
          "reference": "Luke 1:24-25",
          "text": "After these days, his wife Elizabeth became pregnant and for five months remained in seclusion. She declared, / “The Lord has done this for me. In these days He has shown me favor and taken away my disgrace among the people.”"
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "1 Samuel 2:21",
          "text": "So the LORD attended to Hannah, and she conceived and gave birth to three sons and two daughters. Meanwhile, the boy Samuel grew up in the presence of the LORD."
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "Luke 1:36-37",
          "text": "Look, even Elizabeth your relative has conceived a son in her old age, and she who was called barren is in her sixth month. / For no word from God will ever fail.”"
        },
        {
          "reference": "Genesis 16:1-2",
          "text": "Now Abram’s wife Sarai had borne him no children, but she had an Egyptian maidservant named Hagar. / So Sarai said to Abram, “Look now, the LORD has prevented me from bearing children. Please go to my maidservant; perhaps I can build a family by her.” And Abram listened to the voice of Sarai."
        },
        {
          "reference": "Genesis 18:10",
          "text": "Then the LORD said, “I will surely return to you at this time next year, and your wife Sarah will have a son!” Now Sarah was behind him, listening at the entrance to the tent."
        },
        {
          "reference": "Genesis 17:19",
          "text": "But God replied, “Your wife Sarah will indeed bear you a son, and you are to name him Isaac. I will establish My covenant with him as an everlasting covenant for his descendants after him."
        },
        {
          "reference": "Exodus 2:24",
          "text": "So God heard their groaning, and He remembered His covenant with Abraham, Isaac, and Jacob."
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        }
      ]
    },
    {
      "reference": "Genesis 30:23",
      "book": "Genesis",
      "chapter": 30,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "She became pregnant and gave birth to a son and said, “God has taken away my disgrace.”"
        },
        {
          "version": "NLT",
          "text": "She became pregnant and gave birth to a son. “God has removed my disgrace,” she said."
        },
        {
          "version": "ESV",
          "text": "She conceived and bore a son and said, “God has taken away my reproach.”"
        },
        {
          "version": "NKJV",
          "text": "And she conceived and bore a son, and said, “God has taken away my reproach.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Samuel 1:20",
          "text": "So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "Isaiah 54:1",
          "text": "“Shout for joy, O barren woman, who bears no children; break forth in song and cry aloud, you who have never travailed; because more are the children of the desolate woman than of her who has a husband,” says the LORD."
        },
        {
          "reference": "Luke 1:25",
          "text": "“The Lord has done this for me. In these days He has shown me favor and taken away my disgrace among the people.”"
        },
        {
          "reference": "Genesis 21:6",
          "text": "Then Sarah said, “God has made me laugh, and everyone who hears of this will laugh with me.”"
        },
        {
          "reference": "Psalm 113:9",
          "text": "He settles the barren woman in her home as a joyful mother to her children. Hallelujah!"
        },
        {
          "reference": "Luke 1:13-14",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John. / He will be a joy and delight to you, and many will rejoice at his birth,"
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "1 Samuel 2:1-2",
          "text": "At that time Hannah prayed: “My heart rejoices in the LORD; my horn is exalted in the LORD. My mouth speaks boldly against my enemies, for I rejoice in Your salvation. / There is no one holy like the LORD. Indeed, there is no one besides You! And there is no Rock like our God."
        },
        {
          "reference": "Isaiah 49:21",
          "text": "Then you will say in your heart, ‘Who has begotten these for me? I was bereaved and barren; I was exiled and rejected. So who has reared them? Look, I was left all alone, so where did they come from?’”"
        },
        {
          "reference": "Luke 1:57-58",
          "text": "When the time came for Elizabeth to have her child, she gave birth to a son. / Her neighbors and relatives heard that the Lord had shown her great mercy, and they rejoiced with her."
        },
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "1 Samuel 1:6-7",
          "text": "Because the LORD had closed Hannah’s womb, her rival would provoke her viciously to taunt her. / And this went on year after year. Whenever Hannah went up to the house of the LORD, her rival taunted her until she wept and would not eat."
        },
        {
          "reference": "Isaiah 66:9",
          "text": "Shall I bring a baby to the point of birth and not deliver it?” says the LORD. “Or will I who deliver close the womb?” says your God."
        }
      ]
    },
    {
      "reference": "Genesis 30:24",
      "book": "Genesis",
      "chapter": 30,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "She named him Joseph, and said, “May the LORD add to me another son.”"
        },
        {
          "version": "NLT",
          "text": "And she named him Joseph, for she said, “May the LORD add yet another son to my family.”"
        },
        {
          "version": "ESV",
          "text": "And she called his name Joseph, saying, “May the LORD add to me another son!”"
        },
        {
          "version": "NKJV",
          "text": "So she called his name Joseph, and said, “The LORD shall add to me another son.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 35:17-18",
          "text": "During her severe labor, the midwife said to her, “Do not be afraid, for you are having another son.” / And with her last breath—for she was dying—she named him Ben-oni. But his father called him Benjamin."
        },
        {
          "reference": "Genesis 41:51-52",
          "text": "Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "1 Samuel 1:20",
          "text": "So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "Genesis 21:6-7",
          "text": "Then Sarah said, “God has made me laugh, and everyone who hears of this will laugh with me.” / She added, “Who would have told Abraham that Sarah would nurse children? Yet I have borne him a son in his old age.”"
        },
        {
          "reference": "Genesis 29:32",
          "text": "And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.”"
        },
        {
          "reference": "Genesis 48:16",
          "text": "the angel who has redeemed me from all harm—may He bless these boys. And may they be called by my name and the names of my fathers Abraham and Isaac, and may they grow into a multitude upon the earth.”"
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "Exodus 1:7",
          "text": "but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Deuteronomy 33:13-17",
          "text": "Concerning Joseph he said: “May his land be blessed by the LORD with the precious dew from heaven above and the deep waters that lie beneath, / with the bountiful harvest from the sun and the abundant yield of the seasons, / with the best of the ancient mountains and the bounty of the everlasting hills, ..."
        },
        {
          "reference": "Psalm 127:3-5",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward. / Like arrows in the hand of a warrior, so are children born in one’s youth. / Blessed is the man whose quiver is full of them. He will not be put to shame when he confronts the enemies at the gate."
        },
        {
          "reference": "Psalm 128:3-4",
          "text": "Your wife will be like a fruitful vine flourishing within your house, your sons like olive shoots sitting around your table. / In this way indeed shall blessing come to the man who fears the LORD."
        },
        {
          "reference": "Isaiah 49:20-21",
          "text": "Yet the children of your bereavement will say in your hearing, ‘This place is too small for us; make room for us to live here.’ / Then you will say in your heart, ‘Who has begotten these for me? I was bereaved and barren; I was exiled and rejected. So who has reared them? Look, I was left all alone, so where did they come from?’”"
        },
        {
          "reference": "Matthew 1:21",
          "text": "She will give birth to a Son, and you are to give Him the name Jesus, because He will save His people from their sins.”"
        },
        {
          "reference": "Luke 1:13-14",
          "text": "But the angel said to him, “Do not be afraid, Zechariah, because your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to give him the name John. / He will be a joy and delight to you, and many will rejoice at his birth,"
        },
        {
          "reference": "Luke 1:57-60",
          "text": "When the time came for Elizabeth to have her child, she gave birth to a son. / Her neighbors and relatives heard that the Lord had shown her great mercy, and they rejoiced with her. / On the eighth day, when they came to circumcise the child, they were going to name him after his father Zechariah. ..."
        }
      ]
    },
    {
      "reference": "Genesis 30:25",
      "book": "Genesis",
      "chapter": 30,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "After Rachel gave birth to Joseph, Jacob said to Laban, “Send me on my way so I can go back to my own homeland."
        },
        {
          "version": "NLT",
          "text": "Soon after Rachel had given birth to Joseph, Jacob said to Laban, “Please release me so I can go home to my own country."
        },
        {
          "version": "ESV",
          "text": "As soon as Rachel had borne Joseph, Jacob said to Laban, “Send me away, that I may go to my own home and country."
        },
        {
          "version": "NKJV",
          "text": "And it came to pass, when Rachel had borne Joseph, that Jacob said to Laban, “Send me away, that I may go to my own place and to my country."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:13",
          "text": "I am the God of Bethel, where you anointed the pillar and made a solemn vow to Me. Now get up, leave this land at once, and return to your native land.’”"
        },
        {
          "reference": "Genesis 31:3",
          "text": "Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 31:55",
          "text": "Early the next morning, Laban got up and kissed his grandchildren and daughters and blessed them. Then he left to return home."
        },
        {
          "reference": "Genesis 31:18",
          "text": "and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Genesis 31:17",
          "text": "Then Jacob got up and put his children and his wives on camels,"
        },
        {
          "reference": "Genesis 31:30",
          "text": "Now you have gone off because you long for your father’s house. But why have you stolen my gods?”"
        },
        {
          "reference": "Genesis 31:24",
          "text": "But that night God came to Laban the Aramean in a dream and warned him, “Be careful not to say anything to Jacob, either good or bad.”"
        },
        {
          "reference": "Genesis 31:20",
          "text": "Moreover, Jacob deceived Laban the Aramean by not telling him that he was running away."
        },
        {
          "reference": "Genesis 31:21",
          "text": "So he fled with all his possessions, crossed the Euphrates, and headed for the hill country of Gilead."
        },
        {
          "reference": "Genesis 31:22",
          "text": "On the third day Laban was informed that Jacob had fled."
        },
        {
          "reference": "Genesis 31:19",
          "text": "Now while Laban was out shearing his sheep, Rachel stole her father’s household idols."
        },
        {
          "reference": "Genesis 31:32",
          "text": "If you find your gods with anyone here, he shall not live! In the presence of our relatives, see for yourself if anything is yours, and take it back.” For Jacob did not know that Rachel had stolen the idols."
        },
        {
          "reference": "Genesis 31:33",
          "text": "So Laban went into Jacob’s tent, then Leah’s tent, and then the tents of the two maidservants, but he found nothing. Then he left Leah’s tent and entered Rachel’s tent."
        },
        {
          "reference": "Genesis 31:34",
          "text": "Now Rachel had taken Laban’s household idols, put them in the saddlebag of her camel, and was sitting on them. And Laban searched everything in the tent but found nothing."
        },
        {
          "reference": "Genesis 31:35",
          "text": "Rachel said to her father, “Sir, do not be angry that I cannot stand up before you; for I am having my period.” So Laban searched but could not find the household idols."
        }
      ]
    },
    {
      "reference": "Genesis 30:26",
      "book": "Genesis",
      "chapter": 30,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "Give me my wives and children, for whom I have served you, and I will be on my way. You know how much work I’ve done for you.”"
        },
        {
          "version": "NLT",
          "text": "Let me take my wives and children, for I have earned them by serving you, and let me be on my way. You certainly know how hard I have worked for you.”"
        },
        {
          "version": "ESV",
          "text": "Give me my wives and my children for whom I have served you, that I may go, for you know the service that I have given you.”"
        },
        {
          "version": "NKJV",
          "text": "Give me my wives and my children for whom I have served you, and let me go; for you know my service which I have done for you.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 31:38-40",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes."
        },
        {
          "reference": "Genesis 31:6-7",
          "text": "You know that I have served your father with all my strength. / And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:14-16",
          "text": "And Rachel and Leah replied, “Do we have any portion or inheritance left in our father’s house? / Are we not regarded by him as outsiders? Not only has he sold us, but he has certainly squandered what was paid for us. / Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 31:18",
          "text": "and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Genesis 31:32",
          "text": "If you find your gods with anyone here, he shall not live! In the presence of our relatives, see for yourself if anything is yours, and take it back.” For Jacob did not know that Rachel had stolen the idols."
        },
        {
          "reference": "Genesis 31:43",
          "text": "But Laban answered Jacob, “These daughters are my daughters, these sons are my sons, and these flocks are my flocks! Everything you see is mine! Yet what can I do today about these daughters of mine or the children they have borne?"
        },
        {
          "reference": "Genesis 31:55",
          "text": "Early the next morning, Laban got up and kissed his grandchildren and daughters and blessed them. Then he left to return home."
        },
        {
          "reference": "Exodus 21:2",
          "text": "If you buy a Hebrew servant, he is to serve you for six years. But in the seventh year, he shall go free without paying anything."
        },
        {
          "reference": "Deuteronomy 15:12-14",
          "text": "If a fellow Hebrew, a man or a woman, is sold to you and serves you six years, then in the seventh year you must set him free. / And when you release him, do not send him away empty-handed. / You are to furnish him liberally from your flock, your threshing floor, and your winepress. You shall give to him as the LORD your God has blessed you."
        },
        {
          "reference": "1 Samuel 18:25-27",
          "text": "Saul replied, “Say to David, ‘The king desires no other dowry but a hundred Philistine foreskins as revenge on his enemies.’” But Saul intended to cause David’s death at the hands of the Philistines. / When the servants reported these terms to David, he was pleased to become the king’s son-in-law. Before the wedding day arrived, / David and his men went out and killed two hundred Philistines. He brought their foreskins and presented them as payment in full to become the king’s son-in-law. Then Saul gave his daughter Michal to David in marriage."
        },
        {
          "reference": "1 Samuel 25:10-11",
          "text": "But Nabal asked them, “Who is David? Who is this son of Jesse? Many servants these days are breaking away from their masters. / Why should I take my bread and water and the meat I have slaughtered for my shearers, and give them to these men whose origin I do not know?”"
        },
        {
          "reference": "2 Samuel 19:17",
          "text": "along with a thousand men of Benjamin, as well as Ziba the steward of the house of Saul and his fifteen sons and twenty servants. They rushed down to the Jordan before the king"
        },
        {
          "reference": "Nehemiah 5:8",
          "text": "and said, “We have done our best to buy back our Jewish brothers who were sold to foreigners, but now you are selling your own brothers, that they may be sold back to us!” But they remained silent, for they could find nothing to say."
        },
        {
          "reference": "Job 7:1-2",
          "text": "“Is not man consigned to labor on earth? Are not his days like those of a hired hand? / Like a slave he longs for shade; like a hireling he waits for his wages."
        }
      ]
    },
    {
      "reference": "Genesis 30:27",
      "book": "Genesis",
      "chapter": 30,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "But Laban said to him, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.”"
        },
        {
          "version": "NLT",
          "text": "“Please listen to me,” Laban replied. “I have become wealthy, for the LORD has blessed me because of you."
        },
        {
          "version": "ESV",
          "text": "But Laban said to him, “If I have found favor in your sight, I have learned by divination that the LORD has blessed me because of you."
        },
        {
          "version": "NKJV",
          "text": "And Laban said to him, “Please stay, if I have found favor in your eyes, for I have learned by experience that the LORD has blessed me for your sake.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 39:3",
          "text": "When his master saw that the LORD was with him and made him prosper in all he did,"
        },
        {
          "reference": "Genesis 26:24",
          "text": "and that night the LORD appeared to him and said, “I am the God of your father Abraham. Do not be afraid, for I am with you. I will bless you and multiply your descendants for the sake of My servant Abraham.”"
        },
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 24:35",
          "text": "“The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 31:7-9",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. / Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 39:5",
          "text": "From the time that he put Joseph in charge of his household and all he owned, the LORD blessed the Egyptian’s household on account of him. The LORD’s blessing was on everything he owned, both in his house and in his field."
        },
        {
          "reference": "Exodus 23:25",
          "text": "So you shall serve the LORD your God, and He will bless your bread and your water. And I will take away sickness from among you."
        },
        {
          "reference": "Deuteronomy 28:2-6",
          "text": "And all these blessings will come upon you and overtake you, if you will obey the voice of the LORD your God: / You will be blessed in the city and blessed in the country. / The fruit of your womb will be blessed, as well as the produce of your land and the offspring of your livestock—the calves of your herds and the lambs of your flocks. ..."
        },
        {
          "reference": "Numbers 24:9",
          "text": "He crouches, he lies down like a lion, like a lioness—who dares to rouse him? Blessed are those who bless you and cursed are those who curse you.”"
        },
        {
          "reference": "Psalm 1:3",
          "text": "He is like a tree planted by streams of water, yielding its fruit in season, whose leaf does not wither, and who prospers in all he does."
        },
        {
          "reference": "Psalm 128:1-2",
          "text": "A song of ascents. Blessed are all who fear the LORD, who walk in His ways! / For when you eat the fruit of your labor, blessings and prosperity will be yours."
        },
        {
          "reference": "Proverbs 10:22",
          "text": "The blessing of the LORD enriches, and He adds no sorrow to it."
        },
        {
          "reference": "Isaiah 61:9",
          "text": "Their descendants will be known among the nations, and their offspring among the peoples. All who see them will acknowledge that they are a people the LORD has blessed."
        },
        {
          "reference": "Malachi 3:10-12",
          "text": "Bring the full tithe into the storehouse, so that there may be food in My house. Test Me in this,” says the LORD of Hosts. “See if I will not open the windows of heaven and pour out for you blessing without measure. / I will rebuke the devourer for you, so that it will not destroy the fruits of your land, and the vine in your field will not fail to produce fruit,” says the LORD of Hosts. / “Then all the nations will call you blessed, for you will be a land of delight,” says the LORD of Hosts."
        }
      ]
    },
    {
      "reference": "Genesis 30:28",
      "book": "Genesis",
      "chapter": 30,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "He added, “Name your wages, and I will pay them.”"
        },
        {
          "version": "NLT",
          "text": "Tell me how much I owe you. Whatever it is, I’ll pay it.”"
        },
        {
          "version": "ESV",
          "text": "Name your wages, and I will give it.”"
        },
        {
          "version": "NKJV",
          "text": "Then he said, “Name me your wages, and I will give it. ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:7-9",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. / Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:41-42",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times! / If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 29:15",
          "text": "Laban said to him, “Just because you are my relative, should you work for nothing? Tell me what your wages should be.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "1 Samuel 18:25",
          "text": "Saul replied, “Say to David, ‘The king desires no other dowry but a hundred Philistine foreskins as revenge on his enemies.’” But Saul intended to cause David’s death at the hands of the Philistines."
        },
        {
          "reference": "1 Kings 10:10",
          "text": "Then she gave the king 120 talents of gold, a great quantity of spices, and precious stones. Never again were spices in such abundance brought in as those the queen of Sheba gave to King Solomon."
        },
        {
          "reference": "2 Chronicles 9:12",
          "text": "King Solomon gave the queen of Sheba all she desired—whatever she asked—far more than she had brought the king. Then she left and returned to her own country, along with her servants."
        },
        {
          "reference": "Ruth 2:12",
          "text": "May the LORD repay your work, and may you receive a rich reward from the LORD, the God of Israel, under whose wings you have taken refuge.”"
        },
        {
          "reference": "Proverbs 10:22",
          "text": "The blessing of the LORD enriches, and He adds no sorrow to it."
        },
        {
          "reference": "Proverbs 13:22",
          "text": "A good man leaves an inheritance to his children’s children, but the sinner’s wealth is passed to the righteous."
        },
        {
          "reference": "Matthew 10:10",
          "text": "Take no bag for the road, or second tunic, or sandals, or staff; for the worker is worthy of his provisions."
        },
        {
          "reference": "Luke 10:7",
          "text": "Stay at the same house, eating and drinking whatever you are offered. For the worker is worthy of his wages. Do not move around from house to house."
        },
        {
          "reference": "1 Corinthians 9:7-14",
          "text": "Who serves as a soldier at his own expense? Who plants a vineyard and does not eat of its fruit? Who tends a flock and does not drink of its milk? / Do I say this from a human perspective? Doesn’t the Law say the same thing? / For it is written in the Law of Moses: “Do not muzzle an ox while it is treading out the grain.” Is it about oxen that God is concerned? ..."
        },
        {
          "reference": "1 Timothy 5:18",
          "text": "For the Scripture says, “Do not muzzle an ox while it is treading out the grain,” and, “The worker is worthy of his wages.”"
        }
      ]
    },
    {
      "reference": "Genesis 30:29",
      "book": "Genesis",
      "chapter": 30,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob said to him, “You know how I have worked for you and how your livestock has fared under my care."
        },
        {
          "version": "NLT",
          "text": "Jacob replied, “You know how hard I’ve worked for you, and how your flocks and herds have grown under my care."
        },
        {
          "version": "ESV",
          "text": "Jacob said to him, “You yourself know how I have served you, and how your livestock has fared with me."
        },
        {
          "version": "NKJV",
          "text": "So Jacob said to him, “You know how I have served you and how your livestock has been with me."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:6-9",
          "text": "You know that I have served your father with all my strength. / And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. ..."
        },
        {
          "reference": "Genesis 31:38-42",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes. ..."
        },
        {
          "reference": "Genesis 29:18-20",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.” / Laban replied, “Better that I give her to you than to another. Stay here with me.” / So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 31:12",
          "text": "‘Look up,’ he said, ‘and see that all the males that are mating with the flock are streaked, spotted, or speckled; for I have seen all that Laban has done to you."
        },
        {
          "reference": "Genesis 31:16",
          "text": "Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 31:1",
          "text": "Now Jacob heard that Laban’s sons were saying, “Jacob has taken away all that belonged to our father and built all this wealth at our father’s expense.”"
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Deuteronomy 15:14",
          "text": "You are to furnish him liberally from your flock, your threshing floor, and your winepress. You shall give to him as the LORD your God has blessed you."
        },
        {
          "reference": "1 Samuel 25:10-11",
          "text": "But Nabal asked them, “Who is David? Who is this son of Jesse? Many servants these days are breaking away from their masters. / Why should I take my bread and water and the meat I have slaughtered for my shearers, and give them to these men whose origin I do not know?”"
        },
        {
          "reference": "1 Kings 17:13-16",
          "text": "“Do not be afraid,” Elijah said to her. “Go and do as you have said. But first make me a small cake of bread from what you have, and bring it out to me. Afterward, make some for yourself and your son, / for this is what the LORD, the God of Israel, says: ‘The jar of flour will not be exhausted and the jug of oil will not run dry until the day the LORD sends rain upon the face of the earth.’” / So she went and did according to the word of Elijah, and there was food every day for Elijah and the woman and her household. ..."
        },
        {
          "reference": "2 Kings 4:1-7",
          "text": "Now the wife of one of the sons of the prophets cried out to Elisha, “Your servant, my husband, is dead, and you know that your servant feared the LORD. And now his creditor is coming to take my two children as his slaves!” / “How can I help you?” asked Elisha. “Tell me, what do you have in the house?” She answered, “Your servant has nothing in the house but a jar of oil.” / “Go,” said Elisha, “borrow empty jars from all your neighbors. Do not gather just a few. ..."
        },
        {
          "reference": "Job 42:10-12",
          "text": "After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions. / All his brothers and sisters and prior acquaintances came and dined with him in his house. They consoled him and comforted him over all the adversity that the LORD had brought upon him. And each one gave him a piece of silver and a gold ring. / So the LORD blessed Job’s latter days more than his first. He owned 14,000 sheep, 6,000 camels, 1,000 yoke of oxen, and 1,000 female donkeys."
        }
      ]
    },
    {
      "reference": "Genesis 30:30",
      "book": "Genesis",
      "chapter": 30,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "The little you had before I came has increased greatly, and the LORD has blessed you wherever I have been. But now, when may I do something for my own household?”"
        },
        {
          "version": "NLT",
          "text": "You had little indeed before I came, but your wealth has increased enormously. The LORD has blessed you through everything I’ve done. But now, what about me? When can I start providing for my own family?”"
        },
        {
          "version": "ESV",
          "text": "For you had little before I came, and it has increased abundantly, and the LORD has blessed you wherever I turned. But now when shall I provide for my own household also?”"
        },
        {
          "version": "NKJV",
          "text": "For what you had before I came was little, and it has increased to a great amount; the LORD has blessed you since my coming. And now, when shall I also provide for my own house?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:7-9",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. / Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:38-42",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes. ..."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 29:18-20",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.” / Laban replied, “Better that I give her to you than to another. Stay here with me.” / So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 12:2",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing."
        },
        {
          "reference": "Genesis 13:2",
          "text": "And Abram had become extremely wealthy in livestock and silver and gold."
        },
        {
          "reference": "Genesis 24:35",
          "text": "“The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys."
        },
        {
          "reference": "Genesis 26:12-14",
          "text": "Now Isaac sowed seed in the land, and that very year he reaped a hundredfold. And the LORD blessed him, / and he became richer and richer, until he was exceedingly wealthy. / He owned so many flocks and herds and servants that the Philistines envied him."
        },
        {
          "reference": "Genesis 39:5",
          "text": "From the time that he put Joseph in charge of his household and all he owned, the LORD blessed the Egyptian’s household on account of him. The LORD’s blessing was on everything he owned, both in his house and in his field."
        },
        {
          "reference": "Exodus 23:25",
          "text": "So you shall serve the LORD your God, and He will bless your bread and your water. And I will take away sickness from among you."
        },
        {
          "reference": "Deuteronomy 28:3-6",
          "text": "You will be blessed in the city and blessed in the country. / The fruit of your womb will be blessed, as well as the produce of your land and the offspring of your livestock—the calves of your herds and the lambs of your flocks. / Your basket and kneading bowl will be blessed. ..."
        },
        {
          "reference": "Proverbs 10:22",
          "text": "The blessing of the LORD enriches, and He adds no sorrow to it."
        },
        {
          "reference": "Psalm 1:3",
          "text": "He is like a tree planted by streams of water, yielding its fruit in season, whose leaf does not wither, and who prospers in all he does."
        },
        {
          "reference": "Psalm 23:1",
          "text": "A Psalm of David. The LORD is my shepherd; I shall not want."
        },
        {
          "reference": "Psalm 128:1-2",
          "text": "A song of ascents. Blessed are all who fear the LORD, who walk in His ways! / For when you eat the fruit of your labor, blessings and prosperity will be yours."
        }
      ]
    },
    {
      "reference": "Genesis 30:31",
      "book": "Genesis",
      "chapter": 30,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "“What shall I give you?” he asked. &#8220Don’t give me anything,” Jacob replied. &#8220But if you will do this one thing for me, I will go on tending your flocks and watching over them:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nlt/genesis/30.htm\">New Living Translation</a></span><br />&#8220;What wages do you want?&#8221; Laban asked again. Jacob replied, &#8220;Don&#8217;t give me anything. Just do this one thing, and I&#8217;ll continue to tend and watch over your flocks.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/esv/genesis/30.htm\">English Standard Version</a></span><br />He said, &#8220;What shall I give you?&#8221; Jacob said, &#8220;You shall not give me anything. If you will do this for me, I will again pasture your flock and keep it:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/bsb/genesis/30.htm\">Berean Standard Bible</a></span><br />&#8220;What can I give you?&#8221; Laban asked. &#8220;You do not need to give me anything,&#8221; Jacob replied. &#8220;If you do this one thing for me, I will keep on shepherding and keeping your flocks.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/kjv/genesis/30.htm\">King James Bible</a></span><br />And he said, What shall I give thee? And Jacob said, Thou shalt not give me any thing: if thou wilt do this thing for me, I will again feed <i>and</i> keep thy flock:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nkjv/genesis/30.htm\">New King James Version</a></span><br />So he said, &#8220;What shall I give you?&#8221; And Jacob said, &#8220;You shall not give me anything. If you will do this thing for me, I will again feed and keep your flocks:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nasb_/genesis/30.htm\">New American Standard Bible</a></span><br />So he said, &#8220;What shall I give you?&#8221; And Jacob said, &#8220;You shall not give me anything. If you will do this <i>one</i> thing for me, I will again pasture <i>and</i> keep your flock:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nasb/genesis/30.htm\">NASB 1995</a></span><br />So he said, &#8220What shall I give you?&#8221 And Jacob said, &#8220You shall not give me anything. If you will do this one thing for me, I will again pasture and keep your flock:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nasb77/genesis/30.htm\">NASB 1977 </a></span><br />So he said, &#8220;What shall I give you?&#8221; And Jacob said, &#8220;You shall not give me anything. If you will do this <i>one</i> thing for me, I will again pasture <i>and</i> keep your flock:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/lsb/genesis/30.htm\">Legacy Standard Bible </a></span><br />So he said, &#8220;What shall I give you?&#8221; And Jacob said, &#8220;You shall not give me anything. If you will do this <i>one</i> thing for me, I will again pasture <i>and</i> keep your flock:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/amp/genesis/30.htm\">Amplified Bible</a></span><br />Laban asked, &#8220;What shall I give you?&#8221; Jacob replied, &#8220;You shall not give me anything. But if you will do this one thing for me [which I now propose], I will again pasture and keep your flock:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/csb/genesis/30.htm\">Christian Standard Bible</a></span><br />Laban asked, &#8220;What should I give you? &#8221; And Jacob said, &#8220;You don&#8217;t need to give me anything. If you do this one thing for me, I will continue to shepherd and keep your flock.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/hcsb/genesis/30.htm\">Holman Christian Standard Bible</a></span><br />Laban asked, &#8220What should I give you?&#8221 And Jacob said, &#8220You don&#8217t need to give me anything. If you do this one thing for me, I will continue to shepherd and keep your flock. <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/asv/genesis/30.htm\">American Standard Version</a></span><br />And he said, What shall I give thee? And Jacob said, Thou shalt not give me aught: if thou wilt do this thing for me, I will again feed thy flock and keep it.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/cev/genesis/30.htm\">Contemporary English Version</a></span><br />\"How much do you want me to pay you?\" Laban asked. Then Jacob told him: I don't want you to pay me anything. Just do one thing, and I'll take care of your sheep and goats. <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/erv/genesis/30.htm\">English Revised Version</a></span><br />And he said, What shall I give thee? And Jacob said, Thou shalt not give me aught: if thou wilt do this thing for me, I will again feed thy flock and keep it.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/gwt/genesis/30.htm\">GOD'S WORD&reg; Translation</a></span><br />Laban asked, \"What should I give you?\" \"Don't give me anything,\" Jacob answered. \"Instead, do something for me, then I'll go back to taking care of and watching your flocks again.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/gnt/genesis/30.htm\">Good News Translation</a></span><br />\"What shall I pay you?\" Laban asked. Jacob answered, \"I don't want any wages. I will continue to take care of your flocks if you agree to this suggestion: <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/isv/genesis/30.htm\">International Standard Version</a></span><br />\"What do I have to give you?\" Laban asked. Jacob responded, \"You don't have to give me anything. Just do this for me: Let me tend your flock again and watch over it. <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/net/genesis/30.htm\">NET Bible</a></span><br />So Laban asked, \"What should I give you?\" \"You don't need to give me a thing,\" Jacob replied, \"but if you agree to this one condition, I will continue to care for your flocks and protect them:<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nheb/genesis/30.htm\">New Heart English Bible</a></span><br />He said, \"What should I give you?\" Jacob said, \"You do not need to give me anything. If you will do this one thing for me, I will again pasture your flock and take care of it.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/wbt/genesis/30.htm\">Webster's Bible Translation</a></span><br />And he said, What shall I give thee? And Jacob said, Thou shalt not give me any thing; if thou wilt do this thing for me, I will again feed and keep thy flock:<div class=\"vheading2\"><b>Majority Text Translations</b></div><span class=\"versiontext\"><a href=\"/msb/genesis/30.htm\">Majority Standard Bible</a></span><br />&#8220;What can I give you?&#8221; Laban asked. &#8220;You do not need to give me anything,&#8221; Jacob replied. &#8220;If you do this one thing for me, I will keep on shepherding and keeping your flocks.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/web/genesis/30.htm\">World English Bible</a></span><br />Laban said, &#8220;What shall I give you?&#8221; Jacob said, &#8220;You shall not give me anything. If you will do this thing for me, I will again feed your flock and keep it. <div class=\"vheading2\"><b>Literal Translations</b></div><span class=\"versiontext\"><a href=\"/lsv/genesis/30.htm\">Literal Standard Version</a></span><br />And he says, &#8220;What do I give to you?&#8221; And Jacob says, &#8220;You do not give me anything; if you do this thing for me, I turn back; I have delight; I watch your flock;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/ylt/genesis/30.htm\">Young's Literal Translation</a></span><br /> And he saith, 'What do I give to thee?' And Jacob saith, 'Thou dost not give me anything; if thou do for me this thing, I turn back; I have delight; thy flock I watch;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/slt/genesis/30.htm\">Smith's Literal Translation</a></span><br />And he will say, What shall I give to thee? and Jacob will say, Thou shalt not give to me anything. If thou wilt do to me this word, I will return; I will feed thy sheep; I will watch.<div class=\"vheading2\"><b>Catholic Translations</b></div><span class=\"versiontext\"><a href=\"/drb/genesis/30.htm\">Douay-Rheims Bible</a></span><br />And Laban said: What shall I give thee? But he said: I require nothing: but if thou wilt do what I demand, I will feed, and keep thy sheep again. <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/cpdv/genesis/30.htm\">Catholic Public Domain Version</a></span><br />And Laban said, &#8220;What shall I give to you?&#8221; But he said, &#8220;I want nothing. But if you will do what I ask, I will feed and guard your sheep again.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nabre/genesis/30.htm\">New American Bible</a></span><br />Laban asked, &#8220;What should I give you?&#8221; Jacob answered: &#8220;You do not have to give me anything. If you do this thing for me, I will again pasture and tend your sheep.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nrsvce/genesis/30.htm\">New Revised Standard Version</a></span><br />He said, &#8220;What shall I give you?&#8221; Jacob said, &#8220;You shall not give me anything; if you will do this for me, I will again feed your flock and keep it:<div class=\"vheading2\"><b>Translations from Aramaic</b></div><span class=\"versiontext\"><a href=\"/lamsa/genesis/30.htm\">Lamsa Bible</a></span><br />And Laban said, What shall I give you? And Jacob said, You shall not give me anything; if you will do for me the thing which I will tell you, I will go back to feed and keep your flock.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/hpbt/genesis/30.htm\">Peshitta Holy Bible Translated</a></span><br />Laban said to him, &#8220;What shall I give to you?&#8221; Yaquuv said to him, &#8220;You will give me nothing, if you make the response to me that I shall tell you. I shall return, I shall tend and I shall keep your sheep.<div class=\"vheading2\"><b>OT Translations</b></div><span class=\"versiontext\"><a href=\"/jps/genesis/30.htm\">JPS Tanakh 1917</a></span><br />And he said: 'What shall I give thee?' And Jacob said: 'Thou shalt not give me aught; if thou wilt do this thing for me, I will again feed thy flock and keep it.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/sep/genesis/30.htm\">Brenton Septuagint Translation</a></span><br />And Laban said to him, What shall I give thee? and Jacob said to him, Thou shalt not give me anything; if thou wilt do this thing for me, I will again tend thy flocks and keep them.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/parallel/genesis/30-31.htm\">Additional Translations ...</a></span></div></div></div><div id=\"centbox\"><div class=\"padcent\"><a name=\"audio\" id=\"audio\"></a><div class=\"vheadingv\"><b>Audio Bible</b></div><iframe width=\"100%\" src=\"https://www.youtube.com/embed/7ehevn8iSgc?start=7420\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe><span class=\"p\"><br /><br /><br /></span><div class=\"vheadingv\"><b>Context</b></div><span class=\"hdg\"><a href=\"/bsb/genesis/30.htm\">Jacob Prospers</a></span><br>&#8230;<span class=\"reftext\">30</span>Indeed, you had very little before my arrival, but now your wealth has increased many times over. The LORD has blessed you wherever I set foot. But now, when may I also provide for my own household?&#8221; <span class=\"reftext\">31</span><span class=\"highl\"><a href=\"/hebrew/4100.htm\" title=\"4100: m&#257;h (Interrog) -- What? how? anything. \">&#8220;What</a> <a href=\"/hebrew/5414.htm\" title=\"5414: &#8217;et&#183;ten- (V-Qal-Imperf-1cs) -- To give, put, set. A primitive root; to give, used with greatest latitude of application.\">can I give</a> <a href=\"/hebrew/l&#257;&#7733; (Prep:: 2ms) -- \">you?&#8221;</a> <a href=\"/hebrew/559.htm\" title=\"559: way&#183;y&#333;&#183;mer (Conj-w:: V-Qal-ConsecImperf-3ms) -- To utter, say. A primitive root; to say.\">Laban asked.</a> <a href=\"/hebrew/3808.htm\" title=\"3808: l&#333;- (Adv-NegPrt) -- Not. Or lowi; or loh; a primitive particle; not; by implication, no; often used with other particles.\">&#8220;You do not</a> <a href=\"/hebrew/5414.htm\" title=\"5414: &#7791;it&#183;ten- (V-Qal-Imperf-2ms) -- To give, put, set. A primitive root; to give, used with greatest latitude of application.\">need to give</a> <a href=\"/hebrew/l&#238; (Prep:: 1cs) -- \">me</a> <a href=\"/hebrew/3972.htm\" title=\"3972: m&#601;&#183;&#8217;&#363;&#183;m&#257;h (N-ms) -- Anything. Apparently a form of m'uwm; properly, a speck or point, i.e. something; with negative, nothing.\">anything,&#8221;</a> <a href=\"/hebrew/3290.htm\" title=\"3290: ya&#183;&#8216;a&#774;&#183;q&#333;&#7687; (N-proper-ms) -- A son of Isaac, also his desc. From aqab; heel-catcher; Jaakob, the Israelitish patriarch.\">Jacob replied.</a> <a href=\"/hebrew/559.htm\" title=\"559: way&#183;y&#333;&#183;mer (Conj-w:: V-Qal-ConsecImperf-3ms) -- To utter, say. A primitive root; to say.\"></a> <a href=\"/hebrew/518.htm\" title=\"518: &#8217;im- (Conj) -- If. A primitive particle; used very widely as demonstrative, lo!\">&#8220;If</a> <a href=\"/hebrew/6213.htm\" title=\"6213: ta&#183;&#8216;a&#774;&#183;&#347;eh- (V-Qal-Imperf-2ms) -- To do, make. A primitive root; to do or make, in the broadest sense and widest application.\">you do</a> <a href=\"/hebrew/2088.htm\" title=\"2088: haz&#183;zeh (Art:: Pro-ms) -- This, here. A primitive word; the masculine demonstrative pronoun, this or that.\">this</a> <a href=\"/hebrew/1697.htm\" title=\"1697: had&#183;d&#257;&#183;&#7687;&#257;r (Art:: N-ms) -- Speech, word. From dabar; a word; by implication, a matter or thing; adverbially, a cause.\">one thing</a> <a href=\"/hebrew/l&#238; (Prep:: 1cs) -- \">for me,</a> <a href=\"/hebrew/7725.htm\" title=\"7725: &#8217;&#257;&#183;&#353;&#363;&#183;&#7687;&#257;h (V-Qal-Imperf.Cohort-1cs) -- A primitive root; to turn back transitively or intransitively, literally or figuratively; generally to retreat; often adverbial, again.\">I will keep on</a> <a href=\"/hebrew/7462.htm\" title=\"7462: &#8217;er&#183;&#8216;eh (V-Qal-Imperf.h-1cs) -- A primitive root; to tend a flock; i.e. Pasture it; intransitively, to graze; generally to rule; by extension, to associate with.\">shepherding</a> <a href=\"/hebrew/8104.htm\" title=\"8104: &#8217;e&#353;&#183;m&#333;r (V-Qal-Imperf.h-1cs) -- To keep, watch, preserve. A primitive root; properly, to hedge about, i.e. Guard; generally, to protect, attend to, etc.\">and keeping</a> <a href=\"/hebrew/6629.htm\" title=\"6629: &#7779;&#333;&#183;n&#601;&#183;&#7733;&#257; (N-fsc:: 2ms) -- Small cattle, sheep and goats, flock. Or tsaown; from an unused root meaning to migrate; a collective name for a flock; also figuratively.\">your flocks.</a> </span><span class=\"reftext\">32</span>Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb, and every spotted or speckled goat. These will be my wages.&#8230;<div class=\"cred\"><a href=\"//berean.bible\">Berean Standard Bible</a> &middot; <a href=\"//berean.bible/downloads.htm\">Download</a></div><span class=\"p\"><br /><br /></span><a name=\"crossref\" id=\"crossref\"></a><div class=\"vheading\">Cross References</div><div id=\"crf\"><span class=\"crossverse\"><a href=\"/genesis/31-7.htm\">Genesis 31:7-9</a></span><br />And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, &#8216;The speckled will be your wages,&#8217; then the whole flock bore speckled offspring. If he said, &#8216;The streaked will be your wages,&#8217; then the whole flock bore streaked offspring. / Thus God has taken away your father&#8217;s livestock and given them to me.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/genesis/31-41.htm\">Genesis 31:41-42</a></span><br />Thus for twenty years I have served in your household&#8212;fourteen years for your two daughters and six years for your flocks&#8212;and you have changed my wages ten times! / If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.&#8221;<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/exodus/12-35.htm\">Exodus 12:35-36</a></span><br />Furthermore, the Israelites acted on Moses&#8217; word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/1_samuel/25-2.htm\">1 Samuel 25:2-3</a></span><br />Now there was a man in Maon whose business was in Carmel. He was a very wealthy man with a thousand goats and three thousand sheep, which he was shearing in Carmel. / His name was Nabal, and his wife&#8217;s name was Abigail. She was an intelligent and beautiful woman, but her husband, a Calebite, was harsh and evil in his dealings.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/1_samuel/25-10.htm\">1 Samuel 25:10-11</a></span><br />But Nabal asked them, &#8220;Who is David? Who is this son of Jesse? Many servants these days are breaking away from their masters. / Why should I take my bread and water and the meat I have slaughtered for my shearers, and give them to these men whose origin I do not know?&#8221;<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/2_samuel/19-32.htm\">2 Samuel 19:32</a></span><br />Barzillai was quite old, eighty years of age, and since he was a very wealthy man, he had provided for the king while he stayed in Mahanaim.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/job/42-10.htm\">Job 42:10-12</a></span><br />After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions. / All his brothers and sisters and prior acquaintances came and dined with him in his house. They consoled him and comforted him over all the adversity that the LORD had brought upon him. And each one gave him a piece of silver and a gold ring. / So the LORD blessed Job&#8217;s latter days more than his first. He owned 14,000 sheep, 6,000 camels, 1,000 yoke of oxen, and 1,000 female donkeys.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/proverbs/13-22.htm\">Proverbs 13:22</a></span><br />A good man leaves an inheritance to his children&#8217;s children, but the sinner&#8217;s wealth is passed to the righteous.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/proverbs/27-23.htm\">Proverbs 27:23-27</a></span><br />Be sure to know the state of your flocks, and pay close attention to your herds; / for riches are not forever, nor does a crown endure to every generation. / When hay is removed and new growth appears and the grass from the hills is gathered, ...<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/isaiah/61-6.htm\">Isaiah 61:6</a></span><br />But you will be called the priests of the LORD; they will speak of you as ministers of our God; you will feed on the wealth of nations, and you will boast in their riches.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/ezekiel/34-27.htm\">Ezekiel 34:27</a></span><br />The trees of the field will give their fruit, and the land will yield its produce; My flock will be secure in their land. Then they will know that I am the LORD, when I have broken the bars of their yoke and delivered them from the hands that enslaved them.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/matthew/6-26.htm\">Matthew 6:26</a></span><br />Look at the birds of the air: They do not sow or reap or gather into barns, and yet your heavenly Father feeds them. Are you not much more valuable than they?<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/matthew/10-29.htm\">Matthew 10:29-31</a></span><br />Are not two sparrows sold for a penny? Yet not one of them will fall to the ground apart from the will of your Father. / And even the very hairs of your head are all numbered. / So do not be afraid; you are worth more than many sparrows.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/luke/12-24.htm\">Luke 12:24</a></span><br />Consider the ravens: They do not sow or reap, they have no storehouse or barn; yet God feeds them. How much more valuable you are than the birds!<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/luke/16-10.htm\">Luke 16:10-12</a></span><br />Whoever is faithful with very little will also be faithful with much, and whoever is dishonest with very little will also be dishonest with much. / So if you have not been faithful with worldly wealth, who will entrust you with true riches? / And if you have not been faithful with the belongings of another, who will give you belongings of your own?</div><span class=\"p\"><br /><br /></span><a name=\"tsk\" id=\"tsk\"><div class=\"vheading\">Treasury of Scripture</div><p class=\"tsk2\">And he said, What shall I give you? And Jacob said, You shall not give me any thing: if you will do this thing for me, I will again feed and keep your flock.</p><p class=\"tskverse\"><b><a href=\"/2_samuel/21-4.htm\">2 Samuel 21:4-6</a></b></br> And the Gibeonites said unto him, We will have no silver nor gold of Saul, nor of his house; neither for us shalt thou kill any man in Israel. And he said, What ye shall say, <i>that</i> will I do for you&#8230; </p><p class=\"tskverse\"><b><a href=\"/psalms/118-8.htm\">Psalm 118:8</a></b></br> <i>It is</i> better to trust in the LORD than to put confidence in man.</p><p class=\"tskverse\"><b><a href=\"/hebrews/13-5.htm\">Hebrews 13:5</a></b></br> <i>Let your</i> conversation <i>be</i> without covetousness; <i>and be</i> content with such things as ye have: for he hath said, I will never leave thee, nor forsake thee.</p><div class=\"vheading\">Jump to Previous</div><a href=\"/genesis/14-23.htm\">Aught</a> <a href=\"/genesis/30-29.htm\">Care</a> <a href=\"/genesis/3-6.htm\">Delight</a> <a href=\"/genesis/29-7.htm\">Feed</a> <a href=\"/genesis/29-10.htm\">Flock</a> <a href=\"/genesis/29-8.htm\">Flocks</a> <a href=\"/genesis/30-29.htm\">Jacob</a> <a href=\"/genesis/29-7.htm\">Pasture</a> <a href=\"/romans/1-17.htm\">Tending</a> <a href=\"/genesis/28-15.htm\">Turn</a> <a href=\"/genesis/28-20.htm\">Watch</a> <a href=\"/revelation/18-15.htm\">Watching</a> <a href=\"/genesis/30-15.htm\">Wilt</a><div class=\"vheading2\">Jump to Next</div><a href=\"/genesis/39-6.htm\">Aught</a> <a href=\"/genesis/30-35.htm\">Care</a> <a href=\"/genesis/34-19.htm\">Delight</a> <a href=\"/genesis/37-12.htm\">Feed</a> <a href=\"/genesis/30-32.htm\">Flock</a> <a href=\"/genesis/30-36.htm\">Flocks</a> <a href=\"/genesis/30-36.htm\">Jacob</a> <a href=\"/genesis/37-12.htm\">Pasture</a> <a href=\"/1_samuel/16-11.htm\">Tending</a> <a href=\"/genesis/31-3.htm\">Turn</a> <a href=\"/genesis/31-49.htm\">Watch</a> <a href=\"/exodus/12-42.htm\">Watching</a> <a href=\"/genesis/38-16.htm\">Wilt</a><div class=\"vheading2\">Genesis 30</div><span class=\"reftext\">1. </span><span class=\"outlinetext\"><a href=\"/genesis/30-1.htm\">Rachel, in grief for her barrenness, gives Bilhah her maid unto Jacob.</a></span><br><span class=\"reftext\">5. </span><span class=\"outlinetext\"><a href=\"/genesis/30-5.htm\">Bilhah bears Dan and Naphtali.</a></span><br><span class=\"reftext\">9. </span><span class=\"outlinetext\"><a href=\"/genesis/30-9.htm\">Leah gives Zilpah her maid, who bears Gad and Asher.</a></span><br><span class=\"reftext\">14. </span><span class=\"outlinetext\"><a href=\"/genesis/30-14.htm\">Reuben finds mandrakes, </a></span><br><span class=\"reftext\">15. </span><span class=\"outlinetext\"><a href=\"/genesis/30-15.htm\">with which Leah buys her husband's company of Rachel.</a></span><br><span class=\"reftext\">17. </span><span class=\"outlinetext\"><a href=\"/genesis/30-17.htm\">Leah bears Issachar, Zebulun, and Dinah.</a></span><br><span class=\"reftext\">22. </span><span class=\"outlinetext\"><a href=\"/genesis/30-22.htm\">Rachel bears Joseph.</a></span><br><span class=\"reftext\">25. </span><span class=\"outlinetext\"><a href=\"/genesis/30-25.htm\">Jacob desires to depart.</a></span><br><span class=\"reftext\">27. </span><span class=\"outlinetext\"><a href=\"/genesis/30-27.htm\">Laban detains him on a new agreement.</a></span><br><span class=\"reftext\">37. </span><span class=\"outlinetext\"><a href=\"/genesis/30-37.htm\">Jacob's policy, whereby he becomes rich.</a></span><br></div></div><div id=\"mdd\"><div align=\"center\"><div class=\"bot2\"><table align=\"center\" width=\"100%\"><tr><td><div align=\"center\"> <script id=\"3d27ed63fc4348d5b062c4527ae09445\"> (new Image()).src = 'https://capi.connatix.com/tr/si?token=51ce25d5-1a8c-424a-8695-4bd48c750f35&cid=3a9f82d0-4344-4f8d-ac0c-e1a0eb43a405'; </script> <script id=\"b817b7107f1d4a7997da1b3c33457e03\"> (new Image()).src = 'https://capi.connatix.com/tr/si?token=cb0edd8b-b416-47eb-8c6d-3cc96561f7e8&cid=3a9f82d0-4344-4f8d-ac0c-e1a0eb43a405'; </script><br /><br /> <!-- /1078254/BH-728x90-ATF --> <div id='div-gpt-ad-1529103594582-2'> </div><br /><br /> <!-- /1078254/BH-300x250-ATF --> <div id='div-gpt-ad-1529103594582-0' style='max-width: 300px;'> </div><br /><br /> <!-- /1078254/BH-728x90-BTF --> <div id='div-gpt-ad-1529103594582-3'> </div><br /><br /> <!-- /1078254/BH-300x250-BTF --> <div id='div-gpt-ad-1529103594582-1' style='max-width: 300px;'> </div><br /><br /> <!-- /1078254/BH-728x90-BTF2 --> <div align=\"center\" id='div-gpt-ad-1531425649696-0'> </div><br /><br /> <ins class=\"adsbygoogle\" style=\"display:inline-block;width:200px;height:200px\" data-ad-client=\"ca-pub-3753401421161123\" data-ad-slot=\"3592799687\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> <br /><br /> </div> </td></tr></table></div></div></div><div id=\"combox\"><div class=\"padcom\"><a name=\"study\" id=\"study\"></a><div class=\"vheading\"><table width=\"100%\"><tr><td width=\"99%\" valign=\"top\"><a href=\"/study/genesis/30.htm\">Study Bible</a></td><td width=\"1%\" valign=\"top\"><a href=\"/study/genesis/\" title=\"Book Summary and Study\">Book&nbsp;&#9702;</a>&nbsp;<a href=\"/study/chapters/genesis/30.htm\" title=\"Chapter summary and Study\">Chapter&nbsp;</a></tr></table></div><b>&#8220;What can I give you?&#8221; Laban asked.</b><br>Laban's question reflects the cultural norms of the time, where a worker's wages were often negotiated directly with the employer. In the ancient Near East, it was customary for a servant or worker to receive compensation for their labor, often in the form of livestock or goods. Laban's inquiry also reveals his awareness of Jacob's valuable contribution to his household, as Jacob's presence had brought prosperity to Laban (<a href=\"/genesis/30-27.htm\">Genesis 30:27</a>). This question sets the stage for the negotiation that follows, highlighting the dynamics of their relationship.<p><b>&#8220;You do not need to give me anything,&#8221; Jacob replied.</b><br>Jacob's response indicates his desire for independence and self-sufficiency. By refusing a direct gift, Jacob seeks to establish a fair agreement based on his own labor and God's provision. This reflects a broader biblical theme of reliance on God's blessing rather than human generosity. Jacob's confidence in God's provision is reminiscent of Abraham's faith, who also trusted in God's promises (<a href=\"/genesis/15-6.htm\">Genesis 15:6</a>). This phrase underscores the importance of integrity and trust in divine providence.<p><b>&#8220;If you do this one thing for me,</b><br>Jacob proposes a specific condition, demonstrating his shrewdness and understanding of animal husbandry. His request is strategic, aiming to ensure a fair outcome while relying on God's blessing. This reflects the biblical principle of wise stewardship and planning, as seen in <a href=\"/proverbs/21-5.htm\">Proverbs 21:5</a>, which emphasizes the value of diligent planning. Jacob's condition also foreshadows the miraculous increase of his flocks, illustrating God's faithfulness to His covenant promises.<p><b>I will keep on shepherding and keeping your flocks.&#8221;</b><br>Jacob's commitment to continue working for Laban highlights his dedication and work ethic. Shepherding was a common occupation in the ancient Near East, requiring skill and diligence. Jacob's willingness to remain in Laban's service, despite previous hardships, demonstrates perseverance and responsibility. This mirrors the biblical call to work diligently as unto the Lord (<a href=\"/colossians/3-23.htm\">Colossians 3:23</a>). Additionally, Jacob's role as a shepherd can be seen as a type of Christ, the Good Shepherd, who cares for His flock (<a href=\"/john/10-11.htm\">John 10:11</a>).<div class=\"vheading2\">Persons / Places / Events</div>1. <b><a href=\"/topical/j/jacob.htm\">Jacob</a></b><br>The grandson of Abraham, son of Isaac, and brother of Esau. He is a central figure in Genesis, known for his cunning and his role in the lineage of the Israelites.<br><br>2. <b><a href=\"/topical/l/laban.htm\">Laban</a></b><br>Jacob's uncle and father-in-law, known for his deceptive nature. He is the brother of Rebekah, Jacob's mother.<br><br>3. <b><a href=\"/topical/s/shepherding.htm\">Shepherding</a></b><br>The act of tending to and managing flocks, which was Jacob's occupation while living with Laban.<br><br>4. <b><a href=\"/topical/f/flocks.htm\">Flocks</a></b><br>Refers to the sheep and goats that Jacob tended for Laban, which were central to the wealth and livelihood of the time.<br><br>5. <b><a href=\"/topical/p/paddan-aram.htm\">Paddan-aram</a></b><br>The region where Laban lived and where Jacob fled to escape his brother Esau's wrath. It is also where Jacob married Leah and Rachel.<div class=\"vheading2\">Teaching Points</div><b><a href=\"/topical/g/god's_provision.htm\">God's Provision</a></b><br>Jacob's response to Laban shows his trust in God's provision rather than relying on human generosity. Believers are encouraged to trust in God's ability to provide for their needs.<br><br><b><a href=\"/topical/i/integrity_in_work.htm\">Integrity in Work</a></b><br>Jacob's willingness to continue working for Laban without immediate compensation highlights the importance of integrity and diligence in our work, trusting that God sees and rewards our efforts.<br><br><b><a href=\"/topical/n/negotiation_and_wisdom.htm\">Negotiation and Wisdom</a></b><br>Jacob's negotiation with Laban demonstrates wisdom and strategic thinking. Christians are encouraged to seek God's wisdom in their dealings with others.<br><br><b><a href=\"/topical/f/faith_in_adversity.htm\">Faith in Adversity</a></b><br>Despite Laban's deceit, Jacob's faith in God's promise remained steadfast. Believers can learn to maintain faith and integrity even when faced with challenging circumstances.<div class=\"vheading2\">Bible Study Questions and Answers</div><span class=\"count\">1. </span><a href=\"/q/What_does_Genesis_30_31_mean.htm\">What is the meaning of Genesis 30:31?</a><span class=\"p\"><br /><br /></span><span class=\"count\">2. </span><a href=\"/q/Jacob_s_trust_in_God_s_provision.htm\">How does Jacob's request in Genesis 30:31 demonstrate trust in God's provision? </a><span class=\"p\"><br /><br /></span><span class=\"count\">3. </span><a href=\"/q/Genesis_30_31_God_s_role_in_work.htm\">What does Genesis 30:31 reveal about God's role in our daily work? </a><span class=\"p\"><br /><br /></span><span class=\"count\">4. </span><a href=\"/q/Jacob_s_negotiation_decision_guide.htm\">How can Jacob's negotiation in Genesis 30:31 guide our own decision-making? </a><span class=\"p\"><br /><br /></span><span class=\"count\">5. </span><a href=\"/q/Genesis_30_31_links_to_Abraham_s_promises.htm\">What scriptural connections exist between Genesis 30:31 and God's promises to Abraham? </a><span class=\"p\"><br /><br /></span><span class=\"count\">6. </span><a href=\"/q/Apply_Jacob_s_faith_to_finances.htm\">How can we apply Jacob's faith in Genesis 30:31 to our financial decisions?</a><span class=\"p\"><br /><br /></span><span class=\"count\">7. </span><a href=\"/q/Genesis_30_31_God_s_role_in_prosperity.htm\">How does Genesis 30:31 reflect God's involvement in human affairs and prosperity? </a><span class=\"p\"><br /><br /></span><span class=\"count\">8. </span><a href=\"/q/Jacob_s_character_and_faith_in_Gen_30_31.htm\">What does Jacob's negotiation in Genesis 30:31 reveal about his character and faith? </a><span class=\"p\"><br /><br /></span><span class=\"count\">9. </span><a href=\"/q/Genesis_30_31_Divine_providence_theme.htm\">How does Genesis 30:31 illustrate the theme of divine providence in the Bible? </a><span class=\"p\"><br /><br /></span><span class=\"count\">10. </span><a href=\"/top10/lessons_from_genesis_30.htm\">What are the top 10 Lessons from Genesis 30?</a><span class=\"p\"><br /><br /></span><span class=\"count\">11. </span><a href=\"/q/what_is_the_concept_of_veggietales.htm\">Will the Lord watch between you and me?</a><span class=\"p\"><br /><br /></span><span class=\"count\">12. </span><a href=\"/q/does_gen_31_41_suggest_inconsistency.htm\">In Genesis 31:41, Jacob claims Laban changed his wages ten times, yet no detailed account shows each change; does this raise questions of consistency or exaggeration? </a><span class=\"p\"><br /><br /></span><span class=\"count\">13. </span><a href=\"/q/does_genesis_31_45-49_fit_ancient_rituals.htm\">In Genesis 31:45-49, what evidence confirms or challenges the historical reliability of the Mizpah covenant, and does its ritual element fit known ancient Near Eastern practices?</a><span class=\"p\"><br /><br /></span><span class=\"count\">14. </span><a href=\"/q/why_did_god_speak_to_idolater_laban.htm\">In Genesis 31:24, why would God communicate with Laban if Laban worshipped other gods, and how does this align with other biblical passages about idolatry?</a><a name=\"commentary\" id=\"commentary\"></a><div class=\"vheading2\">What Does Genesis 30:31 Mean</div><b>What can I give you?</b><p>&#8226; Laban&#8217;s question rises after Jacob has multiplied Laban&#8217;s wealth for fourteen years (<a href=\"/genesis/30-27.htm\">Genesis 30:27&#8211;30</a>).<p>&#8226; Laban wants to set terms, but history shows his motives are self-serving (<a href=\"/genesis/31-7.htm\">Genesis 31:7</a>).<p>&#8226; Scripture portrays employers owing fair compensation (<a href=\"/leviticus/19-13.htm\">Leviticus 19:13</a>; <a href=\"/james/5-4.htm\">James 5:4</a>).<p>&#8226; The moment exposes the contrast between worldly negotiation and God&#8217;s covenant faithfulness (<a href=\"/genesis/28-13.htm\">Genesis 28:13-15</a>).<p><hr color=\"#eeeeee\"><b>You do not need to give me anything</b><p>&#8226; Jacob declines a handout, showing confidence that the LORD&#8212;not Laban&#8212;is his provider (<a href=\"/philippians/4-19.htm\">Philippians 4:19</a>).<p>&#8226; He models integrity and hard work (<a href=\"/colossians/3-23.htm\">Colossians 3:23</a>; <a href=\"/proverbs/22-29.htm\">Proverbs 22:29</a>).<p>&#8226; Jacob avoids indebtedness that could compromise his future, echoing <a href=\"/proverbs/22-7.htm\">Proverbs 22:7</a>.<p>&#8226; His stance prefigures Paul&#8217;s refusal to be a financial burden (<a href=\"/1_thessalonians/2-9.htm\">1 Thessalonians 2:9</a>).<p><hr color=\"#eeeeee\"><b>If you do this one thing for me, I will keep on shepherding and keeping your flocks</b><p>&#8226; Jacob proposes a clear, measurable arrangement&#8212;he will care for the flock while claiming only the oddly colored animals (<a href=\"/genesis/30-32.htm\">Genesis 30:32-33</a>).<p>&#8226; This plan trusts God&#8217;s sovereign ability to prosper him honestly (<a href=\"/genesis/31-9.htm\">Genesis 31:9</a>; <a href=\"/psalms/75-6.htm\">Psalm 75:6-7</a>).<p>&#8226; The agreement safeguards Laban&#8217;s interests yet sets the stage for divine reversal, where the weaker appears stronger (<a href=\"/1_corinthians/1-27.htm\">1 Corinthians 1:27</a>).<p>&#8226; Jacob&#8217;s continued service reflects servant leadership, anticipating Christ&#8217;s example of laboring for others&#8217; good (<a href=\"/mark/10-45.htm\">Mark 10:45</a>).<p><hr color=\"#eeeeee\"><b>summary</b><p><a href=\"/genesis/30-31.htm\">Genesis 30:31</a> records a negotiation that spotlights Jacob&#8217;s faith, diligence, and reliance on God rather than human generosity. By refusing an outright gift and proposing terms that leave room for the LORD to bless, Jacob demonstrates that honest labor under God&#8217;s providence yields true increase, while also exposing Laban&#8217;s self-interest. The verse invites believers to trust God for provision, work faithfully, and structure commitments with integrity.<div class=\"vheading2\"><a href=\"/commentaries/pulpit/genesis/30.htm\">Pulpit Commentary</a></div><span class=\"cmt_sub_title\">Verse 31.</span> - <span class=\"cmt_word\">And he</span> (Laban, unwilling to part with so profitable an assistant) <span class=\"cmt_word\">said, What shall I give thee?</span> He was apparently prepared to detain Jacob at his own terms. <span class=\"cmt_word\">And Jacob said, Thou shalt not give me anything.</span> Jacob did not design to serve Laban gratuitously, but chose rather to trust God than Laban for recompense (Wordsworth, Gosman in Lange); or he may have meant that he would have no wages of Laban's setting, but only of his own proposing (Hughes). <span class=\"cmt_word\">If thou wilt do this thing for me</span> (accede to this stipulation), <span class=\"cmt_word\">I will again feed and keep thy flock</span> - literally, I <span class=\"accented\">will turn</span>, <span class=\"accented\">I will tend thy flock</span>, <span class=\"accented\">I will keep</span> (sc. 2). <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/commentaries/genesis/30-31.htm\">Parallel Commentaries ...</a></span><span class=\"p\"><br /><br /><br /></span><a name=\"lexicon\" id=\"lexicon\"></a><div class=\"vheading\">Hebrew</div><span class=\"word\">&#8220;What</span><br /><span class=\"heb\">&#1502;&#1464;&#1443;&#1492;</span> <span class=\"translit\">(m&#257;h)</span><br /><span class=\"parse\">Interrogative<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_4100.htm\">Strong's 4100: </a> </span><span class=\"str2\">What?, what!, indefinitely what</span><br /><br /><span class=\"word\">can I give</span><br /><span class=\"heb\">&#1488;&#1462;&#1514;&#1468;&#1462;&#1503;&#1470;</span> <span class=\"translit\">(&#8217;et&#183;ten-)</span><br /><span class=\"parse\">Verb - Qal - Imperfect - first person common singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_5414.htm\">Strong's 5414: </a> </span><span class=\"str2\">To give, put, set</span><br /><br /><span class=\"word\">you?&#8221;</span><br /><span class=\"heb\">&#1500;&#1464;&#1425;&#1498;&#1456;</span> <span class=\"translit\">(l&#257;&#7733;)</span><br /><span class=\"parse\">Preposition &#124; second person masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/.htm\">Strong's Hebrew</a> </span><span class=\"str2\"></span><br /><br /><span class=\"word\">Laban asked.</span><br /><span class=\"heb\">&#1493;&#1463;&#1497;&#1468;&#1465;&#1430;&#1488;&#1502;&#1462;&#1512;</span> <span class=\"translit\">(way&#183;y&#333;&#183;mer)</span><br /><span class=\"parse\">Conjunctive waw &#124; Verb - Qal - Consecutive imperfect - third person masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_559.htm\">Strong's 559: </a> </span><span class=\"str2\">To utter, say</span><br /><br /><span class=\"word\">&#8220;You do not</span><br /><span class=\"heb\">&#1500;&#1465;&#1488;&#1470;</span> <span class=\"translit\">(l&#333;-)</span><br /><span class=\"parse\">Adverb - Negative particle<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_3808.htm\">Strong's 3808: </a> </span><span class=\"str2\">Not, no</span><br /><br /><span class=\"word\">need to give</span><br /><span class=\"heb\">&#1514;&#1460;&#1514;&#1468;&#1462;&#1503;&#1470;</span> <span class=\"translit\">(&#7791;it&#183;ten-)</span><br /><span class=\"parse\">Verb - Qal - Imperfect - second person masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_5414.htm\">Strong's 5414: </a> </span><span class=\"str2\">To give, put, set</span><br /><br /><span class=\"word\">me</span><br /><span class=\"heb\">&#1500;&#1460;&#1443;&#1497;</span> <span class=\"translit\">(l&#238;)</span><br /><span class=\"parse\">Preposition &#124; first person common singular<br /></span><span class=\"str\"><a href=\"/hebrew/.htm\">Strong's Hebrew</a> </span><span class=\"str2\"></span><br /><br /><span class=\"word\">anything,&#8221;</span><br /><span class=\"heb\">&#1502;&#1456;&#1488;&#1428;&#1493;&#1468;&#1502;&#1464;&#1492;</span> <span class=\"translit\">(m&#601;&#183;&#8217;&#363;&#183;m&#257;h)</span><br /><span class=\"parse\">Noun - masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_3972.htm\">Strong's 3972: </a> </span><span class=\"str2\">A speck, point, nothing</span><br /><br /><span class=\"word\">Jacob replied.</span><br /><span class=\"heb\">&#1497;&#1463;&#1506;&#1458;&#1511;&#1465;&#1489;&#1433;</span> <span class=\"translit\">(ya&#183;&#8216;a&#774;&#183;q&#333;&#7687;)</span><br /><span class=\"parse\">Noun - proper - masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_3290.htm\">Strong's 3290: </a> </span><span class=\"str2\">Jacob -- a son of Isaac, also his desc</span><br /><br /><span class=\"word\">&#8220;If</span><br /><span class=\"heb\">&#1488;&#1460;&#1501;&#1470;</span> <span class=\"translit\">(&#8217;im-)</span><br /><span class=\"parse\">Conjunction<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_518.htm\">Strong's 518: </a> </span><span class=\"str2\">Lo!, whether?, if, although, Oh that!, when, not</span><br /><br /><span class=\"word\">you do</span><br /><span class=\"heb\">&#1514;&#1468;&#1469;&#1463;&#1506;&#1458;&#1513;&#1474;&#1462;&#1492;&#1470;</span> <span class=\"translit\">(ta&#183;&#8216;a&#774;&#183;&#347;eh-)</span><br /><span class=\"parse\">Verb - Qal - Imperfect - second person masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_6213.htm\">Strong's 6213: </a> </span><span class=\"str2\">To do, make</span><br /><br /><span class=\"word\">this</span><br /><span class=\"heb\">&#1492;&#1463;&#1494;&#1468;&#1462;&#1428;&#1492;</span> <span class=\"translit\">(haz&#183;zeh)</span><br /><span class=\"parse\">Article &#124; Pronoun - masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_2088.htm\">Strong's 2088: </a> </span><span class=\"str2\">This, that</span><br /><br /><span class=\"word\">one thing</span><br /><span class=\"heb\">&#1492;&#1463;&#1491;&#1468;&#1464;&#1489;&#1464;&#1443;&#1512;</span> <span class=\"translit\">(had&#183;d&#257;&#183;&#7687;&#257;r)</span><br /><span class=\"parse\">Article &#124; Noun - masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_1697.htm\">Strong's 1697: </a> </span><span class=\"str2\">A word, a matter, thing, a cause</span><br /><br /><span class=\"word\">for me,</span><br /><span class=\"heb\">&#1500;&#1468;&#1460;&#1497;&#1433;</span> <span class=\"translit\">(l&#238;)</span><br /><span class=\"parse\">Preposition &#124; first person common singular<br /></span><span class=\"str\"><a href=\"/hebrew/.htm\">Strong's Hebrew</a> </span><span class=\"str2\"></span><br /><br /><span class=\"word\">I will keep on</span><br /><span class=\"heb\">&#1488;&#1464;&#1513;&#1473;&#1435;&#1493;&#1468;&#1489;&#1464;&#1492;</span> <span class=\"translit\">(&#8217;&#257;&#183;&#353;&#363;&#183;&#7687;&#257;h)</span><br /><span class=\"parse\">Verb - Qal - Imperfect Cohortative - first person common singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_7725.htm\">Strong's 7725: </a> </span><span class=\"str2\">To turn back, in, to retreat, again</span><br /><br /><span class=\"word\">shepherding</span><br /><span class=\"heb\">&#1488;&#1462;&#1512;&#1456;&#1506;&#1462;&#1445;&#1492;</span> <span class=\"translit\">(&#8217;er&#183;&#8216;eh)</span><br /><span class=\"parse\">Verb - Qal - Imperfect Cohortative if contextual - first person common singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_7462.htm\">Strong's 7462: </a> </span><span class=\"str2\">To tend a, flock, pasture it, in, to graze, to rule, to associate with</span><br /><br /><span class=\"word\">and keeping</span><br /><span class=\"heb\">&#1488;&#1462;&#1513;&#1473;&#1456;&#1502;&#1465;&#1469;&#1512;&#1475;</span> <span class=\"translit\">(&#8217;e&#353;&#183;m&#333;r)</span><br /><span class=\"parse\">Verb - Qal - Imperfect Cohortative if contextual - first person common singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_8104.htm\">Strong's 8104: </a> </span><span class=\"str2\">To hedge about, guard, to protect, attend to</span><br /><br /><span class=\"word\">your flock.</span><br /><span class=\"heb\">&#1510;&#1465;&#1469;&#1488;&#1504;&#1456;&#1498;&#1464;&#1430;</span> <span class=\"translit\">(&#7779;&#333;&#183;n&#601;&#183;&#7733;&#257;)</span><br /><span class=\"parse\">Noun - feminine singular construct &#124; second person masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_6629.htm\">Strong's 6629: </a> </span><span class=\"str2\">Small cattle, sheep and goats, flock</span><br /><span class=\"p\"><br /><br /></span><div class=\"vheading\">Links</div><a href=\"/niv/genesis/30-31.htm\">Genesis 30:31 NIV</a><br /><a href=\"/nlt/genesis/30-31.htm\">Genesis 30:31 NLT</a><br /><a href=\"/esv/genesis/30-31.htm\">Genesis 30:31 ESV</a><br /><a href=\"/nasb/genesis/30-31.htm\">Genesis 30:31 NASB</a><br /><a href=\"/kjv/genesis/30-31.htm\">Genesis 30:31 KJV</a><span class=\"p\"><br /><br /></span><a href=\"//bibleapps.com/genesis/30-31.htm\">Genesis 30:31 BibleApps.com</a><br /><a href=\"//bibliaparalela.com/genesis/30-31.htm\">Genesis 30:31 Biblia Paralela</a><br /><a href=\"//holybible.com.cn/genesis/30-31.htm\">Genesis 30:31 Chinese Bible</a><br /><a href=\"//saintebible.com/genesis/30-31.htm\">Genesis 30:31 French Bible</a><br /><a href=\"/catholic/genesis/30-31.htm\">Genesis 30:31 Catholic Bible</a><span class=\"p\"><br /><br /></span><a href=\"/genesis/30-31.htm\">OT Law: Genesis 30:31 He said What shall I give you? (Gen. Ge Gn)</a></div></div></td></tr></table></div><div id=\"left\"><a href=\"/genesis/30-30.htm\" onmouseover='lft.src=\"/leftgif.png\"' onmouseout='lft.src=\"/left.png\"' title=\"Genesis 30:30\"><img src=\"/left.png\" name=\"lft\" border=\"0\" alt=\"Genesis 30:30\" /></a></div><div id=\"right\"><a href=\"/genesis/30-32.htm\" onmouseover='rght.src=\"/rightgif.png\"' onmouseout='rght.src=\"/right.png\"' title=\"Genesis 30:32\"><img src=\"/right.png\" name=\"rght\" border=\"0\" alt=\"Genesis 30:32\" /></a></div><div id=\"botleft\"><a href=\"#\" onmouseover='botleft.src=\"/botleftgif.png\"' onmouseout='botleft.src=\"/botleft.png\"' title=\"Top of Page\"><img src=\"/botleft.png\" name=\"botleft\" border=\"0\" alt=\"Top of Page\" /></a></div><div id=\"botright\"><a href=\"#\" onmouseover='botright.src=\"/botrightgif.png\"' onmouseout='botright.src=\"/botright.png\"' title=\"Top of Page\"><img src=\"/botright.png\" name=\"botright\" border=\"0\" alt=\"Top of Page\" /></a></div><div id=\"bot\"><iframe width=\"100%\" height=\"1500\" scrolling=\"no\" src=\"/botmenubhnew2.htm\" frameborder=\"0\"></iframe></div></td></tr></table></div></body></html>"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 30:32",
      "book": "Genesis",
      "chapter": 30,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb and every spotted or speckled goat. They will be my wages."
        },
        {
          "version": "NLT",
          "text": "Let me inspect your flocks today and remove all the sheep and goats that are speckled or spotted, along with all the black sheep. Give these to me as my wages."
        },
        {
          "version": "ESV",
          "text": "let me pass through all your flock today, removing from it every speckled and spotted sheep and every black lamb, and the spotted and speckled among the goats, and they shall be my wages."
        },
        {
          "version": "NKJV",
          "text": "Let me pass through all your flock today, removing from there all the speckled and spotted sheep, and all the brown ones among the lambs, and the spotted and speckled among the goats; and these shall be my wages."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:8-12",
          "text": "If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. / Thus God has taken away your father’s livestock and given them to me. / When the flocks were breeding, I saw in a dream that the streaked, spotted, and speckled males were mating with the females. ..."
        },
        {
          "reference": "Genesis 31:38-42",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes. ..."
        },
        {
          "reference": "Genesis 29:31-35",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren. / And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.” / Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon. ..."
        },
        {
          "reference": "Genesis 31:1-2",
          "text": "Now Jacob heard that Laban’s sons were saying, “Jacob has taken away all that belonged to our father and built all this wealth at our father’s expense.” / And Jacob saw from the countenance of Laban that his attitude toward him had changed."
        },
        {
          "reference": "Genesis 31:9",
          "text": "Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:16",
          "text": "Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 31:18",
          "text": "and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Leviticus 27:32",
          "text": "Every tenth animal from the herd or flock that passes under the shepherd’s rod will be holy to the LORD."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Deuteronomy 15:19-20",
          "text": "You must set apart to the LORD your God every firstborn male produced by your herds and flocks. You are not to put the firstborn of your oxen to work, nor are you to shear the firstborn of your flock. / Each year you and your household are to eat it before the LORD your God in the place the LORD will choose."
        },
        {
          "reference": "1 Samuel 25:2",
          "text": "Now there was a man in Maon whose business was in Carmel. He was a very wealthy man with a thousand goats and three thousand sheep, which he was shearing in Carmel."
        },
        {
          "reference": "1 Kings 8:56",
          "text": "“Blessed be the LORD, who has given rest to His people Israel according to all that He promised. Not one word has failed of all the good promises He made through His servant Moses."
        },
        {
          "reference": "Psalm 37:4",
          "text": "Delight yourself in the LORD, and He will give you the desires of your heart."
        }
      ]
    },
    {
      "reference": "Genesis 30:33",
      "book": "Genesis",
      "chapter": 30,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "And my honesty will testify for me in the future, whenever you check on the wages you have paid me. Any goat in my possession that is not speckled or spotted, or any lamb that is not dark-colored, will be considered stolen.”"
        },
        {
          "version": "NLT",
          "text": "In the future, when you check on the animals you have given me as my wages, you’ll see that I have been honest. If you find in my flock any goats without speckles or spots, or any sheep that are not black, you will know that I have stolen them from you.”"
        },
        {
          "version": "ESV",
          "text": "So my honesty will answer for me later, when you come to look into my wages with you. Every one that is not speckled and spotted among the goats and black among the lambs, if found with me, shall be counted stolen.”"
        },
        {
          "version": "NKJV",
          "text": "So my righteousness will answer for me in time to come, when the subject of my wages comes before you: every one that is not speckled and spotted among the goats, and brown among the lambs, will be considered stolen, if it is with me.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:8-12",
          "text": "If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. / Thus God has taken away your father’s livestock and given them to me. / When the flocks were breeding, I saw in a dream that the streaked, spotted, and speckled males were mating with the females. ..."
        },
        {
          "reference": "Genesis 31:38-42",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes. ..."
        },
        {
          "reference": "Genesis 29:18-20",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.” / Laban replied, “Better that I give her to you than to another. Stay here with me.” / So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 31:6-7",
          "text": "You know that I have served your father with all my strength. / And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 31:9",
          "text": "Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:16",
          "text": "Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 31:43",
          "text": "But Laban answered Jacob, “These daughters are my daughters, these sons are my sons, and these flocks are my flocks! Everything you see is mine! Yet what can I do today about these daughters of mine or the children they have borne?"
        },
        {
          "reference": "Genesis 31:1",
          "text": "Now Jacob heard that Laban’s sons were saying, “Jacob has taken away all that belonged to our father and built all this wealth at our father’s expense.”"
        },
        {
          "reference": "Genesis 31:55",
          "text": "Early the next morning, Laban got up and kissed his grandchildren and daughters and blessed them. Then he left to return home."
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Leviticus 19:13",
          "text": "You must not defraud your neighbor or rob him. You must not withhold until morning the wages due a hired hand."
        },
        {
          "reference": "Deuteronomy 24:14-15",
          "text": "Do not oppress a hired hand who is poor and needy, whether he is a brother or a foreigner residing in one of your towns. / You are to pay his wages each day before sunset, because he is poor and depends on them. Otherwise he may cry out to the LORD against you, and you will be guilty of sin."
        },
        {
          "reference": "Proverbs 10:4",
          "text": "Idle hands make one poor, but diligent hands bring wealth."
        }
      ]
    },
    {
      "reference": "Genesis 30:34",
      "book": "Genesis",
      "chapter": 30,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "&#8220Agreed,” said Laban. “Let it be as you have said.”"
        },
        {
          "version": "NLT",
          "text": "“All right,” Laban replied. “It will be as you say.”"
        },
        {
          "version": "ESV",
          "text": "Laban said, “Good! Let it be as you have said.”"
        },
        {
          "version": "NKJV",
          "text": "And Laban said, “Oh, that it were according to your word!”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:7-9",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. / Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:41-42",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times! / If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 29:18-20",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.” / Laban replied, “Better that I give her to you than to another. Stay here with me.” / So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 31:38-40",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes."
        },
        {
          "reference": "Genesis 31:12-13",
          "text": "‘Look up,’ he said, ‘and see that all the males that are mating with the flock are streaked, spotted, or speckled; for I have seen all that Laban has done to you. / I am the God of Bethel, where you anointed the pillar and made a solemn vow to Me. Now get up, leave this land at once, and return to your native land.’”"
        },
        {
          "reference": "Genesis 31:1-3",
          "text": "Now Jacob heard that Laban’s sons were saying, “Jacob has taken away all that belonged to our father and built all this wealth at our father’s expense.” / And Jacob saw from the countenance of Laban that his attitude toward him had changed. / Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 31:17-18",
          "text": "Then Jacob got up and put his children and his wives on camels, / and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Genesis 31:25-30",
          "text": "Now Jacob had pitched his tent in the hill country of Gilead when Laban overtook him, and Laban and his relatives camped there as well. / Then Laban said to Jacob, “What have you done? You have deceived me and carried off my daughters like captives of war! / Why did you run away secretly and deceive me, without even telling me? I would have sent you away with joy and singing, with tambourines and harps. ..."
        },
        {
          "reference": "Genesis 31:43-44",
          "text": "But Laban answered Jacob, “These daughters are my daughters, these sons are my sons, and these flocks are my flocks! Everything you see is mine! Yet what can I do today about these daughters of mine or the children they have borne? / Come now, let us make a covenant, you and I, and let it serve as a witness between you and me.”"
        },
        {
          "reference": "Genesis 31:51-53",
          "text": "Laban also said to Jacob, “Here is the mound, and here is the pillar I have set up between you and me. / This mound is a witness, and this pillar is a witness, that I will not go past this mound to harm you, and you will not go past this mound and pillar to harm me. / May the God of Abraham and the God of Nahor, the God of their father, judge between us.” So Jacob swore by the Fear of his father Isaac."
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Leviticus 19:13",
          "text": "You must not defraud your neighbor or rob him. You must not withhold until morning the wages due a hired hand."
        },
        {
          "reference": "Deuteronomy 24:14-15",
          "text": "Do not oppress a hired hand who is poor and needy, whether he is a brother or a foreigner residing in one of your towns. / You are to pay his wages each day before sunset, because he is poor and depends on them. Otherwise he may cry out to the LORD against you, and you will be guilty of sin."
        },
        {
          "reference": "1 Samuel 25:10-11",
          "text": "But Nabal asked them, “Who is David? Who is this son of Jesse? Many servants these days are breaking away from their masters. / Why should I take my bread and water and the meat I have slaughtered for my shearers, and give them to these men whose origin I do not know?”"
        }
      ]
    },
    {
      "reference": "Genesis 30:35",
      "book": "Genesis",
      "chapter": 30,
      "verse": 35,
      "translations": [
        {
          "version": "NIV",
          "text": "That same day he removed all the male goats that were streaked or spotted, and all the speckled or spotted female goats (all that had white on them) and all the dark-colored lambs, and he placed them in the care of his sons."
        },
        {
          "version": "NLT",
          "text": "But that very day Laban went out and removed the male goats that were streaked and spotted, all the female goats that were speckled and spotted or had white patches, and all the black sheep. He placed them in the care of his own sons,"
        },
        {
          "version": "ESV",
          "text": "But that day Laban removed the male goats that were striped and spotted, and all the female goats that were speckled and spotted, every one that had white on it, and every lamb that was black, and put them in the charge of his sons."
        },
        {
          "version": "NKJV",
          "text": "So he removed that day the male goats that were speckled and spotted, all the female goats that were speckled and spotted, every one that had some white in it, and all the brown ones among the lambs, and gave them into the hand of his sons."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:9",
          "text": "Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:8",
          "text": "If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring."
        },
        {
          "reference": "Genesis 31:10-12",
          "text": "When the flocks were breeding, I saw in a dream that the streaked, spotted, and speckled males were mating with the females. / In that dream the angel of God said to me, ‘Jacob!’ And I replied, ‘Here I am.’ / ‘Look up,’ he said, ‘and see that all the males that are mating with the flock are streaked, spotted, or speckled; for I have seen all that Laban has done to you."
        },
        {
          "reference": "Genesis 31:38-40",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes."
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 31:7",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:16",
          "text": "Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 31:42",
          "text": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 31:6",
          "text": "You know that I have served your father with all my strength."
        },
        {
          "reference": "Genesis 31:18",
          "text": "and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Exodus 12:38",
          "text": "And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Exodus 3:22",
          "text": "Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 11:2",
          "text": "Now announce to the people that men and women alike should ask their neighbors for articles of silver and gold.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Leviticus 19:19",
          "text": "You are to keep My statutes. You shall not crossbreed two different kinds of livestock; you shall not sow your fields with two kinds of seed; and you shall not wear clothing made of two kinds of material."
        }
      ]
    },
    {
      "reference": "Genesis 30:36",
      "book": "Genesis",
      "chapter": 30,
      "verse": 36,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he put a three-day journey between himself and Jacob, while Jacob continued to tend the rest of Laban’s flocks."
        },
        {
          "version": "NLT",
          "text": "who took them a three-days’ journey from where Jacob was. Meanwhile, Jacob stayed and cared for the rest of Laban’s flock."
        },
        {
          "version": "ESV",
          "text": "And he set a distance of three days’ journey between himself and Jacob, and Jacob pastured the rest of Laban’s flock."
        },
        {
          "version": "NKJV",
          "text": "Then he put three days’ journey between himself and Jacob, and Jacob fed the rest of Laban’s flocks."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:9",
          "text": "Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:12",
          "text": "‘Look up,’ he said, ‘and see that all the males that are mating with the flock are streaked, spotted, or speckled; for I have seen all that Laban has done to you."
        },
        {
          "reference": "Genesis 31:16",
          "text": "Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 31:42",
          "text": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 31:52",
          "text": "This mound is a witness, and this pillar is a witness, that I will not go past this mound to harm you, and you will not go past this mound and pillar to harm me."
        },
        {
          "reference": "Genesis 32:10",
          "text": "I am unworthy of all the kindness and faithfulness You have shown Your servant. Indeed, with only my staff I came across the Jordan, but now I have become two camps."
        },
        {
          "reference": "Genesis 33:13",
          "text": "But Jacob replied, “My lord knows that the children are frail, and I must care for sheep and cattle that are nursing their young. If they are driven hard for even a day, all the animals will die."
        },
        {
          "reference": "Genesis 33:14",
          "text": "Please let my lord go ahead of his servant. I will continue on slowly, at a comfortable pace for the livestock and children, until I come to my lord at Seir.”"
        },
        {
          "reference": "Genesis 34:23",
          "text": "Will not their livestock, their possessions, and all their animals become ours? Only let us consent to them, and they will dwell among us.”"
        },
        {
          "reference": "Exodus 3:22",
          "text": "Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 12:36",
          "text": "And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Leviticus 25:36",
          "text": "Do not take any interest or profit from him, but fear your God, that your countryman may live among you."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Deuteronomy 15:14",
          "text": "You are to furnish him liberally from your flock, your threshing floor, and your winepress. You shall give to him as the LORD your God has blessed you."
        }
      ]
    },
    {
      "reference": "Genesis 30:37",
      "book": "Genesis",
      "chapter": 30,
      "verse": 37,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob, however, took fresh-cut branches from poplar, almond and plane trees and made white stripes on them by peeling the bark and exposing the white inner wood of the branches."
        },
        {
          "version": "NLT",
          "text": "Then Jacob took some fresh branches from poplar, almond, and plane trees and peeled off strips of bark, making white streaks on them."
        },
        {
          "version": "ESV",
          "text": "Then Jacob took fresh sticks of poplar and almond and plane trees, and peeled white streaks in them, exposing the white of the sticks."
        },
        {
          "version": "NKJV",
          "text": "Now Jacob took for himself rods of green poplar and of the almond and chestnut trees, peeled white strips in them, and exposed the white which was in the rods."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 7:19-20",
          "text": "And the LORD said to Moses, “Tell Aaron, ‘Take your staff and stretch out your hand over the waters of Egypt—over their rivers and canals and ponds and all the reservoirs—that they may become blood.’ There will be blood throughout the land of Egypt, even in the vessels of wood and stone.” / Moses and Aaron did just as the LORD had commanded; in the presence of Pharaoh and his officials, Aaron raised the staff and struck the water of the Nile, and all the water was turned to blood."
        },
        {
          "reference": "Exodus 14:21",
          "text": "Then Moses stretched out his hand over the sea, and all that night the LORD drove back the sea with a strong east wind that turned it into dry land. So the waters were divided,"
        },
        {
          "reference": "Numbers 17:8",
          "text": "The next day Moses entered the Tent of the Testimony and saw that Aaron’s staff, representing the house of Levi, had sprouted, put forth buds, blossomed, and produced almonds."
        },
        {
          "reference": "1 Kings 17:6",
          "text": "The ravens would bring him bread and meat in the morning and evening, and he would drink from the brook."
        },
        {
          "reference": "2 Kings 4:41",
          "text": "Then Elisha said, “Get some flour.” He threw it into the pot and said, “Pour it out for the people to eat.” And there was nothing harmful in the pot."
        },
        {
          "reference": "2 Kings 6:6",
          "text": "“Where did it fall?” asked the man of God. And when he showed him the place, the man of God cut a stick, threw it there, and made the iron float."
        },
        {
          "reference": "Ezekiel 17:24",
          "text": "Then all the trees of the field will know that I am the LORD. I bring the tall tree down and make the low tree tall. I dry up the green tree and make the withered tree flourish. I, the LORD, have spoken, and I have done it.’”"
        },
        {
          "reference": "Ezekiel 31:8-9",
          "text": "The cedars in the garden of God could not rival it; the cypresses could not compare with its branches, nor the plane trees match its boughs. No tree in the garden of God could compare with its beauty. / I made it beautiful with its many branches, the envy of all the trees of Eden, which were in the garden of God.’"
        },
        {
          "reference": "Hosea 12:3-4",
          "text": "In the womb he grasped his brother’s heel, and in his vigor he wrestled with God. / Yes, he struggled with the angel and prevailed; he wept and sought His favor; he found Him at Bethel and spoke with Him there—"
        },
        {
          "reference": "John 2:7-9",
          "text": "Jesus told the servants, “Fill the jars with water.” So they filled them to the brim. / “Now draw some out,” He said, “and take it to the master of the banquet.” They did so, / and the master of the banquet tasted the water that had been turned into wine. He did not know where it was from, but the servants who had drawn the water knew. Then he called the bridegroom aside"
        },
        {
          "reference": "John 9:6-7",
          "text": "When Jesus had said this, He spit on the ground, made some mud, and applied it to the man’s eyes. / Then He told him, “Go, wash in the Pool of Siloam” (which means “Sent”). So the man went and washed, and came back seeing."
        },
        {
          "reference": "Acts 19:11-12",
          "text": "God did extraordinary miracles through the hands of Paul, / so that even handkerchiefs and aprons that had touched him were taken to the sick, and the diseases and evil spirits left them."
        },
        {
          "reference": "Romans 4:17-21",
          "text": "As it is written: “I have made you a father of many nations.” He is our father in the presence of God, in whom he believed, the God who gives life to the dead and calls into being what does not yet exist. / Against all hope, Abraham in hope believed and so became the father of many nations, just as he had been told, “So shall your offspring be.” / Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. ..."
        },
        {
          "reference": "1 Corinthians 1:27-29",
          "text": "But God chose the foolish things of the world to shame the wise; God chose the weak things of the world to shame the strong. / He chose the lowly and despised things of the world, and the things that are not, to nullify the things that are, / so that no one may boast in His presence."
        },
        {
          "reference": "2 Corinthians 12:9-10",
          "text": "But He said to me, “My grace is sufficient for you, for My power is perfected in weakness.” Therefore I will boast all the more gladly in my weaknesses, so that the power of Christ may rest on me. / That is why, for the sake of Christ, I delight in weaknesses, in insults, in hardships, in persecutions, in difficulties. For when I am weak, then I am strong."
        }
      ]
    },
    {
      "reference": "Genesis 30:38",
      "book": "Genesis",
      "chapter": 30,
      "verse": 38,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he placed the peeled branches in all the watering troughs, so that they would be directly in front of the flocks when they came to drink. When the flocks were in heat and came to drink,"
        },
        {
          "version": "NLT",
          "text": "Then he placed these peeled branches in the watering troughs where the flocks came to drink, for that was where they mated."
        },
        {
          "version": "ESV",
          "text": "He set the sticks that he had peeled in front of the flocks in the troughs, that is, the watering places, where the flocks came to drink. And since they bred when they came to drink,"
        },
        {
          "version": "NKJV",
          "text": "And the rods which he had peeled, he set before the flocks in the gutters, in the watering troughs where the flocks came to drink, so that they should conceive when they came to drink."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 7:19-20",
          "text": "And the LORD said to Moses, “Tell Aaron, ‘Take your staff and stretch out your hand over the waters of Egypt—over their rivers and canals and ponds and all the reservoirs—that they may become blood.’ There will be blood throughout the land of Egypt, even in the vessels of wood and stone.” / Moses and Aaron did just as the LORD had commanded; in the presence of Pharaoh and his officials, Aaron raised the staff and struck the water of the Nile, and all the water was turned to blood."
        },
        {
          "reference": "Exodus 14:21",
          "text": "Then Moses stretched out his hand over the sea, and all that night the LORD drove back the sea with a strong east wind that turned it into dry land. So the waters were divided,"
        },
        {
          "reference": "Numbers 21:8-9",
          "text": "Then the LORD said to Moses, “Make a fiery serpent and mount it on a pole. When anyone who is bitten looks at it, he will live.” / So Moses made a bronze snake and mounted it on a pole. If anyone who was bitten looked at the bronze snake, he would live."
        },
        {
          "reference": "1 Kings 17:21-22",
          "text": "Then he stretched himself out over the child three times and cried out to the LORD, “O LORD my God, please let this boy’s life return to him!” / And the LORD listened to the voice of Elijah, and the child’s life returned to him, and he lived."
        },
        {
          "reference": "2 Kings 4:29-31",
          "text": "So Elisha said to Gehazi, “Tie up your garment, take my staff in your hand, and go! If you meet anyone, do not greet him, and if anyone greets you, do not answer him. Then lay my staff on the boy’s face.” / And the mother of the boy said, “As surely as the LORD lives and as you yourself live, I will not leave you.” So he got up and followed her. / Gehazi went on ahead of them and laid the staff on the boy’s face, but there was no sound or response. So he went back to meet Elisha and told him, “The boy has not awakened.”"
        },
        {
          "reference": "2 Kings 5:14",
          "text": "So Naaman went down and dipped himself in the Jordan seven times, according to the word of the man of God, and his flesh was restored and became like that of a little child, and he was clean."
        },
        {
          "reference": "2 Kings 6:6",
          "text": "“Where did it fall?” asked the man of God. And when he showed him the place, the man of God cut a stick, threw it there, and made the iron float."
        },
        {
          "reference": "Ezekiel 37:4-10",
          "text": "And He said to me, “Prophesy concerning these bones and tell them, ‘Dry bones, hear the word of the LORD! / This is what the Lord GOD says to these bones: I will cause breath to enter you, and you will come to life. / I will attach tendons to you and make flesh grow upon you and cover you with skin. I will put breath within you so that you will come to life. Then you will know that I am the LORD.’” ..."
        },
        {
          "reference": "John 2:7-9",
          "text": "Jesus told the servants, “Fill the jars with water.” So they filled them to the brim. / “Now draw some out,” He said, “and take it to the master of the banquet.” They did so, / and the master of the banquet tasted the water that had been turned into wine. He did not know where it was from, but the servants who had drawn the water knew. Then he called the bridegroom aside"
        },
        {
          "reference": "John 5:8-9",
          "text": "Then Jesus told him, “Get up, pick up your mat, and walk.” / Immediately the man was made well, and he picked up his mat and began to walk. Now this happened on the Sabbath day,"
        },
        {
          "reference": "John 9:6-7",
          "text": "When Jesus had said this, He spit on the ground, made some mud, and applied it to the man’s eyes. / Then He told him, “Go, wash in the Pool of Siloam” (which means “Sent”). So the man went and washed, and came back seeing."
        },
        {
          "reference": "Acts 3:6-8",
          "text": "But Peter said, “Silver or gold I do not have, but what I have I give you: In the name of Jesus Christ of Nazareth, get up and walk!” / Taking him by the right hand, Peter helped him up, and at once the man’s feet and ankles were made strong. / He sprang to his feet and began to walk. Then he went with them into the temple courts, walking and leaping and praising God."
        },
        {
          "reference": "Acts 5:15-16",
          "text": "As a result, people brought the sick into the streets and laid them on cots and mats, so that at least Peter’s shadow might fall on some of them as he passed by. / Crowds also gathered from the towns around Jerusalem, bringing the sick and those tormented by unclean spirits, and all of them were healed."
        },
        {
          "reference": "Acts 19:11-12",
          "text": "God did extraordinary miracles through the hands of Paul, / so that even handkerchiefs and aprons that had touched him were taken to the sick, and the diseases and evil spirits left them."
        },
        {
          "reference": "Romans 4:17-21",
          "text": "As it is written: “I have made you a father of many nations.” He is our father in the presence of God, in whom he believed, the God who gives life to the dead and calls into being what does not yet exist. / Against all hope, Abraham in hope believed and so became the father of many nations, just as he had been told, “So shall your offspring be.” / Without weakening in his faith, he acknowledged the decrepitness of his body (since he was about a hundred years old) and the lifelessness of Sarah’s womb. ..."
        }
      ]
    },
    {
      "reference": "Genesis 30:39",
      "book": "Genesis",
      "chapter": 30,
      "verse": 39,
      "translations": [
        {
          "version": "NIV",
          "text": "they mated in front of the branches. And they bore young that were streaked or speckled or spotted."
        },
        {
          "version": "NLT",
          "text": "And when they mated in front of the white-streaked branches, they gave birth to young that were streaked, speckled, and spotted."
        },
        {
          "version": "ESV",
          "text": "the flocks bred in front of the sticks and so the flocks brought forth striped, speckled, and spotted."
        },
        {
          "version": "NKJV",
          "text": "So the flocks conceived before the rods, and the flocks brought forth streaked, speckled, and spotted."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:9-12",
          "text": "Thus God has taken away your father’s livestock and given them to me. / When the flocks were breeding, I saw in a dream that the streaked, spotted, and speckled males were mating with the females. / In that dream the angel of God said to me, ‘Jacob!’ And I replied, ‘Here I am.’ ..."
        },
        {
          "reference": "Genesis 31:7-8",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring."
        },
        {
          "reference": "Exodus 12:38",
          "text": "And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Leviticus 19:19",
          "text": "You are to keep My statutes. You shall not crossbreed two different kinds of livestock; you shall not sow your fields with two kinds of seed; and you shall not wear clothing made of two kinds of material."
        },
        {
          "reference": "Deuteronomy 22:9",
          "text": "Do not plant your vineyard with two types of seed; if you do, the entire harvest will be defiled—both the crop you plant and the fruit of your vineyard."
        },
        {
          "reference": "Deuteronomy 22:10",
          "text": "Do not plow with an ox and a donkey yoked together."
        },
        {
          "reference": "Deuteronomy 22:11",
          "text": "Do not wear clothes of wool and linen woven together."
        },
        {
          "reference": "1 Kings 3:14",
          "text": "So if you walk in My ways and keep My statutes and commandments, just as your father David did, I will prolong your days.”"
        },
        {
          "reference": "1 Kings 4:33",
          "text": "He spoke of trees, from the cedar in Lebanon to the hyssop growing in the wall, and he taught about animals, birds, reptiles, and fish."
        },
        {
          "reference": "Ezekiel 34:17",
          "text": "This is what the Lord GOD says to you, My flock: ‘I will judge between one sheep and another, between the rams and the goats."
        },
        {
          "reference": "Ezekiel 34:18",
          "text": "Is it not enough for you to feed on the good pasture? Must you also trample the rest of the pasture with your feet? Is it not enough for you to drink the clear waters? Must you also muddy the rest with your feet?"
        },
        {
          "reference": "Ezekiel 34:19",
          "text": "Why must My flock feed on what your feet have trampled, and drink what your feet have muddied?’"
        },
        {
          "reference": "Ezekiel 34:20",
          "text": "Therefore this is what the Lord GOD says to them: ‘Behold, I Myself will judge between the fat sheep and the lean sheep."
        },
        {
          "reference": "Ezekiel 34:21",
          "text": "Since you shove with flank and shoulder, butting all the weak ones with your horns until you have scattered them abroad,"
        },
        {
          "reference": "Ezekiel 34:22",
          "text": "I will save My flock, and they will no longer be prey. I will judge between one sheep and another."
        }
      ]
    },
    {
      "reference": "Genesis 30:40",
      "book": "Genesis",
      "chapter": 30,
      "verse": 40,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob set apart the young of the flock by themselves, but made the rest face the streaked and dark-colored animals that belonged to Laban. Thus he made separate flocks for himself and did not put them with Laban’s animals."
        },
        {
          "version": "NLT",
          "text": "Jacob separated those lambs from Laban’s flock. And at mating time he turned the flock to face Laban’s animals that were streaked or black. This is how he built his own flock instead of increasing Laban’s."
        },
        {
          "version": "ESV",
          "text": "And Jacob separated the lambs and set the faces of the flocks toward the striped and all the black in the flock of Laban. He put his own droves apart and did not put them with Laban’s flock."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob separated the lambs, and made the flocks face toward the streaked and all the brown in the flock of Laban; but he put his own flocks by themselves and did not put them with Laban’s flock."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:9",
          "text": "Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:8",
          "text": "If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring."
        },
        {
          "reference": "Genesis 31:12",
          "text": "‘Look up,’ he said, ‘and see that all the males that are mating with the flock are streaked, spotted, or speckled; for I have seen all that Laban has done to you."
        },
        {
          "reference": "Genesis 31:41-42",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times! / If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 31:38-40",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes."
        },
        {
          "reference": "Genesis 31:6-7",
          "text": "You know that I have served your father with all my strength. / And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:16",
          "text": "Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 31:1",
          "text": "Now Jacob heard that Laban’s sons were saying, “Jacob has taken away all that belonged to our father and built all this wealth at our father’s expense.”"
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Leviticus 27:32",
          "text": "Every tenth animal from the herd or flock that passes under the shepherd’s rod will be holy to the LORD."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Deuteronomy 15:14",
          "text": "You are to furnish him liberally from your flock, your threshing floor, and your winepress. You shall give to him as the LORD your God has blessed you."
        },
        {
          "reference": "1 Samuel 2:7-8",
          "text": "The LORD sends poverty and wealth; He humbles and He exalts. / He raises the poor from the dust and lifts the needy from the ash heap. He seats them among princes and bestows on them a throne of honor. For the foundations of the earth are the LORD’s, and upon them He has set the world."
        },
        {
          "reference": "Psalm 75:6-7",
          "text": "For exaltation comes neither from east nor west, nor out of the desert, / but it is God who judges; He brings down one and exalts another."
        }
      ]
    },
    {
      "reference": "Genesis 30:41",
      "book": "Genesis",
      "chapter": 30,
      "verse": 41,
      "translations": [
        {
          "version": "NIV",
          "text": "Whenever the stronger females were in heat, Jacob would place the branches in the troughs in front of the animals so they would mate near the branches,"
        },
        {
          "version": "NLT",
          "text": "Whenever the stronger females were ready to mate, Jacob would place the peeled branches in the watering troughs in front of them. Then they would mate in front of the branches."
        },
        {
          "version": "ESV",
          "text": "Whenever the stronger of the flock were breeding, Jacob would lay the sticks in the troughs before the eyes of the flock, that they might breed among the sticks,"
        },
        {
          "version": "NKJV",
          "text": "And it came to pass, whenever the stronger livestock conceived, that Jacob placed the rods before the eyes of the livestock in the gutters, that they might conceive among the rods."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:9-12",
          "text": "Thus God has taken away your father’s livestock and given them to me. / When the flocks were breeding, I saw in a dream that the streaked, spotted, and speckled males were mating with the females. / In that dream the angel of God said to me, ‘Jacob!’ And I replied, ‘Here I am.’ ..."
        },
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 31:38-42",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes. ..."
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Leviticus 19:19",
          "text": "You are to keep My statutes. You shall not crossbreed two different kinds of livestock; you shall not sow your fields with two kinds of seed; and you shall not wear clothing made of two kinds of material."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Deuteronomy 28:4",
          "text": "The fruit of your womb will be blessed, as well as the produce of your land and the offspring of your livestock—the calves of your herds and the lambs of your flocks."
        },
        {
          "reference": "1 Samuel 2:7-8",
          "text": "The LORD sends poverty and wealth; He humbles and He exalts. / He raises the poor from the dust and lifts the needy from the ash heap. He seats them among princes and bestows on them a throne of honor. For the foundations of the earth are the LORD’s, and upon them He has set the world."
        },
        {
          "reference": "1 Kings 3:13",
          "text": "Moreover, I will give you what you did not request—both riches and honor—so that during all your days no man in any kingdom will be your equal."
        },
        {
          "reference": "Job 42:12",
          "text": "So the LORD blessed Job’s latter days more than his first. He owned 14,000 sheep, 6,000 camels, 1,000 yoke of oxen, and 1,000 female donkeys."
        },
        {
          "reference": "Psalm 75:6-7",
          "text": "For exaltation comes neither from east nor west, nor out of the desert, / but it is God who judges; He brings down one and exalts another."
        },
        {
          "reference": "Proverbs 10:22",
          "text": "The blessing of the LORD enriches, and He adds no sorrow to it."
        },
        {
          "reference": "Ecclesiastes 9:11",
          "text": "I saw something else under the sun: The race is not to the swift, nor the battle to the strong; neither is the bread to the wise, nor the wealth to the intelligent, nor the favor to the skillful. For time and chance happen to all."
        },
        {
          "reference": "Isaiah 60:5-7",
          "text": "Then you will look and be radiant, and your heart will tremble and swell with joy, because the riches of the sea will be brought to you, and the wealth of the nations will come to you. / Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD. / All the flocks of Kedar will be gathered to you; the rams of Nebaioth will serve you and go up on My altar with acceptance; I will adorn My glorious house."
        },
        {
          "reference": "Jeremiah 29:11",
          "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, to give you a future and a hope."
        }
      ]
    },
    {
      "reference": "Genesis 30:42",
      "book": "Genesis",
      "chapter": 30,
      "verse": 42,
      "translations": [
        {
          "version": "NIV",
          "text": "but if the animals were weak, he would not place them there. So the weak animals went to Laban and the strong ones to Jacob."
        },
        {
          "version": "NLT",
          "text": "But he didn’t do this with the weaker ones, so the weaker lambs belonged to Laban, and the stronger ones were Jacob’s."
        },
        {
          "version": "ESV",
          "text": "but for the feebler of the flock he would not lay them there. So the feebler would be Laban’s, and the stronger Jacob’s."
        },
        {
          "version": "NKJV",
          "text": "But when the flocks were feeble, he did not put them in; so the feebler were Laban’s and the stronger Jacob’s."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:9",
          "text": "Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:12",
          "text": "‘Look up,’ he said, ‘and see that all the males that are mating with the flock are streaked, spotted, or speckled; for I have seen all that Laban has done to you."
        },
        {
          "reference": "Genesis 31:41-42",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times! / If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 32:10",
          "text": "I am unworthy of all the kindness and faithfulness You have shown Your servant. Indeed, with only my staff I came across the Jordan, but now I have become two camps."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Exodus 12:36",
          "text": "And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Exodus 3:21",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Deuteronomy 28:4",
          "text": "The fruit of your womb will be blessed, as well as the produce of your land and the offspring of your livestock—the calves of your herds and the lambs of your flocks."
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Proverbs 10:22",
          "text": "The blessing of the LORD enriches, and He adds no sorrow to it."
        },
        {
          "reference": "Isaiah 60:5",
          "text": "Then you will look and be radiant, and your heart will tremble and swell with joy, because the riches of the sea will be brought to you, and the wealth of the nations will come to you."
        },
        {
          "reference": "Jeremiah 29:11",
          "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, to give you a future and a hope."
        },
        {
          "reference": "Matthew 6:33",
          "text": "But seek first the kingdom of God and His righteousness, and all these things will be added unto you."
        },
        {
          "reference": "Luke 16:10",
          "text": "Whoever is faithful with very little will also be faithful with much, and whoever is dishonest with very little will also be dishonest with much."
        }
      ]
    },
    {
      "reference": "Genesis 30:43",
      "book": "Genesis",
      "chapter": 30,
      "verse": 43,
      "translations": [
        {
          "version": "NIV",
          "text": "In this way the man grew exceedingly prosperous and came to own large flocks, and female and male servants, and camels and donkeys."
        },
        {
          "version": "NLT",
          "text": "As a result, Jacob became very wealthy, with large flocks of sheep and goats, female and male servants, and many camels and donkeys."
        },
        {
          "version": "ESV",
          "text": "Thus the man increased greatly and had large flocks, female servants and male servants, and camels and donkeys."
        },
        {
          "version": "NKJV",
          "text": "Thus the man became exceedingly prosperous, and had large flocks, female and male servants, and camels and donkeys."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 13:2",
          "text": "And Abram had become extremely wealthy in livestock and silver and gold."
        },
        {
          "reference": "Genesis 24:35",
          "text": "“The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys."
        },
        {
          "reference": "Genesis 26:12-14",
          "text": "Now Isaac sowed seed in the land, and that very year he reaped a hundredfold. And the LORD blessed him, / and he became richer and richer, until he was exceedingly wealthy. / He owned so many flocks and herds and servants that the Philistines envied him."
        },
        {
          "reference": "Genesis 31:1",
          "text": "Now Jacob heard that Laban’s sons were saying, “Jacob has taken away all that belonged to our father and built all this wealth at our father’s expense.”"
        },
        {
          "reference": "Genesis 32:5",
          "text": "I have oxen, donkeys, flocks, menservants, and maidservants. I have sent this message to inform my master, so that I may find favor in your sight.’”"
        },
        {
          "reference": "Genesis 33:11",
          "text": "Please accept my gift that was brought to you, because God has been gracious to me and I have all I need.” So Jacob pressed him until he accepted."
        },
        {
          "reference": "Genesis 36:7",
          "text": "For their possessions were too great for them to dwell together; the land where they stayed could not support them because of their livestock."
        },
        {
          "reference": "Genesis 39:2-3",
          "text": "And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master. / When his master saw that the LORD was with him and made him prosper in all he did,"
        },
        {
          "reference": "Genesis 47:27",
          "text": "Now the Israelites settled in the land of Egypt, in the region of Goshen. They acquired property there and became fruitful and increased greatly in number."
        },
        {
          "reference": "Exodus 12:38",
          "text": "And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "1 Kings 3:13",
          "text": "Moreover, I will give you what you did not request—both riches and honor—so that during all your days no man in any kingdom will be your equal."
        },
        {
          "reference": "2 Chronicles 32:27-29",
          "text": "Hezekiah had very great riches and honor, and he made treasuries for his silver, gold, precious stones, spices, shields, and all kinds of valuable articles. / He also made storehouses for the harvest of grain and new wine and oil, stalls for all kinds of livestock, and pens for the flocks. / He made cities for himself, and he acquired herds of sheep and cattle in abundance, for God gave him very great wealth."
        },
        {
          "reference": "Job 1:3",
          "text": "and he owned 7,000 sheep, 3,000 camels, 500 yoke of oxen, 500 female donkeys, and a very large number of servants. Job was the greatest man of all the people of the East."
        },
        {
          "reference": "Job 42:10-12",
          "text": "After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions. / All his brothers and sisters and prior acquaintances came and dined with him in his house. They consoled him and comforted him over all the adversity that the LORD had brought upon him. And each one gave him a piece of silver and a gold ring. / So the LORD blessed Job’s latter days more than his first. He owned 14,000 sheep, 6,000 camels, 1,000 yoke of oxen, and 1,000 female donkeys."
        }
      ]
    }
  ]
}