{
  "book": "genesis",
  "chapter": 31,
  "verses": [
    {
      "reference": "Genesis 31:1",
      "book": "Genesis",
      "chapter": 31,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob heard that Laban’s sons were saying, “Jacob has taken everything our father owned and has gained all this wealth from what belonged to our father.”"
        },
        {
          "version": "NLT",
          "text": "But Jacob soon learned that Laban’s sons were grumbling about him. “Jacob has robbed our father of everything!” they said. “He has gained all his wealth at our father’s expense.”"
        },
        {
          "version": "ESV",
          "text": "Now Jacob heard that the sons of Laban were saying, “Jacob has taken all that was our father’s, and from what was our father’s he has gained all this wealth.”"
        },
        {
          "version": "NKJV",
          "text": "Now Jacob heard the words of Laban’s sons, saying, “Jacob has taken away all that was our father’s, and from what was our father’s he has acquired all this wealth.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 30:27-30",
          "text": "But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” / And he added, “Name your wages, and I will pay them.” / Then Jacob answered, “You know how I have served you and how your livestock have thrived under my care. ..."
        },
        {
          "reference": "Genesis 30:43",
          "text": "Thus Jacob became exceedingly prosperous. He owned large flocks, maidservants and menservants, and camels and donkeys."
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 29:30",
          "text": "Jacob slept with Rachel as well, and indeed, he loved Rachel more than Leah. So he worked for Laban another seven years."
        },
        {
          "reference": "Genesis 30:25-26",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.”"
        },
        {
          "reference": "Genesis 27:36",
          "text": "So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 32:9-10",
          "text": "Then Jacob declared, “O God of my father Abraham, God of my father Isaac, the LORD who told me, ‘Go back to your country and to your kindred, and I will make you prosper,’ / I am unworthy of all the kindness and faithfulness You have shown Your servant. Indeed, with only my staff I came across the Jordan, but now I have become two camps."
        },
        {
          "reference": "Exodus 1:9-10",
          "text": "“Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Deuteronomy 28:12-13",
          "text": "The LORD will open the heavens, His abundant storehouse, to send rain on your land in season and to bless all the work of your hands. You will lend to many nations, but borrow from none. / The LORD will make you the head and not the tail; you will only move upward and never downward, if you hear and carefully follow the commandments of the LORD your God, which I am giving you today."
        },
        {
          "reference": "Psalm 105:24",
          "text": "And the LORD made His people very fruitful, more numerous than their foes,"
        },
        {
          "reference": "Proverbs 10:22",
          "text": "The blessing of the LORD enriches, and He adds no sorrow to it."
        }
      ]
    },
    {
      "reference": "Genesis 31:2",
      "book": "Genesis",
      "chapter": 31,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "And Jacob noticed that Laban’s attitude toward him was not what it had been."
        },
        {
          "version": "NLT",
          "text": "And Jacob began to notice a change in Laban’s attitude toward him."
        },
        {
          "version": "ESV",
          "text": "And Jacob saw that Laban did not regard him with favor as before."
        },
        {
          "version": "NKJV",
          "text": "And Jacob saw the countenance of Laban, and indeed it was not favorable toward him as before."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 30:27",
          "text": "But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.”"
        },
        {
          "reference": "Genesis 31:5",
          "text": "and he told them, “I can see from your father’s countenance that his attitude toward me has changed; but the God of my father has been with me."
        },
        {
          "reference": "Genesis 31:7",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 29:30",
          "text": "Jacob slept with Rachel as well, and indeed, he loved Rachel more than Leah. So he worked for Laban another seven years."
        },
        {
          "reference": "Genesis 30:2",
          "text": "Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 30:34-35",
          "text": "“Agreed,” said Laban. “Let it be as you have said.” / That very day Laban removed all the streaked or spotted male goats and every speckled or spotted female goat—every one that had any white on it—and every dark-colored lamb, and he placed them under the care of his sons."
        },
        {
          "reference": "Genesis 31:20",
          "text": "Moreover, Jacob deceived Laban the Aramean by not telling him that he was running away."
        },
        {
          "reference": "Genesis 31:24",
          "text": "But that night God came to Laban the Aramean in a dream and warned him, “Be careful not to say anything to Jacob, either good or bad.”"
        },
        {
          "reference": "Genesis 31:29",
          "text": "I have power to do you great harm, but last night the God of your father said to me, ‘Be careful not to say anything to Jacob, either good or bad.’"
        },
        {
          "reference": "Genesis 31:42",
          "text": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 32:6-7",
          "text": "When the messengers returned to Jacob, they said, “We went to your brother Esau, and now he is coming to meet you—he and four hundred men with him.” / In great fear and distress, Jacob divided his people into two camps, as well as the flocks and herds and camels."
        },
        {
          "reference": "Genesis 33:1-4",
          "text": "Now Jacob looked up and saw Esau coming toward him with four hundred men. So he divided the children among Leah, Rachel, and the two maidservants. / He put the maidservants and their children in front, Leah and her children next, and Rachel and Joseph at the rear. / But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother. ..."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        }
      ]
    },
    {
      "reference": "Genesis 31:3",
      "book": "Genesis",
      "chapter": 31,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the LORD said to Jacob, “Go back to the land of your fathers and to your relatives, and I will be with you.”"
        },
        {
          "version": "NLT",
          "text": "Then the LORD said to Jacob, “Return to the land of your father and grandfather and to your relatives there, and I will be with you.”"
        },
        {
          "version": "ESV",
          "text": "Then the LORD said to Jacob, “Return to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "version": "NKJV",
          "text": "Then the LORD said to Jacob, “Return to the land of your fathers and to your family, and I will be with you.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 32:9",
          "text": "Then Jacob declared, “O God of my father Abraham, God of my father Isaac, the LORD who told me, ‘Go back to your country and to your kindred, and I will make you prosper,’"
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Exodus 3:12",
          "text": "“I will surely be with you,” God said, “and this will be the sign to you that I have sent you: When you have brought the people out of Egypt, all of you will worship God on this mountain.”"
        },
        {
          "reference": "Exodus 4:12",
          "text": "Now go! I will help you as you speak, and I will teach you what to say.”"
        },
        {
          "reference": "Deuteronomy 31:6",
          "text": "Be strong and courageous; do not be afraid or terrified of them, for it is the LORD your God who goes with you; He will never leave you nor forsake you.”"
        },
        {
          "reference": "Joshua 1:5",
          "text": "No one shall stand against you all the days of your life. As I was with Moses, so will I be with you; I will never leave you nor forsake you."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Isaiah 43:5",
          "text": "Do not be afraid, for I am with you; I will bring your offspring from the east and gather you from the west."
        },
        {
          "reference": "Jeremiah 1:8",
          "text": "Do not be afraid of them, for I am with you to deliver you,” declares the LORD."
        },
        {
          "reference": "Matthew 28:20",
          "text": "and teaching them to obey all that I have commanded you. And surely I am with you always, even to the end of the age.”"
        },
        {
          "reference": "Acts 18:9-10",
          "text": "One night the Lord spoke to Paul in a vision: “Do not be afraid; keep on speaking; do not be silent. / For I am with you and no one will lay a hand on you, because I have many people in this city.”"
        },
        {
          "reference": "Hebrews 13:5",
          "text": "Keep your lives free from the love of money and be content with what you have, for God has said: “Never will I leave you, never will I forsake you.”"
        },
        {
          "reference": "Genesis 46:3-4",
          "text": "“I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. / I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Genesis 12:1",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you."
        }
      ]
    },
    {
      "reference": "Genesis 31:4",
      "book": "Genesis",
      "chapter": 31,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "So Jacob sent word to Rachel and Leah to come out to the fields where his flocks were."
        },
        {
          "version": "NLT",
          "text": "So Jacob called Rachel and Leah out to the field where he was watching his flock."
        },
        {
          "version": "ESV",
          "text": "So Jacob sent and called Rachel and Leah into the field where his flock was"
        },
        {
          "version": "NKJV",
          "text": "So Jacob sent and called Rachel and Leah to the field, to his flock,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 2:24",
          "text": "For this reason a man will leave his father and mother and be united to his wife, and they will become one flesh."
        },
        {
          "reference": "Genesis 12:1",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 29:20",
          "text": "So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 35:2",
          "text": "So Jacob told his household and all who were with him, “Get rid of the foreign gods that are among you. Purify yourselves and change your garments."
        },
        {
          "reference": "Exodus 18:5-6",
          "text": "Moses’ father-in-law Jethro, along with Moses’ wife and sons, came to him in the desert, where he was encamped at the mountain of God. / He sent word to Moses, “I, your father-in-law Jethro, am coming to you with your wife and her two sons.”"
        },
        {
          "reference": "Ruth 1:16-17",
          "text": "But Ruth replied: “Do not urge me to leave you or to turn from following you. For wherever you go, I will go, and wherever you live, I will live; your people will be my people, and your God will be my God. / Where you die, I will die, and there I will be buried. May the LORD punish me, and ever so severely, if anything but death separates you and me.”"
        },
        {
          "reference": "1 Samuel 1:8",
          "text": "“Hannah, why are you crying?” her husband Elkanah asked. “Why won’t you eat? Why is your heart so grieved? Am I not better to you than ten sons?”"
        },
        {
          "reference": "1 Kings 19:19-21",
          "text": "So Elijah departed and found Elisha son of Shaphat. He was plowing with twelve teams of oxen, and he was with the twelfth team. Elijah passed by him and threw his cloak around him. / So Elisha left the oxen, ran after Elijah, and said, “Please let me kiss my father and mother goodbye, and then I will follow you.” “Go on back,” Elijah replied, “for what have I done to you?” / So Elisha turned back from him, took his pair of oxen, and slaughtered them. Using the oxen’s equipment for fuel, he cooked the meat and gave it to the people, and they ate. Then he set out to follow and serve Elijah."
        },
        {
          "reference": "Proverbs 31:10-12",
          "text": "A wife of noble character, who can find? She is far more precious than rubies. / The heart of her husband trusts in her, and he lacks nothing of value. / She brings him good and not harm all the days of her life."
        },
        {
          "reference": "Song of Solomon 2:10-13",
          "text": "My beloved calls to me, “Arise, my darling. Come away with me, my beautiful one. / For now the winter is past; the rain is over and gone. / The flowers have appeared in the countryside; the season of singing has come, and the cooing of turtledoves is heard in our land. ..."
        },
        {
          "reference": "Matthew 19:5-6",
          "text": "and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Mark 10:7-9",
          "text": "‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh. / Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Luke 14:26",
          "text": "“If anyone comes to Me and does not hate his father and mother and wife and children and brothers and sisters—yes, even his own life—he cannot be My disciple."
        }
      ]
    },
    {
      "reference": "Genesis 31:5",
      "book": "Genesis",
      "chapter": 31,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "He said to them, “I see that your father’s attitude toward me is not what it was before, but the God of my father has been with me."
        },
        {
          "version": "NLT",
          "text": "He said to them, “I have noticed that your father’s attitude toward me has changed. But the God of my father has been with me."
        },
        {
          "version": "ESV",
          "text": "and said to them, “I see that your father does not regard me with favor as he did before. But the God of my father has been with me."
        },
        {
          "version": "NKJV",
          "text": "and said to them, “I see your father’s countenance, that it is not favorable toward me as before; but the God of my father has been with me."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:42",
          "text": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 31:7",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 30:27",
          "text": "But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.”"
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 21:22",
          "text": "At that time Abimelech and Phicol the commander of his army said to Abraham, “God is with you in all that you do."
        },
        {
          "reference": "Genesis 26:24",
          "text": "and that night the LORD appeared to him and said, “I am the God of your father Abraham. Do not be afraid, for I am with you. I will bless you and multiply your descendants for the sake of My servant Abraham.”"
        },
        {
          "reference": "Genesis 39:2-3",
          "text": "And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master. / When his master saw that the LORD was with him and made him prosper in all he did,"
        },
        {
          "reference": "Genesis 39:21",
          "text": "the LORD was with him and extended kindness to him, granting him favor in the eyes of the prison warden."
        },
        {
          "reference": "Exodus 3:12",
          "text": "“I will surely be with you,” God said, “and this will be the sign to you that I have sent you: When you have brought the people out of Egypt, all of you will worship God on this mountain.”"
        },
        {
          "reference": "Exodus 33:14",
          "text": "And the LORD answered, “My Presence will go with you, and I will give you rest.”"
        },
        {
          "reference": "Deuteronomy 31:6",
          "text": "Be strong and courageous; do not be afraid or terrified of them, for it is the LORD your God who goes with you; He will never leave you nor forsake you.”"
        },
        {
          "reference": "Joshua 1:5",
          "text": "No one shall stand against you all the days of your life. As I was with Moses, so will I be with you; I will never leave you nor forsake you."
        },
        {
          "reference": "1 Samuel 18:14",
          "text": "and he continued to prosper in all his ways, because the LORD was with him."
        },
        {
          "reference": "1 Samuel 18:28",
          "text": "When Saul realized that the LORD was with David and that his daughter Michal loved David,"
        },
        {
          "reference": "Psalm 23:4",
          "text": "Even though I walk through the valley of the shadow of death, I will fear no evil, for You are with me; Your rod and Your staff, they comfort me."
        }
      ]
    },
    {
      "reference": "Genesis 31:6",
      "book": "Genesis",
      "chapter": 31,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "You know that I’ve worked for your father with all my strength,"
        },
        {
          "version": "NLT",
          "text": "You know how hard I have worked for your father,"
        },
        {
          "version": "ESV",
          "text": "You know that I have served your father with all my strength,"
        },
        {
          "version": "NKJV",
          "text": "And you know that with all my might I have served your father."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 30:29-30",
          "text": "Then Jacob answered, “You know how I have served you and how your livestock have thrived under my care. / Indeed, you had very little before my arrival, but now your wealth has increased many times over. The LORD has blessed you wherever I set foot. But now, when may I also provide for my own household?”"
        },
        {
          "reference": "Genesis 30:25-28",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” ..."
        },
        {
          "reference": "Genesis 29:18-20",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.” / Laban replied, “Better that I give her to you than to another. Stay here with me.” / So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 31:38-42",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes. ..."
        },
        {
          "reference": "Genesis 31:7-9",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. / Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Exodus 1:12-14",
          "text": "But the more they were oppressed, the more they multiplied and flourished; so the Egyptians came to dread the Israelites. / They worked the Israelites ruthlessly / and made their lives bitter with hard labor in brick and mortar, and with all kinds of work in the fields. Every service they imposed was harsh."
        },
        {
          "reference": "Exodus 3:7-9",
          "text": "The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings. / I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites. / And now the cry of the Israelites has reached Me, and I have seen how severely the Egyptians are oppressing them."
        },
        {
          "reference": "Exodus 5:6-9",
          "text": "That same day Pharaoh commanded the taskmasters of the people and their foremen: / “You shall no longer supply the people with straw for making bricks. They must go and gather their own straw. / But require of them the same quota of bricks as before; do not reduce it. For they are lazy; that is why they are crying out, ‘Let us go and sacrifice to our God.’ ..."
        },
        {
          "reference": "Leviticus 19:13",
          "text": "You must not defraud your neighbor or rob him. You must not withhold until morning the wages due a hired hand."
        },
        {
          "reference": "Deuteronomy 24:14-15",
          "text": "Do not oppress a hired hand who is poor and needy, whether he is a brother or a foreigner residing in one of your towns. / You are to pay his wages each day before sunset, because he is poor and depends on them. Otherwise he may cry out to the LORD against you, and you will be guilty of sin."
        },
        {
          "reference": "1 Samuel 18:5",
          "text": "So David marched out and prospered in everything Saul sent him to do, and Saul set him over the men of war. And this was pleasing in the sight of all the people, and of Saul’s officers as well."
        },
        {
          "reference": "1 Samuel 18:14",
          "text": "and he continued to prosper in all his ways, because the LORD was with him."
        },
        {
          "reference": "1 Samuel 25:15-16",
          "text": "Yet these men were very good to us. When we were in the field, we were not harassed, and nothing of ours went missing the whole time we lived among them. / They were a wall around us, both day and night, the whole time we were herding our sheep near them."
        },
        {
          "reference": "Nehemiah 5:8-9",
          "text": "and said, “We have done our best to buy back our Jewish brothers who were sold to foreigners, but now you are selling your own brothers, that they may be sold back to us!” But they remained silent, for they could find nothing to say. / So I continued, “What you are doing is not right. Shouldn’t you walk in the fear of our God to avoid the reproach of our foreign enemies?"
        },
        {
          "reference": "Job 31:38-40",
          "text": "if my land cries out against me and its furrows weep together, / if I have devoured its produce without payment or broken the spirit of its tenants, / then let briers grow instead of wheat and stinkweed instead of barley.” Thus conclude the words of Job."
        }
      ]
    },
    {
      "reference": "Genesis 31:7",
      "book": "Genesis",
      "chapter": 31,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "yet your father has cheated me by changing my wages ten times. However, God has not allowed him to harm me."
        },
        {
          "version": "NLT",
          "text": "but he has cheated me, changing my wages ten times. But God has not allowed him to do me any harm."
        },
        {
          "version": "ESV",
          "text": "yet your father has cheated me and changed my wages ten times. But God did not permit him to harm me."
        },
        {
          "version": "NKJV",
          "text": "Yet your father has deceived me and changed my wages ten times, but God did not allow him to hurt me."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 12:36",
          "text": "And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Leviticus 19:13",
          "text": "You must not defraud your neighbor or rob him. You must not withhold until morning the wages due a hired hand."
        },
        {
          "reference": "Deuteronomy 24:14-15",
          "text": "Do not oppress a hired hand who is poor and needy, whether he is a brother or a foreigner residing in one of your towns. / You are to pay his wages each day before sunset, because he is poor and depends on them. Otherwise he may cry out to the LORD against you, and you will be guilty of sin."
        },
        {
          "reference": "Malachi 3:5",
          "text": "“Then I will draw near to you for judgment. And I will be a swift witness against sorcerers and adulterers and perjurers, against oppressors of the widowed and fatherless, and against those who defraud laborers of their wages and deny justice to the foreigner but do not fear Me,” says the LORD of Hosts."
        },
        {
          "reference": "James 5:4",
          "text": "Look, the wages you withheld from the workmen who mowed your fields are crying out against you. The cries of the harvesters have reached the ears of the Lord of Hosts."
        },
        {
          "reference": "1 Samuel 24:15",
          "text": "May the LORD be our judge and decide between you and me. May He take notice and plead my case and deliver me from your hand.”"
        },
        {
          "reference": "Psalm 105:14-15",
          "text": "He let no man oppress them; He rebuked kings on their behalf: / “Do not touch My anointed ones! Do no harm to My prophets!”"
        },
        {
          "reference": "Proverbs 22:22-23",
          "text": "Do not rob a poor man because he is poor, and do not crush the afflicted at the gate, / for the LORD will take up their case and will plunder those who rob them."
        },
        {
          "reference": "Jeremiah 22:13",
          "text": "“Woe to him who builds his palace by unrighteousness, and his upper rooms without justice, who makes his countrymen serve without pay, and fails to pay their wages,"
        },
        {
          "reference": "Micah 2:1-3",
          "text": "Woe to those who devise iniquity and plot evil on their beds! At morning’s light they accomplish it because the power is in their hands. / They covet fields and seize them; they take away houses. They deprive a man of his home, a fellow man of his inheritance. / Therefore this is what the LORD says: “I am planning against this nation a disaster from which you cannot free your necks. Then you will not walk so proudly, for it will be a time of calamity."
        },
        {
          "reference": "1 Thessalonians 4:6",
          "text": "and no one should ever violate or exploit his brother in this regard, because the Lord will avenge all such acts, as we have already told you and solemnly warned you."
        },
        {
          "reference": "1 Peter 2:18-20",
          "text": "Servants, submit yourselves to your masters with all respect, not only to those who are good and gentle, but even to those who are unreasonable. / For if anyone endures the pain of unjust suffering because he is conscious of God, this is to be commended. / How is it to your credit if you are beaten for doing wrong and you endure it? But if you suffer for doing good and you endure it, this is commendable before God."
        },
        {
          "reference": "Colossians 3:22-25",
          "text": "Slaves, obey your earthly masters in everything, not only to please them while they are watching, but with sincerity of heart and fear of the Lord. / Whatever you do, work at it with your whole being, as for the Lord and not for men, / because you know that you will receive an inheritance from the Lord as your reward. It is the Lord Christ you are serving. ..."
        },
        {
          "reference": "Ephesians 6:9",
          "text": "And masters, do the same for your slaves. Give up your use of threats, because you know that He who is both their Master and yours is in heaven, and there is no favoritism with Him."
        },
        {
          "reference": "Luke 16:10-12",
          "text": "Whoever is faithful with very little will also be faithful with much, and whoever is dishonest with very little will also be dishonest with much. / So if you have not been faithful with worldly wealth, who will entrust you with true riches? / And if you have not been faithful with the belongings of another, who will give you belongings of your own?"
        }
      ]
    },
    {
      "reference": "Genesis 31:8",
      "book": "Genesis",
      "chapter": 31,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "If he said, ‘The speckled ones will be your wages,’ then all the flocks gave birth to speckled young; and if he said, ‘The streaked ones will be your wages,’ then all the flocks bore streaked young."
        },
        {
          "version": "NLT",
          "text": "For if he said, ‘The speckled animals will be your wages,’ the whole flock began to produce speckled young. And when he changed his mind and said, ‘The striped animals will be your wages,’ then the whole flock produced striped young."
        },
        {
          "version": "ESV",
          "text": "If he said, ‘The spotted shall be your wages,’ then all the flock bore spotted; and if he said, ‘The striped shall be your wages,’ then all the flock bore striped."
        },
        {
          "version": "NKJV",
          "text": "If he said thus: ‘The speckled shall be your wages,’ then all the flocks bore speckled. And if he said thus: ‘The streaked shall be your wages,’ then all the flocks bore streaked."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 30:32-43",
          "text": "Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb, and every spotted or speckled goat. These will be my wages. / So my honesty will testify for me when you come to check on my wages in the future. If I have any goats that are not speckled or spotted, or any lambs that are not dark-colored, they will be considered stolen.” / “Agreed,” said Laban. “Let it be as you have said.” ..."
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Leviticus 26:9",
          "text": "I will turn toward you and make you fruitful and multiply you, and I will establish My covenant with you."
        },
        {
          "reference": "Deuteronomy 28:4",
          "text": "The fruit of your womb will be blessed, as well as the produce of your land and the offspring of your livestock—the calves of your herds and the lambs of your flocks."
        },
        {
          "reference": "Deuteronomy 28:11",
          "text": "The LORD will make you prosper abundantly—in the fruit of your womb, the offspring of your livestock, and the produce of your land—in the land that the LORD swore to your fathers to give you."
        },
        {
          "reference": "Deuteronomy 28:51",
          "text": "They will eat the offspring of your livestock and the produce of your land until you are destroyed. They will leave you no grain or new wine or oil, no calves of your herds or lambs of your flocks, until they have caused you to perish."
        },
        {
          "reference": "1 Samuel 2:7-8",
          "text": "The LORD sends poverty and wealth; He humbles and He exalts. / He raises the poor from the dust and lifts the needy from the ash heap. He seats them among princes and bestows on them a throne of honor. For the foundations of the earth are the LORD’s, and upon them He has set the world."
        },
        {
          "reference": "1 Samuel 25:2",
          "text": "Now there was a man in Maon whose business was in Carmel. He was a very wealthy man with a thousand goats and three thousand sheep, which he was shearing in Carmel."
        },
        {
          "reference": "Job 42:12",
          "text": "So the LORD blessed Job’s latter days more than his first. He owned 14,000 sheep, 6,000 camels, 1,000 yoke of oxen, and 1,000 female donkeys."
        },
        {
          "reference": "Psalm 37:25-26",
          "text": "I once was young and now am old, yet never have I seen the righteous abandoned or their children begging for bread. / They are ever generous and quick to lend, and their children are a blessing."
        },
        {
          "reference": "Psalm 128:1-2",
          "text": "A song of ascents. Blessed are all who fear the LORD, who walk in His ways! / For when you eat the fruit of your labor, blessings and prosperity will be yours."
        },
        {
          "reference": "Proverbs 10:22",
          "text": "The blessing of the LORD enriches, and He adds no sorrow to it."
        },
        {
          "reference": "Proverbs 13:22",
          "text": "A good man leaves an inheritance to his children’s children, but the sinner’s wealth is passed to the righteous."
        },
        {
          "reference": "Isaiah 61:7",
          "text": "Instead of shame, My people will have a double portion, and instead of humiliation, they will rejoice in their share; and so they will inherit a double portion in their land, and everlasting joy will be theirs."
        }
      ]
    },
    {
      "reference": "Genesis 31:9",
      "book": "Genesis",
      "chapter": 31,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "So God has taken away your father’s livestock and has given them to me."
        },
        {
          "version": "NLT",
          "text": "In this way, God has taken your father’s animals and given them to me."
        },
        {
          "version": "ESV",
          "text": "Thus God has taken away the livestock of your father and given them to me."
        },
        {
          "version": "NKJV",
          "text": "So God has taken away the livestock of your father and given them to me."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Psalm 105:37",
          "text": "He brought Israel out with silver and gold, and none among His tribes stumbled."
        },
        {
          "reference": "Proverbs 13:22",
          "text": "A good man leaves an inheritance to his children’s children, but the sinner’s wealth is passed to the righteous."
        },
        {
          "reference": "Proverbs 28:8",
          "text": "He who increases his wealth by interest and usury lays it up for one who is kind to the poor."
        },
        {
          "reference": "Isaiah 61:6",
          "text": "But you will be called the priests of the LORD; they will speak of you as ministers of our God; you will feed on the wealth of nations, and you will boast in their riches."
        },
        {
          "reference": "Isaiah 61:8",
          "text": "For I, the LORD, love justice; I hate robbery and iniquity; in My faithfulness I will give them their recompense and make an everlasting covenant with them."
        },
        {
          "reference": "Ezekiel 39:10",
          "text": "They will not gather wood from the countryside or cut it from the forests, for they will use the weapons for fuel. They will loot those who looted them and plunder those who plundered them, declares the Lord GOD."
        },
        {
          "reference": "Job 27:16-17",
          "text": "Though he heaps up silver like dust and piles up a wardrobe like clay, / what he lays up, the righteous will wear, and his silver will be divided by the innocent."
        },
        {
          "reference": "James 5:4",
          "text": "Look, the wages you withheld from the workmen who mowed your fields are crying out against you. The cries of the harvesters have reached the ears of the Lord of Hosts."
        },
        {
          "reference": "Luke 1:51-53",
          "text": "He has performed mighty deeds with His arm; He has scattered those who are proud in the thoughts of their hearts. / He has brought down rulers from their thrones, but has exalted the humble. / He has filled the hungry with good things, but has sent the rich away empty."
        },
        {
          "reference": "Luke 16:11",
          "text": "So if you have not been faithful with worldly wealth, who will entrust you with true riches?"
        },
        {
          "reference": "1 Corinthians 10:26",
          "text": "for, “The earth is the Lord’s, and the fullness thereof.”"
        },
        {
          "reference": "2 Corinthians 8:9",
          "text": "For you know the grace of our Lord Jesus Christ, that though He was rich, yet for your sake He became poor, so that you through His poverty might become rich."
        }
      ]
    },
    {
      "reference": "Genesis 31:10",
      "book": "Genesis",
      "chapter": 31,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "“In breeding season I once had a dream in which I looked up and saw that the male goats mating with the flock were streaked, speckled or spotted."
        },
        {
          "version": "NLT",
          "text": "“One time during the mating season, I had a dream and saw that the male goats mating with the females were streaked, speckled, and spotted."
        },
        {
          "version": "ESV",
          "text": "In the breeding season of the flock I lifted up my eyes and saw in a dream that the goats that mated with the flock were striped, spotted, and mottled."
        },
        {
          "version": "NKJV",
          "text": "“And it happened, at the time when the flocks conceived, that I lifted my eyes and saw in a dream, and behold, the rams which leaped upon the flocks were streaked, speckled, and gray-spotted."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 30:37-43",
          "text": "Jacob, however, took fresh branches of poplar, almond, and plane trees, and peeled the bark, exposing the white inner wood of the branches. / Then he set the peeled branches in the watering troughs in front of the flocks coming in to drink. So when the flocks were in heat and came to drink, / they mated in front of the branches. And they bore young that were streaked or speckled or spotted. ..."
        },
        {
          "reference": "Genesis 28:12-15",
          "text": "And Jacob had a dream about a ladder that rested on the earth with its top reaching up to heaven, and God’s angels were going up and down the ladder. / And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. ..."
        },
        {
          "reference": "Genesis 37:5-10",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 46:2",
          "text": "And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob."
        },
        {
          "reference": "Numbers 12:6",
          "text": "He said, “Hear now My words: If there is a prophet among you, I, the LORD, will reveal Myself to him in a vision; I will speak to him in a dream."
        },
        {
          "reference": "Job 33:14-16",
          "text": "For God speaks in one way and in another, yet no one notices. / In a dream, in a vision in the night, when deep sleep falls upon men as they slumber on their beds, / He opens their ears and terrifies them with warnings"
        },
        {
          "reference": "Daniel 2:19",
          "text": "During the night, the mystery was revealed to Daniel in a vision, and he blessed the God of heaven"
        },
        {
          "reference": "Daniel 7:1",
          "text": "In the first year of the reign of Belshazzar over Babylon, Daniel had a dream, and visions passed through his mind as he lay on his bed. He wrote down the dream, and this is the summary of his account."
        },
        {
          "reference": "Matthew 1:20",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit."
        },
        {
          "reference": "Matthew 2:12-13",
          "text": "And having been warned in a dream not to return to Herod, they withdrew to their country by another route. / When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.”"
        },
        {
          "reference": "Matthew 2:19-22",
          "text": "After Herod died, an angel of the Lord appeared in a dream to Joseph in Egypt. / “Get up!” he said. “Take the Child and His mother and go to the land of Israel, for those seeking the Child’s life are now dead.” / So Joseph got up, took the Child and His mother, and went to the land of Israel. ..."
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Acts 10:10-16",
          "text": "He became hungry and wanted something to eat, but while the meal was being prepared, he fell into a trance. / He saw heaven open and something like a large sheet being let down to earth by its four corners. / It contained all kinds of four-footed animals and reptiles of the earth, as well as birds of the air. ..."
        },
        {
          "reference": "Acts 16:9-10",
          "text": "During the night, Paul had a vision of a man of Macedonia standing and pleading with him, “Come over to Macedonia and help us.” / As soon as Paul had seen the vision, we got ready to leave for Macedonia, concluding that God had called us to preach the gospel to them."
        },
        {
          "reference": "Acts 18:9-10",
          "text": "One night the Lord spoke to Paul in a vision: “Do not be afraid; keep on speaking; do not be silent. / For I am with you and no one will lay a hand on you, because I have many people in this city.”"
        }
      ]
    },
    {
      "reference": "Genesis 31:11",
      "book": "Genesis",
      "chapter": 31,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "The angel of God said to me in the dream, ‘Jacob.’ I answered, ‘Here I am.’"
        },
        {
          "version": "NLT",
          "text": "Then in my dream, the angel of God said to me, ‘Jacob!’ And I replied, ‘Yes, here I am.’"
        },
        {
          "version": "ESV",
          "text": "Then the angel of God said to me in the dream, ‘Jacob,’ and I said, ‘Here I am!’"
        },
        {
          "version": "NKJV",
          "text": "Then the Angel of God spoke to me in a dream, saying, ‘Jacob.’ And I said, ‘Here I am.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:2",
          "text": "There the angel of the LORD appeared to him in a blazing fire from within a bush. Moses saw the bush ablaze with fire, but it was not consumed."
        },
        {
          "reference": "Judges 6:12",
          "text": "And the angel of the LORD appeared to Gideon and said, “The LORD is with you, O mighty man of valor.”"
        },
        {
          "reference": "Acts 7:30",
          "text": "After forty years had passed, an angel appeared to Moses in the flames of a burning bush in the desert near Mount Sinai."
        },
        {
          "reference": "Matthew 1:20",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit."
        },
        {
          "reference": "Luke 1:11",
          "text": "Just then an angel of the Lord appeared to Zechariah, standing at the right side of the altar of incense."
        },
        {
          "reference": "Daniel 10:5-6",
          "text": "I lifted up my eyes, and behold, there was a certain man dressed in linen, with a belt of fine gold from Uphaz around his waist. / His body was like beryl, his face like the brilliance of lightning, his eyes like flaming torches, his arms and legs like the gleam of polished bronze, and his voice like the sound of a multitude."
        },
        {
          "reference": "Zechariah 1:11-12",
          "text": "And the riders answered the angel of the LORD who was standing among the myrtle trees, “We have patrolled the earth, and behold, all the earth is at rest and tranquil.” / Then the angel of the LORD said, “How long, O LORD of Hosts, will You withhold mercy from Jerusalem and the cities of Judah, with which You have been angry these seventy years?”"
        },
        {
          "reference": "Revelation 22:8-9",
          "text": "And I, John, am the one who heard and saw these things. And when I had heard and seen them, I fell down to worship at the feet of the angel who had shown me these things. / But he said to me, “Do not do that! I am a fellow servant with you and your brothers the prophets, and with those who keep the words of this book. Worship God!”"
        },
        {
          "reference": "Acts 12:7",
          "text": "Suddenly an angel of the Lord appeared and a light shone in the cell. He tapped Peter on the side and woke him up, saying, “Get up quickly.” And the chains fell off his wrists."
        },
        {
          "reference": "Luke 2:9",
          "text": "Just then an angel of the Lord stood before them, and the glory of the Lord shone around them, and they were terrified."
        },
        {
          "reference": "Numbers 22:22-23",
          "text": "Then God’s anger was kindled because Balaam was going along, and the angel of the LORD stood in the road to oppose him. Balaam was riding his donkey, and his two servants were with him. / When the donkey saw the angel of the LORD standing in the road with a drawn sword in his hand, she turned off the path and went into a field. So Balaam beat her to return her to the path."
        },
        {
          "reference": "1 Kings 19:5",
          "text": "Then he lay down under the broom tree and fell asleep. Suddenly an angel touched him and said, “Get up and eat.”"
        },
        {
          "reference": "Matthew 28:2-3",
          "text": "Suddenly there was a great earthquake, for an angel of the Lord descended from heaven, rolled away the stone, and sat on it. / His appearance was like lightning, and his clothes were white as snow."
        },
        {
          "reference": "Acts 10:3",
          "text": "One day at about the ninth hour, he had a clear vision of an angel of God who came to him and said, “Cornelius!”"
        },
        {
          "reference": "Genesis 16:7",
          "text": "Now the angel of the LORD found Hagar by a spring of water in the desert—the spring along the road to Shur."
        }
      ]
    },
    {
      "reference": "Genesis 31:12",
      "book": "Genesis",
      "chapter": 31,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "And he said, ‘Look up and see that all the male goats mating with the flock are streaked, speckled or spotted, for I have seen all that Laban has been doing to you."
        },
        {
          "version": "NLT",
          "text": "“The angel said, ‘Look up, and you will see that only the streaked, speckled, and spotted males are mating with the females of your flock. For I have seen how Laban has treated you."
        },
        {
          "version": "ESV",
          "text": "And he said, ‘Lift up your eyes and see, all the goats that mate with the flock are striped, spotted, and mottled, for I have seen all that Laban is doing to you."
        },
        {
          "version": "NKJV",
          "text": "And He said, ‘Lift your eyes now and see, all the rams which leap on the flocks are streaked, speckled, and gray-spotted; for I have seen all that Laban is doing to you."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:7-8",
          "text": "The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings. / I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites."
        },
        {
          "reference": "Exodus 3:16",
          "text": "Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt."
        },
        {
          "reference": "Exodus 4:31",
          "text": "and they believed. And when they heard that the LORD had attended to the Israelites and had seen their affliction, they bowed down and worshiped."
        },
        {
          "reference": "Exodus 14:19-20",
          "text": "And the angel of God, who had gone before the camp of Israel, withdrew and went behind them. The pillar of cloud also moved from before them and stood behind them, / so that it came between the camps of Egypt and Israel. The cloud was there in the darkness, but it lit up the night. So all night long neither camp went near the other."
        },
        {
          "reference": "Exodus 23:20-23",
          "text": "Behold, I am sending an angel before you to protect you along the way and to bring you to the place I have prepared. / Pay attention to him and listen to his voice; do not defy him, for he will not forgive rebellion, since My Name is in him. / But if you will listen carefully to his voice and do everything I say, I will be an enemy to your enemies and a foe to your foes. ..."
        },
        {
          "reference": "Deuteronomy 11:12",
          "text": "It is a land for which the LORD your God cares; the eyes of the LORD your God are always on it, from the beginning to the end of the year."
        },
        {
          "reference": "Deuteronomy 26:7-9",
          "text": "So we called out to the LORD, the God of our fathers; and the LORD heard our voice and saw our affliction, toil, and oppression. / Then the LORD brought us out of Egypt with a mighty hand and an outstretched arm, with great terror, signs, and wonders. / And He brought us to this place and gave us this land, a land flowing with milk and honey."
        },
        {
          "reference": "Psalm 34:15",
          "text": "The eyes of the LORD are on the righteous, and His ears are inclined to their cry."
        },
        {
          "reference": "Psalm 121:3-4",
          "text": "He will not allow your foot to slip; your Protector will not slumber. / Behold, the Protector of Israel will neither slumber nor sleep."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Isaiah 43:1-2",
          "text": "But now, this is what the LORD says—He who created you, O Jacob, and He who formed you, O Israel: “Do not fear, for I have redeemed you; I have called you by your name; you are Mine! / When you pass through the waters, I will be with you; and when you go through the rivers, they will not overwhelm you. When you walk through the fire, you will not be scorched; the flames will not set you ablaze."
        },
        {
          "reference": "Jeremiah 1:12",
          "text": "“You have observed correctly,” said the LORD, “for I am watching over My word to accomplish it.”"
        },
        {
          "reference": "Jeremiah 29:11",
          "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, to give you a future and a hope."
        },
        {
          "reference": "Matthew 28:20",
          "text": "and teaching them to obey all that I have commanded you. And surely I am with you always, even to the end of the age.”"
        },
        {
          "reference": "Luke 1:78-79",
          "text": "because of the tender mercy of our God, by which the Dawn will visit us from on high, / to shine on those who live in darkness and in the shadow of death, to guide our feet into the path of peace.”"
        }
      ]
    },
    {
      "reference": "Genesis 31:13",
      "book": "Genesis",
      "chapter": 31,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "I am the God of Bethel, where you anointed a pillar and where you made a vow to me. Now leave this land at once and go back to your native land.’”"
        },
        {
          "version": "NLT",
          "text": "I am the God who appeared to you at Bethel, the place where you anointed the pillar of stone and made your vow to me. Now get ready and leave this country and return to the land of your birth.’”"
        },
        {
          "version": "ESV",
          "text": "I am the God of Bethel, where you anointed a pillar and made a vow to me. Now arise, go out from this land and return to the land of your kindred.’”"
        },
        {
          "version": "NKJV",
          "text": "I am the God of Bethel, where you anointed the pillar and where you made a vow to Me. Now arise, get out of this land, and return to the land of your family.’ ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 35:1-3",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.” / So Jacob told his household and all who were with him, “Get rid of the foreign gods that are among you. Purify yourselves and change your garments. / Then let us arise and go to Bethel. I will build an altar there to God, who answered me in my day of distress. He has been with me wherever I have gone.”"
        },
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Exodus 3:15-16",
          "text": "God also told Moses, “Say to the Israelites, ‘The LORD, the God of your fathers—the God of Abraham, the God of Isaac, and the God of Jacob—has sent me to you.’ This is My name forever, and this is how I am to be remembered in every generation. / Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt."
        },
        {
          "reference": "Exodus 20:2",
          "text": "“I am the LORD your God, who brought you out of the land of Egypt, out of the house of slavery."
        },
        {
          "reference": "Genesis 32:9",
          "text": "Then Jacob declared, “O God of my father Abraham, God of my father Isaac, the LORD who told me, ‘Go back to your country and to your kindred, and I will make you prosper,’"
        },
        {
          "reference": "Genesis 46:1-3",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there."
        },
        {
          "reference": "Genesis 48:3",
          "text": "Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan, and there He blessed me"
        },
        {
          "reference": "Genesis 50:24",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.”"
        },
        {
          "reference": "Exodus 6:2-3",
          "text": "God also told Moses, “I am the LORD. / I appeared to Abraham, to Isaac, and to Jacob as God Almighty, but by My name the LORD I did not make Myself known to them."
        },
        {
          "reference": "Exodus 33:1",
          "text": "Then the LORD said to Moses, “Leave this place, you and the people you brought up out of the land of Egypt, and go to the land that I promised to Abraham, Isaac, and Jacob when I said, ‘I will give it to your descendants.’"
        },
        {
          "reference": "Deuteronomy 1:8",
          "text": "See, I have placed the land before you. Enter and possess the land that the LORD swore He would give to your fathers Abraham, Isaac, and Jacob, and to their descendants after them.”"
        },
        {
          "reference": "Deuteronomy 6:10",
          "text": "And when the LORD your God brings you into the land He swore to your fathers, to Abraham, Isaac, and Jacob, that He would give you—a land with great and splendid cities that you did not build,"
        },
        {
          "reference": "Deuteronomy 26:3",
          "text": "to the priest who is serving at that time, and say to him, “I declare today to the LORD your God that I have entered the land that the LORD swore to our fathers to give us.”"
        },
        {
          "reference": "Joshua 24:3",
          "text": "But I took your father Abraham from beyond the Euphrates and led him through all the land of Canaan, and I multiplied his descendants. I gave him Isaac,"
        }
      ]
    },
    {
      "reference": "Genesis 31:14",
      "book": "Genesis",
      "chapter": 31,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Rachel and Leah replied, &#8220Do we still have any share in the inheritance of our father’s estate?"
        },
        {
          "version": "NLT",
          "text": "Rachel and Leah responded, “That’s fine with us! We won’t inherit any of our father’s wealth anyway."
        },
        {
          "version": "ESV",
          "text": "Then Rachel and Leah answered and said to him, “Is there any portion or inheritance left to us in our father’s house?"
        },
        {
          "version": "NKJV",
          "text": "Then Rachel and Leah answered and said to him, “Is there still any portion or inheritance for us in our father’s house?"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 31:15",
      "book": "Genesis",
      "chapter": 31,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "Does he not regard us as foreigners? Not only has he sold us, but he has used up what was paid for us."
        },
        {
          "version": "NLT",
          "text": "He has reduced our rights to those of foreign women. And after he sold us, he wasted the money you paid him for us."
        },
        {
          "version": "ESV",
          "text": "Are we not regarded by him as foreigners? For he has sold us, and he has indeed devoured our money."
        },
        {
          "version": "NKJV",
          "text": "Are we not considered strangers by him? For he has sold us, and also completely consumed our money."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:20-30",
          "text": "So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her. / Finally Jacob said to Laban, “Grant me my wife, for my time is complete, and I want to sleep with her.” / So Laban invited all the men of that place and prepared a feast. ..."
        },
        {
          "reference": "Genesis 30:26-30",
          "text": "Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” / And he added, “Name your wages, and I will pay them.” ..."
        },
        {
          "reference": "Genesis 27:43-45",
          "text": "So now, my son, obey my voice and flee at once to my brother Laban in Haran. / Stay with him for a while, until your brother’s fury subsides— / until your brother’s rage against you wanes and he forgets what you have done to him. Then I will send for you and bring you back from there. Why should I lose both of you in one day?”"
        },
        {
          "reference": "Genesis 24:35",
          "text": "“The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys."
        },
        {
          "reference": "Genesis 25:5-6",
          "text": "Abraham left everything he owned to Isaac. / But while he was still alive, Abraham gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east."
        },
        {
          "reference": "Genesis 28:2-5",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother. / May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples. / And may He give the blessing of Abraham to you and your descendants, so that you may possess the land where you dwell as a foreigner, the land God gave to Abraham.” ..."
        },
        {
          "reference": "Genesis 30:31-43",
          "text": "“What can I give you?” Laban asked. “You do not need to give me anything,” Jacob replied. “If you do this one thing for me, I will keep on shepherding and keeping your flocks. / Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb, and every spotted or speckled goat. These will be my wages. / So my honesty will testify for me when you come to check on my wages in the future. If I have any goats that are not speckled or spotted, or any lambs that are not dark-colored, they will be considered stolen.” ..."
        },
        {
          "reference": "Genesis 31:7-9",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. / Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:41-42",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times! / If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 32:10",
          "text": "I am unworthy of all the kindness and faithfulness You have shown Your servant. Indeed, with only my staff I came across the Jordan, but now I have become two camps."
        },
        {
          "reference": "Exodus 21:7-11",
          "text": "And if a man sells his daughter as a servant, she is not to go free as the menservants do. / If she is displeasing in the eyes of her master who had designated her for himself, he must allow her to be redeemed. He has no right to sell her to foreigners, since he has broken faith with her. / And if he chooses her for his son, he must deal with her as with a daughter. ..."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "Ruth 4:5-10",
          "text": "Then Boaz said, “On the day you buy the land from Naomi and also from Ruth the Moabitess, you must also acquire the widow of the deceased in order to raise up the name of the deceased on his inheritance.” / The kinsman-redeemer replied, “I cannot redeem it myself, or I would jeopardize my own inheritance. Take my right of redemption, because I cannot redeem it.” / Now in former times in Israel, concerning the redemption or exchange of property, to make any matter legally binding a man would remove his sandal and give it to the other party, and this was a confirmation in Israel. ..."
        },
        {
          "reference": "1 Samuel 18:17-19",
          "text": "Then Saul said to David, “Here is my older daughter Merab. I will give her to you in marriage. Only be valiant for me and fight the LORD’s battles.” But Saul was thinking, “I need not raise my hand against him; let the hand of the Philistines be against him.” / And David said to Saul, “Who am I, and what is my family or my father’s clan in Israel, that I should become the son-in-law of the king?” / So when it was time to give Saul’s daughter Merab to David, she was given in marriage to Adriel of Meholah."
        },
        {
          "reference": "1 Kings 21:3-4",
          "text": "But Naboth replied, “The LORD forbid that I should give you the inheritance of my fathers.” / So Ahab went to his palace, sullen and angry because Naboth the Jezreelite had told him, “I will not give you the inheritance of my fathers.” He lay down on his bed, turned his face away, and refused to eat."
        }
      ]
    },
    {
      "reference": "Genesis 31:16",
      "book": "Genesis",
      "chapter": 31,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "Surely all the wealth that God took away from our father belongs to us and our children. So do whatever God has told you.”"
        },
        {
          "version": "NLT",
          "text": "All the wealth God has given you from our father legally belongs to us and our children. So go ahead and do whatever God has told you.”"
        },
        {
          "version": "ESV",
          "text": "All the wealth that God has taken away from our father belongs to us and to our children. Now then, whatever God has said to you, do.”"
        },
        {
          "version": "NKJV",
          "text": "For all these riches which God has taken from our father are really ours and our children’s; now then, whatever God has said to you, do it.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:14-15",
          "text": "And Rachel and Leah replied, “Do we have any portion or inheritance left in our father’s house? / Are we not regarded by him as outsiders? Not only has he sold us, but he has certainly squandered what was paid for us."
        },
        {
          "reference": "Genesis 2:24",
          "text": "For this reason a man will leave his father and mother and be united to his wife, and they will become one flesh."
        },
        {
          "reference": "Genesis 12:1",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you."
        },
        {
          "reference": "Genesis 15:1",
          "text": "After these events, the word of the LORD came to Abram in a vision: “Do not be afraid, Abram. I am your shield, your very great reward.”"
        },
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 30:43",
          "text": "Thus Jacob became exceedingly prosperous. He owned large flocks, maidservants and menservants, and camels and donkeys."
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Joshua 24:2-3",
          "text": "And Joshua said to all the people, “This is what the LORD, the God of Israel, says: ‘Long ago your fathers, including Terah the father of Abraham and Nahor, lived beyond the Euphrates and worshiped other gods. / But I took your father Abraham from beyond the Euphrates and led him through all the land of Canaan, and I multiplied his descendants. I gave him Isaac,"
        },
        {
          "reference": "Ruth 4:11",
          "text": "“We are witnesses,” said the elders and all the people at the gate. “May the LORD make the woman entering your home like Rachel and Leah, who together built up the house of Israel. May you be prosperous in Ephrathah and famous in Bethlehem."
        },
        {
          "reference": "1 Samuel 25:42",
          "text": "So Abigail hurried and got on a donkey, and attended by five of her maidens, she followed David’s messengers and became his wife."
        },
        {
          "reference": "Psalm 37:25",
          "text": "I once was young and now am old, yet never have I seen the righteous abandoned or their children begging for bread."
        },
        {
          "reference": "Proverbs 13:22",
          "text": "A good man leaves an inheritance to his children’s children, but the sinner’s wealth is passed to the righteous."
        },
        {
          "reference": "Isaiah 61:6",
          "text": "But you will be called the priests of the LORD; they will speak of you as ministers of our God; you will feed on the wealth of nations, and you will boast in their riches."
        }
      ]
    },
    {
      "reference": "Genesis 31:17",
      "book": "Genesis",
      "chapter": 31,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob put his children and his wives on camels,"
        },
        {
          "version": "NLT",
          "text": "So Jacob put his wives and children on camels,"
        },
        {
          "version": "ESV",
          "text": "So Jacob arose and set his sons and his wives on camels."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob rose and set his sons and his wives on camels."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:4-5",
          "text": "So Abram departed, as the LORD had directed him, and Lot went with him. Abram was seventy-five years old when he left Haran. / And Abram took his wife Sarai, his nephew Lot, and all the possessions and people they had acquired in Haran, and set out for the land of Canaan. When they came to the land of Canaan,"
        },
        {
          "reference": "Genesis 28:5",
          "text": "So Isaac sent Jacob to Paddan-aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau."
        },
        {
          "reference": "Genesis 30:25-26",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.”"
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Genesis 46:1-7",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Exodus 12:31-32",
          "text": "Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested. / Take your flocks and herds as well, just as you have said, and depart! And bless me also.”"
        },
        {
          "reference": "Exodus 18:27",
          "text": "Then Moses sent his father-in-law on his way, and Jethro returned to his own land."
        },
        {
          "reference": "Numbers 10:29-32",
          "text": "Then Moses said to Hobab, the son of Moses’ father-in-law Reuel the Midianite, “We are setting out for the place of which the LORD said: ‘I will give it to you.’ Come with us, and we will treat you well, for the LORD has promised good things to Israel.” / “I will not go,” Hobab replied. “Instead, I am going back to my own land and my own people.” / “Please do not leave us,” Moses said, “since you know where we should camp in the wilderness, and you can serve as our eyes. ..."
        },
        {
          "reference": "Deuteronomy 26:5",
          "text": "and you are to declare before the LORD your God, “My father was a wandering Aramean, and he went down to Egypt few in number and lived there and became a great nation, mighty and numerous."
        },
        {
          "reference": "Joshua 24:2-3",
          "text": "And Joshua said to all the people, “This is what the LORD, the God of Israel, says: ‘Long ago your fathers, including Terah the father of Abraham and Nahor, lived beyond the Euphrates and worshiped other gods. / But I took your father Abraham from beyond the Euphrates and led him through all the land of Canaan, and I multiplied his descendants. I gave him Isaac,"
        },
        {
          "reference": "Ruth 1:6-7",
          "text": "When Naomi heard in Moab that the LORD had attended to His people by providing them with food, she and her daughters-in-law prepared to leave the land of Moab. / Accompanied by her two daughters-in-law, she left the place where she had been living and set out on the road leading back to the land of Judah."
        },
        {
          "reference": "1 Samuel 12:8",
          "text": "When Jacob went to Egypt, your fathers cried out to the LORD, and He sent them Moses and Aaron, who brought your fathers out of Egypt and settled them in this place."
        },
        {
          "reference": "2 Samuel 15:19-20",
          "text": "Then the king said to Ittai the Gittite, “Why should you also go with us? Go back and stay with the new king, since you are both a foreigner and an exile from your homeland. / In fact, you arrived only yesterday; should I make you wander around with us today while I do not know where I am going? Go back and take your brothers with you. May the LORD show you loving devotion and faithfulness.”"
        },
        {
          "reference": "1 Kings 19:20-21",
          "text": "So Elisha left the oxen, ran after Elijah, and said, “Please let me kiss my father and mother goodbye, and then I will follow you.” “Go on back,” Elijah replied, “for what have I done to you?” / So Elisha turned back from him, took his pair of oxen, and slaughtered them. Using the oxen’s equipment for fuel, he cooked the meat and gave it to the people, and they ate. Then he set out to follow and serve Elijah."
        },
        {
          "reference": "Isaiah 52:11-12",
          "text": "Depart, depart, go out from there! Touch no unclean thing; come out from it, purify yourselves, you who carry the vessels of the LORD. / For you will not leave in a hurry nor flee in haste, for the LORD goes before you, and the God of Israel is your rear guard."
        }
      ]
    },
    {
      "reference": "Genesis 31:18",
      "book": "Genesis",
      "chapter": 31,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "and he drove all his livestock ahead of him, along with all the goods he had accumulated in Paddan Aram, to go to his father Isaac in the land of Canaan."
        },
        {
          "version": "NLT",
          "text": "and he drove all his livestock in front of him. He packed all the belongings he had acquired in Paddan-aram and set out for the land of Canaan, where his father, Isaac, lived."
        },
        {
          "version": "ESV",
          "text": "He drove away all his livestock, all his property that he had gained, the livestock in his possession that he had acquired in Paddan-aram, to go to the land of Canaan to his father Isaac."
        },
        {
          "version": "NKJV",
          "text": "And he carried away all his livestock and all his possessions which he had gained, his acquired livestock which he had gained in Padan Aram, to go to his father Isaac in the land of Canaan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 30:43",
          "text": "Thus Jacob became exceedingly prosperous. He owned large flocks, maidservants and menservants, and camels and donkeys."
        },
        {
          "reference": "Genesis 32:9-10",
          "text": "Then Jacob declared, “O God of my father Abraham, God of my father Isaac, the LORD who told me, ‘Go back to your country and to your kindred, and I will make you prosper,’ / I am unworthy of all the kindness and faithfulness You have shown Your servant. Indeed, with only my staff I came across the Jordan, but now I have become two camps."
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Exodus 13:5",
          "text": "And when the LORD brings you into the land of the Canaanites, Hittites, Amorites, Hivites, and Jebusites—the land He swore to your fathers that He would give you, a land flowing with milk and honey—you shall keep this service in this month."
        },
        {
          "reference": "Exodus 33:1",
          "text": "Then the LORD said to Moses, “Leave this place, you and the people you brought up out of the land of Egypt, and go to the land that I promised to Abraham, Isaac, and Jacob when I said, ‘I will give it to your descendants.’"
        },
        {
          "reference": "Deuteronomy 1:8",
          "text": "See, I have placed the land before you. Enter and possess the land that the LORD swore He would give to your fathers Abraham, Isaac, and Jacob, and to their descendants after them.”"
        },
        {
          "reference": "Deuteronomy 6:10",
          "text": "And when the LORD your God brings you into the land He swore to your fathers, to Abraham, Isaac, and Jacob, that He would give you—a land with great and splendid cities that you did not build,"
        },
        {
          "reference": "Joshua 24:3",
          "text": "But I took your father Abraham from beyond the Euphrates and led him through all the land of Canaan, and I multiplied his descendants. I gave him Isaac,"
        },
        {
          "reference": "Psalm 105:9-11",
          "text": "the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: / “I will give you the land of Canaan as the portion of your inheritance.”"
        },
        {
          "reference": "Isaiah 41:8-10",
          "text": "“But you, O Israel, My servant, Jacob, whom I have chosen, descendant of Abraham My friend— / I brought you from the ends of the earth and called you from its farthest corners. I said, ‘You are My servant.’ I have chosen and not rejected you. / Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Acts 7:2-5",
          "text": "And Stephen declared: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Haran, / and told him, ‘Leave your country and your kindred and go to the land I will show you.’ / So Abraham left the land of the Chaldeans and settled in Haran. After his father died, God brought him out of that place and into this land where you are now living. ..."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        }
      ]
    },
    {
      "reference": "Genesis 31:19",
      "book": "Genesis",
      "chapter": 31,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "When Laban had gone to shear his sheep, Rachel stole her father’s household gods."
        },
        {
          "version": "NLT",
          "text": "At the time they left, Laban was some distance away, shearing his sheep. Rachel stole her father’s household idols and took them with her."
        },
        {
          "version": "ESV",
          "text": "Laban had gone to shear his sheep, and Rachel stole her father’s household gods."
        },
        {
          "version": "NKJV",
          "text": "Now Laban had gone to shear his sheep, and Rachel had stolen the household idols that were her father’s."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 35:2-4",
          "text": "So Jacob told his household and all who were with him, “Get rid of the foreign gods that are among you. Purify yourselves and change your garments. / Then let us arise and go to Bethel. I will build an altar there to God, who answered me in my day of distress. He has been with me wherever I have gone.” / So they gave Jacob all their foreign gods and all their earrings, and Jacob buried them under the oak near Shechem."
        },
        {
          "reference": "Joshua 24:2",
          "text": "And Joshua said to all the people, “This is what the LORD, the God of Israel, says: ‘Long ago your fathers, including Terah the father of Abraham and Nahor, lived beyond the Euphrates and worshiped other gods."
        },
        {
          "reference": "Joshua 24:14-15",
          "text": "Now, therefore, fear the LORD and serve Him in sincerity and truth; cast aside the gods your fathers served beyond the Euphrates and in Egypt, and serve the LORD. / But if it is unpleasing in your sight to serve the LORD, then choose for yourselves this day whom you will serve, whether the gods your fathers served beyond the Euphrates, or the gods of the Amorites in whose land you are living. As for me and my house, we will serve the LORD!”"
        },
        {
          "reference": "Judges 17:5",
          "text": "Now this man Micah had a shrine, and he made an ephod and some household idols, and ordained one of his sons as his priest."
        },
        {
          "reference": "Judges 18:14-20",
          "text": "Then the five men who had gone to spy out the land of Laish said to their brothers, “Did you know that one of these houses has an ephod, household gods, a graven image, and a molten idol? Now think about what you should do.” / So they turned aside there and went to the home of the young Levite, the house of Micah, and greeted him. / The six hundred Danites stood at the entrance of the gate, armed with their weapons of war. ..."
        },
        {
          "reference": "1 Samuel 19:13",
          "text": "Then Michal took a household idol and laid it in the bed, placed some goat hair on its head, and covered it with a garment."
        },
        {
          "reference": "1 Kings 11:5",
          "text": "Solomon followed Ashtoreth the goddess of the Sidonians and Milcom the abomination of the Ammonites."
        },
        {
          "reference": "1 Kings 11:33",
          "text": "For they have forsaken Me to worship Ashtoreth the goddess of the Sidonians, Chemosh the god of the Moabites, and Milcom the god of the Ammonites. They have not walked in My ways, nor done what is right in My eyes, nor kept My statutes and judgments, as Solomon’s father David did."
        },
        {
          "reference": "2 Kings 23:24",
          "text": "Furthermore, Josiah removed the mediums and spiritists, the household gods and idols, and all the abominations that were seen in the land of Judah and in Jerusalem. He did this to carry out the words of the law written in the book that Hilkiah the priest had found in the house of the LORD."
        },
        {
          "reference": "Hosea 3:4",
          "text": "For the Israelites must live many days without king or prince, without sacrifice or sacred pillar, and without ephod or idol."
        },
        {
          "reference": "Hosea 4:12",
          "text": "My people consult their wooden idols, and their divining rods inform them. For a spirit of prostitution leads them astray and they have played the harlot against their God."
        },
        {
          "reference": "Zechariah 10:2",
          "text": "For idols speak deceit and diviners see illusions; they tell false dreams and offer empty comfort. Therefore the people wander like sheep, oppressed for lack of a shepherd."
        },
        {
          "reference": "Acts 17:29",
          "text": "Therefore, being offspring of God, we should not think that the Divine Being is like gold or silver or stone, an image formed by man’s skill and imagination."
        },
        {
          "reference": "Romans 1:23",
          "text": "and exchanged the glory of the immortal God for images of mortal man and birds and animals and reptiles."
        },
        {
          "reference": "1 Corinthians 10:19-20",
          "text": "Am I suggesting, then, that food sacrificed to an idol is anything, or that an idol is anything? / No, but the sacrifices of pagans are offered to demons, not to God. And I do not want you to be participants with demons."
        }
      ]
    },
    {
      "reference": "Genesis 31:20",
      "book": "Genesis",
      "chapter": 31,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "Moreover, Jacob deceived Laban the Aramean by not telling him he was running away."
        },
        {
          "version": "NLT",
          "text": "Jacob outwitted Laban the Aramean, for they set out secretly and never told Laban they were leaving."
        },
        {
          "version": "ESV",
          "text": "And Jacob tricked Laban the Aramean, by not telling him that he intended to flee."
        },
        {
          "version": "NKJV",
          "text": "And Jacob stole away, unknown to Laban the Syrian, in that he did not tell him that he intended to flee."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:35",
          "text": "But Isaac replied, “Your brother came deceitfully and took your blessing.”"
        },
        {
          "reference": "Genesis 27:36",
          "text": "So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 27:41-45",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.” / When the words of her older son Esau were relayed to Rebekah, she sent for her younger son Jacob and told him, “Look, your brother Esau is consoling himself by plotting to kill you. / So now, my son, obey my voice and flee at once to my brother Laban in Haran. ..."
        },
        {
          "reference": "Genesis 30:25-26",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.”"
        },
        {
          "reference": "Genesis 31:3",
          "text": "Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 31:13",
          "text": "I am the God of Bethel, where you anointed the pillar and made a solemn vow to Me. Now get up, leave this land at once, and return to your native land.’”"
        },
        {
          "reference": "Genesis 31:17-18",
          "text": "Then Jacob got up and put his children and his wives on camels, / and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Genesis 31:24",
          "text": "But that night God came to Laban the Aramean in a dream and warned him, “Be careful not to say anything to Jacob, either good or bad.”"
        },
        {
          "reference": "Genesis 31:27",
          "text": "Why did you run away secretly and deceive me, without even telling me? I would have sent you away with joy and singing, with tambourines and harps."
        },
        {
          "reference": "Genesis 31:29",
          "text": "I have power to do you great harm, but last night the God of your father said to me, ‘Be careful not to say anything to Jacob, either good or bad.’"
        },
        {
          "reference": "Genesis 31:42",
          "text": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, surely by now you would have sent me away empty-handed. But God has seen my affliction and the toil of my hands, and last night He rendered judgment.”"
        },
        {
          "reference": "Genesis 32:9-12",
          "text": "Then Jacob declared, “O God of my father Abraham, God of my father Isaac, the LORD who told me, ‘Go back to your country and to your kindred, and I will make you prosper,’ / I am unworthy of all the kindness and faithfulness You have shown Your servant. Indeed, with only my staff I came across the Jordan, but now I have become two camps. / Please deliver me from the hand of my brother Esau, for I am afraid that he may come and attack me and the mothers and children with me. ..."
        },
        {
          "reference": "Exodus 14:5",
          "text": "When the king of Egypt was told that the people had fled, Pharaoh and his officials changed their minds about them and said, “What have we done? We have released Israel from serving us.”"
        },
        {
          "reference": "1 Samuel 19:12",
          "text": "So Michal lowered David from the window, and he ran away and escaped."
        },
        {
          "reference": "1 Samuel 20:1",
          "text": "Then David fled from Naioth in Ramah. He came to Jonathan and asked, “What have I done? What is my iniquity? How have I sinned against your father, that he wants to take my life?”"
        }
      ]
    },
    {
      "reference": "Genesis 31:21",
      "book": "Genesis",
      "chapter": 31,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "So he fled with all he had, crossed the Euphrates River, and headed for the hill country of Gilead."
        },
        {
          "version": "NLT",
          "text": "So Jacob took all his possessions with him and crossed the Euphrates River, heading for the hill country of Gilead."
        },
        {
          "version": "ESV",
          "text": "He fled with all that he had and arose and crossed the Euphrates, and set his face toward the hill country of Gilead."
        },
        {
          "version": "NKJV",
          "text": "So he fled with all that he had. He arose and crossed the river, and headed toward the mountains of Gilead."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 14:5-9",
          "text": "When the king of Egypt was told that the people had fled, Pharaoh and his officials changed their minds about them and said, “What have we done? We have released Israel from serving us.” / So Pharaoh prepared his chariot and took his army with him. / He took 600 of the best chariots, and all the other chariots of Egypt, with officers over all of them. ..."
        },
        {
          "reference": "Hosea 12:12",
          "text": "Jacob fled to the land of Aram and Israel worked for a wife—for a wife he tended sheep."
        },
        {
          "reference": "Genesis 28:5",
          "text": "So Isaac sent Jacob to Paddan-aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau."
        },
        {
          "reference": "Genesis 35:1-3",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.” / So Jacob told his household and all who were with him, “Get rid of the foreign gods that are among you. Purify yourselves and change your garments. / Then let us arise and go to Bethel. I will build an altar there to God, who answered me in my day of distress. He has been with me wherever I have gone.”"
        },
        {
          "reference": "Deuteronomy 26:5",
          "text": "and you are to declare before the LORD your God, “My father was a wandering Aramean, and he went down to Egypt few in number and lived there and became a great nation, mighty and numerous."
        },
        {
          "reference": "1 Samuel 19:12",
          "text": "So Michal lowered David from the window, and he ran away and escaped."
        },
        {
          "reference": "1 Kings 19:3",
          "text": "And Elijah was afraid and ran for his life. When he came to Beersheba in Judah, he left his servant there,"
        },
        {
          "reference": "Jeremiah 31:21",
          "text": "“Set up the road markers, put up the signposts. Keep the highway in mind, the road you have traveled. Return, O Virgin Israel, return to these cities of yours."
        },
        {
          "reference": "Acts 7:2-4",
          "text": "And Stephen declared: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Haran, / and told him, ‘Leave your country and your kindred and go to the land I will show you.’ / So Abraham left the land of the Chaldeans and settled in Haran. After his father died, God brought him out of that place and into this land where you are now living."
        },
        {
          "reference": "Hebrews 11:8-9",
          "text": "By faith Abraham, when called to go to a place he would later receive as his inheritance, obeyed and went, without knowing where he was going. / By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Matthew 2:13-15",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.” / So he got up, took the Child and His mother by night, and withdrew to Egypt, / where he stayed until the death of Herod. This fulfilled what the Lord had spoken through the prophet: “Out of Egypt I called My Son.”"
        },
        {
          "reference": "Matthew 2:20-21",
          "text": "“Get up!” he said. “Take the Child and His mother and go to the land of Israel, for those seeking the Child’s life are now dead.” / So Joseph got up, took the Child and His mother, and went to the land of Israel."
        },
        {
          "reference": "Acts 12:17",
          "text": "Peter motioned with his hand for silence, and he described how the Lord had brought him out of the prison. “Send word to James and to the brothers,” he said, and he left for another place."
        },
        {
          "reference": "Acts 13:17",
          "text": "The God of the people of Israel chose our fathers. He made them into a great people during their stay in Egypt, and with an uplifted arm He led them out of that land."
        },
        {
          "reference": "Acts 15:3",
          "text": "Sent on their way by the church, they passed through Phoenicia and Samaria, recounting the conversion of the Gentiles and bringing great joy to all the brothers."
        }
      ]
    },
    {
      "reference": "Genesis 31:22",
      "book": "Genesis",
      "chapter": 31,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "On the third day Laban was told that Jacob had fled."
        },
        {
          "version": "NLT",
          "text": "Three days later, Laban was told that Jacob had fled."
        },
        {
          "version": "ESV",
          "text": "When it was told Laban on the third day that Jacob had fled,"
        },
        {
          "version": "NKJV",
          "text": "And Laban was told on the third day that Jacob had fled."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 14:5-9",
          "text": "When the king of Egypt was told that the people had fled, Pharaoh and his officials changed their minds about them and said, “What have we done? We have released Israel from serving us.” / So Pharaoh prepared his chariot and took his army with him. / He took 600 of the best chariots, and all the other chariots of Egypt, with officers over all of them. ..."
        },
        {
          "reference": "Joshua 10:9-11",
          "text": "After marching all night from Gilgal, Joshua caught them by surprise. / And the LORD threw them into confusion before Israel, who defeated them in a great slaughter at Gibeon, pursued them along the ascent to Beth-horon, and struck them down as far as Azekah and Makkedah. / As they fled before Israel along the descent from Beth-horon to Azekah, the LORD cast down on them large hailstones from the sky, and more of them were killed by the hailstones than by the swords of the Israelites."
        },
        {
          "reference": "1 Samuel 19:11-12",
          "text": "Then Saul sent messengers to David’s house to watch him and kill him in the morning. But David’s wife Michal warned him, “If you do not run for your life tonight, tomorrow you will be dead!” / So Michal lowered David from the window, and he ran away and escaped."
        },
        {
          "reference": "1 Samuel 23:7-8",
          "text": "When Saul was told that David had gone to Keilah, he said, “God has delivered him into my hand, for he has trapped himself by entering a town with gates and bars.” / Then Saul summoned all his troops to go to war at Keilah and besiege David and his men."
        },
        {
          "reference": "2 Kings 6:13-14",
          "text": "So the king said, “Go and see where he is, that I may send men to capture him.” On receiving the report, “Elisha is in Dothan,” / the king of Aram sent horses, chariots, and a great army. They went there by night and surrounded the city."
        },
        {
          "reference": "Psalm 18:37",
          "text": "I pursued my enemies and overtook them; I did not turn back until they were consumed."
        },
        {
          "reference": "Psalm 35:4-6",
          "text": "May those who seek my life be disgraced and put to shame; may those who plan to harm me be driven back and confounded. / May they be like chaff in the wind, as the angel of the LORD drives them away. / May their path be dark and slick, as the angel of the LORD pursues."
        },
        {
          "reference": "Psalm 83:15",
          "text": "so pursue them with Your tempest, and terrify them with Your storm."
        },
        {
          "reference": "Proverbs 4:16",
          "text": "For they cannot sleep unless they do evil; they are deprived of slumber until they make someone fall."
        },
        {
          "reference": "Isaiah 59:7",
          "text": "Their feet run to evil; they are swift to shed innocent blood. Their thoughts are sinful thoughts; ruin and destruction lie in their wake."
        },
        {
          "reference": "Jeremiah 50:24",
          "text": "I laid a snare for you, O Babylon, and you were caught before you knew it. You were found and captured because you challenged the LORD."
        },
        {
          "reference": "Matthew 2:13-15",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.” / So he got up, took the Child and His mother by night, and withdrew to Egypt, / where he stayed until the death of Herod. This fulfilled what the Lord had spoken through the prophet: “Out of Egypt I called My Son.”"
        },
        {
          "reference": "Matthew 2:19-20",
          "text": "After Herod died, an angel of the Lord appeared in a dream to Joseph in Egypt. / “Get up!” he said. “Take the Child and His mother and go to the land of Israel, for those seeking the Child’s life are now dead.”"
        },
        {
          "reference": "Matthew 26:47-50",
          "text": "While Jesus was still speaking, Judas, one of the Twelve, arrived, accompanied by a large crowd armed with swords and clubs, sent from the chief priests and elders of the people. / Now the betrayer had arranged a signal with them: “The One I kiss is the man; arrest Him.” / Going directly to Jesus, he said, “Greetings, Rabbi!” and kissed Him. ..."
        },
        {
          "reference": "Luke 22:47-48",
          "text": "While He was still speaking, a crowd arrived, led by the man called Judas, one of the Twelve. He approached Jesus to kiss Him. / But Jesus asked him, “Judas, are you betraying the Son of Man with a kiss?”"
        }
      ]
    },
    {
      "reference": "Genesis 31:23",
      "book": "Genesis",
      "chapter": 31,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "Taking his relatives with him, he pursued Jacob for seven days and caught up with him in the hill country of Gilead."
        },
        {
          "version": "NLT",
          "text": "So he gathered a group of his relatives and set out in hot pursuit. He caught up with Jacob seven days later in the hill country of Gilead."
        },
        {
          "version": "ESV",
          "text": "he took his kinsmen with him and pursued him for seven days and followed close after him into the hill country of Gilead."
        },
        {
          "version": "NKJV",
          "text": "Then he took his brethren with him and pursued him for seven days’ journey, and he overtook him in the mountains of Gilead."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:36-42",
          "text": "Then Jacob became incensed and challenged Laban. “What is my crime?” he said. “For what sin of mine have you so hotly pursued me? / You have searched all my goods! Have you found anything that belongs to you? Put it here before my brothers and yours, that they may judge between the two of us. / I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. ..."
        },
        {
          "reference": "Genesis 27:41-45",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.” / When the words of her older son Esau were relayed to Rebekah, she sent for her younger son Jacob and told him, “Look, your brother Esau is consoling himself by plotting to kill you. / So now, my son, obey my voice and flee at once to my brother Laban in Haran. ..."
        },
        {
          "reference": "Genesis 32:6-8",
          "text": "When the messengers returned to Jacob, they said, “We went to your brother Esau, and now he is coming to meet you—he and four hundred men with him.” / In great fear and distress, Jacob divided his people into two camps, as well as the flocks and herds and camels. / He thought, “If Esau comes and attacks one camp, then the other camp can escape.”"
        },
        {
          "reference": "Genesis 27:30-41",
          "text": "As soon as Isaac had finished blessing him and Jacob had left his father’s presence, his brother Esau returned from the hunt. / He too made some tasty food, brought it to his father, and said to him, “My father, sit up and eat of your son’s game, so that you may bless me.” / But his father Isaac replied, “Who are you?” “I am Esau, your firstborn son,” he answered. ..."
        },
        {
          "reference": "Genesis 33:1-4",
          "text": "Now Jacob looked up and saw Esau coming toward him with four hundred men. So he divided the children among Leah, Rachel, and the two maidservants. / He put the maidservants and their children in front, Leah and her children next, and Rachel and Joseph at the rear. / But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother. ..."
        },
        {
          "reference": "Exodus 14:5-9",
          "text": "When the king of Egypt was told that the people had fled, Pharaoh and his officials changed their minds about them and said, “What have we done? We have released Israel from serving us.” / So Pharaoh prepared his chariot and took his army with him. / He took 600 of the best chariots, and all the other chariots of Egypt, with officers over all of them. ..."
        },
        {
          "reference": "1 Samuel 30:8-10",
          "text": "and David inquired of the LORD: “Should I pursue these raiders? Will I overtake them?” “Pursue them,” the LORD replied, “for you will surely overtake them and rescue the captives.” / So David and his six hundred men went to the Brook of Besor, where some stayed behind / because two hundred men were too exhausted to cross the brook. But David and four hundred men continued in pursuit."
        },
        {
          "reference": "1 Samuel 23:25-28",
          "text": "and Saul and his men went to seek him. When David was told about it, he went down to the rock and stayed in the Wilderness of Maon. And when Saul heard of this, he pursued David there. / Saul was proceeding along one side of the mountain, and David and his men along the other side. Even though David was hurrying to get away, Saul and his men were closing in on David and his men to capture them. / Then a messenger came to Saul, saying, “Come quickly, for the Philistines have raided the land!” ..."
        },
        {
          "reference": "2 Kings 6:13-14",
          "text": "So the king said, “Go and see where he is, that I may send men to capture him.” On receiving the report, “Elisha is in Dothan,” / the king of Aram sent horses, chariots, and a great army. They went there by night and surrounded the city."
        },
        {
          "reference": "Psalm 18:37",
          "text": "I pursued my enemies and overtook them; I did not turn back until they were consumed."
        },
        {
          "reference": "Psalm 35:4-6",
          "text": "May those who seek my life be disgraced and put to shame; may those who plan to harm me be driven back and confounded. / May they be like chaff in the wind, as the angel of the LORD drives them away. / May their path be dark and slick, as the angel of the LORD pursues."
        },
        {
          "reference": "Proverbs 16:7",
          "text": "When a man’s ways please the LORD, He makes even the man’s enemies live at peace with him."
        },
        {
          "reference": "Isaiah 41:11-12",
          "text": "Behold, all who rage against you will be ashamed and disgraced; those who contend with you will be reduced to nothing and will perish. / You will seek them but will not find them. Those who wage war against you will come to nothing."
        },
        {
          "reference": "Jeremiah 50:41-42",
          "text": "Behold, an army is coming from the north; a great nation and many kings are stirred up from the ends of the earth. / They grasp the bow and spear; they are cruel and merciless. Their voice roars like the sea, and they ride upon horses, lined up like men in formation against you, O Daughter of Babylon."
        },
        {
          "reference": "Matthew 2:13-15",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.” / So he got up, took the Child and His mother by night, and withdrew to Egypt, / where he stayed until the death of Herod. This fulfilled what the Lord had spoken through the prophet: “Out of Egypt I called My Son.”"
        }
      ]
    },
    {
      "reference": "Genesis 31:24",
      "book": "Genesis",
      "chapter": 31,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "Then God came to Laban the Aramean in a dream at night and said to him, &#8220Be careful not to say anything to Jacob, either good or bad.”"
        },
        {
          "version": "NLT",
          "text": "But the previous night God had appeared to Laban the Aramean in a dream and told him, “I’m warning you—leave Jacob alone!”"
        },
        {
          "version": "ESV",
          "text": "But God came to Laban the Aramean in a dream by night and said to him, “Be careful not to say anything to Jacob, either good or bad.”"
        },
        {
          "version": "NKJV",
          "text": "But God had come to Laban the Syrian in a dream by night, and said to him, “Be careful that you speak to Jacob neither good nor bad.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 31:25",
      "book": "Genesis",
      "chapter": 31,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob had pitched his tent in the hill country of Gilead when Laban overtook him, and Laban and his relatives camped there too."
        },
        {
          "version": "NLT",
          "text": "Laban caught up with Jacob as he was camped in the hill country of Gilead, and he set up his camp not far from Jacob’s."
        },
        {
          "version": "ESV",
          "text": "And Laban overtook Jacob. Now Jacob had pitched his tent in the hill country, and Laban with his kinsmen pitched tents in the hill country of Gilead."
        },
        {
          "version": "NKJV",
          "text": "So Laban overtook Jacob. Now Jacob had pitched his tent in the mountains, and Laban with his brethren pitched in the mountains of Gilead."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 30:43",
          "text": "Thus Jacob became exceedingly prosperous. He owned large flocks, maidservants and menservants, and camels and donkeys."
        },
        {
          "reference": "Genesis 32:1-2",
          "text": "Jacob also went on his way, and the angels of God met him. / When Jacob saw them, he said, “This is the camp of God.” So he named that place Mahanaim."
        },
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 29:1",
          "text": "Jacob resumed his journey and came to the land of the people of the east."
        },
        {
          "reference": "Genesis 27:43-45",
          "text": "So now, my son, obey my voice and flee at once to my brother Laban in Haran. / Stay with him for a while, until your brother’s fury subsides— / until your brother’s rage against you wanes and he forgets what you have done to him. Then I will send for you and bring you back from there. Why should I lose both of you in one day?”"
        },
        {
          "reference": "Genesis 24:10",
          "text": "Then the servant took ten of his master’s camels and departed with all manner of good things from his master in hand. And he set out for Nahor’s hometown in Aram-naharaim."
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Genesis 33:1-3",
          "text": "Now Jacob looked up and saw Esau coming toward him with four hundred men. So he divided the children among Leah, Rachel, and the two maidservants. / He put the maidservants and their children in front, Leah and her children next, and Rachel and Joseph at the rear. / But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother."
        },
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Exodus 3:1",
          "text": "Meanwhile, Moses was shepherding the flock of his father-in-law Jethro, the priest of Midian. He led the flock to the far side of the wilderness and came to Horeb, the mountain of God."
        },
        {
          "reference": "Exodus 4:18",
          "text": "Then Moses went back to his father-in-law Jethro and said to him, “Please let me return to my brothers in Egypt to see if they are still alive.” “Go in peace,” Jethro replied."
        },
        {
          "reference": "Exodus 18:5-7",
          "text": "Moses’ father-in-law Jethro, along with Moses’ wife and sons, came to him in the desert, where he was encamped at the mountain of God. / He sent word to Moses, “I, your father-in-law Jethro, am coming to you with your wife and her two sons.” / So Moses went out to meet his father-in-law and bowed down and kissed him. They greeted each other and went into the tent."
        },
        {
          "reference": "Numbers 22:9-12",
          "text": "Then God came to Balaam and asked, “Who are these men with you?” / And Balaam said to God, “Balak son of Zippor, king of Moab, sent me this message: / ‘Behold, a people has come out of Egypt, and they cover the face of the land. Now come and put a curse on them for me. Perhaps I may be able to fight against them and drive them away.’” ..."
        },
        {
          "reference": "Deuteronomy 26:5",
          "text": "and you are to declare before the LORD your God, “My father was a wandering Aramean, and he went down to Egypt few in number and lived there and became a great nation, mighty and numerous."
        },
        {
          "reference": "Joshua 24:2-3",
          "text": "And Joshua said to all the people, “This is what the LORD, the God of Israel, says: ‘Long ago your fathers, including Terah the father of Abraham and Nahor, lived beyond the Euphrates and worshiped other gods. / But I took your father Abraham from beyond the Euphrates and led him through all the land of Canaan, and I multiplied his descendants. I gave him Isaac,"
        }
      ]
    },
    {
      "reference": "Genesis 31:26",
      "book": "Genesis",
      "chapter": 31,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Laban said to Jacob, “What have you done? You’ve deceived me, and you’ve carried off my daughters like captives in war."
        },
        {
          "version": "NLT",
          "text": "“What do you mean by deceiving me like this?” Laban demanded. “How dare you drag my daughters away like prisoners of war?"
        },
        {
          "version": "ESV",
          "text": "And Laban said to Jacob, “What have you done, that you have tricked me and driven away my daughters like captives of the sword?"
        },
        {
          "version": "NKJV",
          "text": "And Laban said to Jacob: “What have you done, that you have stolen away unknown to me, and carried away my daughters like captives taken with the sword?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:15-30",
          "text": "Laban said to him, “Just because you are my relative, should you work for nothing? Tell me what your wages should be.” / Now Laban had two daughters; the older was named Leah, and the younger was named Rachel. / Leah had weak eyes, but Rachel was shapely and beautiful. ..."
        },
        {
          "reference": "Genesis 30:25-43",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” ..."
        },
        {
          "reference": "Genesis 27:41-45",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.” / When the words of her older son Esau were relayed to Rebekah, she sent for her younger son Jacob and told him, “Look, your brother Esau is consoling himself by plotting to kill you. / So now, my son, obey my voice and flee at once to my brother Laban in Haran. ..."
        },
        {
          "reference": "Genesis 28:1-5",
          "text": "So Isaac called for Jacob and blessed him. “Do not take a wife from the Canaanite women,” he commanded. / “Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother. / May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples. ..."
        },
        {
          "reference": "Genesis 24:50-60",
          "text": "Laban and Bethuel answered, “This is from the LORD; we have no choice in the matter. / Rebekah is here before you. Take her and go, and let her become the wife of your master’s son, just as the LORD has decreed.” / When Abraham’s servant heard their words, he bowed down to the ground before the LORD. ..."
        },
        {
          "reference": "Genesis 27:43-45",
          "text": "So now, my son, obey my voice and flee at once to my brother Laban in Haran. / Stay with him for a while, until your brother’s fury subsides— / until your brother’s rage against you wanes and he forgets what you have done to him. Then I will send for you and bring you back from there. Why should I lose both of you in one day?”"
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 31:1-3",
          "text": "Now Jacob heard that Laban’s sons were saying, “Jacob has taken away all that belonged to our father and built all this wealth at our father’s expense.” / And Jacob saw from the countenance of Laban that his attitude toward him had changed. / Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 31:19-21",
          "text": "Now while Laban was out shearing his sheep, Rachel stole her father’s household idols. / Moreover, Jacob deceived Laban the Aramean by not telling him that he was running away. / So he fled with all his possessions, crossed the Euphrates, and headed for the hill country of Gilead."
        },
        {
          "reference": "Genesis 31:38-42",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes. ..."
        },
        {
          "reference": "Genesis 32:3-5",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom. / He instructed them, “You are to say to my master Esau, ‘Your servant Jacob says: I have been staying with Laban and have remained there until now. / I have oxen, donkeys, flocks, menservants, and maidservants. I have sent this message to inform my master, so that I may find favor in your sight.’”"
        },
        {
          "reference": "Genesis 33:1-4",
          "text": "Now Jacob looked up and saw Esau coming toward him with four hundred men. So he divided the children among Leah, Rachel, and the two maidservants. / He put the maidservants and their children in front, Leah and her children next, and Rachel and Joseph at the rear. / But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother. ..."
        },
        {
          "reference": "Exodus 14:5-9",
          "text": "When the king of Egypt was told that the people had fled, Pharaoh and his officials changed their minds about them and said, “What have we done? We have released Israel from serving us.” / So Pharaoh prepared his chariot and took his army with him. / He took 600 of the best chariots, and all the other chariots of Egypt, with officers over all of them. ..."
        },
        {
          "reference": "Exodus 14:10-12",
          "text": "As Pharaoh approached, the Israelites looked up and saw the Egyptians marching after them, and they were terrified and cried out to the LORD. / They said to Moses, “Was it because there were no graves in Egypt that you brought us into the wilderness to die? What have you done to us by bringing us out of Egypt? / Did we not say to you in Egypt, ‘Leave us alone so that we may serve the Egyptians’? For it would have been better for us to serve the Egyptians than to die in the wilderness.”"
        },
        {
          "reference": "1 Samuel 19:11-17",
          "text": "Then Saul sent messengers to David’s house to watch him and kill him in the morning. But David’s wife Michal warned him, “If you do not run for your life tonight, tomorrow you will be dead!” / So Michal lowered David from the window, and he ran away and escaped. / Then Michal took a household idol and laid it in the bed, placed some goat hair on its head, and covered it with a garment. ..."
        }
      ]
    },
    {
      "reference": "Genesis 31:27",
      "book": "Genesis",
      "chapter": 31,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "Why did you run off secretly and deceive me? Why didn’t you tell me, so I could send you away with joy and singing to the music of timbrels and harps?"
        },
        {
          "version": "NLT",
          "text": "Why did you slip away secretly? Why did you deceive me? And why didn’t you say you wanted to leave? I would have given you a farewell feast, with singing and music, accompanied by tambourines and harps."
        },
        {
          "version": "ESV",
          "text": "Why did you flee secretly and trick me, and did not tell me, so that I might have sent you away with mirth and songs, with tambourine and lyre?"
        },
        {
          "version": "NKJV",
          "text": "Why did you flee away secretly, and steal away from me, and not tell me; for I might have sent you away with joy and songs, with timbrel and harp?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 15:20-21",
          "text": "Then Miriam the prophetess, Aaron’s sister, took a tambourine in her hand, and all the women followed her with tambourines and dancing. / And Miriam sang back to them: “Sing to the LORD, for He is highly exalted; the horse and rider He has thrown into the sea.”"
        },
        {
          "reference": "Judges 11:34",
          "text": "And when Jephthah returned home to Mizpah, there was his daughter coming out to meet him with tambourines and dancing! She was his only child; he had no son or daughter besides her."
        },
        {
          "reference": "1 Samuel 18:6-7",
          "text": "As the troops were returning home after David had killed the Philistine, the women came out of all the cities of Israel to meet King Saul with singing and dancing, with joyful songs, and with tambourines and other instruments. / And as the women danced, they sang out: “Saul has slain his thousands, and David his tens of thousands.”"
        },
        {
          "reference": "2 Samuel 6:5",
          "text": "David and all the house of Israel were celebrating before the LORD with all kinds of wood instruments, harps, stringed instruments, tambourines, sistrums, and cymbals."
        },
        {
          "reference": "2 Samuel 6:14-15",
          "text": "And David, wearing a linen ephod, danced with all his might before the LORD, / while he and all the house of Israel brought up the ark of the LORD with shouting and the sounding of the ram’s horn."
        },
        {
          "reference": "Psalm 30:11",
          "text": "You turned my mourning into dancing; You peeled off my sackcloth and clothed me with joy,"
        },
        {
          "reference": "Psalm 149:3",
          "text": "Let them praise His name with dancing, and make music to Him with tambourine and harp."
        },
        {
          "reference": "Jeremiah 31:4",
          "text": "Again I will build you, and you will be rebuilt, O Virgin Israel. Again you will take up your tambourines and go out in joyful dancing."
        },
        {
          "reference": "Jeremiah 31:13",
          "text": "Then the maidens will rejoice with dancing, young men and old as well. I will turn their mourning into joy, and give them comfort and joy for their sorrow."
        },
        {
          "reference": "Luke 15:25",
          "text": "Meanwhile the older son was in the field, and as he approached the house, he heard music and dancing."
        },
        {
          "reference": "Matthew 11:17",
          "text": "‘We played the flute for you, and you did not dance; we sang a dirge, and you did not mourn.’"
        },
        {
          "reference": "Matthew 9:15",
          "text": "Jesus replied, “How can the guests of the bridegroom mourn while He is with them? But the time will come when the bridegroom will be taken from them; then they will fast."
        },
        {
          "reference": "Luke 7:32",
          "text": "They are like children sitting in the marketplace and calling out to one another: ‘We played the flute for you, and you did not dance; we sang a dirge, and you did not weep.’"
        },
        {
          "reference": "Luke 15:23-24",
          "text": "Bring the fattened calf and kill it. Let us feast and celebrate. / For this son of mine was dead and is alive again! He was lost and is found!’ So they began to celebrate."
        },
        {
          "reference": "John 16:20",
          "text": "Truly, truly, I tell you, you will weep and wail while the world rejoices. You will grieve, but your grief will turn to joy."
        }
      ]
    },
    {
      "reference": "Genesis 31:28",
      "book": "Genesis",
      "chapter": 31,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "You didn’t even let me kiss my grandchildren and my daughters goodbye. You have done a foolish thing."
        },
        {
          "version": "NLT",
          "text": "Why didn’t you let me kiss my daughters and grandchildren and tell them good-bye? You have acted very foolishly!"
        },
        {
          "version": "ESV",
          "text": "And why did you not permit me to kiss my sons and my daughters farewell? Now you have done foolishly."
        },
        {
          "version": "NKJV",
          "text": "And you did not allow me to kiss my sons and my daughters. Now you have done foolishly in so doing."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:41-45",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.” / When the words of her older son Esau were relayed to Rebekah, she sent for her younger son Jacob and told him, “Look, your brother Esau is consoling himself by plotting to kill you. / So now, my son, obey my voice and flee at once to my brother Laban in Haran. ..."
        },
        {
          "reference": "Genesis 29:20",
          "text": "So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 30:25-26",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.”"
        },
        {
          "reference": "Genesis 32:1-2",
          "text": "Jacob also went on his way, and the angels of God met him. / When Jacob saw them, he said, “This is the camp of God.” So he named that place Mahanaim."
        },
        {
          "reference": "Genesis 33:4",
          "text": "Esau, however, ran to him and embraced him, threw his arms around his neck, and kissed him. And they both wept."
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Genesis 46:29",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely."
        },
        {
          "reference": "Exodus 4:18",
          "text": "Then Moses went back to his father-in-law Jethro and said to him, “Please let me return to my brothers in Egypt to see if they are still alive.” “Go in peace,” Jethro replied."
        },
        {
          "reference": "Ruth 1:9-14",
          "text": "May the LORD enable each of you to find rest in the home of your new husband.” And she kissed them as they wept aloud / and said, “Surely we will return with you to your people.” / But Naomi replied, “Return home, my daughters. Why would you go with me? Are there still sons in my womb to become your husbands? ..."
        },
        {
          "reference": "1 Samuel 20:41-42",
          "text": "When the young man had gone, David got up from the south side of the stone, fell facedown, and bowed three times. Then he and Jonathan kissed each other and wept together—though David wept more. / And Jonathan said to David, “Go in peace, for the two of us have sworn in the name of the LORD, saying, ‘May the LORD be a witness between you and me, and between your descendants and mine forever.’” Then David got up and departed, and Jonathan went back into the city."
        },
        {
          "reference": "2 Samuel 19:37-39",
          "text": "Please let your servant return, that I may die in my own city near the tomb of my father and mother. But here is your servant Chimham. Let him cross over with my lord the king, and do for him what is good in your sight.” / The king replied, “Chimham will cross over with me, and I will do for him what is good in your sight, and I will do for you whatever you desire of me.” / So all the people crossed the Jordan, and then the king crossed over. The king kissed Barzillai and blessed him, and Barzillai returned home."
        },
        {
          "reference": "1 Kings 19:20",
          "text": "So Elisha left the oxen, ran after Elijah, and said, “Please let me kiss my father and mother goodbye, and then I will follow you.” “Go on back,” Elijah replied, “for what have I done to you?”"
        },
        {
          "reference": "Psalm 126:6",
          "text": "He who goes out weeping, bearing a trail of seed, will surely return with shouts of joy, carrying sheaves of grain."
        },
        {
          "reference": "Proverbs 27:10",
          "text": "Do not forsake your friend or your father’s friend, and do not go to your brother’s house in the day of your calamity; better a neighbor nearby than a brother far away."
        },
        {
          "reference": "Luke 15:20",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him."
        }
      ]
    },
    {
      "reference": "Genesis 31:29",
      "book": "Genesis",
      "chapter": 31,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "I have the power to harm you; but last night the God of your father said to me, &#8216Be careful not to say anything to Jacob, either good or bad.’"
        },
        {
          "version": "NLT",
          "text": "I could destroy you, but the God of your father appeared to me last night and warned me, ‘Leave Jacob alone!’"
        },
        {
          "version": "ESV",
          "text": "It is in my power to do you harm. But the God of your father spoke to me last night, saying, ‘Be careful not to say anything to Jacob, either good or bad.’"
        },
        {
          "version": "NKJV",
          "text": "It is in my power to do you harm, but the God of your father spoke to me last night, saying, ‘Be careful that you speak to Jacob neither good nor bad.’"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 31:30",
      "book": "Genesis",
      "chapter": 31,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "Now you have gone off because you longed to return to your father’s household. But why did you steal my gods?”"
        },
        {
          "version": "NLT",
          "text": "I can understand your feeling that you must go, and your intense longing for your father’s home. But why have you stolen my gods?”"
        },
        {
          "version": "ESV",
          "text": "And now you have gone away because you longed greatly for your father’s house, but why did you steal my gods?”"
        },
        {
          "version": "NKJV",
          "text": "And now you have surely gone because you greatly long for your father’s house, but why did you steal my gods?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 20:3-5",
          "text": "You shall have no other gods before Me. / You shall not make for yourself an idol in the form of anything in the heavens above, on the earth below, or in the waters beneath. / You shall not bow down to them or worship them; for I, the LORD your God, am a jealous God, visiting the iniquity of the fathers on their children to the third and fourth generations of those who hate Me,"
        },
        {
          "reference": "Joshua 24:2",
          "text": "And Joshua said to all the people, “This is what the LORD, the God of Israel, says: ‘Long ago your fathers, including Terah the father of Abraham and Nahor, lived beyond the Euphrates and worshiped other gods."
        },
        {
          "reference": "1 Samuel 7:3",
          "text": "Then Samuel said to all the house of Israel, “If you are returning to the LORD with all your hearts, then put away the foreign gods and Ashtoreths among you, prepare your hearts for the LORD, and serve Him only. And He will deliver you from the hand of the Philistines.”"
        },
        {
          "reference": "1 Kings 11:4-5",
          "text": "For when Solomon grew old, his wives turned his heart after other gods, and he was not wholeheartedly devoted to the LORD his God, as his father David had been. / Solomon followed Ashtoreth the goddess of the Sidonians and Milcom the abomination of the Ammonites."
        },
        {
          "reference": "2 Kings 17:12",
          "text": "They served idols, although the LORD had told them, “You shall not do this thing.”"
        },
        {
          "reference": "Isaiah 42:8",
          "text": "I am the LORD; that is My name! I will not yield My glory to another or My praise to idols."
        },
        {
          "reference": "Jeremiah 10:10-11",
          "text": "But the LORD is the true God; He is the living God and eternal King. The earth quakes at His wrath, and the nations cannot endure His indignation. / Thus you are to tell them: “These gods, who have made neither the heavens nor the earth, will perish from this earth and from under these heavens.”"
        },
        {
          "reference": "Ezekiel 20:7-8",
          "text": "And I said to them: ‘Each of you must throw away the abominations before his eyes, and you must not defile yourselves with the idols of Egypt. I am the LORD your God.’ / But they rebelled against Me and refused to listen. None of them cast away the abominations before their eyes, and they did not forsake the idols of Egypt. So I resolved to pour out My wrath upon them and vent My anger against them in the land of Egypt."
        },
        {
          "reference": "Hosea 2:13",
          "text": "I will punish her for the days of the Baals when she burned incense to them, when she adorned herself with rings and jewelry, and went after her lovers. But Me she forgot,” declares the LORD."
        },
        {
          "reference": "Acts 17:29",
          "text": "Therefore, being offspring of God, we should not think that the Divine Being is like gold or silver or stone, an image formed by man’s skill and imagination."
        },
        {
          "reference": "Romans 1:23",
          "text": "and exchanged the glory of the immortal God for images of mortal man and birds and animals and reptiles."
        },
        {
          "reference": "1 Corinthians 8:4-6",
          "text": "So about eating food sacrificed to idols: We know that an idol is nothing at all in the world, and that there is no God but one. / For even if there are so-called gods, whether in heaven or on earth (as there are many so-called gods and lords), / yet for us there is but one God, the Father, from whom all things came and for whom we exist. And there is but one Lord, Jesus Christ, through whom all things came and through whom we exist."
        },
        {
          "reference": "2 Corinthians 6:16",
          "text": "What agreement can exist between the temple of God and idols? For we are the temple of the living God. As God has said: “I will dwell with them and walk among them, and I will be their God, and they will be My people.”"
        },
        {
          "reference": "Galatians 4:8",
          "text": "Formerly, when you did not know God, you were slaves to those who by nature are not gods."
        },
        {
          "reference": "Ephesians 5:5",
          "text": "For of this you can be sure: No immoral, impure, or greedy person (that is, an idolater) has any inheritance in the kingdom of Christ and of God."
        }
      ]
    },
    {
      "reference": "Genesis 31:31",
      "book": "Genesis",
      "chapter": 31,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob answered Laban, “I was afraid, because I thought you would take your daughters away from me by force."
        },
        {
          "version": "NLT",
          "text": "“I rushed away because I was afraid,” Jacob answered. “I thought you would take your daughters from me by force."
        },
        {
          "version": "ESV",
          "text": "Jacob answered and said to Laban, “Because I was afraid, for I thought that you would take your daughters from me by force."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob answered and said to Laban, “Because I was afraid, for I said, ‘Perhaps you would take your daughters from me by force.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:26-27",
          "text": "Then Laban said to Jacob, “What have you done? You have deceived me and carried off my daughters like captives of war! / Why did you run away secretly and deceive me, without even telling me? I would have sent you away with joy and singing, with tambourines and harps."
        },
        {
          "reference": "Genesis 30:25-26",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.”"
        },
        {
          "reference": "Genesis 27:41-45",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.” / When the words of her older son Esau were relayed to Rebekah, she sent for her younger son Jacob and told him, “Look, your brother Esau is consoling himself by plotting to kill you. / So now, my son, obey my voice and flee at once to my brother Laban in Haran. ..."
        },
        {
          "reference": "Genesis 28:5",
          "text": "So Isaac sent Jacob to Paddan-aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau."
        },
        {
          "reference": "Genesis 29:20",
          "text": "So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 32:6-7",
          "text": "When the messengers returned to Jacob, they said, “We went to your brother Esau, and now he is coming to meet you—he and four hundred men with him.” / In great fear and distress, Jacob divided his people into two camps, as well as the flocks and herds and camels."
        },
        {
          "reference": "Genesis 33:1-4",
          "text": "Now Jacob looked up and saw Esau coming toward him with four hundred men. So he divided the children among Leah, Rachel, and the two maidservants. / He put the maidservants and their children in front, Leah and her children next, and Rachel and Joseph at the rear. / But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother. ..."
        },
        {
          "reference": "Exodus 14:10-12",
          "text": "As Pharaoh approached, the Israelites looked up and saw the Egyptians marching after them, and they were terrified and cried out to the LORD. / They said to Moses, “Was it because there were no graves in Egypt that you brought us into the wilderness to die? What have you done to us by bringing us out of Egypt? / Did we not say to you in Egypt, ‘Leave us alone so that we may serve the Egyptians’? For it would have been better for us to serve the Egyptians than to die in the wilderness.”"
        },
        {
          "reference": "Exodus 2:14-15",
          "text": "But the man replied, “Who made you ruler and judge over us? Are you planning to kill me as you killed the Egyptian?” Then Moses was afraid and thought, “This thing I have done has surely become known.” / When Pharaoh heard about this matter, he sought to kill Moses. But Moses fled from Pharaoh and settled in the land of Midian, where he sat down beside a well."
        },
        {
          "reference": "1 Samuel 20:1-3",
          "text": "Then David fled from Naioth in Ramah. He came to Jonathan and asked, “What have I done? What is my iniquity? How have I sinned against your father, that he wants to take my life?” / “Far from it!” Jonathan replied. “You will not die. Indeed, my father does nothing, great or small, without telling me. So why would he hide this matter from me? This cannot be true!” / But David again vowed, “Your father knows very well that I have found favor in your eyes, and he has said, ‘Jonathan must not know of this, or he will be grieved.’ As surely as the LORD lives and as you yourself live, there is but a step between me and death.”"
        },
        {
          "reference": "1 Samuel 21:10-12",
          "text": "That day David fled from Saul and went to Achish king of Gath. / But the servants of Achish said to him, “Is this not David, the king of the land? Did they not sing about him in their dances, saying: ‘Saul has slain his thousands, and David his tens of thousands’?” / Now David took these words to heart and was very much afraid of Achish the king of Gath."
        },
        {
          "reference": "1 Kings 19:3",
          "text": "And Elijah was afraid and ran for his life. When he came to Beersheba in Judah, he left his servant there,"
        },
        {
          "reference": "Psalm 56:3",
          "text": "When I am afraid, I put my trust in You."
        },
        {
          "reference": "Proverbs 29:25",
          "text": "The fear of man is a snare, but whoever trusts in the LORD is set securely on high."
        }
      ]
    },
    {
      "reference": "Genesis 31:32",
      "book": "Genesis",
      "chapter": 31,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "But if you find anyone who has your gods, that person shall not live. In the presence of our relatives, see for yourself whether there is anything of yours here with me; and if so, take it.” Now Jacob did not know that Rachel had stolen the gods."
        },
        {
          "version": "NLT",
          "text": "But as for your gods, see if you can find them, and let the person who has taken them die! And if you find anything else that belongs to you, identify it before all these relatives of ours, and I will give it back!” But Jacob did not know that Rachel had stolen the household idols."
        },
        {
          "version": "ESV",
          "text": "Anyone with whom you find your gods shall not live. In the presence of our kinsmen point out what I have that is yours, and take it.” Now Jacob did not know that Rachel had stolen them."
        },
        {
          "version": "NKJV",
          "text": "With whomever you find your gods, do not let him live. In the presence of our brethren, identify what I have of yours and take it with you.” For Jacob did not know that Rachel had stolen them."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 7:10-26",
          "text": "But the LORD said to Joshua, “Stand up! Why have you fallen on your face? / Israel has sinned; they have transgressed My covenant that I commanded them, and they have taken some of what was devoted to destruction. Indeed, they have stolen and lied, and they have put these things with their own possessions. / This is why the Israelites cannot stand against their enemies. They will turn their backs and run from their enemies, because they themselves have been set apart for destruction. I will no longer be with you unless you remove from among you whatever is devoted to destruction. ..."
        },
        {
          "reference": "1 Samuel 14:38-45",
          "text": "Therefore Saul said, “Come here, all you leaders of the troops, and let us investigate how this sin has occurred today. / As surely as the LORD who saves Israel lives, even if it is my son Jonathan, he must die!” But not one of the troops said a word. / Then Saul said to all Israel, “You stand on one side, and I and my son Jonathan will stand on the other side.” “Do what seems good to you,” the troops replied. ..."
        },
        {
          "reference": "Exodus 22:1-4",
          "text": "“If a man steals an ox or a sheep and slaughters or sells it, he must repay five oxen for an ox and four sheep for a sheep. / If a thief is caught breaking in and is beaten to death, no one shall be guilty of bloodshed. / But if it happens after sunrise, there is guilt for his bloodshed. A thief must make full restitution; if he has nothing, he himself shall be sold for his theft. ..."
        },
        {
          "reference": "Leviticus 6:1-5",
          "text": "And the LORD said to Moses, / “If someone sins and acts unfaithfully against the LORD by deceiving his neighbor in regard to a deposit or security entrusted to him or stolen, or if he extorts his neighbor / or finds lost property and lies about it and swears falsely, or if he commits any such sin that a man might commit— ..."
        },
        {
          "reference": "Deuteronomy 24:7",
          "text": "If a man is caught kidnapping one of his Israelite brothers, whether he treats him as a slave or sells him, the kidnapper must die. So you must purge the evil from among you."
        },
        {
          "reference": "2 Kings 5:20-27",
          "text": "Gehazi, the servant of Elisha the man of God, said, “Look, my master has spared this Aramean, Naaman, by not accepting what he brought. As surely as the LORD lives, I will run after him and get something from him.” / So Gehazi pursued Naaman. And when Naaman saw him running toward him, he got down from the chariot to meet him and asked, “Is everything all right?” / “Everything is all right,” Gehazi replied. “My master has sent me to say, ‘Look, two young men from the sons of the prophets have just now come to me from the hill country of Ephraim. Please give them a talent of silver and two sets of clothing.’” ..."
        },
        {
          "reference": "Proverbs 6:30-31",
          "text": "Men do not despise the thief if he steals to satisfy his hunger. / Yet if caught, he must pay sevenfold; he must give up all the wealth of his house."
        },
        {
          "reference": "Zechariah 5:3-4",
          "text": "Then he told me, “This is the curse that is going out over the face of all the land, for according to one side of the scroll, every thief will be removed; and according to the other side, every perjurer will be removed. / I will send it out, declares the LORD of Hosts, and it will enter the house of the thief and the house of him who swears falsely by My name. It will remain inside his house and destroy it, down to its timbers and stones.”"
        },
        {
          "reference": "Matthew 5:37",
          "text": "Simply let your ‘Yes’ be ‘Yes,’ and your ‘No,’ ‘No.’ Anything more comes from the evil one."
        },
        {
          "reference": "Matthew 26:21-25",
          "text": "And while they were eating, He said to them, “Truly I tell you, one of you will betray Me.” / They were deeply grieved and began to ask Him one after another, “Surely not I, Lord?” / Jesus answered, “The one who has dipped his hand into the bowl with Me will betray Me. ..."
        },
        {
          "reference": "Mark 14:18-21",
          "text": "And while they were reclining and eating, Jesus said, “Truly I tell you, one of you who is eating with Me will betray Me.” / They began to be grieved and to ask Him one after another, “Surely not I?” / He answered, “It is one of the Twelve—the one who is dipping his hand into the bowl with Me. ..."
        },
        {
          "reference": "Luke 19:8",
          "text": "But Zacchaeus stood up and said to the Lord, “Look, Lord, half of my possessions I give to the poor, and if I have cheated anyone, I will repay it fourfold.”"
        },
        {
          "reference": "John 13:21-30",
          "text": "After Jesus had said this, He became troubled in spirit and testified, “Truly, truly, I tell you, one of you will betray Me.” / The disciples looked at one another, perplexed as to which of them He meant. / One of His disciples, the one whom Jesus loved, was reclining at His side. ..."
        },
        {
          "reference": "Acts 5:1-11",
          "text": "Now a man named Ananias, together with his wife Sapphira, also sold a piece of property. / With his wife’s full knowledge, he kept back some of the proceeds for himself, but brought a portion and laid it at the apostles’ feet. / Then Peter said, “Ananias, how is it that Satan has filled your heart to lie to the Holy Spirit and withhold some of the proceeds from the land? ..."
        },
        {
          "reference": "Romans 2:21-22",
          "text": "you, then, who teach others, do you not teach yourself? You who preach against stealing, do you steal? / You who forbid adultery, do you commit adultery? You who abhor idols, do you rob temples?"
        }
      ]
    },
    {
      "reference": "Genesis 31:33",
      "book": "Genesis",
      "chapter": 31,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "So Laban went into Jacob’s tent and into Leah’s tent and into the tent of the two female servants, but he found nothing. After he came out of Leah’s tent, he entered Rachel’s tent."
        },
        {
          "version": "NLT",
          "text": "Laban went first into Jacob’s tent to search there, then into Leah’s, and then the tents of the two servant wives—but he found nothing. Finally, he went into Rachel’s tent."
        },
        {
          "version": "ESV",
          "text": "So Laban went into Jacob’s tent and into Leah’s tent and into the tent of the two female servants, but he did not find them. And he went out of Leah’s tent and entered Rachel’s."
        },
        {
          "version": "NKJV",
          "text": "And Laban went into Jacob’s tent, into Leah’s tent, and into the two maids’ tents, but he did not find them. Then he went out of Leah’s tent and entered Rachel’s tent."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:19",
          "text": "Now while Laban was out shearing his sheep, Rachel stole her father’s household idols."
        },
        {
          "reference": "Genesis 31:30",
          "text": "Now you have gone off because you long for your father’s house. But why have you stolen my gods?”"
        },
        {
          "reference": "Genesis 31:34-35",
          "text": "Now Rachel had taken Laban’s household idols, put them in the saddlebag of her camel, and was sitting on them. And Laban searched everything in the tent but found nothing. / Rachel said to her father, “Sir, do not be angry that I cannot stand up before you; for I am having my period.” So Laban searched but could not find the household idols."
        },
        {
          "reference": "Genesis 30:35-36",
          "text": "That very day Laban removed all the streaked or spotted male goats and every speckled or spotted female goat—every one that had any white on it—and every dark-colored lamb, and he placed them under the care of his sons. / Then he put a three-day journey between himself and Jacob, while Jacob was shepherding the rest of Laban’s flocks."
        },
        {
          "reference": "Genesis 27:35",
          "text": "But Isaac replied, “Your brother came deceitfully and took your blessing.”"
        },
        {
          "reference": "Genesis 44:12",
          "text": "The steward searched, beginning with the oldest and ending with the youngest—and the cup was found in Benjamin’s sack."
        },
        {
          "reference": "Exodus 12:31-33",
          "text": "Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested. / Take your flocks and herds as well, just as you have said, and depart! And bless me also.” / And in order to send them out of the land quickly, the Egyptians urged the people on. “For otherwise,” they said, “we are all going to die!”"
        },
        {
          "reference": "Joshua 7:18-22",
          "text": "And he had the family of Zabdi come forward man by man, and Achan son of Carmi, the son of Zabdi, the son of Zerah, of the tribe of Judah, was selected. / So Joshua said to Achan, “My son, give glory to the LORD, the God of Israel, and make a confession to Him. I urge you to tell me what you have done; do not hide it from me.” / “It is true,” Achan replied, “I have sinned against the LORD, the God of Israel. This is what I did: ..."
        },
        {
          "reference": "1 Samuel 10:22",
          "text": "So again they inquired of the LORD, “Has the man come here yet?” And the LORD replied, “Behold, he has hidden himself among the baggage.”"
        },
        {
          "reference": "1 Samuel 19:13-17",
          "text": "Then Michal took a household idol and laid it in the bed, placed some goat hair on its head, and covered it with a garment. / When Saul sent the messengers to seize David, Michal said, “He is ill.” / But Saul sent the messengers back to see David and told them, “Bring him up to me in his bed so I can kill him.” ..."
        },
        {
          "reference": "1 Samuel 25:14-17",
          "text": "Meanwhile, one of Nabal’s young men informed Nabal’s wife Abigail, “Look, David sent messengers from the wilderness to greet our master, but he screamed at them. / Yet these men were very good to us. When we were in the field, we were not harassed, and nothing of ours went missing the whole time we lived among them. / They were a wall around us, both day and night, the whole time we were herding our sheep near them. ..."
        },
        {
          "reference": "2 Kings 5:24-27",
          "text": "When Gehazi came to the hill, he took the gifts from the servants and stored them in the house. Then he dismissed the men, and they departed. / When Gehazi went in and stood before his master, Elisha asked him, “Gehazi, where have you been?” “Your servant did not go anywhere,” he replied. / But Elisha questioned him, “Did not my spirit go with you when the man got down from his chariot to meet you? Is this the time to accept money and clothing, olive groves and vineyards, sheep and oxen, menservants and maidservants? ..."
        },
        {
          "reference": "2 Kings 7:12",
          "text": "So the king got up in the night and said to his servants, “Let me tell you what the Arameans have done to us. They know we are starving, so they have left the camp to hide in the field, thinking, ‘When they come out of the city, we will take them alive and enter the city.’”"
        },
        {
          "reference": "Job 31:9-12",
          "text": "If my heart has been enticed by my neighbor’s wife, or I have lurked at his door, / then may my own wife grind grain for another, and may other men sleep with her. / For that would be a heinous crime, an iniquity to be judged. ..."
        },
        {
          "reference": "Proverbs 6:30-31",
          "text": "Men do not despise the thief if he steals to satisfy his hunger. / Yet if caught, he must pay sevenfold; he must give up all the wealth of his house."
        }
      ]
    },
    {
      "reference": "Genesis 31:34",
      "book": "Genesis",
      "chapter": 31,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Rachel had taken the household gods and put them inside her camel’s saddle and was sitting on them. Laban searched through everything in the tent but found nothing."
        },
        {
          "version": "NLT",
          "text": "But Rachel had taken the household idols and hidden them in her camel saddle, and now she was sitting on them. When Laban had thoroughly searched her tent without finding them,"
        },
        {
          "version": "ESV",
          "text": "Now Rachel had taken the household gods and put them in the camel’s saddle and sat on them. Laban felt all about the tent, but did not find them."
        },
        {
          "version": "NKJV",
          "text": "Now Rachel had taken the household idols, put them in the camel’s saddle, and sat on them. And Laban searched all about the tent but did not find them."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 35:2-4",
          "text": "So Jacob told his household and all who were with him, “Get rid of the foreign gods that are among you. Purify yourselves and change your garments. / Then let us arise and go to Bethel. I will build an altar there to God, who answered me in my day of distress. He has been with me wherever I have gone.” / So they gave Jacob all their foreign gods and all their earrings, and Jacob buried them under the oak near Shechem."
        },
        {
          "reference": "Joshua 24:2",
          "text": "And Joshua said to all the people, “This is what the LORD, the God of Israel, says: ‘Long ago your fathers, including Terah the father of Abraham and Nahor, lived beyond the Euphrates and worshiped other gods."
        },
        {
          "reference": "Joshua 24:14",
          "text": "Now, therefore, fear the LORD and serve Him in sincerity and truth; cast aside the gods your fathers served beyond the Euphrates and in Egypt, and serve the LORD."
        },
        {
          "reference": "1 Samuel 19:13",
          "text": "Then Michal took a household idol and laid it in the bed, placed some goat hair on its head, and covered it with a garment."
        },
        {
          "reference": "1 Samuel 19:16",
          "text": "And when the messengers entered, there was the idol in the bed with the goat hair on its head."
        },
        {
          "reference": "2 Kings 23:24",
          "text": "Furthermore, Josiah removed the mediums and spiritists, the household gods and idols, and all the abominations that were seen in the land of Judah and in Jerusalem. He did this to carry out the words of the law written in the book that Hilkiah the priest had found in the house of the LORD."
        },
        {
          "reference": "Isaiah 2:8",
          "text": "Their land is full of idols; they bow down to the work of their hands, to what their fingers have made."
        },
        {
          "reference": "Isaiah 46:1-2",
          "text": "Bel crouches; Nebo cowers. Their idols weigh down beasts and cattle. The images you carry are burdensome, a load to the weary animal. / The gods cower; they crouch together, unable to relieve the burden; but they themselves go into captivity."
        },
        {
          "reference": "Jeremiah 10:5",
          "text": "Like scarecrows in a cucumber patch, their idols cannot speak. They must be carried because they cannot walk. Do not fear them, for they can do no harm, and neither can they do any good.”"
        },
        {
          "reference": "Ezekiel 20:7-8",
          "text": "And I said to them: ‘Each of you must throw away the abominations before his eyes, and you must not defile yourselves with the idols of Egypt. I am the LORD your God.’ / But they rebelled against Me and refused to listen. None of them cast away the abominations before their eyes, and they did not forsake the idols of Egypt. So I resolved to pour out My wrath upon them and vent My anger against them in the land of Egypt."
        },
        {
          "reference": "Hosea 4:12",
          "text": "My people consult their wooden idols, and their divining rods inform them. For a spirit of prostitution leads them astray and they have played the harlot against their God."
        },
        {
          "reference": "Zechariah 10:2",
          "text": "For idols speak deceit and diviners see illusions; they tell false dreams and offer empty comfort. Therefore the people wander like sheep, oppressed for lack of a shepherd."
        },
        {
          "reference": "Acts 17:29",
          "text": "Therefore, being offspring of God, we should not think that the Divine Being is like gold or silver or stone, an image formed by man’s skill and imagination."
        },
        {
          "reference": "Romans 1:23",
          "text": "and exchanged the glory of the immortal God for images of mortal man and birds and animals and reptiles."
        },
        {
          "reference": "1 Corinthians 10:19-20",
          "text": "Am I suggesting, then, that food sacrificed to an idol is anything, or that an idol is anything? / No, but the sacrifices of pagans are offered to demons, not to God. And I do not want you to be participants with demons."
        }
      ]
    },
    {
      "reference": "Genesis 31:35",
      "book": "Genesis",
      "chapter": 31,
      "verse": 35,
      "translations": [
        {
          "version": "NIV",
          "text": "Rachel said to her father, &#8220Don’t be angry, my lord, that I cannot stand up in your presence; I’m having my period.” So he searched but could not find the household gods."
        },
        {
          "version": "NLT",
          "text": "she said to her father, “Please, sir, forgive me if I don’t get up for you. I’m having my monthly period.” So Laban continued his search, but he could not find the household idols."
        },
        {
          "version": "ESV",
          "text": "And she said to her father, “Let not my lord be angry that I cannot rise before you, for the way of women is upon me.” So he searched but did not find the household gods."
        },
        {
          "version": "NKJV",
          "text": "And she said to her father, “Let it not displease my lord that I cannot rise before you, for the manner of women is with me.” And he searched but did not find the household idols."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:12",
          "text": "So she laughed to herself, saying, “After I am worn out and my master is old, will I now have this pleasure?”"
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 30:15-16",
          "text": "But Leah replied, “Is it not enough that you have taken away my husband? Now you want to take my son’s mandrakes as well?” “Very well,” said Rachel, “he may sleep with you tonight in exchange for your son’s mandrakes.” / When Jacob came in from the field that evening, Leah went out to meet him and said, “You must come with me, for I have hired you with my son’s mandrakes.” So he slept with her that night."
        },
        {
          "reference": "Genesis 35:16-19",
          "text": "Later, they set out from Bethel, and while they were still some distance from Ephrath, Rachel began to give birth, and her labor was difficult. / During her severe labor, the midwife said to her, “Do not be afraid, for you are having another son.” / And with her last breath—for she was dying—she named him Ben-oni. But his father called him Benjamin. ..."
        },
        {
          "reference": "Leviticus 15:19-24",
          "text": "When a woman has a discharge consisting of blood from her body, she will be unclean due to her menstruation for seven days, and anyone who touches her will be unclean until evening. / Anything on which she lies or sits during her menstruation will be unclean, / and anyone who touches her bed must wash his clothes and bathe with water, and he will be unclean until evening. ..."
        },
        {
          "reference": "Leviticus 20:18",
          "text": "If a man lies with a menstruating woman and has sexual relations with her, he has exposed the source of her flow, and she has uncovered the source of her blood. Both of them must be cut off from among their people."
        },
        {
          "reference": "1 Samuel 1:6-8",
          "text": "Because the LORD had closed Hannah’s womb, her rival would provoke her viciously to taunt her. / And this went on year after year. Whenever Hannah went up to the house of the LORD, her rival taunted her until she wept and would not eat. / “Hannah, why are you crying?” her husband Elkanah asked. “Why won’t you eat? Why is your heart so grieved? Am I not better to you than ten sons?”"
        },
        {
          "reference": "1 Samuel 1:19-20",
          "text": "The next morning they got up early to bow in worship before the LORD, and then they returned home to Ramah. And Elkanah had relations with his wife Hannah, and the LORD remembered her. / So in the course of time, Hannah conceived and gave birth to a son. She named him Samuel, saying, “Because I have asked for him from the LORD.”"
        },
        {
          "reference": "2 Samuel 6:23",
          "text": "And Michal the daughter of Saul had no children to the day of her death."
        },
        {
          "reference": "2 Kings 4:16-17",
          "text": "And Elisha declared, “At this time next year, you will hold a son in your arms.” “No, my lord,” she said. “Do not lie to your maidservant, O man of God.” / But the woman did conceive, and at that time the next year she gave birth to a son, just as Elisha had told her."
        },
        {
          "reference": "Isaiah 64:6",
          "text": "Each of us has become like something unclean, and all our righteous acts are like filthy rags; we all wither like a leaf, and our iniquities carry us away like the wind."
        },
        {
          "reference": "Jeremiah 31:22",
          "text": "How long will you wander, O faithless daughter? For the LORD has created a new thing in the land—a woman will shelter a man.”"
        },
        {
          "reference": "Luke 1:24-25",
          "text": "After these days, his wife Elizabeth became pregnant and for five months remained in seclusion. She declared, / “The Lord has done this for me. In these days He has shown me favor and taken away my disgrace among the people.”"
        }
      ]
    },
    {
      "reference": "Genesis 31:36",
      "book": "Genesis",
      "chapter": 31,
      "verse": 36,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob was angry and took Laban to task. “What is my crime?” he asked Laban. “How have I wronged you that you hunt me down?"
        },
        {
          "version": "NLT",
          "text": "Then Jacob became very angry, and he challenged Laban. “What’s my crime?” he demanded. “What have I done wrong to make you chase after me as though I were a criminal?"
        },
        {
          "version": "ESV",
          "text": "Then Jacob became angry and berated Laban. Jacob said to Laban, “What is my offense? What is my sin, that you have hotly pursued me?"
        },
        {
          "version": "NKJV",
          "text": "Then Jacob was angry and rebuked Laban, and Jacob answered and said to Laban: “What is my trespass? What is my sin, that you have so hotly pursued me?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 22:9",
          "text": "In all cases of illegal possession of an ox, a donkey, a sheep, a garment, or any lost item that someone claims, ‘This is mine,’ both parties shall bring their cases before the judges. The one whom the judges find guilty must pay back double to his neighbor."
        },
        {
          "reference": "1 Samuel 12:3",
          "text": "Here I am. Bear witness against me before the LORD and before His anointed: Whose ox or donkey have I taken? Whom have I cheated or oppressed? From whose hand have I accepted a bribe and closed my eyes? Tell me, and I will restore it to you.”"
        },
        {
          "reference": "Job 31:35-37",
          "text": "(Oh, that I had one to hear me! Here is my signature. Let the Almighty answer me; let my accuser compose an indictment. / Surely I would carry it on my shoulder and wear it like a crown. / I would give account of all my steps; I would approach Him like a prince.)—"
        },
        {
          "reference": "1 Samuel 24:11-12",
          "text": "See, my father, look at the corner of your robe in my hand. For I cut it off, but I did not kill you. Know and see that there is no evil or rebellion in my hands. I have not sinned against you, even though you are hunting me down to take my life. / May the LORD judge between you and me, and may the LORD take vengeance on you, but my hand will never be against you."
        },
        {
          "reference": "1 Samuel 25:28-31",
          "text": "Please forgive your servant’s offense, for the LORD will surely make a lasting dynasty for my lord, because he fights the LORD’s battles. May no evil be found in you as long as you live. / And should someone pursue you and seek your life, then the life of my lord will be bound securely by the LORD your God in the bundle of the living. But He shall fling away the lives of your enemies like stones from a sling. / When the LORD has done for my lord all the good He promised, and when He has appointed you ruler over Israel, ..."
        },
        {
          "reference": "2 Corinthians 7:2",
          "text": "Make room for us in your hearts. We have wronged no one, we have corrupted no one, we have exploited no one."
        },
        {
          "reference": "Acts 24:16",
          "text": "In this hope, I strive always to maintain a clear conscience before God and man."
        },
        {
          "reference": "2 Corinthians 1:12",
          "text": "For this is our boast: Our conscience testifies that we have conducted ourselves in the world, and especially in relation to you, in the holiness and sincerity that are from God—not in worldly wisdom, but in the grace of God."
        },
        {
          "reference": "1 Thessalonians 2:10",
          "text": "You are witnesses, and so is God, of how holy, righteous, and blameless our conduct was among you who believed."
        },
        {
          "reference": "Philippians 2:15",
          "text": "so that you may be blameless and pure, children of God without fault in a crooked and perverse generation, in which you shine as lights in the world"
        },
        {
          "reference": "1 Peter 3:16",
          "text": "keeping a clear conscience, so that those who slander you may be put to shame by your good behavior in Christ."
        },
        {
          "reference": "2 Samuel 16:10-12",
          "text": "But the king replied, “What have I to do with you, O sons of Zeruiah? If he curses me because the LORD told him, ‘Curse David,’ who can ask, ‘Why did you do this?’” / Then David said to Abishai and to all his servants, “Behold, my own son, my own flesh and blood, seeks my life. How much more, then, this Benjamite! Leave him alone and let him curse me, for the LORD has told him so. / Perhaps the LORD will see my affliction and repay me with good for the cursing I receive today.”"
        },
        {
          "reference": "1 Kings 18:18",
          "text": "“I have not troubled Israel,” Elijah replied, “but you and your father’s house have, for you have forsaken the commandments of the LORD and have followed the Baals."
        },
        {
          "reference": "Nehemiah 5:7-9",
          "text": "and after serious thought I rebuked the nobles and officials, saying, “You are exacting usury from your own brothers!” So I called a large assembly against them / and said, “We have done our best to buy back our Jewish brothers who were sold to foreigners, but now you are selling your own brothers, that they may be sold back to us!” But they remained silent, for they could find nothing to say. / So I continued, “What you are doing is not right. Shouldn’t you walk in the fear of our God to avoid the reproach of our foreign enemies?"
        },
        {
          "reference": "Proverbs 18:17",
          "text": "The first to state his case seems right until another comes and cross-examines him."
        }
      ]
    },
    {
      "reference": "Genesis 31:37",
      "book": "Genesis",
      "chapter": 31,
      "verse": 37,
      "translations": [
        {
          "version": "NIV",
          "text": "Now that you have searched through all my goods, what have you found that belongs to your household? Put it here in front of your relatives and mine, and let them judge between the two of us."
        },
        {
          "version": "NLT",
          "text": "You have rummaged through everything I own. Now show me what you found that belongs to you! Set it out here in front of us, before our relatives, for all to see. Let them judge between us!"
        },
        {
          "version": "ESV",
          "text": "For you have felt through all my goods; what have you found of all your household goods? Set it here before my kinsmen and your kinsmen, that they may decide between us two."
        },
        {
          "version": "NKJV",
          "text": "Although you have searched all my things, what part of your household things have you found? Set it here before my brethren and your brethren, that they may judge between us both!"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:32",
          "text": "If you find your gods with anyone here, he shall not live! In the presence of our relatives, see for yourself if anything is yours, and take it back.” For Jacob did not know that Rachel had stolen the idols."
        },
        {
          "reference": "Genesis 30:33",
          "text": "So my honesty will testify for me when you come to check on my wages in the future. If I have any goats that are not speckled or spotted, or any lambs that are not dark-colored, they will be considered stolen.”"
        },
        {
          "reference": "Genesis 31:19",
          "text": "Now while Laban was out shearing his sheep, Rachel stole her father’s household idols."
        },
        {
          "reference": "Genesis 31:30",
          "text": "Now you have gone off because you long for your father’s house. But why have you stolen my gods?”"
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 31:53",
          "text": "May the God of Abraham and the God of Nahor, the God of their father, judge between us.” So Jacob swore by the Fear of his father Isaac."
        },
        {
          "reference": "Exodus 22:10-13",
          "text": "If a man gives a donkey, an ox, a sheep, or any other animal to be cared for by his neighbor, but it dies or is injured or stolen while no one is watching, / an oath before the LORD shall be made between the parties to determine whether or not the man has taken his neighbor’s property. The owner must accept the oath and require no restitution. / But if the animal was actually stolen from the neighbor, he must make restitution to the owner. ..."
        },
        {
          "reference": "1 Samuel 12:3",
          "text": "Here I am. Bear witness against me before the LORD and before His anointed: Whose ox or donkey have I taken? Whom have I cheated or oppressed? From whose hand have I accepted a bribe and closed my eyes? Tell me, and I will restore it to you.”"
        },
        {
          "reference": "Job 31:38-40",
          "text": "if my land cries out against me and its furrows weep together, / if I have devoured its produce without payment or broken the spirit of its tenants, / then let briers grow instead of wheat and stinkweed instead of barley.” Thus conclude the words of Job."
        },
        {
          "reference": "Proverbs 28:1",
          "text": "The wicked flee when no one pursues, but the righteous are as bold as a lion."
        },
        {
          "reference": "Matthew 5:37",
          "text": "Simply let your ‘Yes’ be ‘Yes,’ and your ‘No,’ ‘No.’ Anything more comes from the evil one."
        },
        {
          "reference": "Luke 19:8",
          "text": "But Zacchaeus stood up and said to the Lord, “Look, Lord, half of my possessions I give to the poor, and if I have cheated anyone, I will repay it fourfold.”"
        },
        {
          "reference": "John 8:46",
          "text": "Which of you can prove Me guilty of sin? If I speak the truth, why do you not believe Me?"
        },
        {
          "reference": "Acts 24:20-21",
          "text": "Otherwise, let these men state for themselves any crime they found in me when I stood before the Sanhedrin, / unless it was this one thing I called out as I stood in their presence: ‘It is concerning the resurrection of the dead that I am on trial before you today.’”"
        },
        {
          "reference": "2 Corinthians 1:12",
          "text": "For this is our boast: Our conscience testifies that we have conducted ourselves in the world, and especially in relation to you, in the holiness and sincerity that are from God—not in worldly wisdom, but in the grace of God."
        }
      ]
    },
    {
      "reference": "Genesis 31:38",
      "book": "Genesis",
      "chapter": 31,
      "verse": 38,
      "translations": [
        {
          "version": "NIV",
          "text": "“I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten rams from your flocks."
        },
        {
          "version": "NLT",
          "text": "“For twenty years I have been with you, caring for your flocks. In all that time your sheep and goats never miscarried. In all those years I never used a single ram of yours for food."
        },
        {
          "version": "ESV",
          "text": "These twenty years I have been with you. Your ewes and your female goats have not miscarried, and I have not eaten the rams of your flocks."
        },
        {
          "version": "NKJV",
          "text": "These twenty years I have been with you; your ewes and your female goats have not miscarried their young, and I have not eaten the rams of your flock."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:1",
          "text": "Meanwhile, Moses was shepherding the flock of his father-in-law Jethro, the priest of Midian. He led the flock to the far side of the wilderness and came to Horeb, the mountain of God."
        },
        {
          "reference": "1 Samuel 17:34-35",
          "text": "David replied, “Your servant has been tending his father’s sheep, and whenever a lion or a bear came and carried off a lamb from the flock, / I went after it, struck it down, and delivered the lamb from its mouth. If it reared up against me, I would grab it by its fur, strike it down, and kill it."
        },
        {
          "reference": "Isaiah 40:11",
          "text": "He tends His flock like a shepherd; He gathers the lambs in His arms and carries them close to His heart. He gently leads the nursing ewes."
        },
        {
          "reference": "Ezekiel 34:12",
          "text": "As a shepherd looks for his scattered sheep when he is among the flock, so I will look for My flock. I will rescue them from all the places to which they were scattered on a day of clouds and darkness."
        },
        {
          "reference": "John 10:11-14",
          "text": "I am the good shepherd. The good shepherd lays down His life for the sheep. / The hired hand is not the shepherd, and the sheep are not his own. When he sees the wolf coming, he abandons the sheep and runs away. Then the wolf pounces on them and scatters the flock. / The man runs away because he is a hired servant and is unconcerned for the sheep. ..."
        },
        {
          "reference": "Luke 15:4-6",
          "text": "“What man among you, if he has a hundred sheep and loses one of them, does not leave the ninety-nine in the pasture and go after the one that is lost, until he finds it? / And when he finds it, he joyfully puts it on his shoulders, / comes home, and calls together his friends and neighbors to tell them, ‘Rejoice with me, for I have found my lost sheep!’"
        },
        {
          "reference": "1 Peter 5:2-4",
          "text": "Be shepherds of God’s flock that is among you, watching over them not out of compulsion, but willingly, as God would have you; not out of greed, but out of eagerness; / not lording it over those entrusted to you, but being examples to the flock. / And when the Chief Shepherd appears, you will receive the crown of glory that will never fade away."
        },
        {
          "reference": "Psalm 23:1-4",
          "text": "A Psalm of David. The LORD is my shepherd; I shall not want. / He makes me lie down in green pastures; He leads me beside quiet waters. / He restores my soul; He guides me in the paths of righteousness for the sake of His name. ..."
        },
        {
          "reference": "Jeremiah 31:10",
          "text": "Hear, O nations, the word of the LORD, and proclaim it in distant coastlands: “The One who scattered Israel will gather them and keep them as a shepherd keeps his flock."
        },
        {
          "reference": "Micah 5:4",
          "text": "He will stand and shepherd His flock in the strength of the LORD, in the majestic name of the LORD His God. And they will dwell securely, for then His greatness will extend to the ends of the earth."
        },
        {
          "reference": "Matthew 18:12-14",
          "text": "What do you think? If a man has a hundred sheep and one of them goes astray, will he not leave the ninety-nine on the hills and go out to search for the one that is lost? / And if he finds it, truly I tell you, he rejoices more over that one sheep than over the ninety-nine that did not go astray. / In the same way, your Father in heaven is not willing that any of these little ones should perish."
        },
        {
          "reference": "Hebrews 13:20",
          "text": "Now may the God of peace, who through the blood of the eternal covenant brought back from the dead our Lord Jesus, that great Shepherd of the sheep,"
        },
        {
          "reference": "1 Timothy 5:18",
          "text": "For the Scripture says, “Do not muzzle an ox while it is treading out the grain,” and, “The worker is worthy of his wages.”"
        },
        {
          "reference": "Acts 20:28",
          "text": "Keep watch over yourselves and the entire flock of which the Holy Spirit has made you overseers. Be shepherds of the church of God, which He purchased with His own blood."
        },
        {
          "reference": "Zechariah 11:16",
          "text": "For behold, I will raise up a shepherd in the land who will neither care for the lost, nor seek the young, nor heal the broken, nor sustain the healthy, but he will devour the flesh of the choice sheep and tear off their hooves."
        }
      ]
    },
    {
      "reference": "Genesis 31:39",
      "book": "Genesis",
      "chapter": 31,
      "verse": 39,
      "translations": [
        {
          "version": "NIV",
          "text": "I did not bring you animals torn by wild beasts; I bore the loss myself. And you demanded payment from me for whatever was stolen by day or night."
        },
        {
          "version": "NLT",
          "text": "If any were attacked and killed by wild animals, I never showed you the carcass and asked you to reduce the count of your flock. No, I took the loss myself! You made me pay for every stolen animal, whether it was taken in broad daylight or in the dark of night."
        },
        {
          "version": "ESV",
          "text": "What was torn by wild beasts I did not bring to you. I bore the loss of it myself. From my hand you required it, whether stolen by day or stolen by night."
        },
        {
          "version": "NKJV",
          "text": "That which was torn by beasts I did not bring to you; I bore the loss of it. You required it from my hand, whether stolen by day or stolen by night."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 22:10-13",
          "text": "If a man gives a donkey, an ox, a sheep, or any other animal to be cared for by his neighbor, but it dies or is injured or stolen while no one is watching, / an oath before the LORD shall be made between the parties to determine whether or not the man has taken his neighbor’s property. The owner must accept the oath and require no restitution. / But if the animal was actually stolen from the neighbor, he must make restitution to the owner. ..."
        },
        {
          "reference": "1 Samuel 25:21",
          "text": "Now David had just said, “In vain I have protected all that belonged to this man in the wilderness. Nothing that belongs to him has gone missing, yet he has paid me back evil for good."
        },
        {
          "reference": "1 Samuel 25:15-16",
          "text": "Yet these men were very good to us. When we were in the field, we were not harassed, and nothing of ours went missing the whole time we lived among them. / They were a wall around us, both day and night, the whole time we were herding our sheep near them."
        },
        {
          "reference": "1 Samuel 17:34-35",
          "text": "David replied, “Your servant has been tending his father’s sheep, and whenever a lion or a bear came and carried off a lamb from the flock, / I went after it, struck it down, and delivered the lamb from its mouth. If it reared up against me, I would grab it by its fur, strike it down, and kill it."
        },
        {
          "reference": "1 Peter 2:19-20",
          "text": "For if anyone endures the pain of unjust suffering because he is conscious of God, this is to be commended. / How is it to your credit if you are beaten for doing wrong and you endure it? But if you suffer for doing good and you endure it, this is commendable before God."
        },
        {
          "reference": "2 Corinthians 11:27",
          "text": "in labor and toil and often without sleep, in hunger and thirst and often without food, in cold and exposure."
        },
        {
          "reference": "2 Corinthians 11:9",
          "text": "And when I was with you and in need, I was not a burden to anyone; for the brothers who came from Macedonia supplied my needs. I have refrained from being a burden to you in any way, and I will continue to do so."
        },
        {
          "reference": "2 Corinthians 11:28",
          "text": "Apart from these external trials, I face daily the pressure of my concern for all the churches."
        },
        {
          "reference": "1 Thessalonians 2:9",
          "text": "Surely you recall, brothers, our labor and toil. We worked night and day so that we would not be a burden to anyone while we proclaimed to you the gospel of God."
        },
        {
          "reference": "1 Thessalonians 3:10",
          "text": "Night and day we pray most earnestly that we may see you face to face and supply what is lacking in your faith."
        },
        {
          "reference": "Philippians 4:12",
          "text": "I know how to live humbly, and I know how to abound. In any and every situation I have learned the secret of being filled and being hungry, of having plenty and having need."
        },
        {
          "reference": "Philippians 4:18",
          "text": "I have all I need and more, now that I have received your gifts from Epaphroditus. They are a fragrant offering, an acceptable sacrifice, well-pleasing to God."
        },
        {
          "reference": "Acts 20:34-35",
          "text": "You yourselves know that these hands of mine have ministered to my own needs and those of my companions. / In everything, I showed you that by this kind of hard work we must help the weak, remembering the words of the Lord Jesus Himself: ‘It is more blessed to give than to receive.’”"
        },
        {
          "reference": "Acts 20:31",
          "text": "Therefore be alert and remember that for three years I never stopped warning each of you night and day with tears."
        },
        {
          "reference": "Luke 15:4",
          "text": "“What man among you, if he has a hundred sheep and loses one of them, does not leave the ninety-nine in the pasture and go after the one that is lost, until he finds it?"
        }
      ]
    },
    {
      "reference": "Genesis 31:40",
      "book": "Genesis",
      "chapter": 31,
      "verse": 40,
      "translations": [
        {
          "version": "NIV",
          "text": "This was my situation: The heat consumed me in the daytime and the cold at night, and sleep fled from my eyes."
        },
        {
          "version": "NLT",
          "text": "“I worked for you through the scorching heat of the day and through cold and sleepless nights."
        },
        {
          "version": "ESV",
          "text": "There I was: by day the heat consumed me, and the cold by night, and my sleep fled from my eyes."
        },
        {
          "version": "NKJV",
          "text": "There I was! In the day the drought consumed me, and the frost by night, and my sleep departed from my eyes."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 18:18",
          "text": "Surely you and these people with you will wear yourselves out, because the task is too heavy for you. You cannot handle it alone."
        },
        {
          "reference": "Deuteronomy 8:15",
          "text": "He led you through the vast and terrifying wilderness with its venomous snakes and scorpions, a thirsty and waterless land. He brought you water from the rock of flint."
        },
        {
          "reference": "Psalm 32:4",
          "text": "For day and night Your hand was heavy upon me; my strength was drained as in the summer heat. Selah"
        },
        {
          "reference": "Psalm 102:3-4",
          "text": "For my days vanish like smoke, and my bones burn like glowing embers. / My heart is afflicted, and withered like grass; I even forget to eat my bread."
        },
        {
          "reference": "Psalm 121:6",
          "text": "The sun will not strike you by day, nor the moon by night."
        },
        {
          "reference": "Isaiah 49:10",
          "text": "They will not hunger or thirst, nor will scorching heat or sun beat down on them. For He who has compassion on them will guide them and lead them beside springs of water."
        },
        {
          "reference": "Jeremiah 9:2",
          "text": "If only I had a traveler’s lodge in the wilderness, I would abandon my people and depart from them, for they are all adulterers, a crowd of faithless people."
        },
        {
          "reference": "Jeremiah 20:9",
          "text": "If I say, “I will not mention Him or speak any more in His name,” His message becomes a fire burning in my heart, shut up in my bones, and I become weary of holding it in, and I cannot prevail."
        },
        {
          "reference": "Lamentations 1:13",
          "text": "He sent fire from on high, and it overpowered my bones. He spread a net for my feet and turned me back. He made me desolate, faint all the day long."
        },
        {
          "reference": "Lamentations 3:4",
          "text": "He has worn away my flesh and skin; He has shattered my bones."
        },
        {
          "reference": "Matthew 20:12",
          "text": "‘These men who were hired last worked only one hour,’ they said, ‘and you have made them equal to us who have borne the burden and the scorching heat of the day.’"
        },
        {
          "reference": "Luke 12:35-37",
          "text": "Be dressed for service and keep your lamps burning. / Then you will be like servants waiting for their master to return from the wedding banquet, so that when he comes and knocks, they can open the door for him at once. / Blessed are those servants whom the master finds on watch when he returns. Truly I tell you, he will dress himself to serve and will have them recline at the table, and he himself will come and wait on them."
        },
        {
          "reference": "Luke 21:37",
          "text": "Every day Jesus taught at the temple, but every evening He went out to spend the night on the Mount of Olives."
        },
        {
          "reference": "John 4:6",
          "text": "Since Jacob’s well was there, Jesus, weary from His journey, sat down by the well. It was about the sixth hour."
        },
        {
          "reference": "John 9:4",
          "text": "While it is daytime, we must do the works of Him who sent Me. Night is coming, when no one can work."
        }
      ]
    },
    {
      "reference": "Genesis 31:41",
      "book": "Genesis",
      "chapter": 31,
      "verse": 41,
      "translations": [
        {
          "version": "NIV",
          "text": "It was like this for the twenty years I was in your household. I worked for you fourteen years for your two daughters and six years for your flocks, and you changed my wages ten times."
        },
        {
          "version": "NLT",
          "text": "Yes, for twenty years I slaved in your house! I worked for fourteen years earning your two daughters, and then six more years for your flock. And you changed my wages ten times!"
        },
        {
          "version": "ESV",
          "text": "These twenty years I have been in your house. I served you fourteen years for your two daughters, and six years for your flock, and you have changed my wages ten times."
        },
        {
          "version": "NKJV",
          "text": "Thus I have been in your house twenty years; I served you fourteen years for your two daughters, and six years for your flock, and you have changed my wages ten times."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:20",
          "text": "So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 30:26-30",
          "text": "Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” / And he added, “Name your wages, and I will pay them.” ..."
        },
        {
          "reference": "Genesis 31:7",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me."
        },
        {
          "reference": "Genesis 31:38-40",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes."
        },
        {
          "reference": "Exodus 1:14",
          "text": "and made their lives bitter with hard labor in brick and mortar, and with all kinds of work in the fields. Every service they imposed was harsh."
        },
        {
          "reference": "Exodus 2:23",
          "text": "After a long time, the king of Egypt died. The Israelites groaned and cried out under their burden of slavery, and their cry for deliverance from bondage ascended to God."
        },
        {
          "reference": "Leviticus 25:43",
          "text": "You are not to rule over them harshly, but you shall fear your God."
        },
        {
          "reference": "Deuteronomy 24:14-15",
          "text": "Do not oppress a hired hand who is poor and needy, whether he is a brother or a foreigner residing in one of your towns. / You are to pay his wages each day before sunset, because he is poor and depends on them. Otherwise he may cry out to the LORD against you, and you will be guilty of sin."
        },
        {
          "reference": "Job 7:1-3",
          "text": "“Is not man consigned to labor on earth? Are not his days like those of a hired hand? / Like a slave he longs for shade; like a hireling he waits for his wages. / So I am allotted months of futility, and nights of misery are appointed to me."
        },
        {
          "reference": "Job 14:14",
          "text": "When a man dies, will he live again? All the days of my hard service I will wait, until my renewal comes."
        },
        {
          "reference": "Psalm 39:5-6",
          "text": "You, indeed, have made my days as handbreadths, and my lifetime as nothing before You. Truly each man at his best exists as but a breath. Selah / Surely every man goes about like a phantom; surely he bustles in vain; he heaps up riches not knowing who will haul them away."
        },
        {
          "reference": "Psalm 90:10",
          "text": "The length of our days is seventy years—or eighty if we are strong—yet their pride is but labor and sorrow, for they quickly pass, and we fly away."
        },
        {
          "reference": "Jeremiah 22:13",
          "text": "“Woe to him who builds his palace by unrighteousness, and his upper rooms without justice, who makes his countrymen serve without pay, and fails to pay their wages,"
        },
        {
          "reference": "Malachi 3:5",
          "text": "“Then I will draw near to you for judgment. And I will be a swift witness against sorcerers and adulterers and perjurers, against oppressors of the widowed and fatherless, and against those who defraud laborers of their wages and deny justice to the foreigner but do not fear Me,” says the LORD of Hosts."
        },
        {
          "reference": "Matthew 20:1-16",
          "text": "“For the kingdom of heaven is like a landowner who went out early in the morning to hire workers for his vineyard. / He agreed to pay them a denarius for the day and sent them into his vineyard. / About the third hour he went out and saw others standing in the marketplace doing nothing. ..."
        }
      ]
    },
    {
      "reference": "Genesis 31:42",
      "book": "Genesis",
      "chapter": 31,
      "verse": 42,
      "translations": [
        {
          "version": "NIV",
          "text": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been with me, you would surely have sent me away empty-handed. But God has seen my hardship and the toil of my hands, and last night he rebuked you.”"
        },
        {
          "version": "NLT",
          "text": "In fact, if the God of my father had not been on my side—the God of Abraham and the fearsome God of Isaac—you would have sent me away empty-handed. But God has seen your abuse and my hard work. That is why he appeared to you last night and rebuked you!”"
        },
        {
          "version": "ESV",
          "text": "If the God of my father, the God of Abraham and the Fear of Isaac, had not been on my side, surely now you would have sent me away empty-handed. God saw my affliction and the labor of my hands and rebuked you last night.”"
        },
        {
          "version": "NKJV",
          "text": "Unless the God of my father, the God of Abraham and the Fear of Isaac, had been with me, surely now you would have sent me away empty-handed. God has seen my affliction and the labor of my hands, and rebuked you last night.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:7-8",
          "text": "The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings. / I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites."
        },
        {
          "reference": "Exodus 2:23-25",
          "text": "After a long time, the king of Egypt died. The Israelites groaned and cried out under their burden of slavery, and their cry for deliverance from bondage ascended to God. / So God heard their groaning, and He remembered His covenant with Abraham, Isaac, and Jacob. / God saw the Israelites and took notice."
        },
        {
          "reference": "Deuteronomy 26:7-9",
          "text": "So we called out to the LORD, the God of our fathers; and the LORD heard our voice and saw our affliction, toil, and oppression. / Then the LORD brought us out of Egypt with a mighty hand and an outstretched arm, with great terror, signs, and wonders. / And He brought us to this place and gave us this land, a land flowing with milk and honey."
        },
        {
          "reference": "Psalm 124:1-8",
          "text": "A song of ascents. Of David. If the LORD had not been on our side—let Israel now declare— / if the LORD had not been on our side when men attacked us, / when their anger flared against us, then they would have swallowed us alive, ..."
        },
        {
          "reference": "Psalm 18:48",
          "text": "who delivers me from my enemies. You exalt me above my foes; You rescue me from violent men."
        },
        {
          "reference": "Psalm 34:17",
          "text": "The righteous cry out, and the LORD hears; He delivers them from all their troubles."
        },
        {
          "reference": "Psalm 72:12-14",
          "text": "For he will deliver the needy who cry out and the afflicted who have no helper. / He will take pity on the poor and needy and save the lives of the oppressed. / He will redeem them from oppression and violence, for their blood is precious in his sight."
        },
        {
          "reference": "Psalm 146:7-9",
          "text": "He executes justice for the oppressed and gives food to the hungry. The LORD sets the prisoners free, / the LORD opens the eyes of the blind, the LORD lifts those who are weighed down, the LORD loves the righteous. / The LORD protects foreigners; He sustains the fatherless and the widow, but the ways of the wicked He frustrates."
        },
        {
          "reference": "Isaiah 63:9",
          "text": "In all their distress, He too was afflicted, and the Angel of His Presence saved them. In His love and compassion He redeemed them; He lifted them up and carried them all the days of old."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Isaiah 43:1-2",
          "text": "But now, this is what the LORD says—He who created you, O Jacob, and He who formed you, O Israel: “Do not fear, for I have redeemed you; I have called you by your name; you are Mine! / When you pass through the waters, I will be with you; and when you go through the rivers, they will not overwhelm you. When you walk through the fire, you will not be scorched; the flames will not set you ablaze."
        },
        {
          "reference": "Jeremiah 31:11",
          "text": "For the LORD has ransomed Jacob and redeemed him from the hand that had overpowered him."
        },
        {
          "reference": "Matthew 6:26-30",
          "text": "Look at the birds of the air: They do not sow or reap or gather into barns, and yet your heavenly Father feeds them. Are you not much more valuable than they? / Who of you by worrying can add a single hour to his life? / And why do you worry about clothes? Consider how the lilies of the field grow: They do not labor or spin. ..."
        },
        {
          "reference": "Matthew 10:29-31",
          "text": "Are not two sparrows sold for a penny? Yet not one of them will fall to the ground apart from the will of your Father. / And even the very hairs of your head are all numbered. / So do not be afraid; you are worth more than many sparrows."
        },
        {
          "reference": "Luke 1:68-75",
          "text": "“Blessed be the Lord, the God of Israel, because He has visited and redeemed His people. / He has raised up a horn of salvation for us in the house of His servant David, / as He spoke through His holy prophets, those of ages past, ..."
        }
      ]
    },
    {
      "reference": "Genesis 31:43",
      "book": "Genesis",
      "chapter": 31,
      "verse": 43,
      "translations": [
        {
          "version": "NIV",
          "text": "Laban answered Jacob, “The women are my daughters, the children are my children, and the flocks are my flocks. All you see is mine. Yet what can I do today about these daughters of mine, or about the children they have borne?"
        },
        {
          "version": "NLT",
          "text": "Then Laban replied to Jacob, “These women are my daughters, these children are my grandchildren, and these flocks are my flocks—in fact, everything you see is mine. But what can I do now about my daughters and their children?"
        },
        {
          "version": "ESV",
          "text": "Then Laban answered and said to Jacob, “The daughters are my daughters, the children are my children, the flocks are my flocks, and all that you see is mine. But what can I do this day for these my daughters or for their children whom they have borne?"
        },
        {
          "version": "NKJV",
          "text": "And Laban answered and said to Jacob, “ These daughters are my daughters, and these children are my children, and this flock is my flock; all that you see is mine. But what can I do this day to these my daughters or to their children whom they have borne?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:14-16",
          "text": "And Rachel and Leah replied, “Do we have any portion or inheritance left in our father’s house? / Are we not regarded by him as outsiders? Not only has he sold us, but he has certainly squandered what was paid for us. / Surely all the wealth that God has taken away from our father belongs to us and to our children. So do whatever God has told you.”"
        },
        {
          "reference": "Genesis 29:15-30",
          "text": "Laban said to him, “Just because you are my relative, should you work for nothing? Tell me what your wages should be.” / Now Laban had two daughters; the older was named Leah, and the younger was named Rachel. / Leah had weak eyes, but Rachel was shapely and beautiful. ..."
        },
        {
          "reference": "Genesis 30:25-43",
          "text": "Now after Rachel had given birth to Joseph, Jacob said to Laban, “Send me on my way so I can return to my homeland. / Give me my wives and children for whom I have served you, that I may go on my way. You know how hard I have worked for you.” / But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.” ..."
        },
        {
          "reference": "Genesis 24:35",
          "text": "“The LORD has greatly blessed my master, and he has become rich. He has given him sheep and cattle, silver and gold, menservants and maidservants, camels and donkeys."
        },
        {
          "reference": "Genesis 27:36",
          "text": "So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 30:31-34",
          "text": "“What can I give you?” Laban asked. “You do not need to give me anything,” Jacob replied. “If you do this one thing for me, I will keep on shepherding and keeping your flocks. / Let me go through all your flocks today and remove from them every speckled or spotted sheep, every dark-colored lamb, and every spotted or speckled goat. These will be my wages. / So my honesty will testify for me when you come to check on my wages in the future. If I have any goats that are not speckled or spotted, or any lambs that are not dark-colored, they will be considered stolen.” ..."
        },
        {
          "reference": "Genesis 21:25-30",
          "text": "But when Abraham complained to Abimelech about a well that Abimelech’s servants had seized, / Abimelech replied, “I do not know who has done this. You did not tell me, so I have not heard about it until today.” / So Abraham brought sheep and cattle and gave them to Abimelech, and the two men made a covenant. ..."
        },
        {
          "reference": "Genesis 26:14-16",
          "text": "He owned so many flocks and herds and servants that the Philistines envied him. / So the Philistines took dirt and stopped up all the wells that his father’s servants had dug in the days of his father Abraham. / Then Abimelech said to Isaac, “Depart from us, for you are much too powerful for us.”"
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 29:18-20",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.” / Laban replied, “Better that I give her to you than to another. Stay here with me.” / So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 30:27",
          "text": "But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.”"
        },
        {
          "reference": "Genesis 31:7-9",
          "text": "And although he has cheated me and changed my wages ten times, God has not allowed him to harm me. / If he said, ‘The speckled will be your wages,’ then the whole flock bore speckled offspring. If he said, ‘The streaked will be your wages,’ then the whole flock bore streaked offspring. / Thus God has taken away your father’s livestock and given them to me."
        },
        {
          "reference": "Genesis 31:38-42",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes. ..."
        },
        {
          "reference": "Genesis 32:10",
          "text": "I am unworthy of all the kindness and faithfulness You have shown Your servant. Indeed, with only my staff I came across the Jordan, but now I have become two camps."
        },
        {
          "reference": "Genesis 33:11",
          "text": "Please accept my gift that was brought to you, because God has been gracious to me and I have all I need.” So Jacob pressed him until he accepted."
        }
      ]
    },
    {
      "reference": "Genesis 31:44",
      "book": "Genesis",
      "chapter": 31,
      "verse": 44,
      "translations": [
        {
          "version": "NIV",
          "text": "Come now, let’s make a covenant, you and I, and let it serve as a witness between us.”"
        },
        {
          "version": "NLT",
          "text": "So come, let’s make a covenant, you and I, and it will be a witness to our commitment.”"
        },
        {
          "version": "ESV",
          "text": "Come now, let us make a covenant, you and I. And let it be a witness between you and me.”"
        },
        {
          "version": "NKJV",
          "text": "Now therefore, come, let us make a covenant, you and I, and let it be a witness between you and me.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:27",
          "text": "So Abraham brought sheep and cattle and gave them to Abimelech, and the two men made a covenant."
        },
        {
          "reference": "Genesis 26:28-31",
          "text": "“We can plainly see that the LORD has been with you,” they replied. “We recommend that there should now be an oath between us and you. Let us make a covenant with you / that you will not harm us, just as we have not harmed you but have done only good to you, sending you on your way in peace. And now you are blessed by the LORD.” / So Isaac prepared a feast for them, and they ate and drank. ..."
        },
        {
          "reference": "Exodus 24:7-8",
          "text": "Then he took the Book of the Covenant and read it to the people, who replied, “All that the LORD has spoken we will do, and we will be obedient.” / So Moses took the blood, splattered it on the people, and said, “This is the blood of the covenant that the LORD has made with you in accordance with all these words.”"
        },
        {
          "reference": "Joshua 9:15",
          "text": "And Joshua made a treaty of peace with them to let them live, and the leaders of the congregation swore an oath to them."
        },
        {
          "reference": "1 Samuel 18:3",
          "text": "Then Jonathan made a covenant with David because he loved him as himself."
        },
        {
          "reference": "1 Samuel 20:16-17",
          "text": "So Jonathan made a covenant with the house of David, saying, “May the LORD hold David’s enemies accountable.” / And Jonathan had David reaffirm his vow out of love for him, for Jonathan loved David as he loved himself."
        },
        {
          "reference": "1 Samuel 23:18",
          "text": "So the two of them made a covenant before the LORD. And David remained in Horesh, while Jonathan went home."
        },
        {
          "reference": "2 Samuel 3:12-13",
          "text": "Then Abner sent messengers on his behalf to say to David, “To whom does the land belong? Make your covenant with me, and surely my hand will be with you to bring all Israel over to you.” / “Good,” replied David, “I will make a covenant with you. But there is one thing I require of you: Do not appear before me unless you bring Saul’s daughter Michal when you come to see me.”"
        },
        {
          "reference": "2 Samuel 5:3",
          "text": "So all the elders of Israel came to the king at Hebron, where King David made with them a covenant before the LORD. And they anointed him king over Israel."
        },
        {
          "reference": "1 Kings 5:12",
          "text": "And the LORD gave Solomon wisdom, as He had promised him. There was peace between Hiram and Solomon, and the two of them made a treaty."
        },
        {
          "reference": "2 Kings 11:4",
          "text": "Then in the seventh year, Jehoiada sent for the commanders of hundreds, the Carites, and the guards, and had them brought into the house of the LORD. There he made a covenant with them and put them under oath. He showed them the king’s son"
        },
        {
          "reference": "Psalm 50:5",
          "text": "“Gather to Me My saints, who made a covenant with Me by sacrifice.”"
        },
        {
          "reference": "Isaiah 55:3",
          "text": "Incline your ear and come to Me; listen, so that your soul may live. I will make with you an everlasting covenant—My loving devotion promised to David."
        },
        {
          "reference": "Jeremiah 31:31-33",
          "text": "Behold, the days are coming, declares the LORD, when I will make a new covenant with the house of Israel and with the house of Judah. / It will not be like the covenant I made with their fathers when I took them by the hand to lead them out of the land of Egypt—a covenant they broke, though I was a husband to them,” declares the LORD. / “But this is the covenant I will make with the house of Israel after those days, declares the LORD. I will put My law in their minds and inscribe it on their hearts. And I will be their God, and they will be My people."
        },
        {
          "reference": "Ezekiel 37:26",
          "text": "And I will make a covenant of peace with them; it will be an everlasting covenant. I will establish them and multiply them, and I will set My sanctuary among them forever."
        }
      ]
    },
    {
      "reference": "Genesis 31:45",
      "book": "Genesis",
      "chapter": 31,
      "verse": 45,
      "translations": [
        {
          "version": "NIV",
          "text": "So Jacob took a stone and set it up as a pillar."
        },
        {
          "version": "NLT",
          "text": "So Jacob took a stone and set it up as a monument."
        },
        {
          "version": "ESV",
          "text": "So Jacob took a stone and set it up as a pillar."
        },
        {
          "version": "NKJV",
          "text": "So Jacob took a stone and set it up as a pillar."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 24:27",
          "text": "And Joshua said to all the people, “You see this stone. It will be a witness against us, for it has heard all the words the LORD has spoken to us, and it will be a witness against you if you ever deny your God.”"
        },
        {
          "reference": "Exodus 24:4",
          "text": "And Moses wrote down all the words of the LORD. Early the next morning he got up and built an altar at the base of the mountain, along with twelve pillars for the twelve tribes of Israel."
        },
        {
          "reference": "Deuteronomy 27:2-4",
          "text": "And on the day you cross the Jordan into the land that the LORD your God is giving you, set up large stones and coat them with plaster. / Write on them all the words of this law when you have crossed over to enter the land that the LORD your God is giving you, a land flowing with milk and honey, just as the LORD, the God of your fathers, has promised you. / And when you have crossed the Jordan, you are to set up these stones on Mount Ebal, as I am commanding you today, and you are to coat them with plaster."
        },
        {
          "reference": "1 Samuel 7:12",
          "text": "Afterward, Samuel took a stone and set it up between Mizpah and Shen. He named it Ebenezer, saying, “Thus far the LORD has helped us.”"
        },
        {
          "reference": "Joshua 4:20-24",
          "text": "And there at Gilgal Joshua set up the twelve stones they had taken from the Jordan. / Then Joshua said to the Israelites, “In the future, when your children ask their fathers, ‘What is the meaning of these stones?’ / you are to tell them, ‘Israel crossed the Jordan on dry ground.’ ..."
        },
        {
          "reference": "1 Kings 18:31",
          "text": "And Elijah took twelve stones, one for each tribe of the sons of Jacob, to whom the word of the LORD had come and said, “Israel shall be your name.”"
        },
        {
          "reference": "Isaiah 19:19",
          "text": "In that day there will be an altar to the LORD in the center of the land of Egypt, and a pillar to the LORD near her border."
        },
        {
          "reference": "2 Kings 3:19",
          "text": "And you shall attack every fortified city and every city of importance. You shall cut down every good tree, stop up every spring, and ruin every good field with stones.”"
        },
        {
          "reference": "2 Samuel 18:18",
          "text": "During his lifetime, Absalom had set up for himself a pillar in the King’s Valley, for he had said, “I have no son to preserve the memory of my name.” So he gave the pillar his name, and to this day it is called Absalom’s Monument."
        },
        {
          "reference": "Ezekiel 37:16-17",
          "text": "“And you, son of man, take a single stick and write on it: ‘Belonging to Judah and to the Israelites associated with him.’ Then take another stick and write on it: ‘Belonging to Joseph—the stick of Ephraim—and to all the house of Israel associated with him.’ / Then join them together into one stick, so that they become one in your hand."
        },
        {
          "reference": "Matthew 16:18",
          "text": "And I tell you that you are Peter, and on this rock I will build My church, and the gates of Hades will not prevail against it."
        },
        {
          "reference": "1 Peter 2:5",
          "text": "you also, like living stones, are being built into a spiritual house to be a holy priesthood, offering spiritual sacrifices acceptable to God through Jesus Christ."
        },
        {
          "reference": "Ephesians 2:20",
          "text": "built on the foundation of the apostles and prophets, with Christ Jesus Himself as the cornerstone."
        },
        {
          "reference": "Revelation 21:14",
          "text": "The wall of the city had twelve foundations bearing the names of the twelve apostles of the Lamb."
        },
        {
          "reference": "Acts 4:11",
          "text": "This Jesus is ‘the stone you builders rejected, which has become the cornerstone.’"
        }
      ]
    },
    {
      "reference": "Genesis 31:46",
      "book": "Genesis",
      "chapter": 31,
      "verse": 46,
      "translations": [
        {
          "version": "NIV",
          "text": "He said to his relatives, “Gather some stones.” So they took stones and piled them in a heap, and they ate there by the heap."
        },
        {
          "version": "NLT",
          "text": "Then he told his family members, “Gather some stones.” So they gathered stones and piled them in a heap. Then Jacob and Laban sat down beside the pile of stones to eat a covenant meal."
        },
        {
          "version": "ESV",
          "text": "And Jacob said to his kinsmen, “Gather stones.” And they took stones and made a heap, and they ate there by the heap."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob said to his brethren, “Gather stones.” And they took stones and made a heap, and they ate there on the heap."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 24:26-27",
          "text": "Joshua recorded these things in the Book of the Law of God. Then he took a large stone and set it up there under the oak that was near the sanctuary of the LORD. / And Joshua said to all the people, “You see this stone. It will be a witness against us, for it has heard all the words the LORD has spoken to us, and it will be a witness against you if you ever deny your God.”"
        },
        {
          "reference": "1 Samuel 7:12",
          "text": "Afterward, Samuel took a stone and set it up between Mizpah and Shen. He named it Ebenezer, saying, “Thus far the LORD has helped us.”"
        },
        {
          "reference": "Exodus 24:4",
          "text": "And Moses wrote down all the words of the LORD. Early the next morning he got up and built an altar at the base of the mountain, along with twelve pillars for the twelve tribes of Israel."
        },
        {
          "reference": "Deuteronomy 27:2-4",
          "text": "And on the day you cross the Jordan into the land that the LORD your God is giving you, set up large stones and coat them with plaster. / Write on them all the words of this law when you have crossed over to enter the land that the LORD your God is giving you, a land flowing with milk and honey, just as the LORD, the God of your fathers, has promised you. / And when you have crossed the Jordan, you are to set up these stones on Mount Ebal, as I am commanding you today, and you are to coat them with plaster."
        },
        {
          "reference": "Joshua 4:3-9",
          "text": "and command them: ‘Take up for yourselves twelve stones from the middle of the Jordan where the priests were standing, carry them with you, and set them down in the place where you spend the night.’” / So Joshua summoned the twelve men he had appointed from the Israelites, one from each tribe, / and said to them, “Cross over before the ark of the LORD your God into the middle of the Jordan. Each of you is to take a stone upon his shoulder, according to the number of the tribes of Israel, ..."
        },
        {
          "reference": "1 Kings 18:31-32",
          "text": "And Elijah took twelve stones, one for each tribe of the sons of Jacob, to whom the word of the LORD had come and said, “Israel shall be your name.” / And with the stones, Elijah built an altar in the name of the LORD. Then he dug a trench around the altar large enough to hold two seahs of seed."
        },
        {
          "reference": "2 Kings 3:19",
          "text": "And you shall attack every fortified city and every city of importance. You shall cut down every good tree, stop up every spring, and ruin every good field with stones.”"
        },
        {
          "reference": "Hosea 12:4",
          "text": "Yes, he struggled with the angel and prevailed; he wept and sought His favor; he found Him at Bethel and spoke with Him there—"
        },
        {
          "reference": "Judges 6:20",
          "text": "And the angel of God said to him, “Take the meat and the unleavened bread, lay them on this rock, and pour out the broth.” And Gideon did so."
        },
        {
          "reference": "1 Samuel 15:12",
          "text": "Early in the morning Samuel got up to confront Saul, but he was told, “Saul has gone to Carmel, and behold, he has set up a monument for himself and has turned and gone down to Gilgal.”"
        },
        {
          "reference": "Matthew 21:42",
          "text": "Jesus said to them, “Have you never read in the Scriptures: ‘The stone the builders rejected has become the cornerstone. This is from the Lord, and it is marvelous in our eyes’?"
        },
        {
          "reference": "Mark 12:10",
          "text": "Have you never read this Scripture: ‘The stone the builders rejected has become the cornerstone."
        },
        {
          "reference": "Luke 20:17",
          "text": "But Jesus looked directly at them and said, “Then what is the meaning of that which is written: ‘The stone the builders rejected has become the cornerstone’?"
        },
        {
          "reference": "Acts 4:11",
          "text": "This Jesus is ‘the stone you builders rejected, which has become the cornerstone.’"
        },
        {
          "reference": "Romans 9:33",
          "text": "as it is written: “See, I lay in Zion a stone of stumbling and a rock of offense; and the one who believes in Him will never be put to shame.”"
        }
      ]
    },
    {
      "reference": "Genesis 31:47",
      "book": "Genesis",
      "chapter": 31,
      "verse": 47,
      "translations": [
        {
          "version": "NIV",
          "text": "Laban called it Jegar Sahadutha, and Jacob called it Galeed."
        },
        {
          "version": "NLT",
          "text": "To commemorate the event, Laban called the place Jegar-sahadutha (which means “witness pile” in Aramaic), and Jacob called it Galeed (which means “witness pile” in Hebrew)."
        },
        {
          "version": "ESV",
          "text": "Laban called it Jegar-sahadutha, but Jacob called it Galeed."
        },
        {
          "version": "NKJV",
          "text": "Laban called it Jegar Sahadutha, but Jacob called it Galeed."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 22:34",
          "text": "So the Reubenites and Gadites named the altar Witness, for they said, “It is a witness between us that the LORD is God.”"
        },
        {
          "reference": "Judges 6:32",
          "text": "So on that day Gideon was called Jerubbaal, that is to say, “Let Baal contend with him,” because he had torn down Baal’s altar."
        },
        {
          "reference": "1 Samuel 7:12",
          "text": "Afterward, Samuel took a stone and set it up between Mizpah and Shen. He named it Ebenezer, saying, “Thus far the LORD has helped us.”"
        },
        {
          "reference": "1 Samuel 20:42",
          "text": "And Jonathan said to David, “Go in peace, for the two of us have sworn in the name of the LORD, saying, ‘May the LORD be a witness between you and me, and between your descendants and mine forever.’” Then David got up and departed, and Jonathan went back into the city."
        },
        {
          "reference": "2 Samuel 18:18",
          "text": "During his lifetime, Absalom had set up for himself a pillar in the King’s Valley, for he had said, “I have no son to preserve the memory of my name.” So he gave the pillar his name, and to this day it is called Absalom’s Monument."
        },
        {
          "reference": "2 Kings 6:23",
          "text": "So the king prepared a great feast for them, and after they had finished eating and drinking, he sent them away, and they returned to their master. And the Aramean raiders did not come into the land of Israel again."
        },
        {
          "reference": "Psalm 60:4",
          "text": "You have raised a banner for those who fear You, that they may flee the bow. Selah"
        },
        {
          "reference": "Isaiah 19:18",
          "text": "In that day five cities in the land of Egypt will speak the language of Canaan and swear allegiance to the LORD of Hosts. One of them will be called the City of the Sun."
        },
        {
          "reference": "Hosea 12:4",
          "text": "Yes, he struggled with the angel and prevailed; he wept and sought His favor; he found Him at Bethel and spoke with Him there—"
        },
        {
          "reference": "Zechariah 8:23",
          "text": "This is what the LORD of Hosts says: “In those days ten men from the nations of every tongue will tightly grasp the robe of a Jew, saying, ‘Let us go with you, for we have heard that God is with you.’”"
        },
        {
          "reference": "Matthew 1:23",
          "text": "“Behold, the virgin will be with child and will give birth to a son, and they will call Him Immanuel” (which means, “God with us”)."
        },
        {
          "reference": "Matthew 27:46",
          "text": "About the ninth hour Jesus cried out in a loud voice, “Eli, Eli, lema sabachthani?” which means, “My God, My God, why have You forsaken Me?”"
        },
        {
          "reference": "Mark 5:41",
          "text": "Taking her by the hand, Jesus said, “Talitha koum!” which means, “Little girl, I say to you, get up!”"
        },
        {
          "reference": "Mark 15:34",
          "text": "At the ninth hour, Jesus cried out in a loud voice, “Eloi, Eloi, lema sabachthani?” which means, “My God, My God, why have You forsaken Me?”"
        },
        {
          "reference": "John 1:38",
          "text": "Jesus turned and saw them following. “What do you want?” He asked. They said to Him, “Rabbi” (which means Teacher), “where are You staying?”"
        }
      ]
    },
    {
      "reference": "Genesis 31:48",
      "book": "Genesis",
      "chapter": 31,
      "verse": 48,
      "translations": [
        {
          "version": "NIV",
          "text": "Laban said, “This heap is a witness between you and me today.” That is why it was called Galeed."
        },
        {
          "version": "NLT",
          "text": "Then Laban declared, “This pile of stones will stand as a witness to remind us of the covenant we have made today.” This explains why it was called Galeed—“Witness Pile.”"
        },
        {
          "version": "ESV",
          "text": "Laban said, “This heap is a witness between you and me today.” Therefore he named it Galeed,"
        },
        {
          "version": "NKJV",
          "text": "And Laban said, “This heap is a witness between you and me this day.” Therefore its name was called Galeed,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 24:27",
          "text": "And Joshua said to all the people, “You see this stone. It will be a witness against us, for it has heard all the words the LORD has spoken to us, and it will be a witness against you if you ever deny your God.”"
        },
        {
          "reference": "1 Samuel 7:12",
          "text": "Afterward, Samuel took a stone and set it up between Mizpah and Shen. He named it Ebenezer, saying, “Thus far the LORD has helped us.”"
        },
        {
          "reference": "Deuteronomy 31:19-21",
          "text": "Now therefore, write down for yourselves this song and teach it to the Israelites; have them recite it, so that it may be a witness for Me against them. / When I have brought them into the land that I swore to give their fathers, a land flowing with milk and honey, they will eat their fill and prosper. Then they will turn to other gods and worship them, and they will reject Me and break My covenant. / And when many troubles and afflictions have come upon them, this song will testify against them, because it will not be forgotten from the lips of their descendants. For I know their inclination, even before I bring them into the land that I swore to give them.”"
        },
        {
          "reference": "Isaiah 19:19-20",
          "text": "In that day there will be an altar to the LORD in the center of the land of Egypt, and a pillar to the LORD near her border. / It will be a sign and a witness to the LORD of Hosts in the land of Egypt. When they cry out to the LORD because of their oppressors, He will send them a savior and defender to rescue them."
        },
        {
          "reference": "Exodus 24:4",
          "text": "And Moses wrote down all the words of the LORD. Early the next morning he got up and built an altar at the base of the mountain, along with twelve pillars for the twelve tribes of Israel."
        },
        {
          "reference": "Joshua 4:6-7",
          "text": "to serve as a sign among you. In the future, when your children ask, ‘What do these stones mean to you?’ / you are to tell them, ‘The waters of the Jordan were cut off before the ark of the covenant of the LORD. When it crossed the Jordan, the waters were cut off.’ Therefore these stones will be a memorial to the Israelites forever.”"
        },
        {
          "reference": "1 Kings 18:31-32",
          "text": "And Elijah took twelve stones, one for each tribe of the sons of Jacob, to whom the word of the LORD had come and said, “Israel shall be your name.” / And with the stones, Elijah built an altar in the name of the LORD. Then he dug a trench around the altar large enough to hold two seahs of seed."
        },
        {
          "reference": "2 Kings 17:34",
          "text": "To this day they are still practicing their former customs. None of them worship the LORD or observe the statutes, ordinances, laws, and commandments that the LORD gave the descendants of Jacob, whom He named Israel."
        },
        {
          "reference": "2 Samuel 20:24-25",
          "text": "Adoram was in charge of the forced labor; Jehoshaphat son of Ahilud was the recorder; / Sheva was the scribe; Zadok and Abiathar were priests;"
        },
        {
          "reference": "Hosea 12:4",
          "text": "Yes, he struggled with the angel and prevailed; he wept and sought His favor; he found Him at Bethel and spoke with Him there—"
        },
        {
          "reference": "Matthew 18:16",
          "text": "But if he will not listen, take one or two others along, so that ‘every matter may be established by the testimony of two or three witnesses.’"
        },
        {
          "reference": "Hebrews 12:1",
          "text": "Therefore, since we are surrounded by such a great cloud of witnesses, let us throw off every encumbrance and the sin that so easily entangles, and let us run with endurance the race set out for us."
        },
        {
          "reference": "Acts 7:44",
          "text": "Our fathers had the tabernacle of the Testimony with them in the wilderness. It was constructed exactly as God had directed Moses, according to the pattern he had seen."
        },
        {
          "reference": "2 Corinthians 13:1",
          "text": "This is the third time I am coming to you. “Every matter must be established by the testimony of two or three witnesses.”"
        },
        {
          "reference": "Romans 15:4",
          "text": "For everything that was written in the past was written for our instruction, so that through endurance and the encouragement of the Scriptures, we might have hope."
        }
      ]
    },
    {
      "reference": "Genesis 31:49",
      "book": "Genesis",
      "chapter": 31,
      "verse": 49,
      "translations": [
        {
          "version": "NIV",
          "text": "It was also called Mizpah, because he said, “May the LORD keep watch between you and me when we are away from each other."
        },
        {
          "version": "NLT",
          "text": "But it was also called Mizpah (which means “watchtower”), for Laban said, “May the LORD keep watch between us to make sure that we keep this covenant when we are out of each other’s sight."
        },
        {
          "version": "ESV",
          "text": "and Mizpah, for he said, “The LORD watch between you and me, when we are out of one another’s sight."
        },
        {
          "version": "NKJV",
          "text": "also Mizpah, because he said, “May the LORD watch between you and me when we are absent one from another."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Samuel 20:42",
          "text": "And Jonathan said to David, “Go in peace, for the two of us have sworn in the name of the LORD, saying, ‘May the LORD be a witness between you and me, and between your descendants and mine forever.’” Then David got up and departed, and Jonathan went back into the city."
        },
        {
          "reference": "Judges 11:10",
          "text": "And the elders of Gilead said to Jephthah, “The LORD is our witness if we do not do as you say.”"
        },
        {
          "reference": "Joshua 22:22-23",
          "text": "“The LORD, the Mighty One, is God! The LORD, the Mighty One, is God! He knows, and may Israel also know. If this was in rebellion or breach of faith against the LORD, do not spare us today. / If we have built for ourselves an altar to turn away from Him and to offer burnt offerings and grain offerings on it, or to sacrifice peace offerings on it, may the LORD Himself hold us accountable."
        },
        {
          "reference": "1 Samuel 24:12",
          "text": "May the LORD judge between you and me, and may the LORD take vengeance on you, but my hand will never be against you."
        },
        {
          "reference": "1 Samuel 26:23-24",
          "text": "May the LORD repay every man for his righteousness and faithfulness. For the LORD delivered you into my hand today, but I would not extend my hand against the LORD’s anointed. / As surely as I valued your life today, so may the LORD value my life and rescue me from all trouble.”"
        },
        {
          "reference": "Psalm 121:8",
          "text": "The LORD will watch over your coming and going, both now and forevermore."
        },
        {
          "reference": "Psalm 139:1-3",
          "text": "For the choirmaster. A Psalm of David. O LORD, You have searched me and known me. / You know when I sit and when I rise; You understand my thoughts from afar. / You search out my path and my lying down; You are aware of all my ways."
        },
        {
          "reference": "Proverbs 15:3",
          "text": "The eyes of the LORD are in every place, observing the evil and the good."
        },
        {
          "reference": "Jeremiah 29:23",
          "text": "For they have committed an outrage in Israel by committing adultery with the wives of their neighbors and speaking lies in My name, which I did not command them to do. I am He who knows, and I am a witness, declares the LORD.”"
        },
        {
          "reference": "Malachi 3:5",
          "text": "“Then I will draw near to you for judgment. And I will be a swift witness against sorcerers and adulterers and perjurers, against oppressors of the widowed and fatherless, and against those who defraud laborers of their wages and deny justice to the foreigner but do not fear Me,” says the LORD of Hosts."
        },
        {
          "reference": "Matthew 18:20",
          "text": "For where two or three gather together in My name, there am I with them.”"
        },
        {
          "reference": "Matthew 28:20",
          "text": "and teaching them to obey all that I have commanded you. And surely I am with you always, even to the end of the age.”"
        },
        {
          "reference": "Luke 12:2-3",
          "text": "There is nothing concealed that will not be disclosed, and nothing hidden that will not be made known. / What you have spoken in the dark will be heard in the daylight, and what you have whispered in the inner rooms will be proclaimed from the housetops."
        },
        {
          "reference": "John 14:27",
          "text": "Peace I leave with you; My peace I give to you. I do not give to you as the world gives. Do not let your hearts be troubled; do not be afraid."
        },
        {
          "reference": "Acts 1:24",
          "text": "And they prayed, “Lord, You know everyone’s heart. Show us which of these two You have chosen"
        }
      ]
    },
    {
      "reference": "Genesis 31:50",
      "book": "Genesis",
      "chapter": 31,
      "verse": 50,
      "translations": [
        {
          "version": "NIV",
          "text": "If you mistreat my daughters or if you take any wives besides my daughters, even though no one is with us, remember that God is a witness between you and me.”"
        },
        {
          "version": "NLT",
          "text": "If you mistreat my daughters or if you marry other wives, God will see it even if no one else does. He is a witness to this covenant between us."
        },
        {
          "version": "ESV",
          "text": "If you oppress my daughters, or if you take wives besides my daughters, although no one is with us, see, God is witness between you and me.”"
        },
        {
          "version": "NKJV",
          "text": "If you afflict my daughters, or if you take other wives besides my daughters, although no man is with us—see, God is witness between you and me!”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Malachi 2:14-16",
          "text": "Yet you ask, “Why?” It is because the LORD has been a witness between you and the wife of your youth, against whom you have broken faith, though she is your companion and your wife by covenant. / Has not the LORD made them one, having a portion of the Spirit? And why one? Because He seeks godly offspring. So guard yourselves in your spirit and do not break faith with the wife of your youth. / “For I hate divorce,” says the LORD, the God of Israel. “He who divorces his wife covers his garment with violence,” says the LORD of Hosts. So guard yourselves in your spirit and do not break faith."
        },
        {
          "reference": "Exodus 20:7",
          "text": "You shall not take the name of the LORD your God in vain, for the LORD will not leave anyone unpunished who takes His name in vain."
        },
        {
          "reference": "Matthew 19:6",
          "text": "So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "1 Peter 3:7",
          "text": "Husbands, in the same way, treat your wives with consideration as a delicate vessel, and with honor as fellow heirs of the gracious gift of life, so that your prayers will not be hindered."
        },
        {
          "reference": "Deuteronomy 23:21-23",
          "text": "If you make a vow to the LORD your God, do not be slow to keep it, because He will surely require it of you, and you will be guilty of sin. / But if you refrain from making a vow, you will not be guilty of sin. / Be careful to follow through on what comes from your lips, because you have freely vowed to the LORD your God with your own mouth."
        },
        {
          "reference": "1 Corinthians 7:10-11",
          "text": "To the married I give this command (not I, but the Lord): A wife must not separate from her husband. / But if she does, she must remain unmarried or else be reconciled to her husband. And a husband must not divorce his wife."
        },
        {
          "reference": "Hebrews 13:4",
          "text": "Marriage should be honored by all and the marriage bed kept undefiled, for God will judge the sexually immoral and adulterers."
        },
        {
          "reference": "Proverbs 5:15-19",
          "text": "Drink water from your own cistern, and running water from your own well. / Why should your springs flow in the streets, your streams of water in the public squares? / Let them be yours alone, never to be shared with strangers. ..."
        },
        {
          "reference": "Ephesians 5:25-33",
          "text": "Husbands, love your wives, just as Christ loved the church and gave Himself up for her / to sanctify her, cleansing her by the washing with water through the word, / and to present her to Himself as a glorious church, without stain or wrinkle or any such blemish, but holy and blameless. ..."
        },
        {
          "reference": "Numbers 30:2",
          "text": "If a man makes a vow to the LORD or swears an oath to obligate himself by a pledge, he must not break his word; he must do everything he has promised."
        },
        {
          "reference": "Matthew 5:33-37",
          "text": "Again, you have heard that it was said to the ancients, ‘Do not break your oath, but fulfill your vows to the Lord.’ / But I tell you not to swear at all: either by heaven, for it is God’s throne; / or by the earth, for it is His footstool; or by Jerusalem, for it is the city of the great King. ..."
        },
        {
          "reference": "1 Timothy 5:8",
          "text": "If anyone does not provide for his own, and especially his own household, he has denied the faith and is worse than an unbeliever."
        },
        {
          "reference": "Psalm 15:4",
          "text": "who despises the vile but honors those who fear the LORD, who does not revise a costly oath,"
        },
        {
          "reference": "Colossians 3:19",
          "text": "Husbands, love your wives and do not be harsh with them."
        },
        {
          "reference": "Ecclesiastes 5:4-5",
          "text": "When you make a vow to God, do not delay in fulfilling it, because He takes no pleasure in fools. Fulfill your vow. / It is better not to vow than to make a vow and not fulfill it."
        }
      ]
    },
    {
      "reference": "Genesis 31:51",
      "book": "Genesis",
      "chapter": 31,
      "verse": 51,
      "translations": [
        {
          "version": "NIV",
          "text": "Laban also said to Jacob, “Here is this heap, and here is this pillar I have set up between you and me."
        },
        {
          "version": "NLT",
          "text": "“See this pile of stones,” Laban continued, “and see this monument I have set between us."
        },
        {
          "version": "ESV",
          "text": "Then Laban said to Jacob, “See this heap and the pillar, which I have set between you and me."
        },
        {
          "version": "NKJV",
          "text": "Then Laban said to Jacob, “Here is this heap and here is this pillar, which I have placed between you and me."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 24:27",
          "text": "And Joshua said to all the people, “You see this stone. It will be a witness against us, for it has heard all the words the LORD has spoken to us, and it will be a witness against you if you ever deny your God.”"
        },
        {
          "reference": "Deuteronomy 31:19-21",
          "text": "Now therefore, write down for yourselves this song and teach it to the Israelites; have them recite it, so that it may be a witness for Me against them. / When I have brought them into the land that I swore to give their fathers, a land flowing with milk and honey, they will eat their fill and prosper. Then they will turn to other gods and worship them, and they will reject Me and break My covenant. / And when many troubles and afflictions have come upon them, this song will testify against them, because it will not be forgotten from the lips of their descendants. For I know their inclination, even before I bring them into the land that I swore to give them.”"
        },
        {
          "reference": "1 Samuel 7:12",
          "text": "Afterward, Samuel took a stone and set it up between Mizpah and Shen. He named it Ebenezer, saying, “Thus far the LORD has helped us.”"
        },
        {
          "reference": "Joshua 22:27-28",
          "text": "Rather, let it be a witness between us and you and the generations to come, that we will worship the LORD in His presence with our burnt offerings, sacrifices, and peace offerings.’ Then in the future, your descendants cannot say to ours, ‘You have no share in the LORD!’ / Therefore we said, ‘If they ever say this to us or to our descendants, we will answer: Look at the replica of the altar of the LORD that our fathers made, not for burnt offerings or sacrifices, but as a witness between us and you.’"
        },
        {
          "reference": "Joshua 4:6-7",
          "text": "to serve as a sign among you. In the future, when your children ask, ‘What do these stones mean to you?’ / you are to tell them, ‘The waters of the Jordan were cut off before the ark of the covenant of the LORD. When it crossed the Jordan, the waters were cut off.’ Therefore these stones will be a memorial to the Israelites forever.”"
        },
        {
          "reference": "1 Kings 18:31-32",
          "text": "And Elijah took twelve stones, one for each tribe of the sons of Jacob, to whom the word of the LORD had come and said, “Israel shall be your name.” / And with the stones, Elijah built an altar in the name of the LORD. Then he dug a trench around the altar large enough to hold two seahs of seed."
        },
        {
          "reference": "Exodus 24:4",
          "text": "And Moses wrote down all the words of the LORD. Early the next morning he got up and built an altar at the base of the mountain, along with twelve pillars for the twelve tribes of Israel."
        },
        {
          "reference": "Isaiah 19:19-20",
          "text": "In that day there will be an altar to the LORD in the center of the land of Egypt, and a pillar to the LORD near her border. / It will be a sign and a witness to the LORD of Hosts in the land of Egypt. When they cry out to the LORD because of their oppressors, He will send them a savior and defender to rescue them."
        },
        {
          "reference": "2 Kings 17:34",
          "text": "To this day they are still practicing their former customs. None of them worship the LORD or observe the statutes, ordinances, laws, and commandments that the LORD gave the descendants of Jacob, whom He named Israel."
        },
        {
          "reference": "2 Samuel 20:8",
          "text": "And while they were at the great stone in Gibeon, Amasa joined them. Now Joab was dressed in military attire, with a dagger strapped to his belt. And as he stepped forward, he slipped the dagger from its sheath."
        },
        {
          "reference": "Matthew 18:16",
          "text": "But if he will not listen, take one or two others along, so that ‘every matter may be established by the testimony of two or three witnesses.’"
        },
        {
          "reference": "Hebrews 12:1",
          "text": "Therefore, since we are surrounded by such a great cloud of witnesses, let us throw off every encumbrance and the sin that so easily entangles, and let us run with endurance the race set out for us."
        },
        {
          "reference": "Acts 7:44",
          "text": "Our fathers had the tabernacle of the Testimony with them in the wilderness. It was constructed exactly as God had directed Moses, according to the pattern he had seen."
        },
        {
          "reference": "2 Corinthians 13:1",
          "text": "This is the third time I am coming to you. “Every matter must be established by the testimony of two or three witnesses.”"
        },
        {
          "reference": "Romans 15:4",
          "text": "For everything that was written in the past was written for our instruction, so that through endurance and the encouragement of the Scriptures, we might have hope."
        }
      ]
    },
    {
      "reference": "Genesis 31:52",
      "book": "Genesis",
      "chapter": 31,
      "verse": 52,
      "translations": [
        {
          "version": "NIV",
          "text": "This heap is a witness, and this pillar is a witness, that I will not go past this heap to your side to harm you and that you will not go past this heap and pillar to my side to harm me."
        },
        {
          "version": "NLT",
          "text": "They stand between us as witnesses of our vows. I will never pass this pile of stones to harm you, and you must never pass these stones or this monument to harm me."
        },
        {
          "version": "ESV",
          "text": "This heap is a witness, and the pillar is a witness, that I will not pass over this heap to you, and you will not pass over this heap and this pillar to me, to do harm."
        },
        {
          "version": "NKJV",
          "text": "This heap is a witness, and this pillar is a witness, that I will not pass beyond this heap to you, and you will not pass beyond this heap and this pillar to me, for harm."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 24:27",
          "text": "And Joshua said to all the people, “You see this stone. It will be a witness against us, for it has heard all the words the LORD has spoken to us, and it will be a witness against you if you ever deny your God.”"
        },
        {
          "reference": "Deuteronomy 31:19-21",
          "text": "Now therefore, write down for yourselves this song and teach it to the Israelites; have them recite it, so that it may be a witness for Me against them. / When I have brought them into the land that I swore to give their fathers, a land flowing with milk and honey, they will eat their fill and prosper. Then they will turn to other gods and worship them, and they will reject Me and break My covenant. / And when many troubles and afflictions have come upon them, this song will testify against them, because it will not be forgotten from the lips of their descendants. For I know their inclination, even before I bring them into the land that I swore to give them.”"
        },
        {
          "reference": "1 Samuel 7:12",
          "text": "Afterward, Samuel took a stone and set it up between Mizpah and Shen. He named it Ebenezer, saying, “Thus far the LORD has helped us.”"
        },
        {
          "reference": "Joshua 22:27-28",
          "text": "Rather, let it be a witness between us and you and the generations to come, that we will worship the LORD in His presence with our burnt offerings, sacrifices, and peace offerings.’ Then in the future, your descendants cannot say to ours, ‘You have no share in the LORD!’ / Therefore we said, ‘If they ever say this to us or to our descendants, we will answer: Look at the replica of the altar of the LORD that our fathers made, not for burnt offerings or sacrifices, but as a witness between us and you.’"
        },
        {
          "reference": "Joshua 4:6-7",
          "text": "to serve as a sign among you. In the future, when your children ask, ‘What do these stones mean to you?’ / you are to tell them, ‘The waters of the Jordan were cut off before the ark of the covenant of the LORD. When it crossed the Jordan, the waters were cut off.’ Therefore these stones will be a memorial to the Israelites forever.”"
        },
        {
          "reference": "Exodus 24:4",
          "text": "And Moses wrote down all the words of the LORD. Early the next morning he got up and built an altar at the base of the mountain, along with twelve pillars for the twelve tribes of Israel."
        },
        {
          "reference": "1 Kings 18:31-32",
          "text": "And Elijah took twelve stones, one for each tribe of the sons of Jacob, to whom the word of the LORD had come and said, “Israel shall be your name.” / And with the stones, Elijah built an altar in the name of the LORD. Then he dug a trench around the altar large enough to hold two seahs of seed."
        },
        {
          "reference": "Isaiah 19:19-20",
          "text": "In that day there will be an altar to the LORD in the center of the land of Egypt, and a pillar to the LORD near her border. / It will be a sign and a witness to the LORD of Hosts in the land of Egypt. When they cry out to the LORD because of their oppressors, He will send them a savior and defender to rescue them."
        },
        {
          "reference": "2 Kings 17:34",
          "text": "To this day they are still practicing their former customs. None of them worship the LORD or observe the statutes, ordinances, laws, and commandments that the LORD gave the descendants of Jacob, whom He named Israel."
        },
        {
          "reference": "2 Samuel 20:1",
          "text": "Now a worthless man named Sheba son of Bichri, a Benjamite, happened to be there, and he blew the ram’s horn and shouted: “We have no share in David, no inheritance in Jesse’s son. Every man to his tent, O Israel!”"
        },
        {
          "reference": "Matthew 18:20",
          "text": "For where two or three gather together in My name, there am I with them.”"
        },
        {
          "reference": "Hebrews 12:24",
          "text": "to Jesus the mediator of a new covenant, and to the sprinkled blood that speaks a better word than the blood of Abel."
        },
        {
          "reference": "Ephesians 2:14",
          "text": "For He Himself is our peace, who has made the two one and has torn down the dividing wall of hostility"
        },
        {
          "reference": "Matthew 5:9",
          "text": "Blessed are the peacemakers, for they will be called sons of God."
        },
        {
          "reference": "Romans 12:18",
          "text": "If it is possible on your part, live at peace with everyone."
        }
      ]
    },
    {
      "reference": "Genesis 31:53",
      "book": "Genesis",
      "chapter": 31,
      "verse": 53,
      "translations": [
        {
          "version": "NIV",
          "text": "May the God of Abraham and the God of Nahor, the God of their father, judge between us.” So Jacob took an oath in the name of the Fear of his father Isaac."
        },
        {
          "version": "NLT",
          "text": "I call on the God of our ancestors—the God of your grandfather Abraham and the God of my grandfather Nahor—to serve as a judge between us.” So Jacob took an oath before the fearsome God of his father, Isaac, to respect the boundary line."
        },
        {
          "version": "ESV",
          "text": "The God of Abraham and the God of Nahor, the God of their father, judge between us.” So Jacob swore by the Fear of his father Isaac,"
        },
        {
          "version": "NKJV",
          "text": "The God of Abraham, the God of Nahor, and the God of their father judge between us.” And Jacob swore by the Fear of his father Isaac."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:13",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie."
        },
        {
          "reference": "Genesis 21:23-24",
          "text": "Now, therefore, swear to me here before God that you will not deal falsely with me or my children or descendants. Show to me and to the country in which you reside the same kindness that I have shown to you.” / And Abraham replied, “I swear it.”"
        },
        {
          "reference": "Genesis 26:28-31",
          "text": "“We can plainly see that the LORD has been with you,” they replied. “We recommend that there should now be an oath between us and you. Let us make a covenant with you / that you will not harm us, just as we have not harmed you but have done only good to you, sending you on your way in peace. And now you are blessed by the LORD.” / So Isaac prepared a feast for them, and they ate and drank. ..."
        },
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Exodus 20:12",
          "text": "Honor your father and mother, so that your days may be long in the land that the LORD your God is giving you."
        },
        {
          "reference": "Joshua 24:2-3",
          "text": "And Joshua said to all the people, “This is what the LORD, the God of Israel, says: ‘Long ago your fathers, including Terah the father of Abraham and Nahor, lived beyond the Euphrates and worshiped other gods. / But I took your father Abraham from beyond the Euphrates and led him through all the land of Canaan, and I multiplied his descendants. I gave him Isaac,"
        },
        {
          "reference": "Joshua 24:14-15",
          "text": "Now, therefore, fear the LORD and serve Him in sincerity and truth; cast aside the gods your fathers served beyond the Euphrates and in Egypt, and serve the LORD. / But if it is unpleasing in your sight to serve the LORD, then choose for yourselves this day whom you will serve, whether the gods your fathers served beyond the Euphrates, or the gods of the Amorites in whose land you are living. As for me and my house, we will serve the LORD!”"
        },
        {
          "reference": "1 Samuel 20:42",
          "text": "And Jonathan said to David, “Go in peace, for the two of us have sworn in the name of the LORD, saying, ‘May the LORD be a witness between you and me, and between your descendants and mine forever.’” Then David got up and departed, and Jonathan went back into the city."
        },
        {
          "reference": "1 Kings 18:36",
          "text": "At the time of the evening sacrifice, Elijah the prophet approached the altar and said, “O LORD, God of Abraham, Isaac, and Israel, let it be known this day that You are God in Israel and that I am Your servant and have done all these things at Your command."
        },
        {
          "reference": "Psalm 50:6",
          "text": "And the heavens proclaim His righteousness, for God Himself is Judge. Selah"
        },
        {
          "reference": "Psalm 96:13",
          "text": "before the LORD, for He is coming—He is coming to judge the earth. He will judge the world in righteousness and the peoples in His faithfulness."
        },
        {
          "reference": "Isaiah 54:5",
          "text": "For your husband is your Maker—the LORD of Hosts is His name—the Holy One of Israel is your Redeemer; He is called the God of all the earth."
        },
        {
          "reference": "Jeremiah 31:1",
          "text": "“At that time,” declares the LORD, “I will be the God of all the families of Israel, and they will be My people.”"
        },
        {
          "reference": "Malachi 2:10",
          "text": "Do we not all have one Father? Did not one God create us? Why then do we break faith with one another so as to profane the covenant of our fathers?"
        },
        {
          "reference": "Matthew 22:32",
          "text": "‘I am the God of Abraham, the God of Isaac, and the God of Jacob’? He is not the God of the dead, but of the living.”"
        }
      ]
    },
    {
      "reference": "Genesis 31:54",
      "book": "Genesis",
      "chapter": 31,
      "verse": 54,
      "translations": [
        {
          "version": "NIV",
          "text": "He offered a sacrifice there in the hill country and invited his relatives to a meal. After they had eaten, they spent the night there."
        },
        {
          "version": "NLT",
          "text": "Then Jacob offered a sacrifice to God there on the mountain and invited everyone to a covenant feast. After they had eaten, they spent the night on the mountain."
        },
        {
          "version": "ESV",
          "text": "and Jacob offered a sacrifice in the hill country and called his kinsmen to eat bread. They ate bread and spent the night in the hill country."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob offered a sacrifice on the mountain, and called his brethren to eat bread. And they ate bread and stayed all night on the mountain."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 24:5",
          "text": "Then he sent out some young men of Israel, and they offered burnt offerings and sacrificed young bulls as peace offerings to the LORD."
        },
        {
          "reference": "Leviticus 3:1-5",
          "text": "“If one’s offering is a peace offering and he offers an animal from the herd, whether male or female, he must present it without blemish before the LORD. / He is to lay his hand on the head of the offering and slaughter it at the entrance to the Tent of Meeting. Then Aaron’s sons the priests shall splatter the blood on all sides of the altar. / From the peace offering he is to bring a food offering to the LORD: the fat that covers the entrails, all the fat that is on them, ..."
        },
        {
          "reference": "1 Samuel 9:12-13",
          "text": "“Yes, he is ahead of you,” they answered. “Hurry now, for today he has come to the city because the people have a sacrifice on the high place. / As soon as you enter the city, you will find him before he goes up to the high place to eat. The people will not eat until he comes, because he must bless the sacrifice; after that, the guests will eat. Go up at once; you will find him.”"
        },
        {
          "reference": "1 Kings 8:63",
          "text": "And Solomon offered as peace offerings to the LORD 22,000 oxen and 120,000 sheep. So the king and all the Israelites dedicated the house of the LORD."
        },
        {
          "reference": "2 Chronicles 7:5",
          "text": "And King Solomon offered a sacrifice of 22,000 oxen and 120,000 sheep. So the king and all the people dedicated the house of God."
        },
        {
          "reference": "Psalm 50:14",
          "text": "Sacrifice a thank offering to God, and fulfill your vows to the Most High."
        },
        {
          "reference": "Psalm 107:22",
          "text": "Let them offer sacrifices of thanksgiving and declare His works with rejoicing."
        },
        {
          "reference": "Psalm 116:17",
          "text": "I will offer to You a sacrifice of thanksgiving and call on the name of the LORD."
        },
        {
          "reference": "Isaiah 56:7",
          "text": "I will bring them to My holy mountain and make them joyful in My house of prayer. Their burnt offerings and sacrifices will be accepted on My altar, for My house will be called a house of prayer for all the nations.”"
        },
        {
          "reference": "Jeremiah 33:11",
          "text": "the sounds of joy and gladness, the voices of the bride and bridegroom, and the voices of those bringing thank offerings into the house of the LORD, saying: ‘Give thanks to the LORD of Hosts, for the LORD is good; His loving devotion endures forever.’ For I will restore the land from captivity as in former times, says the LORD."
        },
        {
          "reference": "Hosea 6:6",
          "text": "For I desire mercy, not sacrifice, and the knowledge of God rather than burnt offerings."
        },
        {
          "reference": "Matthew 26:26-28",
          "text": "While they were eating, Jesus took bread, spoke a blessing and broke it, and gave it to the disciples, saying, “Take and eat; this is My body.” / Then He took the cup, gave thanks, and gave it to them, saying, “Drink from it, all of you. / This is My blood of the covenant, which is poured out for many for the forgiveness of sins."
        },
        {
          "reference": "Mark 14:22-24",
          "text": "While they were eating, Jesus took bread, spoke a blessing and broke it, and gave it to the disciples, saying, “Take it; this is My body.” / Then He took the cup, gave thanks, and gave it to them, and they all drank from it. / He said to them, “This is My blood of the covenant, which is poured out for many."
        },
        {
          "reference": "Luke 22:19-20",
          "text": "And He took the bread, gave thanks and broke it, and gave it to them, saying, “This is My body, given for you; do this in remembrance of Me.” / In the same way, after supper He took the cup, saying, “This cup is the new covenant in My blood, which is poured out for you."
        },
        {
          "reference": "John 6:53-56",
          "text": "So Jesus said to them, “Truly, truly, I tell you, unless you eat the flesh and drink the blood of the Son of Man, you have no life in you. / Whoever eats My flesh and drinks My blood has eternal life, and I will raise him up at the last day. / For My flesh is real food, and My blood is real drink. ..."
        }
      ]
    },
    {
      "reference": "Genesis 31:55",
      "book": "Genesis",
      "chapter": 31,
      "verse": 55,
      "translations": [
        {
          "version": "NIV",
          "text": "Early the next morning Laban kissed his grandchildren and his daughters and blessed them. Then he left and returned home."
        },
        {
          "version": "NLT",
          "text": "Laban got up early the next morning, and he kissed his grandchildren and his daughters and blessed them. Then he left and returned home."
        },
        {
          "version": "ESV",
          "text": "Early in the morning Laban arose and kissed his grandchildren and his daughters and blessed them. Then Laban departed and returned home."
        },
        {
          "version": "NKJV",
          "text": "And early in the morning Laban arose, and kissed his sons and daughters and blessed them. Then Laban departed and returned to his place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:1-5",
          "text": "So Isaac called for Jacob and blessed him. “Do not take a wife from the Canaanite women,” he commanded. / “Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother. / May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples. ..."
        },
        {
          "reference": "Genesis 32:1-2",
          "text": "Jacob also went on his way, and the angels of God met him. / When Jacob saw them, he said, “This is the camp of God.” So he named that place Mahanaim."
        },
        {
          "reference": "Genesis 24:60",
          "text": "And they blessed Rebekah and said to her, “Our sister, may you become the mother of thousands upon thousands. May your offspring possess the gates of their enemies.”"
        },
        {
          "reference": "Genesis 27:41-45",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.” / When the words of her older son Esau were relayed to Rebekah, she sent for her younger son Jacob and told him, “Look, your brother Esau is consoling himself by plotting to kill you. / So now, my son, obey my voice and flee at once to my brother Laban in Haran. ..."
        },
        {
          "reference": "Genesis 33:4",
          "text": "Esau, however, ran to him and embraced him, threw his arms around his neck, and kissed him. And they both wept."
        },
        {
          "reference": "Genesis 35:9-15",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him. / And God said to him, “Though your name is Jacob, you will no longer be called Jacob. Instead, your name will be Israel.” So God named him Israel. / And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. ..."
        },
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Exodus 18:7",
          "text": "So Moses went out to meet his father-in-law and bowed down and kissed him. They greeted each other and went into the tent."
        },
        {
          "reference": "Ruth 1:9",
          "text": "May the LORD enable each of you to find rest in the home of your new husband.” And she kissed them as they wept aloud"
        },
        {
          "reference": "1 Samuel 20:41-42",
          "text": "When the young man had gone, David got up from the south side of the stone, fell facedown, and bowed three times. Then he and Jonathan kissed each other and wept together—though David wept more. / And Jonathan said to David, “Go in peace, for the two of us have sworn in the name of the LORD, saying, ‘May the LORD be a witness between you and me, and between your descendants and mine forever.’” Then David got up and departed, and Jonathan went back into the city."
        },
        {
          "reference": "2 Samuel 19:39",
          "text": "So all the people crossed the Jordan, and then the king crossed over. The king kissed Barzillai and blessed him, and Barzillai returned home."
        },
        {
          "reference": "1 Kings 19:20",
          "text": "So Elisha left the oxen, ran after Elijah, and said, “Please let me kiss my father and mother goodbye, and then I will follow you.” “Go on back,” Elijah replied, “for what have I done to you?”"
        },
        {
          "reference": "Luke 15:20",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him."
        },
        {
          "reference": "Acts 20:36-38",
          "text": "When Paul had said this, he knelt down with all of them and prayed. / They all wept openly as they embraced Paul and kissed him. / They were especially grieved by his statement that they would never see his face again. Then they accompanied him to the ship."
        },
        {
          "reference": "Romans 16:16",
          "text": "Greet one another with a holy kiss. All the churches of Christ send you greetings."
        }
      ]
    }
  ]
}