{
  "book": "genesis",
  "chapter": 33,
  "verses": [
    {
      "reference": "Genesis 33:1",
      "book": "Genesis",
      "chapter": 33,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob looked up and there was Esau, coming with his four hundred men; so he divided the children among Leah, Rachel and the two female servants."
        },
        {
          "version": "NLT",
          "text": "Then Jacob looked up and saw Esau coming with his 400 men. So he divided the children among Leah, Rachel, and his two servant wives."
        },
        {
          "version": "ESV",
          "text": "And Jacob lifted up his eyes and looked, and behold, Esau was coming, and four hundred men with him. So he divided the children among Leah and Rachel and the two female servants."
        },
        {
          "version": "NKJV",
          "text": "Now Jacob lifted his eyes and looked, and there, Esau was coming, and with him were four hundred men. So he divided the children among Leah, Rachel, and the two maidservants."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:6-8",
          "text": "When the messengers returned to Jacob, they said, “We went to your brother Esau, and now he is coming to meet you—he and four hundred men with him.” / In great fear and distress, Jacob divided his people into two camps, as well as the flocks and herds and camels. / He thought, “If Esau comes and attacks one camp, then the other camp can escape.”"
        },
        {
          "reference": "Genesis 32:11",
          "text": "Please deliver me from the hand of my brother Esau, for I am afraid that he may come and attack me and the mothers and children with me."
        },
        {
          "reference": "Genesis 32:13-20",
          "text": "Jacob spent the night there, and from what he had brought with him, he selected a gift for his brother Esau: / 200 female goats, 20 male goats, 200 ewes, 20 rams, / 30 milk camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys. ..."
        },
        {
          "reference": "Genesis 32:24-30",
          "text": "So Jacob was left all alone, and there a man wrestled with him until daybreak. / When the man saw that he could not overpower Jacob, he struck the socket of Jacob’s hip and dislocated it as they wrestled. / Then the man said, “Let me go, for it is daybreak.” But Jacob replied, “I will not let you go unless you bless me.” ..."
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 28:5-9",
          "text": "So Isaac sent Jacob to Paddan-aram, to Laban son of Bethuel the Aramean, the brother of Rebekah, who was the mother of Jacob and Esau. / Now Esau learned that Isaac had blessed Jacob and sent him to Paddan-aram to take a wife there, commanding him, “Do not marry a Canaanite woman,” / and that Jacob had obeyed his father and mother and gone to Paddan-aram. ..."
        },
        {
          "reference": "Genesis 31:3",
          "text": "Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 31:55",
          "text": "Early the next morning, Laban got up and kissed his grandchildren and daughters and blessed them. Then he left to return home."
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Hosea 12:3-4",
          "text": "In the womb he grasped his brother’s heel, and in his vigor he wrestled with God. / Yes, he struggled with the angel and prevailed; he wept and sought His favor; he found Him at Bethel and spoke with Him there—"
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 11:20",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future."
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        }
      ]
    },
    {
      "reference": "Genesis 33:2",
      "book": "Genesis",
      "chapter": 33,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "He put the female servants and their children in front, Leah and her children next, and Rachel and Joseph in the rear."
        },
        {
          "version": "NLT",
          "text": "He put the servant wives and their children at the front, Leah and her children next, and Rachel and Joseph last."
        },
        {
          "version": "ESV",
          "text": "And he put the servants with their children in front, then Leah with her children, and Rachel and Joseph last of all."
        },
        {
          "version": "NKJV",
          "text": "And he put the maidservants and their children in front, Leah and her children behind, and Rachel and Joseph last."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:7-8",
          "text": "In great fear and distress, Jacob divided his people into two camps, as well as the flocks and herds and camels. / He thought, “If Esau comes and attacks one camp, then the other camp can escape.”"
        },
        {
          "reference": "Genesis 32:11",
          "text": "Please deliver me from the hand of my brother Esau, for I am afraid that he may come and attack me and the mothers and children with me."
        },
        {
          "reference": "Genesis 32:13-15",
          "text": "Jacob spent the night there, and from what he had brought with him, he selected a gift for his brother Esau: / 200 female goats, 20 male goats, 200 ewes, 20 rams, / 30 milk camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys."
        },
        {
          "reference": "Genesis 32:22-23",
          "text": "During the night Jacob got up and took his two wives, his two maidservants, and his eleven sons, and crossed the ford of the Jabbok. / He took them and sent them across the stream, along with all his possessions."
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 31:17",
          "text": "Then Jacob got up and put his children and his wives on camels,"
        },
        {
          "reference": "Genesis 31:55",
          "text": "Early the next morning, Laban got up and kissed his grandchildren and daughters and blessed them. Then he left to return home."
        },
        {
          "reference": "Genesis 35:1-3",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.” / So Jacob told his household and all who were with him, “Get rid of the foreign gods that are among you. Purify yourselves and change your garments. / Then let us arise and go to Bethel. I will build an altar there to God, who answered me in my day of distress. He has been with me wherever I have gone.”"
        },
        {
          "reference": "Exodus 14:19-20",
          "text": "And the angel of God, who had gone before the camp of Israel, withdrew and went behind them. The pillar of cloud also moved from before them and stood behind them, / so that it came between the camps of Egypt and Israel. The cloud was there in the darkness, but it lit up the night. So all night long neither camp went near the other."
        },
        {
          "reference": "Exodus 13:21-22",
          "text": "And the LORD went before them in a pillar of cloud to guide their way by day, and in a pillar of fire to give them light by night, so that they could travel by day or night. / Neither the pillar of cloud by day nor the pillar of fire by night left its place before the people."
        },
        {
          "reference": "1 Samuel 25:13",
          "text": "And David said to his men, “Strap on your swords!” So David and all his men strapped on their swords, and about four hundred men followed David, while two hundred stayed with the supplies."
        },
        {
          "reference": "2 Samuel 18:2",
          "text": "He sent out the troops, a third under Joab, a third under Joab’s brother Abishai son of Zeruiah, and a third under Ittai the Gittite. And the king said to the troops, “I will surely march out with you as well.”"
        },
        {
          "reference": "2 Kings 4:29",
          "text": "So Elisha said to Gehazi, “Tie up your garment, take my staff in your hand, and go! If you meet anyone, do not greet him, and if anyone greets you, do not answer him. Then lay my staff on the boy’s face.”"
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        },
        {
          "reference": "Matthew 10:23",
          "text": "When they persecute you in one town, flee to the next. Truly I tell you, you will not reach all the towns of Israel before the Son of Man comes."
        }
      ]
    },
    {
      "reference": "Genesis 33:3",
      "book": "Genesis",
      "chapter": 33,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "He himself went on ahead and bowed down to the ground seven times as he approached his brother."
        },
        {
          "version": "NLT",
          "text": "Then Jacob went on ahead. As he approached his brother, he bowed to the ground seven times before him."
        },
        {
          "version": "ESV",
          "text": "He himself went on before them, bowing himself to the ground seven times, until he came near to his brother."
        },
        {
          "version": "NKJV",
          "text": "Then he crossed over before them and bowed himself to the ground seven times, until he came near to his brother."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:3-5",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom. / He instructed them, “You are to say to my master Esau, ‘Your servant Jacob says: I have been staying with Laban and have remained there until now. / I have oxen, donkeys, flocks, menservants, and maidservants. I have sent this message to inform my master, so that I may find favor in your sight.’”"
        },
        {
          "reference": "Genesis 32:11",
          "text": "Please deliver me from the hand of my brother Esau, for I am afraid that he may come and attack me and the mothers and children with me."
        },
        {
          "reference": "Genesis 32:20",
          "text": "You are also to say, ‘Look, your servant Jacob is right behind us.’” For he thought, “I will appease Esau with the gift that is going before me. After that I can face him, and perhaps he will accept me.”"
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 27:45",
          "text": "until your brother’s rage against you wanes and he forgets what you have done to him. Then I will send for you and bring you back from there. Why should I lose both of you in one day?”"
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 31:3",
          "text": "Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 31:55",
          "text": "Early the next morning, Laban got up and kissed his grandchildren and daughters and blessed them. Then he left to return home."
        },
        {
          "reference": "Genesis 32:6-7",
          "text": "When the messengers returned to Jacob, they said, “We went to your brother Esau, and now he is coming to meet you—he and four hundred men with him.” / In great fear and distress, Jacob divided his people into two camps, as well as the flocks and herds and camels."
        },
        {
          "reference": "Genesis 32:28",
          "text": "Then the man said, “Your name will no longer be Jacob, but Israel, because you have struggled with God and with men, and you have prevailed.”"
        },
        {
          "reference": "Genesis 50:17-21",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? ..."
        },
        {
          "reference": "Matthew 5:23-24",
          "text": "So if you are offering your gift at the altar and there remember that your brother has something against you, / leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        },
        {
          "reference": "Matthew 18:15",
          "text": "If your brother sins against you, go and confront him privately. If he listens to you, you have won your brother over."
        },
        {
          "reference": "Luke 15:18-20",
          "text": "I will get up and go back to my father and say to him, “Father, I have sinned against heaven and against you. / I am no longer worthy to be called your son. Make me like one of your hired servants.”’ / So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him."
        },
        {
          "reference": "Romans 12:18",
          "text": "If it is possible on your part, live at peace with everyone."
        }
      ]
    },
    {
      "reference": "Genesis 33:4",
      "book": "Genesis",
      "chapter": 33,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "But Esau ran to meet Jacob and embraced him; he threw his arms around his neck and kissed him. And they wept."
        },
        {
          "version": "NLT",
          "text": "Then Esau ran to meet him and embraced him, threw his arms around his neck, and kissed him. And they both wept."
        },
        {
          "version": "ESV",
          "text": "But Esau ran to meet him and embraced him and fell on his neck and kissed him, and they wept."
        },
        {
          "version": "NKJV",
          "text": "But Esau ran to meet him, and embraced him, and fell on his neck and kissed him, and they wept."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Luke 15:20",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him."
        },
        {
          "reference": "Matthew 5:24",
          "text": "leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        },
        {
          "reference": "2 Corinthians 5:18-20",
          "text": "All this is from God, who reconciled us to Himself through Christ and gave us the ministry of reconciliation: / that God was reconciling the world to Himself in Christ, not counting men’s trespasses against them. And He has committed to us the message of reconciliation. / Therefore we are ambassadors for Christ, as though God were making His appeal through us. We implore you on behalf of Christ: Be reconciled to God."
        },
        {
          "reference": "Ephesians 4:32",
          "text": "Be kind and tenderhearted to one another, forgiving each other just as in Christ God forgave you."
        },
        {
          "reference": "Colossians 3:13",
          "text": "Bear with one another and forgive any complaint you may have against someone else. Forgive as the Lord forgave you."
        },
        {
          "reference": "Proverbs 16:7",
          "text": "When a man’s ways please the LORD, He makes even the man’s enemies live at peace with him."
        },
        {
          "reference": "Romans 12:18",
          "text": "If it is possible on your part, live at peace with everyone."
        },
        {
          "reference": "1 John 4:20",
          "text": "If anyone says, “I love God,” but hates his brother, he is a liar. For anyone who does not love his brother, whom he has seen, cannot love God, whom he has not seen."
        },
        {
          "reference": "Matthew 18:21-22",
          "text": "Then Peter came to Jesus and asked, “Lord, how many times shall I forgive my brother who sins against me? Up to seven times?” / Jesus answered, “I tell you, not just seven times, but seventy-seven times!"
        },
        {
          "reference": "1 Samuel 24:16-19",
          "text": "When David had finished saying these things, Saul called back, “Is that your voice, David my son?” Then Saul wept aloud / and said to David, “You are more righteous than I, for you have rewarded me with good, though I have rewarded you with evil. / And you have declared this day how you have treated me well, for when the LORD delivered me into your hand, you did not kill me. ..."
        },
        {
          "reference": "2 Samuel 14:33",
          "text": "So Joab went and told the king, and David summoned Absalom, who came to him and bowed facedown before him. Then the king kissed Absalom."
        },
        {
          "reference": "Genesis 45:14-15",
          "text": "Then Joseph threw his arms around his brother Benjamin and wept, and Benjamin wept as they embraced. / Joseph kissed each of his brothers as he wept over them. And afterward his brothers talked with him."
        },
        {
          "reference": "Genesis 50:17-21",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? ..."
        },
        {
          "reference": "Hosea 11:8",
          "text": "How could I give you up, O Ephraim? How could I surrender you, O Israel? How could I make you like Admah? How could I treat you like Zeboiim? My heart is turned within Me; My compassion is stirred!"
        },
        {
          "reference": "Psalm 85:10",
          "text": "Loving devotion and faithfulness have joined together; righteousness and peace have kissed."
        }
      ]
    },
    {
      "reference": "Genesis 33:5",
      "book": "Genesis",
      "chapter": 33,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Esau looked up and saw the women and children. “Who are these with you?” he asked. Jacob answered, “They are the children God has graciously given your servant.”"
        },
        {
          "version": "NLT",
          "text": "Then Esau looked at the women and children and asked, “Who are these people with you?” “These are the children God has graciously given to me, your servant,” Jacob replied."
        },
        {
          "version": "ESV",
          "text": "And when Esau lifted up his eyes and saw the women and children, he said, “Who are these with you?” Jacob said, “The children whom God has graciously given your servant.”"
        },
        {
          "version": "NKJV",
          "text": "And he lifted his eyes and saw the women and children, and said, “Who are these with you?” So he said, “The children whom God has graciously given your servant.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 48:9",
          "text": "Joseph said to his father, “They are the sons God has given me in this place.” So Jacob said, “Please bring them to me, that I may bless them.”"
        },
        {
          "reference": "Genesis 30:20",
          "text": "“God has given me a good gift,” she said. “This time my husband will honor me, because I have borne him six sons.” And she named him Zebulun."
        },
        {
          "reference": "Genesis 32:11",
          "text": "Please deliver me from the hand of my brother Esau, for I am afraid that he may come and attack me and the mothers and children with me."
        },
        {
          "reference": "Genesis 28:4",
          "text": "And may He give the blessing of Abraham to you and your descendants, so that you may possess the land where you dwell as a foreigner, the land God gave to Abraham.”"
        },
        {
          "reference": "Genesis 17:16",
          "text": "And I will bless her and will surely give you a son by her. I will bless her, and she will be the mother of nations; kings of peoples will descend from her.”"
        },
        {
          "reference": "Genesis 21:1-2",
          "text": "Now the LORD attended to Sarah as He had said, and the LORD did for Sarah what He had promised. / So Sarah conceived and bore a son to Abraham in his old age, at the very time God had promised."
        },
        {
          "reference": "Genesis 25:21",
          "text": "Later, Isaac prayed to the LORD on behalf of his wife, because she was barren. And the LORD heard his prayer, and his wife Rebekah conceived."
        },
        {
          "reference": "Genesis 29:31",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren."
        },
        {
          "reference": "Genesis 30:22-24",
          "text": "Then God remembered Rachel. He listened to her and opened her womb, / and she conceived and gave birth to a son. “God has taken away my shame,” she said. / She named him Joseph, and said, “May the LORD add to me another son.”"
        },
        {
          "reference": "Genesis 49:25",
          "text": "by the God of your father who helps you, and by the Almighty who blesses you, with blessings of the heavens above, with blessings of the depths below, with blessings of the breasts and womb."
        },
        {
          "reference": "1 Samuel 1:27",
          "text": "I prayed for this boy, and since the LORD has granted me what I asked of Him,"
        },
        {
          "reference": "Psalm 127:3",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward."
        },
        {
          "reference": "Psalm 128:3-4",
          "text": "Your wife will be like a fruitful vine flourishing within your house, your sons like olive shoots sitting around your table. / In this way indeed shall blessing come to the man who fears the LORD."
        },
        {
          "reference": "Isaiah 8:18",
          "text": "Here am I, and the children the LORD has given me as signs and symbols in Israel from the LORD of Hosts, who dwells on Mount Zion."
        },
        {
          "reference": "Isaiah 61:9",
          "text": "Their descendants will be known among the nations, and their offspring among the peoples. All who see them will acknowledge that they are a people the LORD has blessed."
        }
      ]
    },
    {
      "reference": "Genesis 33:6",
      "book": "Genesis",
      "chapter": 33,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the female servants and their children approached and bowed down."
        },
        {
          "version": "NLT",
          "text": "Then the servant wives came forward with their children and bowed before him."
        },
        {
          "version": "ESV",
          "text": "Then the servants drew near, they and their children, and bowed down."
        },
        {
          "version": "NKJV",
          "text": "Then the maidservants came near, they and their children, and bowed down."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:22-23",
          "text": "During the night Jacob got up and took his two wives, his two maidservants, and his eleven sons, and crossed the ford of the Jabbok. / He took them and sent them across the stream, along with all his possessions."
        },
        {
          "reference": "Genesis 30:1-2",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?”"
        },
        {
          "reference": "Genesis 31:17-18",
          "text": "Then Jacob got up and put his children and his wives on camels, / and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Genesis 29:31-35",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren. / And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.” / Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon. ..."
        },
        {
          "reference": "Genesis 35:23-26",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. / The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. ..."
        },
        {
          "reference": "Genesis 46:8-27",
          "text": "Now these are the names of the sons of Israel (Jacob and his descendants) who went to Egypt: Reuben, Jacob’s firstborn. / The sons of Reuben: Hanoch, Pallu, Hezron, and Carmi. / The sons of Simeon: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul the son of a Canaanite woman. ..."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Deuteronomy 33:1-3",
          "text": "This is the blessing that Moses the man of God pronounced upon the Israelites before his death. / He said: “The LORD came from Sinai and dawned upon us from Seir; He shone forth from Mount Paran and came with myriads of holy ones, with flaming fire at His right hand. / Surely You love the people; all the holy ones are in Your hand, and they sit down at Your feet; each receives Your words—"
        },
        {
          "reference": "1 Chronicles 2:1-2",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, / Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."
        },
        {
          "reference": "Ruth 4:11",
          "text": "“We are witnesses,” said the elders and all the people at the gate. “May the LORD make the woman entering your home like Rachel and Leah, who together built up the house of Israel. May you be prosperous in Ephrathah and famous in Bethlehem."
        },
        {
          "reference": "Matthew 19:13-15",
          "text": "Then little children were brought to Jesus for Him to place His hands on them and pray for them. And the disciples rebuked those who brought them. / But Jesus said, “Let the little children come to Me, and do not hinder them! For the kingdom of heaven belongs to such as these.” / And after He had placed His hands on them, He went on from there."
        },
        {
          "reference": "Mark 10:13-16",
          "text": "Now people were bringing the little children to Jesus for Him to place His hands on them, and the disciples rebuked those who brought them. / But when Jesus saw this, He was indignant and told them, “Let the little children come to Me, and do not hinder them! For the kingdom of God belongs to such as these. / Truly I tell you, anyone who does not receive the kingdom of God like a little child will never enter it.” ..."
        },
        {
          "reference": "Luke 18:15-17",
          "text": "Now people were even bringing their babies to Jesus for Him to place His hands on them. And when the disciples saw this, they rebuked those who brought them. / But Jesus called the children to Him and said, “Let the little children come to Me, and do not hinder them! For the kingdom of God belongs to such as these. / Truly I tell you, anyone who does not receive the kingdom of God like a little child will never enter it.”"
        },
        {
          "reference": "John 4:12",
          "text": "Are You greater than our father Jacob, who gave us this well and drank from it himself, as did his sons and his livestock?”"
        },
        {
          "reference": "Acts 7:8-9",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs. / Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        }
      ]
    },
    {
      "reference": "Genesis 33:7",
      "book": "Genesis",
      "chapter": 33,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Next, Leah and her children came and bowed down. Last of all came Joseph and Rachel, and they too bowed down."
        },
        {
          "version": "NLT",
          "text": "Next came Leah with her children, and they bowed before him. Finally, Joseph and Rachel came forward and bowed before him."
        },
        {
          "version": "ESV",
          "text": "Leah likewise and her children drew near and bowed down. And last Joseph and Rachel drew near, and they bowed down."
        },
        {
          "version": "NKJV",
          "text": "And Leah also came near with her children, and they bowed down. Afterward Joseph and Rachel came near, and they bowed down."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:3-5",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom. / He instructed them, “You are to say to my master Esau, ‘Your servant Jacob says: I have been staying with Laban and have remained there until now. / I have oxen, donkeys, flocks, menservants, and maidservants. I have sent this message to inform my master, so that I may find favor in your sight.’”"
        },
        {
          "reference": "Genesis 32:11",
          "text": "Please deliver me from the hand of my brother Esau, for I am afraid that he may come and attack me and the mothers and children with me."
        },
        {
          "reference": "Genesis 32:13-20",
          "text": "Jacob spent the night there, and from what he had brought with him, he selected a gift for his brother Esau: / 200 female goats, 20 male goats, 200 ewes, 20 rams, / 30 milk camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys. ..."
        },
        {
          "reference": "Genesis 32:28",
          "text": "Then the man said, “Your name will no longer be Jacob, but Israel, because you have struggled with God and with men, and you have prevailed.”"
        },
        {
          "reference": "Genesis 33:3",
          "text": "But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother."
        },
        {
          "reference": "Genesis 33:10",
          "text": "But Jacob insisted, “No, please! If I have found favor in your sight, then receive this gift from my hand. For indeed, I have seen your face, and it is like seeing the face of God, since you have received me favorably."
        },
        {
          "reference": "Genesis 33:11",
          "text": "Please accept my gift that was brought to you, because God has been gracious to me and I have all I need.” So Jacob pressed him until he accepted."
        },
        {
          "reference": "Genesis 33:13-14",
          "text": "But Jacob replied, “My lord knows that the children are frail, and I must care for sheep and cattle that are nursing their young. If they are driven hard for even a day, all the animals will die. / Please let my lord go ahead of his servant. I will continue on slowly, at a comfortable pace for the livestock and children, until I come to my lord at Seir.”"
        },
        {
          "reference": "Genesis 33:18-20",
          "text": "After Jacob had come from Paddan-aram, he arrived safely at the city of Shechem in the land of Canaan, and he camped just outside the city. / And the plot of ground where he pitched his tent, he purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. / There he set up an altar and called it El-Elohe-Israel."
        },
        {
          "reference": "Genesis 34:1-2",
          "text": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the daughters of the land. / When Shechem son of Hamor the Hivite, the prince of the region, saw her, he took her and lay with her by force."
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Genesis 35:9-12",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him. / And God said to him, “Though your name is Jacob, you will no longer be called Jacob. Instead, your name will be Israel.” So God named him Israel. / And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. ..."
        },
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Exodus 18:7",
          "text": "So Moses went out to meet his father-in-law and bowed down and kissed him. They greeted each other and went into the tent."
        },
        {
          "reference": "1 Samuel 25:23-24",
          "text": "When Abigail saw David, she quickly got off the donkey, fell facedown, and bowed before him. / She fell at his feet and said, “My lord, may the blame be on me alone, but please let your servant speak to you; hear the words of your servant."
        }
      ]
    },
    {
      "reference": "Genesis 33:8",
      "book": "Genesis",
      "chapter": 33,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "Esau asked, “What’s the meaning of all these flocks and herds I met?” “To find favor in your eyes, my lord,” he said."
        },
        {
          "version": "NLT",
          "text": "“And what were all the flocks and herds I met as I came?” Esau asked. Jacob replied, “They are a gift, my lord, to ensure your friendship.”"
        },
        {
          "version": "ESV",
          "text": "Esau said, “What do you mean by all this company that I met?” Jacob answered, “To find favor in the sight of my lord.”"
        },
        {
          "version": "NKJV",
          "text": "Then Esau said, “What do you mean by all this company which I met?” And he said, “ These are to find favor in the sight of my lord.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:13-21",
          "text": "Jacob spent the night there, and from what he had brought with him, he selected a gift for his brother Esau: / 200 female goats, 20 male goats, 200 ewes, 20 rams, / 30 milk camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys. ..."
        },
        {
          "reference": "Genesis 18:3-5",
          "text": "“My lord,” said Abraham, “if I have found favor in your sight, please do not pass your servant by. / Let a little water be brought, that you may wash your feet and rest yourselves under the tree. / And I will bring a bit of bread so that you may refresh yourselves. This is why you have passed your servant’s way. After that, you may continue on your way.” “Yes,” they replied, “you may do as you have said.”"
        },
        {
          "reference": "Genesis 43:11",
          "text": "Then their father Israel said to them, “If it must be so, then do this: Put some of the best products of the land in your packs and carry them down as a gift for the man—a little balm and a little honey, spices and myrrh, pistachios and almonds."
        },
        {
          "reference": "Genesis 23:11",
          "text": "“No, my lord. Listen to me. I give you the field, and I give you the cave that is in it. I give it to you in the presence of my people. Bury your dead.”"
        },
        {
          "reference": "Genesis 42:6",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground."
        },
        {
          "reference": "Genesis 45:22-23",
          "text": "He gave new garments to each of them, but to Benjamin he gave three hundred shekels of silver and five sets of clothes. / And he sent to his father the following: ten donkeys loaded with the best of Egypt, and ten female donkeys loaded with grain and bread and provisions for his father’s journey."
        },
        {
          "reference": "1 Samuel 25:27",
          "text": "Now let this gift your servant has brought to my lord be given to the young men who follow you."
        },
        {
          "reference": "2 Samuel 16:1-2",
          "text": "When David had gone a little beyond the summit, Ziba the servant of Mephibosheth was there to meet him. He had a pair of saddled donkeys loaded with two hundred loaves of bread, a hundred clusters of raisins, a hundred summer fruits, and a skin of wine. / “Why do you have these?” asked the king. Ziba replied, “The donkeys are for the king’s household to ride, the bread and summer fruit are for the young men to eat, and the wine is to refresh those who become exhausted in the wilderness.”"
        },
        {
          "reference": "2 Kings 5:15-16",
          "text": "Then Naaman and all his attendants went back to the man of God, stood before him, and declared, “Now I know for sure that there is no God in all the earth except in Israel. So please accept a gift from your servant.” / But Elisha replied, “As surely as the LORD lives, before whom I stand, I will not accept it.” And although Naaman urged him to accept it, he refused."
        },
        {
          "reference": "Proverbs 18:16",
          "text": "A man’s gift opens doors for him, and brings him before great men."
        },
        {
          "reference": "Proverbs 21:14",
          "text": "A gift in secret soothes anger, and a covert bribe pacifies great wrath."
        },
        {
          "reference": "Matthew 5:23-24",
          "text": "So if you are offering your gift at the altar and there remember that your brother has something against you, / leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        },
        {
          "reference": "Matthew 18:15",
          "text": "If your brother sins against you, go and confront him privately. If he listens to you, you have won your brother over."
        },
        {
          "reference": "Luke 14:12-14",
          "text": "Then Jesus said to the man who had invited Him, “When you host a dinner or a banquet, do not invite your friends or brothers or relatives or rich neighbors. Otherwise, they may invite you in return, and you will be repaid. / But when you host a banquet, invite the poor, the crippled, the lame, and the blind, / and you will be blessed. Since they cannot repay you, you will be repaid at the resurrection of the righteous.”"
        },
        {
          "reference": "Luke 19:8",
          "text": "But Zacchaeus stood up and said to the Lord, “Look, Lord, half of my possessions I give to the poor, and if I have cheated anyone, I will repay it fourfold.”"
        }
      ]
    },
    {
      "reference": "Genesis 33:9",
      "book": "Genesis",
      "chapter": 33,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "But Esau said, “I already have plenty, my brother. Keep what you have for yourself.”"
        },
        {
          "version": "NLT",
          "text": "“My brother, I have plenty,” Esau answered. “Keep what you have for yourself.”"
        },
        {
          "version": "ESV",
          "text": "But Esau said, “I have enough, my brother; keep what you have for yourself.”"
        },
        {
          "version": "NKJV",
          "text": "But Esau said, “I have enough, my brother; keep what you have for yourself.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Philippians 4:11-12",
          "text": "I am not saying this out of need, for I have learned to be content regardless of my circumstances. / I know how to live humbly, and I know how to abound. In any and every situation I have learned the secret of being filled and being hungry, of having plenty and having need."
        },
        {
          "reference": "1 Timothy 6:6-8",
          "text": "Of course, godliness with contentment is great gain. / For we brought nothing into the world, so we cannot carry anything out of it. / But if we have food and clothing, we will be content with these."
        },
        {
          "reference": "Hebrews 13:5",
          "text": "Keep your lives free from the love of money and be content with what you have, for God has said: “Never will I leave you, never will I forsake you.”"
        },
        {
          "reference": "Luke 3:14",
          "text": "Then some soldiers asked him, “And what should we do?” “Do not take money by force or false accusation,” he said. “Be content with your wages.”"
        },
        {
          "reference": "2 Corinthians 9:8",
          "text": "And God is able to make all grace abound to you, so that in all things, at all times, having all that you need, you will abound in every good work."
        },
        {
          "reference": "Proverbs 30:8-9",
          "text": "Keep falsehood and deceitful words far from me. Give me neither poverty nor riches; feed me with the bread that is my portion. / Otherwise, I may have too much and deny You, saying, ‘Who is the LORD?’ Or I may become poor and steal, profaning the name of my God."
        },
        {
          "reference": "Ecclesiastes 5:10",
          "text": "He who loves money is never satisfied by money, and he who loves wealth is never satisfied by income. This too is futile."
        },
        {
          "reference": "Matthew 6:31-33",
          "text": "Therefore do not worry, saying, ‘What shall we eat?’ or ‘What shall we drink?’ or ‘What shall we wear?’ / For the Gentiles strive after all these things, and your heavenly Father knows that you need them. / But seek first the kingdom of God and His righteousness, and all these things will be added unto you."
        },
        {
          "reference": "1 John 3:17",
          "text": "If anyone with earthly possessions sees his brother in need, but withholds his compassion from him, how can the love of God abide in him?"
        },
        {
          "reference": "James 2:15-16",
          "text": "Suppose a brother or sister is without clothes and daily food. / If one of you tells him, “Go in peace; stay warm and well fed,” but does not provide for his physical needs, what good is that?"
        },
        {
          "reference": "2 Corinthians 8:9",
          "text": "For you know the grace of our Lord Jesus Christ, that though He was rich, yet for your sake He became poor, so that you through His poverty might become rich."
        },
        {
          "reference": "Acts 20:33-35",
          "text": "I have not coveted anyone’s silver or gold or clothing. / You yourselves know that these hands of mine have ministered to my own needs and those of my companions. / In everything, I showed you that by this kind of hard work we must help the weak, remembering the words of the Lord Jesus Himself: ‘It is more blessed to give than to receive.’”"
        },
        {
          "reference": "1 Thessalonians 4:11-12",
          "text": "and to aspire to live quietly, to attend to your own matters, and to work with your own hands, as we instructed you. / Then you will behave properly toward outsiders, without being dependent on anyone."
        },
        {
          "reference": "Psalm 23:1",
          "text": "A Psalm of David. The LORD is my shepherd; I shall not want."
        },
        {
          "reference": "Psalm 37:16",
          "text": "Better is the little of the righteous than the abundance of many who are wicked."
        }
      ]
    },
    {
      "reference": "Genesis 33:10",
      "book": "Genesis",
      "chapter": 33,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "“No, please!” said Jacob. “If I have found favor in your eyes, accept this gift from me. For to see your face is like seeing the face of God, now that you have received me favorably."
        },
        {
          "version": "NLT",
          "text": "But Jacob insisted, “No, if I have found favor with you, please accept this gift from me. And what a relief to see your friendly smile. It is like seeing the face of God!"
        },
        {
          "version": "ESV",
          "text": "Jacob said, “No, please, if I have found favor in your sight, then accept my present from my hand. For I have seen your face, which is like seeing the face of God, and you have accepted me."
        },
        {
          "version": "NKJV",
          "text": "And Jacob said, “No, please, if I have now found favor in your sight, then receive my present from my hand, inasmuch as I have seen your face as though I had seen the face of God, and you were pleased with me."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:20",
          "text": "You are also to say, ‘Look, your servant Jacob is right behind us.’” For he thought, “I will appease Esau with the gift that is going before me. After that I can face him, and perhaps he will accept me.”"
        },
        {
          "reference": "Genesis 32:30",
          "text": "So Jacob named the place Peniel, saying, “Indeed, I have seen God face to face, and yet my life was spared.”"
        },
        {
          "reference": "1 Samuel 25:23-24",
          "text": "When Abigail saw David, she quickly got off the donkey, fell facedown, and bowed before him. / She fell at his feet and said, “My lord, may the blame be on me alone, but please let your servant speak to you; hear the words of your servant."
        },
        {
          "reference": "1 Samuel 25:32-35",
          "text": "Then David said to Abigail, “Blessed be the LORD, the God of Israel, who sent you to meet me this day! / Blessed is your discernment, and blessed are you, because today you kept me from bloodshed and from avenging myself by my own hand. / Otherwise, as surely as the LORD, the God of Israel, lives, who has restrained me from harming you, if you had not come quickly to meet me, then surely no male belonging to Nabal would have been left alive by morning light.” ..."
        },
        {
          "reference": "2 Samuel 14:17",
          "text": "And now your servant says, ‘May the word of my lord the king bring me rest, for my lord the king is able to discern good and evil, just like the angel of God. May the LORD your God be with you.’”"
        },
        {
          "reference": "2 Samuel 19:27-30",
          "text": "and he has slandered your servant to my lord the king. Yet my lord the king is like the angel of God, so do what is good in your eyes. / For all the house of my grandfather deserves death from my lord the king, yet you have set your servant among those who eat at your table. What further right, then, do I have to keep appealing to the king?” / The king replied, “Why say any more? I hereby declare that you and Ziba are to divide the land.” ..."
        },
        {
          "reference": "Proverbs 16:7",
          "text": "When a man’s ways please the LORD, He makes even the man’s enemies live at peace with him."
        },
        {
          "reference": "Proverbs 21:1",
          "text": "The king’s heart is a waterway in the hand of the LORD; He directs it where He pleases."
        },
        {
          "reference": "Proverbs 25:21-22",
          "text": "If your enemy is hungry, give him food to eat, and if he is thirsty, give him water to drink. / For in so doing, you will heap burning coals on his head, and the LORD will reward you."
        },
        {
          "reference": "Matthew 5:9",
          "text": "Blessed are the peacemakers, for they will be called sons of God."
        },
        {
          "reference": "Matthew 5:23-24",
          "text": "So if you are offering your gift at the altar and there remember that your brother has something against you, / leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        },
        {
          "reference": "Matthew 18:15",
          "text": "If your brother sins against you, go and confront him privately. If he listens to you, you have won your brother over."
        },
        {
          "reference": "Luke 6:27-28",
          "text": "But to those of you who will listen, I say: Love your enemies, do good to those who hate you, / bless those who curse you, pray for those who mistreat you."
        },
        {
          "reference": "Luke 17:3-4",
          "text": "Watch yourselves. If your brother sins, rebuke him; and if he repents, forgive him. / Even if he sins against you seven times in a day, and seven times returns to say, ‘I repent,’ you must forgive him.”"
        },
        {
          "reference": "Luke 19:8",
          "text": "But Zacchaeus stood up and said to the Lord, “Look, Lord, half of my possessions I give to the poor, and if I have cheated anyone, I will repay it fourfold.”"
        }
      ]
    },
    {
      "reference": "Genesis 33:11",
      "book": "Genesis",
      "chapter": 33,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Please accept the present that was brought to you, for God has been gracious to me and I have all I need.” And because Jacob insisted, Esau accepted it."
        },
        {
          "version": "NLT",
          "text": "Please take this gift I have brought you, for God has been very gracious to me. I have more than enough.” And because Jacob insisted, Esau finally accepted the gift."
        },
        {
          "version": "ESV",
          "text": "Please accept my blessing that is brought to you, because God has dealt graciously with me, and because I have enough.” Thus he urged him, and he took it."
        },
        {
          "version": "NKJV",
          "text": "Please, take my blessing that is brought to you, because God has dealt graciously with me, and because I have enough.” So he urged him, and he took it."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:20",
          "text": "You are also to say, ‘Look, your servant Jacob is right behind us.’” For he thought, “I will appease Esau with the gift that is going before me. After that I can face him, and perhaps he will accept me.”"
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 32:13-15",
          "text": "Jacob spent the night there, and from what he had brought with him, he selected a gift for his brother Esau: / 200 female goats, 20 male goats, 200 ewes, 20 rams, / 30 milk camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys."
        },
        {
          "reference": "Genesis 45:7-11",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt. / Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. ..."
        },
        {
          "reference": "Genesis 50:17-21",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? ..."
        },
        {
          "reference": "1 Samuel 25:27-35",
          "text": "Now let this gift your servant has brought to my lord be given to the young men who follow you. / Please forgive your servant’s offense, for the LORD will surely make a lasting dynasty for my lord, because he fights the LORD’s battles. May no evil be found in you as long as you live. / And should someone pursue you and seek your life, then the life of my lord will be bound securely by the LORD your God in the bundle of the living. But He shall fling away the lives of your enemies like stones from a sling. ..."
        },
        {
          "reference": "Proverbs 18:16",
          "text": "A man’s gift opens doors for him, and brings him before great men."
        },
        {
          "reference": "Proverbs 21:14",
          "text": "A gift in secret soothes anger, and a covert bribe pacifies great wrath."
        },
        {
          "reference": "2 Kings 5:15-16",
          "text": "Then Naaman and all his attendants went back to the man of God, stood before him, and declared, “Now I know for sure that there is no God in all the earth except in Israel. So please accept a gift from your servant.” / But Elisha replied, “As surely as the LORD lives, before whom I stand, I will not accept it.” And although Naaman urged him to accept it, he refused."
        },
        {
          "reference": "2 Corinthians 9:7",
          "text": "Each one should give what he has decided in his heart to give, not out of regret or compulsion. For God loves a cheerful giver."
        },
        {
          "reference": "Matthew 5:23-24",
          "text": "So if you are offering your gift at the altar and there remember that your brother has something against you, / leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        },
        {
          "reference": "Matthew 6:14-15",
          "text": "For if you forgive men their trespasses, your heavenly Father will also forgive you. / But if you do not forgive men their trespasses, neither will your Father forgive yours."
        },
        {
          "reference": "Luke 6:38",
          "text": "Give, and it will be given to you. A good measure, pressed down, shaken together, and running over will be poured into your lap. For with the measure you use, it will be measured back to you.”"
        },
        {
          "reference": "Luke 19:8-9",
          "text": "But Zacchaeus stood up and said to the Lord, “Look, Lord, half of my possessions I give to the poor, and if I have cheated anyone, I will repay it fourfold.” / Jesus said to him, “Today salvation has come to this house, because this man too is a son of Abraham."
        },
        {
          "reference": "Acts 20:35",
          "text": "In everything, I showed you that by this kind of hard work we must help the weak, remembering the words of the Lord Jesus Himself: ‘It is more blessed to give than to receive.’”"
        }
      ]
    },
    {
      "reference": "Genesis 33:12",
      "book": "Genesis",
      "chapter": 33,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Esau said, “Let us be on our way; I’ll accompany you.”"
        },
        {
          "version": "NLT",
          "text": "“Well,” Esau said, “let’s be going. I will lead the way.”"
        },
        {
          "version": "ESV",
          "text": "Then Esau said, “Let us journey on our way, and I will go ahead of you.”"
        },
        {
          "version": "NKJV",
          "text": "Then Esau said, “Let us take our journey; let us go, and I will go before you.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:3-5",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom. / He instructed them, “You are to say to my master Esau, ‘Your servant Jacob says: I have been staying with Laban and have remained there until now. / I have oxen, donkeys, flocks, menservants, and maidservants. I have sent this message to inform my master, so that I may find favor in your sight.’”"
        },
        {
          "reference": "Genesis 31:3",
          "text": "Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 27:41-45",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.” / When the words of her older son Esau were relayed to Rebekah, she sent for her younger son Jacob and told him, “Look, your brother Esau is consoling himself by plotting to kill you. / So now, my son, obey my voice and flee at once to my brother Laban in Haran. ..."
        },
        {
          "reference": "Genesis 32:6-8",
          "text": "When the messengers returned to Jacob, they said, “We went to your brother Esau, and now he is coming to meet you—he and four hundred men with him.” / In great fear and distress, Jacob divided his people into two camps, as well as the flocks and herds and camels. / He thought, “If Esau comes and attacks one camp, then the other camp can escape.”"
        },
        {
          "reference": "Genesis 32:11",
          "text": "Please deliver me from the hand of my brother Esau, for I am afraid that he may come and attack me and the mothers and children with me."
        },
        {
          "reference": "Genesis 32:28",
          "text": "Then the man said, “Your name will no longer be Jacob, but Israel, because you have struggled with God and with men, and you have prevailed.”"
        },
        {
          "reference": "Genesis 33:4",
          "text": "Esau, however, ran to him and embraced him, threw his arms around his neck, and kissed him. And they both wept."
        },
        {
          "reference": "Genesis 33:10",
          "text": "But Jacob insisted, “No, please! If I have found favor in your sight, then receive this gift from my hand. For indeed, I have seen your face, and it is like seeing the face of God, since you have received me favorably."
        },
        {
          "reference": "Genesis 33:14",
          "text": "Please let my lord go ahead of his servant. I will continue on slowly, at a comfortable pace for the livestock and children, until I come to my lord at Seir.”"
        },
        {
          "reference": "Genesis 34:1-2",
          "text": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the daughters of the land. / When Shechem son of Hamor the Hivite, the prince of the region, saw her, he took her and lay with her by force."
        },
        {
          "reference": "Exodus 23:20",
          "text": "Behold, I am sending an angel before you to protect you along the way and to bring you to the place I have prepared."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-8",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession. / You are to pay them in silver for the food you eat and the water you drink.’” ..."
        },
        {
          "reference": "1 Samuel 25:32-35",
          "text": "Then David said to Abigail, “Blessed be the LORD, the God of Israel, who sent you to meet me this day! / Blessed is your discernment, and blessed are you, because today you kept me from bloodshed and from avenging myself by my own hand. / Otherwise, as surely as the LORD, the God of Israel, lives, who has restrained me from harming you, if you had not come quickly to meet me, then surely no male belonging to Nabal would have been left alive by morning light.” ..."
        }
      ]
    },
    {
      "reference": "Genesis 33:13",
      "book": "Genesis",
      "chapter": 33,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "But Jacob said to him, “My lord knows that the children are tender and that I must care for the ewes and cows that are nursing their young. If they are driven hard just one day, all the animals will die."
        },
        {
          "version": "NLT",
          "text": "But Jacob replied, “You can see, my lord, that some of the children are very young, and the flocks and herds have their young, too. If they are driven too hard, even for one day, all the animals could die."
        },
        {
          "version": "ESV",
          "text": "But Jacob said to him, “My lord knows that the children are frail, and that the nursing flocks and herds are a care to me. If they are driven hard for one day, all the flocks will die."
        },
        {
          "version": "NKJV",
          "text": "But Jacob said to him, “My lord knows that the children are weak, and the flocks and herds which are nursing are with me. And if the men should drive them hard one day, all the flock will die."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:13-20",
          "text": "Jacob spent the night there, and from what he had brought with him, he selected a gift for his brother Esau: / 200 female goats, 20 male goats, 200 ewes, 20 rams, / 30 milk camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys. ..."
        },
        {
          "reference": "Genesis 30:43",
          "text": "Thus Jacob became exceedingly prosperous. He owned large flocks, maidservants and menservants, and camels and donkeys."
        },
        {
          "reference": "Genesis 31:38-40",
          "text": "I have been with you for twenty years now. Your sheep and goats have not miscarried, nor have I eaten the rams of your flock. / I did not bring you anything torn by wild beasts; I bore the loss myself. And you demanded payment from me for what was stolen by day or night. / As it was, the heat consumed me by day and the frost by night, and sleep fled from my eyes."
        },
        {
          "reference": "Genesis 34:1-2",
          "text": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the daughters of the land. / When Shechem son of Hamor the Hivite, the prince of the region, saw her, he took her and lay with her by force."
        },
        {
          "reference": "Genesis 46:34",
          "text": "you are to say, ‘Your servants have raised livestock ever since our youth—both we and our fathers.’ Then you will be allowed to settle in the land of Goshen, since all shepherds are detestable to the Egyptians.”"
        },
        {
          "reference": "Exodus 12:38",
          "text": "And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Exodus 23:29",
          "text": "I will not drive them out before you in a single year; otherwise the land would become desolate and wild animals would multiply against you."
        },
        {
          "reference": "Numbers 32:24",
          "text": "Build cities for your little ones and folds for your flocks, but do what you have promised.”"
        },
        {
          "reference": "Deuteronomy 7:22",
          "text": "The LORD your God will drive out these nations before you little by little. You will not be enabled to eliminate them all at once, or the wild animals would multiply around you."
        },
        {
          "reference": "1 Samuel 16:11",
          "text": "And Samuel asked him, “Are these all the sons you have?” “There is still the youngest,” Jesse replied, “but he is tending the sheep.” “Send for him,” Samuel replied. “For we will not sit down to eat until he arrives.”"
        },
        {
          "reference": "2 Samuel 12:3",
          "text": "but the poor man had nothing except one small ewe lamb that he had bought. He raised it, and it grew up with him and his children. It shared his food and drank from his cup; it slept in his arms and was like a daughter to him."
        },
        {
          "reference": "Psalm 78:70-72",
          "text": "He chose David His servant and took him from the sheepfolds; / from tending the ewes He brought him to be shepherd of His people Jacob, of Israel His inheritance. / So David shepherded them with integrity of heart and guided them with skillful hands."
        },
        {
          "reference": "Isaiah 40:11",
          "text": "He tends His flock like a shepherd; He gathers the lambs in His arms and carries them close to His heart. He gently leads the nursing ewes."
        },
        {
          "reference": "Ezekiel 34:12-16",
          "text": "As a shepherd looks for his scattered sheep when he is among the flock, so I will look for My flock. I will rescue them from all the places to which they were scattered on a day of clouds and darkness. / I will bring them out from the peoples, gather them from the countries, and bring them into their own land. I will feed them on the mountains of Israel, in the ravines, and in all the settlements of the land. / I will feed them in good pasture, and the lofty mountains of Israel will be their grazing land. There they will lie down in a good grazing land; they will feed in rich pasture on the mountains of Israel. ..."
        },
        {
          "reference": "John 10:11-14",
          "text": "I am the good shepherd. The good shepherd lays down His life for the sheep. / The hired hand is not the shepherd, and the sheep are not his own. When he sees the wolf coming, he abandons the sheep and runs away. Then the wolf pounces on them and scatters the flock. / The man runs away because he is a hired servant and is unconcerned for the sheep. ..."
        }
      ]
    },
    {
      "reference": "Genesis 33:14",
      "book": "Genesis",
      "chapter": 33,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "So let my lord go on ahead of his servant, while I move along slowly at the pace of the flocks and herds before me and the pace of the children, until I come to my lord in Seir.”"
        },
        {
          "version": "NLT",
          "text": "Please, my lord, go ahead of your servant. We will follow slowly, at a pace that is comfortable for the livestock and the children. I will meet you at Seir.”"
        },
        {
          "version": "ESV",
          "text": "Let my lord pass on ahead of his servant, and I will lead on slowly, at the pace of the livestock that are ahead of me and at the pace of the children, until I come to my lord in Seir.”"
        },
        {
          "version": "NKJV",
          "text": "Please let my lord go on ahead before his servant. I will lead on slowly at a pace which the livestock that go before me, and the children, are able to endure, until I come to my lord in Seir.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:4-5",
          "text": "He instructed them, “You are to say to my master Esau, ‘Your servant Jacob says: I have been staying with Laban and have remained there until now. / I have oxen, donkeys, flocks, menservants, and maidservants. I have sent this message to inform my master, so that I may find favor in your sight.’”"
        },
        {
          "reference": "Genesis 31:3",
          "text": "Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 32:13-16",
          "text": "Jacob spent the night there, and from what he had brought with him, he selected a gift for his brother Esau: / 200 female goats, 20 male goats, 200 ewes, 20 rams, / 30 milk camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys. ..."
        },
        {
          "reference": "Genesis 32:17-20",
          "text": "He instructed the one in the lead, “When my brother Esau meets you and asks, ‘To whom do you belong, where are you going, and whose animals are these before you?’ / then you are to say, ‘They belong to your servant Jacob. They are a gift, sent to my lord Esau. And behold, Jacob is behind us.’” / He also instructed the second, the third, and all those following behind the herds: “When you meet Esau, you are to say the same thing to him. ..."
        },
        {
          "reference": "Genesis 32:9-12",
          "text": "Then Jacob declared, “O God of my father Abraham, God of my father Isaac, the LORD who told me, ‘Go back to your country and to your kindred, and I will make you prosper,’ / I am unworthy of all the kindness and faithfulness You have shown Your servant. Indeed, with only my staff I came across the Jordan, but now I have become two camps. / Please deliver me from the hand of my brother Esau, for I am afraid that he may come and attack me and the mothers and children with me. ..."
        },
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 31:55",
          "text": "Early the next morning, Laban got up and kissed his grandchildren and daughters and blessed them. Then he left to return home."
        },
        {
          "reference": "Genesis 33:3",
          "text": "But Jacob himself went on ahead and bowed to the ground seven times as he approached his brother."
        },
        {
          "reference": "Genesis 33:9-11",
          "text": "“I already have plenty, my brother,” Esau replied. “Keep what belongs to you.” / But Jacob insisted, “No, please! If I have found favor in your sight, then receive this gift from my hand. For indeed, I have seen your face, and it is like seeing the face of God, since you have received me favorably. / Please accept my gift that was brought to you, because God has been gracious to me and I have all I need.” So Jacob pressed him until he accepted."
        },
        {
          "reference": "Genesis 34:1-2",
          "text": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the daughters of the land. / When Shechem son of Hamor the Hivite, the prince of the region, saw her, he took her and lay with her by force."
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Exodus 13:21-22",
          "text": "And the LORD went before them in a pillar of cloud to guide their way by day, and in a pillar of fire to give them light by night, so that they could travel by day or night. / Neither the pillar of cloud by day nor the pillar of fire by night left its place before the people."
        },
        {
          "reference": "Exodus 33:14",
          "text": "And the LORD answered, “My Presence will go with you, and I will give you rest.”"
        },
        {
          "reference": "Numbers 10:29-32",
          "text": "Then Moses said to Hobab, the son of Moses’ father-in-law Reuel the Midianite, “We are setting out for the place of which the LORD said: ‘I will give it to you.’ Come with us, and we will treat you well, for the LORD has promised good things to Israel.” / “I will not go,” Hobab replied. “Instead, I am going back to my own land and my own people.” / “Please do not leave us,” Moses said, “since you know where we should camp in the wilderness, and you can serve as our eyes. ..."
        }
      ]
    },
    {
      "reference": "Genesis 33:15",
      "book": "Genesis",
      "chapter": 33,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "Esau said, “Then let me leave some of my men with you.” &#8220But why do that?” Jacob asked. “Just let me find favor in the eyes of my lord.”"
        },
        {
          "version": "NLT",
          "text": "“All right,” Esau said, “but at least let me assign some of my men to guide and protect you.” Jacob responded, “That’s not necessary. It’s enough that you’ve received me warmly, my lord!”"
        },
        {
          "version": "ESV",
          "text": "So Esau said, “Let me leave with you some of the people who are with me.” But he said, “What need is there? Let me find favor in the sight of my lord.”"
        },
        {
          "version": "NKJV",
          "text": "And Esau said, “Now let me leave with you some of the people who are with me.” But he said, “What need is there? Let me find favor in the sight of my lord.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:3-5",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom. / He instructed them, “You are to say to my master Esau, ‘Your servant Jacob says: I have been staying with Laban and have remained there until now. / I have oxen, donkeys, flocks, menservants, and maidservants. I have sent this message to inform my master, so that I may find favor in your sight.’”"
        },
        {
          "reference": "Genesis 32:13-16",
          "text": "Jacob spent the night there, and from what he had brought with him, he selected a gift for his brother Esau: / 200 female goats, 20 male goats, 200 ewes, 20 rams, / 30 milk camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys. ..."
        },
        {
          "reference": "Genesis 32:20-21",
          "text": "You are also to say, ‘Look, your servant Jacob is right behind us.’” For he thought, “I will appease Esau with the gift that is going before me. After that I can face him, and perhaps he will accept me.” / So Jacob’s gifts went on before him, while he spent the night in the camp."
        },
        {
          "reference": "Genesis 34:1-5",
          "text": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the daughters of the land. / When Shechem son of Hamor the Hivite, the prince of the region, saw her, he took her and lay with her by force. / And his soul was drawn to Dinah, the daughter of Jacob. He loved the young girl and spoke to her tenderly. ..."
        },
        {
          "reference": "Genesis 35:1-5",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.” / So Jacob told his household and all who were with him, “Get rid of the foreign gods that are among you. Purify yourselves and change your garments. / Then let us arise and go to Bethel. I will build an altar there to God, who answered me in my day of distress. He has been with me wherever I have gone.” ..."
        },
        {
          "reference": "Exodus 18:7-9",
          "text": "So Moses went out to meet his father-in-law and bowed down and kissed him. They greeted each other and went into the tent. / Then Moses recounted to his father-in-law all that the LORD had done to Pharaoh and the Egyptians for Israel’s sake, all the hardships they had encountered along the way, and how the LORD had delivered them. / And Jethro rejoiced over all the good things the LORD had done for Israel, whom He had rescued from the hand of the Egyptians."
        },
        {
          "reference": "Numbers 10:29-32",
          "text": "Then Moses said to Hobab, the son of Moses’ father-in-law Reuel the Midianite, “We are setting out for the place of which the LORD said: ‘I will give it to you.’ Come with us, and we will treat you well, for the LORD has promised good things to Israel.” / “I will not go,” Hobab replied. “Instead, I am going back to my own land and my own people.” / “Please do not leave us,” Moses said, “since you know where we should camp in the wilderness, and you can serve as our eyes. ..."
        },
        {
          "reference": "1 Samuel 25:14-19",
          "text": "Meanwhile, one of Nabal’s young men informed Nabal’s wife Abigail, “Look, David sent messengers from the wilderness to greet our master, but he screamed at them. / Yet these men were very good to us. When we were in the field, we were not harassed, and nothing of ours went missing the whole time we lived among them. / They were a wall around us, both day and night, the whole time we were herding our sheep near them. ..."
        },
        {
          "reference": "2 Samuel 19:31-39",
          "text": "Now Barzillai the Gileadite had come down from Rogelim to cross the Jordan with the king and send him on his way from there. / Barzillai was quite old, eighty years of age, and since he was a very wealthy man, he had provided for the king while he stayed in Mahanaim. / The king said to Barzillai, “Cross over with me, and I will provide for you at my side in Jerusalem.” ..."
        },
        {
          "reference": "Proverbs 25:21-22",
          "text": "If your enemy is hungry, give him food to eat, and if he is thirsty, give him water to drink. / For in so doing, you will heap burning coals on his head, and the LORD will reward you."
        },
        {
          "reference": "Matthew 5:9",
          "text": "Blessed are the peacemakers, for they will be called sons of God."
        },
        {
          "reference": "Matthew 5:23-24",
          "text": "So if you are offering your gift at the altar and there remember that your brother has something against you, / leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        },
        {
          "reference": "Luke 6:27-28",
          "text": "But to those of you who will listen, I say: Love your enemies, do good to those who hate you, / bless those who curse you, pray for those who mistreat you."
        },
        {
          "reference": "Luke 10:5-6",
          "text": "Whatever house you enter, begin by saying, ‘Peace to this house.’ / If a man of peace is there, your peace will rest on him; if not, it will return to you."
        }
      ]
    },
    {
      "reference": "Genesis 33:16",
      "book": "Genesis",
      "chapter": 33,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "So that day Esau started on his way back to Seir."
        },
        {
          "version": "NLT",
          "text": "So Esau turned around and started back to Seir that same day."
        },
        {
          "version": "ESV",
          "text": "So Esau returned that day on his way to Seir."
        },
        {
          "version": "NKJV",
          "text": "So Esau returned that day on his way to Seir."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 32:3-5",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom. / He instructed them, “You are to say to my master Esau, ‘Your servant Jacob says: I have been staying with Laban and have remained there until now. / I have oxen, donkeys, flocks, menservants, and maidservants. I have sent this message to inform my master, so that I may find favor in your sight.’”"
        },
        {
          "reference": "Genesis 31:55",
          "text": "Early the next morning, Laban got up and kissed his grandchildren and daughters and blessed them. Then he left to return home."
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 27:41-45",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.” / When the words of her older son Esau were relayed to Rebekah, she sent for her younger son Jacob and told him, “Look, your brother Esau is consoling himself by plotting to kill you. / So now, my son, obey my voice and flee at once to my brother Laban in Haran. ..."
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 32:6-7",
          "text": "When the messengers returned to Jacob, they said, “We went to your brother Esau, and now he is coming to meet you—he and four hundred men with him.” / In great fear and distress, Jacob divided his people into two camps, as well as the flocks and herds and camels."
        },
        {
          "reference": "Genesis 32:13-21",
          "text": "Jacob spent the night there, and from what he had brought with him, he selected a gift for his brother Esau: / 200 female goats, 20 male goats, 200 ewes, 20 rams, / 30 milk camels with their young, 40 cows, 10 bulls, 20 female donkeys, and 10 male donkeys. ..."
        },
        {
          "reference": "Genesis 34:1-2",
          "text": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the daughters of the land. / When Shechem son of Hamor the Hivite, the prince of the region, saw her, he took her and lay with her by force."
        },
        {
          "reference": "Genesis 36:6-8",
          "text": "Later, Esau took his wives and sons and daughters and all the people of his household, along with his livestock, all his other animals, and all the property he had acquired in Canaan, and he moved to a land far away from his brother Jacob. / For their possessions were too great for them to dwell together; the land where they stayed could not support them because of their livestock. / So Esau (that is, Edom) settled in the area of Mount Seir."
        },
        {
          "reference": "Exodus 18:27",
          "text": "Then Moses sent his father-in-law on his way, and Jethro returned to his own land."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Obadiah 1:10-12",
          "text": "Because of the violence against your brother Jacob, you will be covered with shame and cut off forever. / On the day you stood aloof while strangers carried off his wealth and foreigners entered his gate and cast lots for Jerusalem, you were just like one of them. / But you should not gloat in that day, your brother’s day of misfortune, nor rejoice over the people of Judah in the day of their destruction, nor boast proudly in the day of their distress."
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        }
      ]
    },
    {
      "reference": "Genesis 33:17",
      "book": "Genesis",
      "chapter": 33,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob, however, went to Sukkoth, where he built a place for himself and made shelters for his livestock. That is why the place is called Sukkoth."
        },
        {
          "version": "NLT",
          "text": "Jacob, on the other hand, traveled on to Succoth. There he built himself a house and made shelters for his livestock. That is why the place was named Succoth (which means “shelters”)."
        },
        {
          "version": "ESV",
          "text": "But Jacob journeyed to Succoth, and built himself a house and made booths for his livestock. Therefore the name of the place is called Succoth."
        },
        {
          "version": "NKJV",
          "text": "And Jacob journeyed to Succoth, built himself a house, and made booths for his livestock. Therefore the name of the place is called Succoth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 13:27",
          "text": "and in the valley, Beth-haram, Beth-nimrah, Succoth, and Zaphon, with the rest of the kingdom of Sihon king of Heshbon (the territory on the east side of the Jordan up to the edge of the Sea of Chinnereth)."
        },
        {
          "reference": "Judges 8:5-6",
          "text": "So Gideon said to the men of Succoth, “Please give my troops some bread, for they are exhausted, and I am still pursuing Zebah and Zalmunna, the kings of Midian.” / But the leaders of Succoth asked, “Are the hands of Zebah and Zalmunna already in your possession, that we should give bread to your army?”"
        },
        {
          "reference": "Judges 8:8-9",
          "text": "From there he went up to Penuel and asked the same from them, but the men of Penuel gave the same response as the men of Succoth. / So Gideon told the men of Penuel, “When I return in triumph, I will tear down this tower!”"
        },
        {
          "reference": "1 Chronicles 5:9",
          "text": "They also settled in the east as far as the edge of the desert that extends to the Euphrates River, because their livestock had increased in the land of Gilead."
        },
        {
          "reference": "1 Chronicles 5:16",
          "text": "They lived in Gilead, in Bashan and its towns, and throughout the pasturelands of Sharon."
        },
        {
          "reference": "1 Samuel 13:6",
          "text": "Seeing that they were in danger because their troops were hard-pressed, the men of Israel hid in caves and thickets, among the rocks, and in cellars and cisterns."
        },
        {
          "reference": "2 Samuel 19:18",
          "text": "and crossed at the ford to carry over the king’s household and to do what was good in his sight. When Shimei son of Gera crossed the Jordan, he fell down before the king"
        },
        {
          "reference": "2 Samuel 19:31",
          "text": "Now Barzillai the Gileadite had come down from Rogelim to cross the Jordan with the king and send him on his way from there."
        },
        {
          "reference": "1 Kings 4:13",
          "text": "Ben-geber in Ramoth-gilead (the villages of Jair son of Manasseh in Gilead belonged to him, as well as the region of Argob in Bashan with its sixty great cities with walls and bronze bars);"
        },
        {
          "reference": "Psalm 60:6-8",
          "text": "God has spoken from His sanctuary: “I will triumph! I will parcel out Shechem and apportion the Valley of Succoth. / Gilead is Mine, and Manasseh is Mine; Ephraim is My helmet, Judah is My scepter. / Moab is My washbasin; upon Edom I toss My sandal; over Philistia I shout in triumph.”"
        },
        {
          "reference": "Psalm 108:7-9",
          "text": "God has spoken from His sanctuary: “I will triumph! I will parcel out Shechem and apportion the Valley of Succoth. / Gilead is Mine, and Manasseh is Mine; Ephraim is My helmet, Judah is My scepter. / Moab is My washbasin; upon Edom I toss My sandal; over Philistia I shout in triumph.”"
        },
        {
          "reference": "John 1:14",
          "text": "The Word became flesh and made His dwelling among us. We have seen His glory, the glory of the one and only Son from the Father, full of grace and truth."
        },
        {
          "reference": "Hebrews 11:9",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Hebrews 11:13",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth."
        },
        {
          "reference": "Hebrews 11:16",
          "text": "Instead, they were longing for a better country, a heavenly one. Therefore God is not ashamed to be called their God, for He has prepared a city for them."
        }
      ]
    },
    {
      "reference": "Genesis 33:18",
      "book": "Genesis",
      "chapter": 33,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "After Jacob came from Paddan Aram, he arrived safely at the city of Shechem in Canaan and camped within sight of the city."
        },
        {
          "version": "NLT",
          "text": "Later, having traveled all the way from Paddan-aram, Jacob arrived safely at the town of Shechem, in the land of Canaan. There he set up camp outside the town."
        },
        {
          "version": "ESV",
          "text": "And Jacob came safely to the city of Shechem, which is in the land of Canaan, on his way from Paddan-aram, and he camped before the city."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob came safely to the city of Shechem, which is in the land of Canaan, when he came from Padan Aram; and he pitched his tent before the city."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:19",
          "text": "and he called that place Bethel, though previously the city had been named Luz."
        },
        {
          "reference": "Genesis 12:6",
          "text": "Abram traveled through the land as far as the site of the Oak of Moreh at Shechem. And at that time the Canaanites were in the land."
        },
        {
          "reference": "Genesis 35:27",
          "text": "Jacob returned to his father Isaac at Mamre, near Kiriath-arba (that is, Hebron), where Abraham and Isaac had stayed."
        },
        {
          "reference": "Genesis 12:8",
          "text": "From there Abram moved on to the hill country east of Bethel and pitched his tent, with Bethel to the west and Ai to the east. There he built an altar to the LORD, and he called on the name of the LORD."
        },
        {
          "reference": "Genesis 13:18",
          "text": "So Abram moved his tent and went to live near the Oaks of Mamre at Hebron, where he built an altar to the LORD."
        },
        {
          "reference": "Genesis 23:19",
          "text": "After this, Abraham buried his wife Sarah in the cave of the field at Machpelah near Mamre (that is, Hebron) in the land of Canaan."
        },
        {
          "reference": "Genesis 28:10",
          "text": "Meanwhile Jacob left Beersheba and set out for Haran."
        },
        {
          "reference": "Genesis 31:13",
          "text": "I am the God of Bethel, where you anointed the pillar and made a solemn vow to Me. Now get up, leave this land at once, and return to your native land.’”"
        },
        {
          "reference": "Genesis 48:7",
          "text": "Now as for me, when I was returning from Paddan, to my sorrow Rachel died along the way in the land of Canaan, some distance from Ephrath. So I buried her there beside the road to Ephrath” (that is, Bethlehem)."
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "John 4:5",
          "text": "So He came to a town of Samaria called Sychar, near the plot of ground that Jacob had given to his son Joseph."
        },
        {
          "reference": "Acts 7:16",
          "text": "Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Hebrews 11:9",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Hebrews 11:13",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth."
        },
        {
          "reference": "Hebrews 11:16",
          "text": "Instead, they were longing for a better country, a heavenly one. Therefore God is not ashamed to be called their God, for He has prepared a city for them."
        }
      ]
    },
    {
      "reference": "Genesis 33:19",
      "book": "Genesis",
      "chapter": 33,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "For a hundred pieces of silver, he bought from the sons of Hamor, the father of Shechem, the plot of ground where he pitched his tent."
        },
        {
          "version": "NLT",
          "text": "Jacob bought the plot of land where he camped from the family of Hamor, the father of Shechem, for 100 pieces of silver."
        },
        {
          "version": "ESV",
          "text": "And from the sons of Hamor, Shechem’s father, he bought for a hundred pieces of money the piece of land on which he had pitched his tent."
        },
        {
          "version": "NKJV",
          "text": "And he bought the parcel of land, where he had pitched his tent, from the children of Hamor, Shechem’s father, for one hundred pieces of money."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "John 4:5",
          "text": "So He came to a town of Samaria called Sychar, near the plot of ground that Jacob had given to his son Joseph."
        },
        {
          "reference": "Acts 7:16",
          "text": "Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 12:6-7",
          "text": "Abram traveled through the land as far as the site of the Oak of Moreh at Shechem. And at that time the Canaanites were in the land. / Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 23:16-20",
          "text": "Abraham agreed to Ephron’s terms and weighed out for him the price he had named in the hearing of the Hittites: four hundred shekels of silver, according to the standard of the merchants. / So Ephron’s field at Machpelah near Mamre, the cave that was in it, and all the trees within the boundaries of the field were deeded over / to Abraham’s possession in the presence of all the Hittites who had come to the gate of his city. ..."
        },
        {
          "reference": "Genesis 28:13-19",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.” ..."
        },
        {
          "reference": "Genesis 48:22",
          "text": "And to you, as one who is above your brothers, I give the ridge of land that I took from the Amorites with my sword and bow.”"
        },
        {
          "reference": "Exodus 6:8",
          "text": "And I will bring you into the land that I swore to give to Abraham, Isaac, and Jacob. I will give it to you as a possession. I am the LORD!’”"
        },
        {
          "reference": "Deuteronomy 32:49",
          "text": "“Go up into the Abarim Range to Mount Nebo, in the land of Moab across from Jericho, and view the land of Canaan, which I am giving to the Israelites as their own possession."
        },
        {
          "reference": "Joshua 21:43",
          "text": "Thus the LORD gave Israel all the land He had sworn to give their fathers, and they took possession of it and settled in it."
        },
        {
          "reference": "Judges 1:1",
          "text": "After the death of Joshua, the Israelites inquired of the LORD, “Who will be the first to go up and fight for us against the Canaanites?”"
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Psalm 105:9-11",
          "text": "the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: / “I will give you the land of Canaan as the portion of your inheritance.”"
        },
        {
          "reference": "Jeremiah 32:10-12",
          "text": "I signed and sealed the deed, called in witnesses, and weighed out the silver on the scales. / Then I took the deed of purchase—the sealed copy with its terms and conditions, as well as the open copy— / and I gave this deed to Baruch son of Neriah, the son of Mahseiah, in the sight of my cousin Hanamel and the witnesses who were signing the purchase agreement and all the Jews sitting in the courtyard of the guard."
        },
        {
          "reference": "Ezekiel 47:14",
          "text": "You are to divide it equally among them. Because I swore with an uplifted hand to give it to your forefathers, this land will fall to you as an inheritance."
        }
      ]
    },
    {
      "reference": "Genesis 33:20",
      "book": "Genesis",
      "chapter": 33,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "There he set up an altar and called it El Elohe Israel."
        },
        {
          "version": "NLT",
          "text": "And there he built an altar and named it El-Elohe-Israel."
        },
        {
          "version": "ESV",
          "text": "There he erected an altar and called it El-Elohe-Israel."
        },
        {
          "version": "NKJV",
          "text": "Then he erected an altar there and called it El Elohe Israel."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 28:18-19",
          "text": "Early the next morning, Jacob took the stone that he had placed under his head, and he set it up as a pillar. He poured oil on top of it, / and he called that place Bethel, though previously the city had been named Luz."
        },
        {
          "reference": "Genesis 35:7",
          "text": "There Jacob built an altar, and he called that place El-bethel, because it was there that God had revealed Himself to Jacob as he fled from his brother."
        },
        {
          "reference": "Exodus 17:15",
          "text": "And Moses built an altar and named it The LORD Is My Banner."
        },
        {
          "reference": "Joshua 24:26-27",
          "text": "Joshua recorded these things in the Book of the Law of God. Then he took a large stone and set it up there under the oak that was near the sanctuary of the LORD. / And Joshua said to all the people, “You see this stone. It will be a witness against us, for it has heard all the words the LORD has spoken to us, and it will be a witness against you if you ever deny your God.”"
        },
        {
          "reference": "Judges 6:24",
          "text": "So Gideon built an altar to the LORD there and called it The LORD Is Peace. To this day it stands in Ophrah of the Abiezrites."
        },
        {
          "reference": "1 Samuel 7:12",
          "text": "Afterward, Samuel took a stone and set it up between Mizpah and Shen. He named it Ebenezer, saying, “Thus far the LORD has helped us.”"
        },
        {
          "reference": "2 Samuel 24:25",
          "text": "And there he built an altar to the LORD and offered burnt offerings and peace offerings. Then the LORD answered the prayers on behalf of the land, and the plague upon Israel was halted."
        },
        {
          "reference": "1 Kings 18:31-32",
          "text": "And Elijah took twelve stones, one for each tribe of the sons of Jacob, to whom the word of the LORD had come and said, “Israel shall be your name.” / And with the stones, Elijah built an altar in the name of the LORD. Then he dug a trench around the altar large enough to hold two seahs of seed."
        },
        {
          "reference": "2 Kings 17:32-33",
          "text": "So the new residents worshiped the LORD, but they also appointed for themselves priests of all sorts to serve in the shrines of the high places. / They worshiped the LORD, but they also served their own gods according to the customs of the nations from which they had been carried away."
        },
        {
          "reference": "Psalm 116:17",
          "text": "I will offer to You a sacrifice of thanksgiving and call on the name of the LORD."
        },
        {
          "reference": "Isaiah 19:19",
          "text": "In that day there will be an altar to the LORD in the center of the land of Egypt, and a pillar to the LORD near her border."
        },
        {
          "reference": "Hosea 12:4-5",
          "text": "Yes, he struggled with the angel and prevailed; he wept and sought His favor; he found Him at Bethel and spoke with Him there— / the LORD God of Hosts, the LORD is His name of renown."
        },
        {
          "reference": "John 4:20-24",
          "text": "Our fathers worshiped on this mountain, but you Jews say that the place where one must worship is in Jerusalem.” / “Believe Me, woman,” Jesus replied, “a time is coming when you will worship the Father neither on this mountain nor in Jerusalem. / You worship what you do not know; we worship what we do know, for salvation is from the Jews. ..."
        },
        {
          "reference": "Acts 7:44-48",
          "text": "Our fathers had the tabernacle of the Testimony with them in the wilderness. It was constructed exactly as God had directed Moses, according to the pattern he had seen. / And our fathers who received it brought it in with Joshua when they dispossessed the nations God drove out before them. It remained until the time of David, / who found favor in the sight of God and asked to provide a dwelling place for the God of Jacob. ..."
        }
      ]
    }
  ]
}