{
  "book": "genesis",
  "chapter": 34,
  "verses": [
    {
      "reference": "Genesis 34:1",
      "book": "Genesis",
      "chapter": 34,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the women of the land."
        },
        {
          "version": "NLT",
          "text": "One day Dinah, the daughter of Jacob and Leah, went to visit some of the young women who lived in the area."
        },
        {
          "version": "ESV",
          "text": "Now Dinah the daughter of Leah, whom she had borne to Jacob, went out to see the women of the land."
        },
        {
          "version": "NKJV",
          "text": "Now Dinah the daughter of Leah, whom she had borne to Jacob, went out to see the daughters of the land."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 30:21",
          "text": "After that, Leah gave birth to a daughter and named her Dinah."
        },
        {
          "reference": "Genesis 46:15",
          "text": "These are the sons of Leah born to Jacob in Paddan-aram, in addition to his daughter Dinah. The total number of sons and daughters was thirty-three."
        },
        {
          "reference": "2 Samuel 13:1-22",
          "text": "After some time, David’s son Amnon fell in love with Tamar, the beautiful sister of David’s son Absalom. / Amnon was sick with frustration over his sister Tamar, for she was a virgin, and it seemed implausible for him to do anything to her. / Now Amnon had a friend named Jonadab, the son of David’s brother Shimeah. Jonadab was a very shrewd man, ..."
        },
        {
          "reference": "Judges 19:24",
          "text": "Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.”"
        },
        {
          "reference": "Deuteronomy 22:25-27",
          "text": "But if the man encounters a betrothed woman in the open country, and he overpowers her and lies with her, only the man who has done this must die. / Do nothing to the young woman, because she has committed no sin worthy of death. This case is just like one in which a man attacks his neighbor and murders him. / When he found her in the field, the betrothed woman cried out, but there was no one to save her."
        },
        {
          "reference": "2 Samuel 11:2-4",
          "text": "One evening David got up from his bed and strolled around on the roof of the palace. And from the roof he saw a woman bathing—a very beautiful woman. / So David sent and inquired about the woman, and he was told, “This is Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite.” / Then David sent messengers to get her, and when she came to him, he slept with her. (Now she had just purified herself from her uncleanness.) Then she returned home."
        },
        {
          "reference": "Leviticus 19:29",
          "text": "You must not defile your daughter by making her a prostitute, or the land will be prostituted and filled with depravity."
        },
        {
          "reference": "Exodus 22:16-17",
          "text": "If a man seduces a virgin who is not pledged in marriage and sleeps with her, he must pay the full dowry for her to be his wife. / If her father absolutely refuses to give her to him, the man still must pay an amount comparable to the bridal price of a virgin."
        },
        {
          "reference": "Deuteronomy 22:28-29",
          "text": "If a man encounters a virgin who is not pledged in marriage, and he seizes her and lies with her, and they are discovered, / then the man who lay with her must pay the young woman’s father fifty shekels of silver, and she must become his wife because he has violated her. He must not divorce her as long as he lives."
        },
        {
          "reference": "2 Samuel 13:11-14",
          "text": "And when she had brought them to him to eat, he took hold of her and said, “Come lie with me, my sister!” / “No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” ..."
        },
        {
          "reference": "1 Corinthians 6:18-20",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body. / Do you not know that your body is a temple of the Holy Spirit who is in you, whom you have received from God? You are not your own; / you were bought at a price. Therefore glorify God with your body."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "1 Peter 3:3-4",
          "text": "Your beauty should not come from outward adornment, such as braided hair or gold jewelry or fine clothes, / but from the inner disposition of your heart, the unfading beauty of a gentle and quiet spirit, which is precious in God’s sight."
        },
        {
          "reference": "Proverbs 7:10-12",
          "text": "Then a woman came out to meet him, with the attire of a harlot and cunning of heart. / She is loud and defiant; her feet do not remain at home. / Now in the street, now in the squares, she lurks at every corner."
        },
        {
          "reference": "1 Timothy 2:9-10",
          "text": "Likewise, I want the women to adorn themselves with respectable apparel, with modesty, and with self-control, not with braided hair or gold or pearls or expensive clothes, / but with good deeds, as is proper for women who profess to worship God."
        }
      ]
    },
    {
      "reference": "Genesis 34:2",
      "book": "Genesis",
      "chapter": 34,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "When Shechem son of Hamor the Hivite, the ruler of that area, saw her, he took her and raped her."
        },
        {
          "version": "NLT",
          "text": "But when the local prince, Shechem son of Hamor the Hivite, saw Dinah, he seized her and raped her."
        },
        {
          "version": "ESV",
          "text": "And when Shechem the son of Hamor the Hivite, the prince of the land, saw her, he seized her and lay with her and humiliated her."
        },
        {
          "version": "NKJV",
          "text": "And when Shechem the son of Hamor the Hivite, prince of the country, saw her, he took her and lay with her, and violated her."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "2 Samuel 13:11-14",
          "text": "And when she had brought them to him to eat, he took hold of her and said, “Come lie with me, my sister!” / “No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” ..."
        },
        {
          "reference": "Judges 19:25",
          "text": "But the men would not listen to him. So the Levite took his concubine and sent her outside to them, and they raped her and abused her throughout the night, and at dawn they let her go."
        },
        {
          "reference": "Deuteronomy 22:25-27",
          "text": "But if the man encounters a betrothed woman in the open country, and he overpowers her and lies with her, only the man who has done this must die. / Do nothing to the young woman, because she has committed no sin worthy of death. This case is just like one in which a man attacks his neighbor and murders him. / When he found her in the field, the betrothed woman cried out, but there was no one to save her."
        },
        {
          "reference": "2 Samuel 13:1-2",
          "text": "After some time, David’s son Amnon fell in love with Tamar, the beautiful sister of David’s son Absalom. / Amnon was sick with frustration over his sister Tamar, for she was a virgin, and it seemed implausible for him to do anything to her."
        },
        {
          "reference": "Leviticus 18:9",
          "text": "You must not have sexual relations with your sister, either your father’s daughter or your mother’s daughter, whether she was born in the same home or elsewhere."
        },
        {
          "reference": "Deuteronomy 22:28-29",
          "text": "If a man encounters a virgin who is not pledged in marriage, and he seizes her and lies with her, and they are discovered, / then the man who lay with her must pay the young woman’s father fifty shekels of silver, and she must become his wife because he has violated her. He must not divorce her as long as he lives."
        },
        {
          "reference": "2 Samuel 13:32",
          "text": "But Jonadab, the son of David’s brother Shimeah, spoke up: “My lord must not think they have killed all the sons of the king, for only Amnon is dead. In fact, Absalom has planned this since the day Amnon violated his sister Tamar."
        },
        {
          "reference": "Exodus 22:16-17",
          "text": "If a man seduces a virgin who is not pledged in marriage and sleeps with her, he must pay the full dowry for her to be his wife. / If her father absolutely refuses to give her to him, the man still must pay an amount comparable to the bridal price of a virgin."
        },
        {
          "reference": "Leviticus 18:29",
          "text": "Therefore anyone who commits any of these abominations must be cut off from among his people."
        },
        {
          "reference": "2 Samuel 13:20",
          "text": "Her brother Absalom said to her, “Has your brother Amnon been with you? Be quiet for now, my sister. He is your brother. Do not take this thing to heart.” So Tamar lived as a desolate woman in the house of her brother Absalom."
        },
        {
          "reference": "1 Corinthians 5:1",
          "text": "It is actually reported that there is sexual immorality among you, and of a kind that is intolerable even among pagans: A man has his father’s wife."
        },
        {
          "reference": "1 Thessalonians 4:3-6",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God; ..."
        },
        {
          "reference": "Ephesians 5:3",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed."
        },
        {
          "reference": "1 Corinthians 6:18",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body."
        },
        {
          "reference": "Romans 13:13",
          "text": "Let us behave decently, as in the daytime, not in carousing and drunkenness, not in sexual immorality and debauchery, not in dissension and jealousy."
        }
      ]
    },
    {
      "reference": "Genesis 34:3",
      "book": "Genesis",
      "chapter": 34,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "His heart was drawn to Dinah daughter of Jacob; he loved the young woman and spoke tenderly to her."
        },
        {
          "version": "NLT",
          "text": "But then he fell in love with her, and he tried to win her affection with tender words."
        },
        {
          "version": "ESV",
          "text": "And his soul was drawn to Dinah the daughter of Jacob. He loved the young woman and spoke tenderly to her."
        },
        {
          "version": "NKJV",
          "text": "His soul was strongly attracted to Dinah the daughter of Jacob, and he loved the young woman and spoke kindly to the young woman."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "2 Samuel 13:1-15",
          "text": "After some time, David’s son Amnon fell in love with Tamar, the beautiful sister of David’s son Absalom. / Amnon was sick with frustration over his sister Tamar, for she was a virgin, and it seemed implausible for him to do anything to her. / Now Amnon had a friend named Jonadab, the son of David’s brother Shimeah. Jonadab was a very shrewd man, ..."
        },
        {
          "reference": "Judges 14:1-3",
          "text": "One day Samson went down to Timnah, where he saw a young Philistine woman. / So he returned and told his father and mother, “I have seen a daughter of the Philistines in Timnah. Now get her for me as a wife.” / But his father and mother replied, “Can’t you find a young woman among your relatives or among any of our people? Must you go to the uncircumcised Philistines to get a wife?” But Samson told his father, “Get her for me, for she is pleasing to my eyes.”"
        },
        {
          "reference": "Deuteronomy 22:28-29",
          "text": "If a man encounters a virgin who is not pledged in marriage, and he seizes her and lies with her, and they are discovered, / then the man who lay with her must pay the young woman’s father fifty shekels of silver, and she must become his wife because he has violated her. He must not divorce her as long as he lives."
        },
        {
          "reference": "2 Samuel 13:32-33",
          "text": "But Jonadab, the son of David’s brother Shimeah, spoke up: “My lord must not think they have killed all the sons of the king, for only Amnon is dead. In fact, Absalom has planned this since the day Amnon violated his sister Tamar. / So now, my lord the king, do not take to heart the report that all the sons of the king are dead. Only Amnon is dead.”"
        },
        {
          "reference": "Judges 16:4",
          "text": "Some time later, Samson fell in love with a woman in the Valley of Sorek, whose name was Delilah."
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Exodus 22:16-17",
          "text": "If a man seduces a virgin who is not pledged in marriage and sleeps with her, he must pay the full dowry for her to be his wife. / If her father absolutely refuses to give her to him, the man still must pay an amount comparable to the bridal price of a virgin."
        },
        {
          "reference": "1 Samuel 18:20",
          "text": "Now Saul’s daughter Michal loved David, and when this was reported to Saul, it pleased him."
        },
        {
          "reference": "1 Kings 11:3",
          "text": "He had seven hundred wives of royal birth and three hundred concubines—and his wives turned his heart away."
        },
        {
          "reference": "2 Samuel 11:2-4",
          "text": "One evening David got up from his bed and strolled around on the roof of the palace. And from the roof he saw a woman bathing—a very beautiful woman. / So David sent and inquired about the woman, and he was told, “This is Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite.” / Then David sent messengers to get her, and when she came to him, he slept with her. (Now she had just purified herself from her uncleanness.) Then she returned home."
        },
        {
          "reference": "Matthew 14:6-8",
          "text": "On Herod’s birthday, however, the daughter of Herodias danced before them and pleased Herod / so much that he promised with an oath to give to her whatever she asked. / Prompted by her mother, she said, “Give me here on a platter the head of John the Baptist.”"
        },
        {
          "reference": "Mark 6:22-25",
          "text": "When the daughter of Herodias came and danced, she pleased Herod and his guests, and the king said to the girl, “Ask me for whatever you wish, and I will give it to you.” / And he swore to her, “Whatever you ask of me, I will give you, up to half my kingdom!” / Then she went out and asked her mother, “What should I request?” And her mother answered, “The head of John the Baptist.” ..."
        },
        {
          "reference": "John 4:7-9",
          "text": "When a Samaritan woman came to draw water, Jesus said to her, “Give Me a drink.” / (His disciples had gone into the town to buy food.) / “You are a Jew,” said the woman. “How can You ask for a drink from me, a Samaritan woman?” (For Jews do not associate with Samaritans.)"
        },
        {
          "reference": "1 Corinthians 7:2",
          "text": "But because there is so much sexual immorality, each man should have his own wife, and each woman her own husband."
        },
        {
          "reference": "1 Corinthians 6:18",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body."
        }
      ]
    },
    {
      "reference": "Genesis 34:4",
      "book": "Genesis",
      "chapter": 34,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "And Shechem said to his father Hamor, “Get me this girl as my wife.”"
        },
        {
          "version": "NLT",
          "text": "He said to his father, Hamor, “Get me this young girl. I want to marry her.”"
        },
        {
          "version": "ESV",
          "text": "So Shechem spoke to his father Hamor, saying, “Get me this girl for my wife.”"
        },
        {
          "version": "NKJV",
          "text": "So Shechem spoke to his father Hamor, saying, “Get me this young woman as a wife.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 14:2",
          "text": "So he returned and told his father and mother, “I have seen a daughter of the Philistines in Timnah. Now get her for me as a wife.”"
        },
        {
          "reference": "2 Samuel 13:13",
          "text": "Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.”"
        },
        {
          "reference": "Deuteronomy 7:3",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons,"
        },
        {
          "reference": "Exodus 34:16",
          "text": "And when you take some of their daughters as brides for your sons, their daughters will prostitute themselves to their gods and cause your sons to do the same."
        },
        {
          "reference": "1 Kings 11:2",
          "text": "These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:25-27",
          "text": "I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! / Did not King Solomon of Israel sin in matters like this? There was not a king like him among many nations, and he was loved by his God, who made him king over all Israel—yet foreign women drew him into sin. / Must we now hear that you too are doing all this terrible evil and acting unfaithfully against our God by marrying foreign women?”"
        },
        {
          "reference": "Joshua 23:12-13",
          "text": "For if you turn away and cling to the rest of these nations that remain among you, and if you intermarry and associate with them, / know for sure that the LORD your God will no longer drive out these nations before you. Instead, they will become for you a snare and a trap, a scourge in your sides and thorns in your eyes, until you perish from this good land that the LORD your God has given you."
        },
        {
          "reference": "1 Corinthians 7:39",
          "text": "A wife is bound to her husband as long as he lives. But if her husband dies, she is free to marry anyone she wishes, as long as he belongs to the Lord."
        },
        {
          "reference": "2 Corinthians 6:14",
          "text": "Do not be unequally yoked with unbelievers. For what partnership can righteousness have with wickedness? Or what fellowship does light have with darkness?"
        },
        {
          "reference": "Ephesians 5:22-33",
          "text": "Wives, submit to your husbands as to the Lord. / For the husband is the head of the wife as Christ is the head of the church, His body, of which He is the Savior. / Now as the church submits to Christ, so also wives should submit to their husbands in everything. ..."
        },
        {
          "reference": "Colossians 3:18-19",
          "text": "Wives, submit to your husbands, as is fitting in the Lord. / Husbands, love your wives and do not be harsh with them."
        },
        {
          "reference": "1 Peter 3:1-7",
          "text": "Wives, in the same way, submit yourselves to your husbands, so that even if they refuse to believe the word, they will be won over without words by the behavior of their wives / when they see your pure and reverent demeanor. / Your beauty should not come from outward adornment, such as braided hair or gold jewelry or fine clothes, ..."
        },
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Mark 10:6-9",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh. ..."
        },
        {
          "reference": "1 Corinthians 7:2",
          "text": "But because there is so much sexual immorality, each man should have his own wife, and each woman her own husband."
        }
      ]
    },
    {
      "reference": "Genesis 34:5",
      "book": "Genesis",
      "chapter": 34,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "When Jacob heard that his daughter Dinah had been defiled, his sons were in the fields with his livestock; so he did nothing about it until they came home."
        },
        {
          "version": "NLT",
          "text": "Soon Jacob heard that Shechem had defiled his daughter, Dinah. But since his sons were out in the fields herding his livestock, he said nothing until they returned."
        },
        {
          "version": "ESV",
          "text": "Now Jacob heard that he had defiled his daughter Dinah. But his sons were with his livestock in the field, so Jacob held his peace until they came."
        },
        {
          "version": "NKJV",
          "text": "And Jacob heard that he had defiled Dinah his daughter. Now his sons were with his livestock in the field; so Jacob held his peace until they came."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Genesis 30:20-21",
          "text": "“God has given me a good gift,” she said. “This time my husband will honor me, because I have borne him six sons.” And she named him Zebulun. / After that, Leah gave birth to a daughter and named her Dinah."
        },
        {
          "reference": "Genesis 29:31-35",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren. / And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.” / Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon. ..."
        },
        {
          "reference": "Genesis 37:34-35",
          "text": "Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 46:15",
          "text": "These are the sons of Leah born to Jacob in Paddan-aram, in addition to his daughter Dinah. The total number of sons and daughters was thirty-three."
        },
        {
          "reference": "Exodus 2:1-10",
          "text": "Now a man of the house of Levi married a Levite woman, / and she conceived and gave birth to a son. When she saw that he was a beautiful child, she hid him for three months. / But when she could no longer hide him, she got him a papyrus basket and coated it with tar and pitch. Then she placed the child in the basket and set it among the reeds along the bank of the Nile. ..."
        },
        {
          "reference": "Numbers 12:1-15",
          "text": "Then Miriam and Aaron criticized Moses because of the Cushite woman he had married, for he had taken a Cushite wife. / “Does the LORD speak only through Moses?” they said. “Does He not also speak through us?” And the LORD heard this. / Now Moses was a very humble man, more so than any man on the face of the earth. ..."
        },
        {
          "reference": "Deuteronomy 22:28-29",
          "text": "If a man encounters a virgin who is not pledged in marriage, and he seizes her and lies with her, and they are discovered, / then the man who lay with her must pay the young woman’s father fifty shekels of silver, and she must become his wife because he has violated her. He must not divorce her as long as he lives."
        },
        {
          "reference": "2 Samuel 13:1-22",
          "text": "After some time, David’s son Amnon fell in love with Tamar, the beautiful sister of David’s son Absalom. / Amnon was sick with frustration over his sister Tamar, for she was a virgin, and it seemed implausible for him to do anything to her. / Now Amnon had a friend named Jonadab, the son of David’s brother Shimeah. Jonadab was a very shrewd man, ..."
        },
        {
          "reference": "2 Samuel 13:37-39",
          "text": "Now Absalom fled and went to Talmai son of Ammihud, the king of Geshur. But David mourned for his son every day. / After Absalom had fled and gone to Geshur, he stayed there three years. / And King David longed to go to Absalom, for he had been consoled over Amnon’s death."
        },
        {
          "reference": "1 Chronicles 2:1",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun,"
        },
        {
          "reference": "Psalm 12:5",
          "text": "“For the cause of the oppressed and for the groaning of the needy, I will now arise,” says the LORD. “I will bring safety to him who yearns.”"
        },
        {
          "reference": "Psalm 82:3-4",
          "text": "Defend the cause of the weak and fatherless; uphold the rights of the afflicted and oppressed. / Rescue the weak and needy; save them from the hand of the wicked."
        },
        {
          "reference": "Proverbs 31:8-9",
          "text": "Open your mouth for those with no voice, for the cause of all the dispossessed. / Open your mouth, judge righteously, and defend the cause of the poor and needy."
        },
        {
          "reference": "Isaiah 1:17",
          "text": "Learn to do right; seek justice and correct the oppressor. Defend the fatherless and plead the case of the widow.”"
        }
      ]
    },
    {
      "reference": "Genesis 34:6",
      "book": "Genesis",
      "chapter": 34,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Shechem’s father Hamor went out to talk with Jacob."
        },
        {
          "version": "NLT",
          "text": "Hamor, Shechem’s father, came to discuss the matter with Jacob."
        },
        {
          "version": "ESV",
          "text": "And Hamor the father of Shechem went out to Jacob to speak with him."
        },
        {
          "version": "NKJV",
          "text": "Then Hamor the father of Shechem went out to Jacob to speak with him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Genesis 33:18-20",
          "text": "After Jacob had come from Paddan-aram, he arrived safely at the city of Shechem in the land of Canaan, and he camped just outside the city. / And the plot of ground where he pitched his tent, he purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. / There he set up an altar and called it El-Elohe-Israel."
        },
        {
          "reference": "Genesis 31:44-54",
          "text": "Come now, let us make a covenant, you and I, and let it serve as a witness between you and me.” / So Jacob picked out a stone and set it up as a pillar, / and he said to his relatives, “Gather some stones.” So they took stones and made a mound, and there by the mound they ate. ..."
        },
        {
          "reference": "Genesis 24:3-4",
          "text": "and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling, / but will go to my country and my kindred to take a wife for my son Isaac.”"
        },
        {
          "reference": "Genesis 28:1-2",
          "text": "So Isaac called for Jacob and blessed him. “Do not take a wife from the Canaanite women,” he commanded. / “Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Exodus 34:15-16",
          "text": "Do not make a covenant with the inhabitants of the land, for when they prostitute themselves to their gods and sacrifice to them, they will invite you, and you will eat their sacrifices. / And when you take some of their daughters as brides for your sons, their daughters will prostitute themselves to their gods and cause your sons to do the same."
        },
        {
          "reference": "Deuteronomy 7:3-4",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons, / because they will turn your sons away from following Me to serve other gods. Then the anger of the LORD will burn against you, and He will swiftly destroy you."
        },
        {
          "reference": "Joshua 9:15-21",
          "text": "And Joshua made a treaty of peace with them to let them live, and the leaders of the congregation swore an oath to them. / Three days after they had made the treaty with the Gibeonites, the Israelites learned that they were neighbors, living among them. / So the Israelites set out and on the third day arrived at their cities—Gibeon, Chephirah, Beeroth, and Kiriath-jearim. ..."
        },
        {
          "reference": "Judges 14:1-3",
          "text": "One day Samson went down to Timnah, where he saw a young Philistine woman. / So he returned and told his father and mother, “I have seen a daughter of the Philistines in Timnah. Now get her for me as a wife.” / But his father and mother replied, “Can’t you find a young woman among your relatives or among any of our people? Must you go to the uncircumcised Philistines to get a wife?” But Samson told his father, “Get her for me, for she is pleasing to my eyes.”"
        },
        {
          "reference": "2 Samuel 13:23-29",
          "text": "Two years later, when Absalom’s sheepshearers were at Baal-hazor near Ephraim, he invited all the sons of the king. / And he went to the king and said, “Your servant has just hired shearers. Will the king and his servants please come with me?” / “No, my son,” the king replied, “we should not all go, or we would be a burden to you.” Although Absalom urged him, he was not willing to go, but gave him his blessing. ..."
        },
        {
          "reference": "2 Samuel 13:1-22",
          "text": "After some time, David’s son Amnon fell in love with Tamar, the beautiful sister of David’s son Absalom. / Amnon was sick with frustration over his sister Tamar, for she was a virgin, and it seemed implausible for him to do anything to her. / Now Amnon had a friend named Jonadab, the son of David’s brother Shimeah. Jonadab was a very shrewd man, ..."
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:23-27",
          "text": "In those days I also saw Jews who had married women from Ashdod, Ammon, and Moab. / Half of their children spoke the language of Ashdod or of the other peoples, but could not speak the language of Judah. / I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! ..."
        },
        {
          "reference": "Ezra 9:1-2",
          "text": "After these things had been accomplished, the leaders approached me and said, “The people of Israel, including the priests and Levites, have not kept themselves separate from the surrounding peoples whose abominations are like those of the Canaanites, Hittites, Perizzites, Jebusites, Ammonites, Moabites, Egyptians, and Amorites. / Indeed, the Israelites have taken some of their daughters as wives for themselves and their sons, so that the holy seed has been mixed with the people of the land. And the leaders and officials have taken the lead in this unfaithfulness!”"
        },
        {
          "reference": "Acts 15:20",
          "text": "Instead, we should write and tell them to abstain from food polluted by idols, from sexual immorality, from the meat of strangled animals, and from blood."
        }
      ]
    },
    {
      "reference": "Genesis 34:7",
      "book": "Genesis",
      "chapter": 34,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Meanwhile, Jacob’s sons had come in from the fields as soon as they heard what had happened. They were shocked and furious, because Shechem had done an outrageous thing in Israel by sleeping with Jacob’s daughter—a thing that should not be done."
        },
        {
          "version": "NLT",
          "text": "Meanwhile, Jacob’s sons had come in from the field as soon as they heard what had happened. They were shocked and furious that their sister had been raped. Shechem had done a disgraceful thing against Jacob’s family, something that should never be done."
        },
        {
          "version": "ESV",
          "text": "The sons of Jacob had come in from the field as soon as they heard of it, and the men were indignant and very angry, because he had done an outrageous thing in Israel by lying with Jacob’s daughter, for such a thing must not be done."
        },
        {
          "version": "NKJV",
          "text": "And the sons of Jacob came in from the field when they heard it; and the men were grieved and very angry, because he had done a disgraceful thing in Israel by lying with Jacob’s daughter, a thing which ought not to be done."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 22:21",
          "text": "she shall be brought to the door of her father’s house, and there the men of her city will stone her to death. For she has committed an outrage in Israel by being promiscuous in her father’s house. So you must purge the evil from among you."
        },
        {
          "reference": "2 Samuel 13:12-14",
          "text": "“No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” / But Amnon refused to listen to her, and being stronger, he violated her and lay with her."
        },
        {
          "reference": "Leviticus 18:29",
          "text": "Therefore anyone who commits any of these abominations must be cut off from among his people."
        },
        {
          "reference": "Deuteronomy 22:24",
          "text": "you must take both of them out to the gate of that city and stone them to death—the young woman because she did not cry out in the city, and the man because he has violated his neighbor’s wife. So you must purge the evil from among you."
        },
        {
          "reference": "Judges 19:23-24",
          "text": "The owner of the house went out and said to them, “No, my brothers, do not do this wicked thing! After all, this man is a guest in my house. Do not commit this outrage. / Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.”"
        },
        {
          "reference": "2 Samuel 13:22",
          "text": "And Absalom never said a word to Amnon, either good or bad, because he hated Amnon for violating his sister Tamar."
        },
        {
          "reference": "Leviticus 20:10",
          "text": "If a man commits adultery with another man’s wife—with the wife of his neighbor—both the adulterer and the adulteress must surely be put to death."
        },
        {
          "reference": "Deuteronomy 22:25-27",
          "text": "But if the man encounters a betrothed woman in the open country, and he overpowers her and lies with her, only the man who has done this must die. / Do nothing to the young woman, because she has committed no sin worthy of death. This case is just like one in which a man attacks his neighbor and murders him. / When he found her in the field, the betrothed woman cried out, but there was no one to save her."
        },
        {
          "reference": "2 Samuel 13:32",
          "text": "But Jonadab, the son of David’s brother Shimeah, spoke up: “My lord must not think they have killed all the sons of the king, for only Amnon is dead. In fact, Absalom has planned this since the day Amnon violated his sister Tamar."
        },
        {
          "reference": "Exodus 22:16-17",
          "text": "If a man seduces a virgin who is not pledged in marriage and sleeps with her, he must pay the full dowry for her to be his wife. / If her father absolutely refuses to give her to him, the man still must pay an amount comparable to the bridal price of a virgin."
        },
        {
          "reference": "1 Corinthians 5:1",
          "text": "It is actually reported that there is sexual immorality among you, and of a kind that is intolerable even among pagans: A man has his father’s wife."
        },
        {
          "reference": "1 Thessalonians 4:3-7",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God; ..."
        },
        {
          "reference": "Ephesians 5:3",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed."
        },
        {
          "reference": "1 Corinthians 6:18-20",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body. / Do you not know that your body is a temple of the Holy Spirit who is in you, whom you have received from God? You are not your own; / you were bought at a price. Therefore glorify God with your body."
        },
        {
          "reference": "Romans 13:13",
          "text": "Let us behave decently, as in the daytime, not in carousing and drunkenness, not in sexual immorality and debauchery, not in dissension and jealousy."
        }
      ]
    },
    {
      "reference": "Genesis 34:8",
      "book": "Genesis",
      "chapter": 34,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "But Hamor said to them, “My son Shechem has his heart set on your daughter. Please give her to him as his wife."
        },
        {
          "version": "NLT",
          "text": "Hamor tried to speak with Jacob and his sons. “My son Shechem is truly in love with your daughter,” he said. “Please let him marry her."
        },
        {
          "version": "ESV",
          "text": "But Hamor spoke with them, saying, “The soul of my son Shechem longs for your daughter. Please give her to him to be his wife."
        },
        {
          "version": "NKJV",
          "text": "But Hamor spoke with them, saying, “The soul of my son Shechem longs for your daughter. Please give her to him as a wife."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 34:12",
          "text": "Demand a high dowry and an expensive gift, and I will give you whatever you ask. Only give me the girl as my wife!”"
        },
        {
          "reference": "Genesis 34:16-17",
          "text": "Then we will give you our daughters and take your daughters for ourselves. We will dwell among you and become one people. / But if you will not agree to be circumcised, then we will take our sister and go.”"
        },
        {
          "reference": "Genesis 34:21-22",
          "text": "“These men are at peace with us. Let them live and trade in our land; indeed, it is large enough for them. Let us take their daughters in marriage and give our daughters to them. / But only on this condition will the men agree to dwell with us and be one people: if all our men are circumcised as they are."
        },
        {
          "reference": "Exodus 22:16-17",
          "text": "If a man seduces a virgin who is not pledged in marriage and sleeps with her, he must pay the full dowry for her to be his wife. / If her father absolutely refuses to give her to him, the man still must pay an amount comparable to the bridal price of a virgin."
        },
        {
          "reference": "Deuteronomy 7:3-4",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons, / because they will turn your sons away from following Me to serve other gods. Then the anger of the LORD will burn against you, and He will swiftly destroy you."
        },
        {
          "reference": "Deuteronomy 22:28-29",
          "text": "If a man encounters a virgin who is not pledged in marriage, and he seizes her and lies with her, and they are discovered, / then the man who lay with her must pay the young woman’s father fifty shekels of silver, and she must become his wife because he has violated her. He must not divorce her as long as he lives."
        },
        {
          "reference": "Joshua 9:15",
          "text": "And Joshua made a treaty of peace with them to let them live, and the leaders of the congregation swore an oath to them."
        },
        {
          "reference": "Judges 14:2-3",
          "text": "So he returned and told his father and mother, “I have seen a daughter of the Philistines in Timnah. Now get her for me as a wife.” / But his father and mother replied, “Can’t you find a young woman among your relatives or among any of our people? Must you go to the uncircumcised Philistines to get a wife?” But Samson told his father, “Get her for me, for she is pleasing to my eyes.”"
        },
        {
          "reference": "1 Samuel 18:22-25",
          "text": "Then Saul ordered his servants, “Speak to David privately and tell him, ‘Behold, the king is pleased with you, and all his servants love you. Now therefore, become his son-in-law.’” / But when Saul’s servants relayed these words to David, he replied, “Does it seem trivial in your sight to be the son-in-law of the king? I am a poor man and lightly esteemed.” / And the servants told Saul what David had said. ..."
        },
        {
          "reference": "2 Samuel 13:13",
          "text": "Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.”"
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:25-27",
          "text": "I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! / Did not King Solomon of Israel sin in matters like this? There was not a king like him among many nations, and he was loved by his God, who made him king over all Israel—yet foreign women drew him into sin. / Must we now hear that you too are doing all this terrible evil and acting unfaithfully against our God by marrying foreign women?”"
        },
        {
          "reference": "Matthew 22:2-3",
          "text": "“The kingdom of heaven is like a king who prepared a wedding banquet for his son. / He sent his servants to call those he had invited to the banquet, but they refused to come."
        },
        {
          "reference": "Matthew 22:8-10",
          "text": "Then he said to his servants, ‘The wedding banquet is ready, but those I invited were not worthy. / Go therefore to the crossroads and invite to the banquet as many as you can find.’ / So the servants went out into the streets and gathered everyone they could find, both evil and good, and the wedding hall was filled with guests."
        },
        {
          "reference": "John 4:9",
          "text": "“You are a Jew,” said the woman. “How can You ask for a drink from me, a Samaritan woman?” (For Jews do not associate with Samaritans.)"
        }
      ]
    },
    {
      "reference": "Genesis 34:9",
      "book": "Genesis",
      "chapter": 34,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "Intermarry with us; give us your daughters and take our daughters for yourselves."
        },
        {
          "version": "NLT",
          "text": "In fact, let’s arrange other marriages, too. You give us your daughters for our sons, and we will give you our daughters for your sons."
        },
        {
          "version": "ESV",
          "text": "Make marriages with us. Give your daughters to us, and take our daughters for yourselves."
        },
        {
          "version": "NKJV",
          "text": "And make marriages with us; give your daughters to us, and take our daughters to yourselves."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 34:16",
          "text": "And when you take some of their daughters as brides for your sons, their daughters will prostitute themselves to their gods and cause your sons to do the same."
        },
        {
          "reference": "Deuteronomy 7:3-4",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons, / because they will turn your sons away from following Me to serve other gods. Then the anger of the LORD will burn against you, and He will swiftly destroy you."
        },
        {
          "reference": "Joshua 23:12-13",
          "text": "For if you turn away and cling to the rest of these nations that remain among you, and if you intermarry and associate with them, / know for sure that the LORD your God will no longer drive out these nations before you. Instead, they will become for you a snare and a trap, a scourge in your sides and thorns in your eyes, until you perish from this good land that the LORD your God has given you."
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:25-27",
          "text": "I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! / Did not King Solomon of Israel sin in matters like this? There was not a king like him among many nations, and he was loved by his God, who made him king over all Israel—yet foreign women drew him into sin. / Must we now hear that you too are doing all this terrible evil and acting unfaithfully against our God by marrying foreign women?”"
        },
        {
          "reference": "Judges 3:5-6",
          "text": "Thus the Israelites continued to live among the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites. / And they took the daughters of these people in marriage, gave their own daughters to their sons, and served their gods."
        },
        {
          "reference": "Ezra 9:12",
          "text": "Now, therefore, do not give your daughters in marriage to their sons or take their daughters for your sons. Never seek their peace or prosperity, so that you may be strong and may eat the good things of the land, leaving it as an inheritance to your sons forever.’"
        },
        {
          "reference": "2 Corinthians 6:14-17",
          "text": "Do not be unequally yoked with unbelievers. For what partnership can righteousness have with wickedness? Or what fellowship does light have with darkness? / What harmony is there between Christ and Belial? Or what does a believer have in common with an unbeliever? / What agreement can exist between the temple of God and idols? For we are the temple of the living God. As God has said: “I will dwell with them and walk among them, and I will be their God, and they will be My people.” ..."
        },
        {
          "reference": "1 Corinthians 7:39",
          "text": "A wife is bound to her husband as long as he lives. But if her husband dies, she is free to marry anyone she wishes, as long as he belongs to the Lord."
        },
        {
          "reference": "1 Corinthians 9:5",
          "text": "Have we no right to take along a believing wife, as do the other apostles and the Lord’s brothers and Cephas?"
        },
        {
          "reference": "2 Corinthians 11:2",
          "text": "I am jealous for you with a godly jealousy. For I promised you to one husband, to present you as a pure virgin to Christ."
        },
        {
          "reference": "Ephesians 5:31",
          "text": "“For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh.”"
        },
        {
          "reference": "Matthew 19:4-6",
          "text": "Jesus answered, “Have you not read that from the beginning the Creator ‘made them male and female,’ / and said, ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh’? / So they are no longer two, but one flesh. Therefore what God has joined together, let man not separate.”"
        },
        {
          "reference": "Mark 10:6-9",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh. ..."
        },
        {
          "reference": "Romans 7:2-3",
          "text": "For instance, a married woman is bound by law to her husband as long as he lives. But if her husband dies, she is released from the law of marriage. / So then, if she is joined to another man while her husband is still alive, she is called an adulteress; but if her husband dies, she is free from that law and is not an adulteress if she marries another man."
        }
      ]
    },
    {
      "reference": "Genesis 34:10",
      "book": "Genesis",
      "chapter": 34,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "You can settle among us; the land is open to you. Live in it, trade in it, and acquire property in it.”"
        },
        {
          "version": "NLT",
          "text": "And you may live among us; the land is open to you! Settle here and trade with us. And feel free to buy property in the area.”"
        },
        {
          "version": "ESV",
          "text": "You shall dwell with us, and the land shall be open to you. Dwell and trade in it, and get property in it.”"
        },
        {
          "version": "NKJV",
          "text": "So you shall dwell with us, and the land shall be before you. Dwell and trade in it, and acquire possessions for yourselves in it.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 13:9",
          "text": "Is not the whole land before you? Now separate yourself from me. If you go to the left, I will go to the right; if you go to the right, I will go to the left.”"
        },
        {
          "reference": "Genesis 23:6",
          "text": "“Listen to us, sir. You are God’s chosen one among us. Bury your dead in the finest of our tombs. None of us will withhold his tomb for burying your dead.”"
        },
        {
          "reference": "Genesis 47:6",
          "text": "the land of Egypt is before you; settle your father and brothers in the best part of the land. They may dwell in the land of Goshen. And if you know of any talented men among them, put them in charge of my own livestock.”"
        },
        {
          "reference": "Numbers 32:1-5",
          "text": "Now the Reubenites and Gadites, who had very large herds and flocks, surveyed the lands of Jazer and Gilead, and they saw that the region was suitable for livestock. / So the Gadites and Reubenites came to Moses, Eleazar the priest, and the leaders of the congregation, and said, / “Ataroth, Dibon, Jazer, Nimrah, Heshbon, Elealeh, Sebam, Nebo, and Beon, ..."
        },
        {
          "reference": "Joshua 22:19",
          "text": "If indeed the land of your inheritance is unclean, then cross over to the land of the LORD’s possession, where the LORD’s tabernacle stands, and take possession of it among us. But do not rebel against the LORD or against us by building for yourselves an altar other than the altar of the LORD our God."
        },
        {
          "reference": "Ruth 1:16",
          "text": "But Ruth replied: “Do not urge me to leave you or to turn from following you. For wherever you go, I will go, and wherever you live, I will live; your people will be my people, and your God will be my God."
        },
        {
          "reference": "1 Samuel 27:5-6",
          "text": "Then David said to Achish, “If I have found favor in your eyes, let me be assigned a place in one of the outlying towns, so I can live there. For why should your servant live in the royal city with you?” / That day Achish gave him Ziklag, and to this day it still belongs to the kings of Judah."
        },
        {
          "reference": "2 Samuel 24:23",
          "text": "O king, Araunah gives all these to the king.” He also said to the king, “May the LORD your God accept you.”"
        },
        {
          "reference": "1 Kings 21:2",
          "text": "So Ahab said to Naboth, “Give me your vineyard to use as a vegetable garden, since it is next to my palace. I will give you a better vineyard in its place—or if you prefer, I will give you its value in silver.”"
        },
        {
          "reference": "2 Kings 8:6",
          "text": "When the king asked the woman, she confirmed it. So the king appointed for her an officer, saying, “Restore all that was hers, along with all the proceeds of the field from the day that she left the country until now.”"
        },
        {
          "reference": "Isaiah 1:19",
          "text": "If you are willing and obedient, you will eat the best of the land."
        },
        {
          "reference": "Jeremiah 40:4",
          "text": "But now, behold, I am freeing you today from the chains that were on your wrists. If it pleases you to come with me to Babylon, then come, and I will take care of you. But if it seems wrong to you to come with me to Babylon, go no farther. Look, the whole land is before you. Wherever it seems good and right to you, go there.”"
        },
        {
          "reference": "Ezekiel 47:22-23",
          "text": "You shall allot it as an inheritance for yourselves and for the foreigners who dwell among you and who have children. You are to treat them as native-born Israelites; along with you, they shall be allotted an inheritance among the tribes of Israel. / In whatever tribe a foreigner dwells, you are to assign his inheritance there,” declares the Lord GOD."
        },
        {
          "reference": "Matthew 5:5",
          "text": "Blessed are the meek, for they will inherit the earth."
        },
        {
          "reference": "Matthew 19:29",
          "text": "And everyone who has left houses or brothers or sisters or father or mother or wife or children or fields for the sake of My name will receive a hundredfold and will inherit eternal life."
        }
      ]
    },
    {
      "reference": "Genesis 34:11",
      "book": "Genesis",
      "chapter": 34,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Shechem said to Dinah’s father and brothers, “Let me find favor in your eyes, and I will give you whatever you ask."
        },
        {
          "version": "NLT",
          "text": "Then Shechem himself spoke to Dinah’s father and brothers. “Please be kind to me, and let me marry her,” he begged. “I will give you whatever you ask."
        },
        {
          "version": "ESV",
          "text": "Shechem also said to her father and to her brothers, “Let me find favor in your eyes, and whatever you say to me I will give."
        },
        {
          "version": "NKJV",
          "text": "Then Shechem said to her father and her brothers, “Let me find favor in your eyes, and whatever you say to me I will give."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:18",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.”"
        },
        {
          "reference": "Genesis 24:37-38",
          "text": "My master made me swear an oath and said, ‘You shall not take a wife for my son from the daughters of the Canaanites in whose land I dwell, / but you shall go to my father’s house and to my kindred to take a wife for my son.’"
        },
        {
          "reference": "Genesis 28:1-2",
          "text": "So Isaac called for Jacob and blessed him. “Do not take a wife from the Canaanite women,” he commanded. / “Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Exodus 22:16-17",
          "text": "If a man seduces a virgin who is not pledged in marriage and sleeps with her, he must pay the full dowry for her to be his wife. / If her father absolutely refuses to give her to him, the man still must pay an amount comparable to the bridal price of a virgin."
        },
        {
          "reference": "Deuteronomy 7:3-4",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons, / because they will turn your sons away from following Me to serve other gods. Then the anger of the LORD will burn against you, and He will swiftly destroy you."
        },
        {
          "reference": "Judges 14:2-3",
          "text": "So he returned and told his father and mother, “I have seen a daughter of the Philistines in Timnah. Now get her for me as a wife.” / But his father and mother replied, “Can’t you find a young woman among your relatives or among any of our people? Must you go to the uncircumcised Philistines to get a wife?” But Samson told his father, “Get her for me, for she is pleasing to my eyes.”"
        },
        {
          "reference": "1 Samuel 18:20-27",
          "text": "Now Saul’s daughter Michal loved David, and when this was reported to Saul, it pleased him. / “I will give her to David,” Saul thought, “so that she may be a snare to him, and the hand of the Philistines may be against him.” So Saul said to David, “For a second time now you can be my son-in-law.” / Then Saul ordered his servants, “Speak to David privately and tell him, ‘Behold, the king is pleased with you, and all his servants love you. Now therefore, become his son-in-law.’” ..."
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:25-27",
          "text": "I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! / Did not King Solomon of Israel sin in matters like this? There was not a king like him among many nations, and he was loved by his God, who made him king over all Israel—yet foreign women drew him into sin. / Must we now hear that you too are doing all this terrible evil and acting unfaithfully against our God by marrying foreign women?”"
        },
        {
          "reference": "Matthew 22:39",
          "text": "And the second is like it: ‘Love your neighbor as yourself.’"
        },
        {
          "reference": "Mark 10:6-9",
          "text": "However, from the beginning of creation, ‘God made them male and female.’ / ‘For this reason a man will leave his father and mother and be united to his wife, / and the two will become one flesh.’ So they are no longer two, but one flesh. ..."
        },
        {
          "reference": "Luke 16:18",
          "text": "Anyone who divorces his wife and marries another woman commits adultery, and he who marries a divorced woman commits adultery."
        },
        {
          "reference": "John 4:9",
          "text": "“You are a Jew,” said the woman. “How can You ask for a drink from me, a Samaritan woman?” (For Jews do not associate with Samaritans.)"
        },
        {
          "reference": "Acts 15:20",
          "text": "Instead, we should write and tell them to abstain from food polluted by idols, from sexual immorality, from the meat of strangled animals, and from blood."
        }
      ]
    },
    {
      "reference": "Genesis 34:12",
      "book": "Genesis",
      "chapter": 34,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "Make the price for the bride and the gift I am to bring as great as you like, and I’ll pay whatever you ask me. Only give me the young woman as my wife.”"
        },
        {
          "version": "NLT",
          "text": "No matter what dowry or gift you demand, I will gladly pay it—just give me the girl as my wife.”"
        },
        {
          "version": "ESV",
          "text": "Ask me for as great a bride-price and gift as you will, and I will give whatever you say to me. Only give me the young woman to be my wife.”"
        },
        {
          "version": "NKJV",
          "text": "Ask me ever so much dowry and gift, and I will give according to what you say to me; but give me the young woman as a wife.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 22:16-17",
          "text": "If a man seduces a virgin who is not pledged in marriage and sleeps with her, he must pay the full dowry for her to be his wife. / If her father absolutely refuses to give her to him, the man still must pay an amount comparable to the bridal price of a virgin."
        },
        {
          "reference": "Deuteronomy 22:28-29",
          "text": "If a man encounters a virgin who is not pledged in marriage, and he seizes her and lies with her, and they are discovered, / then the man who lay with her must pay the young woman’s father fifty shekels of silver, and she must become his wife because he has violated her. He must not divorce her as long as he lives."
        },
        {
          "reference": "1 Samuel 18:25",
          "text": "Saul replied, “Say to David, ‘The king desires no other dowry but a hundred Philistine foreskins as revenge on his enemies.’” But Saul intended to cause David’s death at the hands of the Philistines."
        },
        {
          "reference": "2 Samuel 3:14",
          "text": "Then David sent messengers to say to Ish-bosheth son of Saul, “Give me back my wife, Michal, whom I betrothed to myself for a hundred Philistine foreskins.”"
        },
        {
          "reference": "Hosea 3:2",
          "text": "So I bought her for fifteen shekels of silver and a homer and a lethech of barley."
        },
        {
          "reference": "Judges 14:2-3",
          "text": "So he returned and told his father and mother, “I have seen a daughter of the Philistines in Timnah. Now get her for me as a wife.” / But his father and mother replied, “Can’t you find a young woman among your relatives or among any of our people? Must you go to the uncircumcised Philistines to get a wife?” But Samson told his father, “Get her for me, for she is pleasing to my eyes.”"
        },
        {
          "reference": "1 Kings 9:16",
          "text": "Pharaoh king of Egypt had attacked and captured Gezer. He had set it on fire, killed the Canaanites who lived in the city, and given it as a dowry to his daughter, Solomon’s wife."
        },
        {
          "reference": "Numbers 36:6-7",
          "text": "This is what the LORD has commanded concerning the daughters of Zelophehad: They may marry anyone they please, provided they marry within a clan of the tribe of their father. / No inheritance in Israel may be transferred from tribe to tribe, because each of the Israelites is to retain the inheritance of the tribe of his fathers."
        },
        {
          "reference": "Ruth 4:10",
          "text": "Moreover, I have acquired Ruth the Moabitess, Mahlon’s widow, as my wife, to raise up the name of the deceased through his inheritance, so that his name will not disappear from among his brothers or from the gate of his home. You are witnesses today.”"
        },
        {
          "reference": "1 Corinthians 7:36-38",
          "text": "However, if someone thinks he is acting inappropriately toward his betrothed, and if she is beyond her youth and they ought to marry, let him do as he wishes; he is not sinning; they should get married. / But the man who is firmly established in his heart and under no constraint, with control over his will and resolve in his heart not to marry the virgin, he will do well. / So then, he who marries the virgin does well, but he who does not marry her does even better."
        },
        {
          "reference": "Matthew 22:25-28",
          "text": "Now there were seven brothers among us. The first one married and died without having children. So he left his wife to his brother. / The same thing happened to the second and third brothers, down to the seventh. / And last of all, the woman died. ..."
        },
        {
          "reference": "Ephesians 5:25-33",
          "text": "Husbands, love your wives, just as Christ loved the church and gave Himself up for her / to sanctify her, cleansing her by the washing with water through the word, / and to present her to Himself as a glorious church, without stain or wrinkle or any such blemish, but holy and blameless. ..."
        },
        {
          "reference": "1 Peter 3:7",
          "text": "Husbands, in the same way, treat your wives with consideration as a delicate vessel, and with honor as fellow heirs of the gracious gift of life, so that your prayers will not be hindered."
        },
        {
          "reference": "1 Timothy 5:14",
          "text": "So I advise the younger widows to marry, have children, and manage their households, denying the adversary occasion for slander."
        },
        {
          "reference": "1 Corinthians 6:16",
          "text": "Or don’t you know that he who unites himself with a prostitute is one with her in body? For it is said, “The two will become one flesh.”"
        }
      ]
    },
    {
      "reference": "Genesis 34:13",
      "book": "Genesis",
      "chapter": 34,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "Because their sister Dinah had been defiled, Jacob’s sons replied deceitfully as they spoke to Shechem and his father Hamor."
        },
        {
          "version": "NLT",
          "text": "But since Shechem had defiled their sister, Dinah, Jacob’s sons responded deceitfully to Shechem and his father, Hamor."
        },
        {
          "version": "ESV",
          "text": "The sons of Jacob answered Shechem and his father Hamor deceitfully, because he had defiled their sister Dinah."
        },
        {
          "version": "NKJV",
          "text": "But the sons of Jacob answered Shechem and Hamor his father, and spoke deceitfully, because he had defiled Dinah their sister."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 9:22-27",
          "text": "Then Joshua summoned the Gibeonites and said, “Why did you deceive us by telling us you live far away from us, when in fact you live among us? / Now therefore you are under a curse and will perpetually serve as woodcutters and water carriers for the house of my God.” / The Gibeonites answered, “Your servants were told clearly that the LORD your God had commanded His servant Moses to give you all the land and wipe out all its inhabitants before you. So we greatly feared for our lives because of you, and that is why we have done this. ..."
        },
        {
          "reference": "2 Samuel 13:23-29",
          "text": "Two years later, when Absalom’s sheepshearers were at Baal-hazor near Ephraim, he invited all the sons of the king. / And he went to the king and said, “Your servant has just hired shearers. Will the king and his servants please come with me?” / “No, my son,” the king replied, “we should not all go, or we would be a burden to you.” Although Absalom urged him, he was not willing to go, but gave him his blessing. ..."
        },
        {
          "reference": "1 Samuel 21:2",
          "text": "“The king has given me a mission,” David replied. “He told me no one is to know about the mission on which I am sending you. And I have directed my young men to meet me at a certain place."
        },
        {
          "reference": "2 Kings 10:18-19",
          "text": "Then Jehu brought all the people together and said, “Ahab served Baal a little, but Jehu will serve him a lot. / Now, therefore, summon to me all the prophets of Baal, all his servants, and all his priests. See that no one is missing, for I have a great sacrifice for Baal. Whoever is missing will not live.” But Jehu was acting deceptively in order to destroy the servants of Baal."
        },
        {
          "reference": "2 Samuel 3:27",
          "text": "When Abner returned to Hebron, Joab pulled him aside into the gateway, as if to speak to him privately, and there Joab stabbed him in the stomach. So Abner died on account of the blood of Joab’s brother Asahel."
        },
        {
          "reference": "1 Kings 2:5-6",
          "text": "Moreover, you know what Joab son of Zeruiah did to me—what he did to Abner son of Ner and Amasa son of Jether, the two commanders of the armies of Israel. He killed them in peacetime to avenge the blood of war. He stained with the blood of war the belt around his waist and the sandals on his feet. / So act according to your wisdom, and do not let his gray head go down to Sheol in peace."
        },
        {
          "reference": "Jeremiah 41:6-7",
          "text": "And Ishmael son of Nethaniah went out from Mizpah to meet them, weeping as he went. When Ishmael encountered the men, he said, “Come to Gedaliah son of Ahikam.” / And when they came into the city, Ishmael son of Nethaniah and the men with him slaughtered them and threw them into a cistern."
        },
        {
          "reference": "Proverbs 12:20",
          "text": "Deceit is in the hearts of those who devise evil, but the counselors of peace have joy."
        },
        {
          "reference": "Proverbs 26:24-26",
          "text": "A hateful man disguises himself with his speech, but he lays up deceit in his heart. / When he speaks graciously, do not believe him, for seven abominations fill his heart. / Though his hatred is concealed by deception, his wickedness will be exposed in the assembly."
        },
        {
          "reference": "Psalm 55:21",
          "text": "His speech is smooth as butter, but war is in his heart. His words are softer than oil, yet they are swords unsheathed."
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        },
        {
          "reference": "Matthew 26:48-49",
          "text": "Now the betrayer had arranged a signal with them: “The One I kiss is the man; arrest Him.” / Going directly to Jesus, he said, “Greetings, Rabbi!” and kissed Him."
        },
        {
          "reference": "Mark 14:44-45",
          "text": "Now the betrayer had arranged a signal with them: “The One I kiss is the man; arrest Him and lead Him away securely.” / Going directly to Jesus, he said, “Rabbi!” and kissed Him."
        },
        {
          "reference": "Luke 22:47-48",
          "text": "While He was still speaking, a crowd arrived, led by the man called Judas, one of the Twelve. He approached Jesus to kiss Him. / But Jesus asked him, “Judas, are you betraying the Son of Man with a kiss?”"
        },
        {
          "reference": "John 7:19",
          "text": "Has not Moses given you the law? Yet not one of you keeps it. Why are you trying to kill Me?”"
        }
      ]
    },
    {
      "reference": "Genesis 34:14",
      "book": "Genesis",
      "chapter": 34,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "They said to them, “We can’t do such a thing; we can’t give our sister to a man who is not circumcised. That would be a disgrace to us."
        },
        {
          "version": "NLT",
          "text": "They said to them, “We couldn’t possibly allow this, because you’re not circumcised. It would be a disgrace for our sister to marry a man like you!"
        },
        {
          "version": "ESV",
          "text": "They said to them, “We cannot do this thing, to give our sister to one who is uncircumcised, for that would be a disgrace to us."
        },
        {
          "version": "NKJV",
          "text": "And they said to them, “We cannot do this thing, to give our sister to one who is uncircumcised, for that would be a reproach to us."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 7:3-4",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons, / because they will turn your sons away from following Me to serve other gods. Then the anger of the LORD will burn against you, and He will swiftly destroy you."
        },
        {
          "reference": "Exodus 34:16",
          "text": "And when you take some of their daughters as brides for your sons, their daughters will prostitute themselves to their gods and cause your sons to do the same."
        },
        {
          "reference": "Joshua 23:12-13",
          "text": "For if you turn away and cling to the rest of these nations that remain among you, and if you intermarry and associate with them, / know for sure that the LORD your God will no longer drive out these nations before you. Instead, they will become for you a snare and a trap, a scourge in your sides and thorns in your eyes, until you perish from this good land that the LORD your God has given you."
        },
        {
          "reference": "2 Corinthians 6:14-17",
          "text": "Do not be unequally yoked with unbelievers. For what partnership can righteousness have with wickedness? Or what fellowship does light have with darkness? / What harmony is there between Christ and Belial? Or what does a believer have in common with an unbeliever? / What agreement can exist between the temple of God and idols? For we are the temple of the living God. As God has said: “I will dwell with them and walk among them, and I will be their God, and they will be My people.” ..."
        },
        {
          "reference": "Leviticus 20:26",
          "text": "You are to be holy to Me because I, the LORD, am holy, and I have set you apart from the nations to be My own."
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:25-27",
          "text": "I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! / Did not King Solomon of Israel sin in matters like this? There was not a king like him among many nations, and he was loved by his God, who made him king over all Israel—yet foreign women drew him into sin. / Must we now hear that you too are doing all this terrible evil and acting unfaithfully against our God by marrying foreign women?”"
        },
        {
          "reference": "Judges 14:3",
          "text": "But his father and mother replied, “Can’t you find a young woman among your relatives or among any of our people? Must you go to the uncircumcised Philistines to get a wife?” But Samson told his father, “Get her for me, for she is pleasing to my eyes.”"
        },
        {
          "reference": "1 Corinthians 7:39",
          "text": "A wife is bound to her husband as long as he lives. But if her husband dies, she is free to marry anyone she wishes, as long as he belongs to the Lord."
        },
        {
          "reference": "Deuteronomy 14:2",
          "text": "for you are a people holy to the LORD your God. The LORD has chosen you to be a people for His prized possession out of all the peoples on the face of the earth."
        },
        {
          "reference": "1 Peter 2:9",
          "text": "But you are a chosen people, a royal priesthood, a holy nation, a people for God’s own possession, to proclaim the virtues of Him who called you out of darkness into His marvelous light."
        },
        {
          "reference": "Ezra 9:12",
          "text": "Now, therefore, do not give your daughters in marriage to their sons or take their daughters for your sons. Never seek their peace or prosperity, so that you may be strong and may eat the good things of the land, leaving it as an inheritance to your sons forever.’"
        },
        {
          "reference": "2 Corinthians 11:2",
          "text": "I am jealous for you with a godly jealousy. For I promised you to one husband, to present you as a pure virgin to Christ."
        },
        {
          "reference": "Romans 12:2",
          "text": "Do not be conformed to this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what is the good, pleasing, and perfect will of God."
        },
        {
          "reference": "Leviticus 19:2",
          "text": "“Speak to the whole congregation of Israel and tell them: Be holy because I, the LORD your God, am holy."
        }
      ]
    },
    {
      "reference": "Genesis 34:15",
      "book": "Genesis",
      "chapter": 34,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "We will enter into an agreement with you on one condition only: that you become like us by circumcising all your males."
        },
        {
          "version": "NLT",
          "text": "But here is a solution. If every man among you will be circumcised like we are,"
        },
        {
          "version": "ESV",
          "text": "Only on this condition will we agree with you—that you will become as we are by every male among you being circumcised."
        },
        {
          "version": "NKJV",
          "text": "But on this condition we will consent to you: If you will become as we are, if every male of you is circumcised,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "1 Samuel 18:25",
          "text": "Saul replied, “Say to David, ‘The king desires no other dowry but a hundred Philistine foreskins as revenge on his enemies.’” But Saul intended to cause David’s death at the hands of the Philistines."
        },
        {
          "reference": "2 Samuel 3:14",
          "text": "Then David sent messengers to say to Ish-bosheth son of Saul, “Give me back my wife, Michal, whom I betrothed to myself for a hundred Philistine foreskins.”"
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Deuteronomy 7:3-4",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons, / because they will turn your sons away from following Me to serve other gods. Then the anger of the LORD will burn against you, and He will swiftly destroy you."
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Acts 15:1",
          "text": "Then some men came down from Judea and were teaching the brothers, “Unless you are circumcised according to the custom of Moses, you cannot be saved.”"
        },
        {
          "reference": "Acts 15:5",
          "text": "But some believers from the party of the Pharisees stood up and declared, “The Gentiles must be circumcised and required to obey the law of Moses.”"
        },
        {
          "reference": "Acts 15:24",
          "text": "It has come to our attention that some went out from us without our authorization and unsettled you, troubling your minds by what they said."
        },
        {
          "reference": "Galatians 5:2-3",
          "text": "Take notice: I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all. / Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law."
        },
        {
          "reference": "Romans 2:25-29",
          "text": "Circumcision has value if you observe the law, but if you break the law, your circumcision has become uncircumcision. / If a man who is not circumcised keeps the requirements of the law, will not his uncircumcision be regarded as circumcision? / The one who is physically uncircumcised yet keeps the law will condemn you who, even though you have the written code and circumcision, are a lawbreaker. ..."
        },
        {
          "reference": "1 Corinthians 7:18-19",
          "text": "Was a man already circumcised when he was called? He should not become uncircumcised. Was a man still uncircumcised when called? He should not be circumcised. / Circumcision is nothing and uncircumcision is nothing. Keeping God’s commandments is what counts."
        },
        {
          "reference": "Philippians 3:2-3",
          "text": "Watch out for those dogs, those workers of evil, those mutilators of the flesh! / For it is we who are the circumcision, we who worship by the Spirit of God, who glory in Christ Jesus, and who put no confidence in the flesh—"
        },
        {
          "reference": "Colossians 2:11",
          "text": "In Him you were also circumcised, in the putting off of your sinful nature, with the circumcision performed by Christ and not by human hands."
        }
      ]
    },
    {
      "reference": "Genesis 34:16",
      "book": "Genesis",
      "chapter": 34,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "Then we will give you our daughters and take your daughters for ourselves. We’ll settle among you and become one people with you."
        },
        {
          "version": "NLT",
          "text": "then we will give you our daughters, and we’ll take your daughters for ourselves. We will live among you and become one people."
        },
        {
          "version": "ESV",
          "text": "Then we will give our daughters to you, and we will take your daughters to ourselves, and we will dwell with you and become one people."
        },
        {
          "version": "NKJV",
          "text": "then we will give our daughters to you, and we will take your daughters to us; and we will dwell with you, and we will become one people."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 34:15-16",
          "text": "Do not make a covenant with the inhabitants of the land, for when they prostitute themselves to their gods and sacrifice to them, they will invite you, and you will eat their sacrifices. / And when you take some of their daughters as brides for your sons, their daughters will prostitute themselves to their gods and cause your sons to do the same."
        },
        {
          "reference": "Deuteronomy 7:3-4",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons, / because they will turn your sons away from following Me to serve other gods. Then the anger of the LORD will burn against you, and He will swiftly destroy you."
        },
        {
          "reference": "2 Corinthians 6:14-18",
          "text": "Do not be unequally yoked with unbelievers. For what partnership can righteousness have with wickedness? Or what fellowship does light have with darkness? / What harmony is there between Christ and Belial? Or what does a believer have in common with an unbeliever? / What agreement can exist between the temple of God and idols? For we are the temple of the living God. As God has said: “I will dwell with them and walk among them, and I will be their God, and they will be My people.” ..."
        },
        {
          "reference": "Joshua 23:12-13",
          "text": "For if you turn away and cling to the rest of these nations that remain among you, and if you intermarry and associate with them, / know for sure that the LORD your God will no longer drive out these nations before you. Instead, they will become for you a snare and a trap, a scourge in your sides and thorns in your eyes, until you perish from this good land that the LORD your God has given you."
        },
        {
          "reference": "Nehemiah 13:25-27",
          "text": "I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! / Did not King Solomon of Israel sin in matters like this? There was not a king like him among many nations, and he was loved by his God, who made him king over all Israel—yet foreign women drew him into sin. / Must we now hear that you too are doing all this terrible evil and acting unfaithfully against our God by marrying foreign women?”"
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Judges 3:5-6",
          "text": "Thus the Israelites continued to live among the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites. / And they took the daughters of these people in marriage, gave their own daughters to their sons, and served their gods."
        },
        {
          "reference": "Ezra 9:1-2",
          "text": "After these things had been accomplished, the leaders approached me and said, “The people of Israel, including the priests and Levites, have not kept themselves separate from the surrounding peoples whose abominations are like those of the Canaanites, Hittites, Perizzites, Jebusites, Ammonites, Moabites, Egyptians, and Amorites. / Indeed, the Israelites have taken some of their daughters as wives for themselves and their sons, so that the holy seed has been mixed with the people of the land. And the leaders and officials have taken the lead in this unfaithfulness!”"
        },
        {
          "reference": "1 Corinthians 7:39",
          "text": "A wife is bound to her husband as long as he lives. But if her husband dies, she is free to marry anyone she wishes, as long as he belongs to the Lord."
        },
        {
          "reference": "1 Corinthians 5:9-11",
          "text": "I wrote you in my letter not to associate with sexually immoral people. / I was not including the sexually immoral of this world, or the greedy and swindlers, or idolaters. In that case you would have to leave this world. / But now I am writing you not to associate with anyone who claims to be a brother but is sexually immoral or greedy, an idolater or a verbal abuser, a drunkard or a swindler. With such a man do not even eat."
        },
        {
          "reference": "1 Peter 2:9",
          "text": "But you are a chosen people, a royal priesthood, a holy nation, a people for God’s own possession, to proclaim the virtues of Him who called you out of darkness into His marvelous light."
        },
        {
          "reference": "Leviticus 20:26",
          "text": "You are to be holy to Me because I, the LORD, am holy, and I have set you apart from the nations to be My own."
        },
        {
          "reference": "2 Corinthians 11:2",
          "text": "I am jealous for you with a godly jealousy. For I promised you to one husband, to present you as a pure virgin to Christ."
        },
        {
          "reference": "Romans 12:2",
          "text": "Do not be conformed to this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what is the good, pleasing, and perfect will of God."
        },
        {
          "reference": "Ephesians 5:11",
          "text": "Have no fellowship with the fruitless deeds of darkness, but rather expose them."
        }
      ]
    },
    {
      "reference": "Genesis 34:17",
      "book": "Genesis",
      "chapter": 34,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "But if you will not agree to be circumcised, we’ll take our sister and go.”"
        },
        {
          "version": "NLT",
          "text": "But if you don’t agree to be circumcised, we will take her and be on our way.”"
        },
        {
          "version": "ESV",
          "text": "But if you will not listen to us and be circumcised, then we will take our daughter, and we will be gone.”"
        },
        {
          "version": "NKJV",
          "text": "But if you will not heed us and be circumcised, then we will take our daughter and be gone.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:14",
          "text": "But if any male is not circumcised, he will be cut off from his people; he has broken My covenant.”"
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "1 Samuel 18:25-27",
          "text": "Saul replied, “Say to David, ‘The king desires no other dowry but a hundred Philistine foreskins as revenge on his enemies.’” But Saul intended to cause David’s death at the hands of the Philistines. / When the servants reported these terms to David, he was pleased to become the king’s son-in-law. Before the wedding day arrived, / David and his men went out and killed two hundred Philistines. He brought their foreskins and presented them as payment in full to become the king’s son-in-law. Then Saul gave his daughter Michal to David in marriage."
        },
        {
          "reference": "2 Samuel 3:14",
          "text": "Then David sent messengers to say to Ish-bosheth son of Saul, “Give me back my wife, Michal, whom I betrothed to myself for a hundred Philistine foreskins.”"
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:23-27",
          "text": "In those days I also saw Jews who had married women from Ashdod, Ammon, and Moab. / Half of their children spoke the language of Ashdod or of the other peoples, but could not speak the language of Judah. / I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! ..."
        },
        {
          "reference": "Ezekiel 44:7-9",
          "text": "In addition to all your other abominations, you brought in foreigners uncircumcised in both heart and flesh to occupy My sanctuary; you defiled My temple when you offered My food—the fat and the blood; you broke My covenant. / And you have not kept charge of My holy things, but have appointed others to keep charge of My sanctuary for you.’ / This is what the Lord GOD says: No foreigner uncircumcised in heart and flesh may enter My sanctuary—not even a foreigner who lives among the Israelites."
        },
        {
          "reference": "Acts 15:1",
          "text": "Then some men came down from Judea and were teaching the brothers, “Unless you are circumcised according to the custom of Moses, you cannot be saved.”"
        },
        {
          "reference": "Acts 15:5",
          "text": "But some believers from the party of the Pharisees stood up and declared, “The Gentiles must be circumcised and required to obey the law of Moses.”"
        },
        {
          "reference": "Acts 15:24",
          "text": "It has come to our attention that some went out from us without our authorization and unsettled you, troubling your minds by what they said."
        },
        {
          "reference": "Romans 2:25-29",
          "text": "Circumcision has value if you observe the law, but if you break the law, your circumcision has become uncircumcision. / If a man who is not circumcised keeps the requirements of the law, will not his uncircumcision be regarded as circumcision? / The one who is physically uncircumcised yet keeps the law will condemn you who, even though you have the written code and circumcision, are a lawbreaker. ..."
        },
        {
          "reference": "1 Corinthians 7:18-19",
          "text": "Was a man already circumcised when he was called? He should not become uncircumcised. Was a man still uncircumcised when called? He should not be circumcised. / Circumcision is nothing and uncircumcision is nothing. Keeping God’s commandments is what counts."
        },
        {
          "reference": "Galatians 2:3-5",
          "text": "Yet not even Titus, who was with me, was compelled to be circumcised, even though he was a Greek. / This issue arose because some false brothers had come in under false pretenses to spy on our freedom in Christ Jesus, in order to enslave us. / We did not give in to them for a moment, so that the truth of the gospel would remain with you."
        }
      ]
    },
    {
      "reference": "Genesis 34:18",
      "book": "Genesis",
      "chapter": 34,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "Their proposal seemed good to Hamor and his son Shechem."
        },
        {
          "version": "NLT",
          "text": "Hamor and his son Shechem agreed to their proposal."
        },
        {
          "version": "ESV",
          "text": "Their words pleased Hamor and Hamor’s son Shechem."
        },
        {
          "version": "NKJV",
          "text": "And their words pleased Hamor and Shechem, Hamor’s son."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Exodus 34:16",
          "text": "And when you take some of their daughters as brides for your sons, their daughters will prostitute themselves to their gods and cause your sons to do the same."
        },
        {
          "reference": "Deuteronomy 7:3-4",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons, / because they will turn your sons away from following Me to serve other gods. Then the anger of the LORD will burn against you, and He will swiftly destroy you."
        },
        {
          "reference": "Joshua 9:14-15",
          "text": "Then the men of Israel sampled their provisions but did not seek the counsel of the LORD. / And Joshua made a treaty of peace with them to let them live, and the leaders of the congregation swore an oath to them."
        },
        {
          "reference": "Judges 14:1-3",
          "text": "One day Samson went down to Timnah, where he saw a young Philistine woman. / So he returned and told his father and mother, “I have seen a daughter of the Philistines in Timnah. Now get her for me as a wife.” / But his father and mother replied, “Can’t you find a young woman among your relatives or among any of our people? Must you go to the uncircumcised Philistines to get a wife?” But Samson told his father, “Get her for me, for she is pleasing to my eyes.”"
        },
        {
          "reference": "2 Samuel 13:12-14",
          "text": "“No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” / But Amnon refused to listen to her, and being stronger, he violated her and lay with her."
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:25-27",
          "text": "I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! / Did not King Solomon of Israel sin in matters like this? There was not a king like him among many nations, and he was loved by his God, who made him king over all Israel—yet foreign women drew him into sin. / Must we now hear that you too are doing all this terrible evil and acting unfaithfully against our God by marrying foreign women?”"
        },
        {
          "reference": "Psalm 106:35",
          "text": "but they mingled with the nations and adopted their customs."
        },
        {
          "reference": "Proverbs 6:32",
          "text": "He who commits adultery lacks judgment; whoever does so destroys himself."
        },
        {
          "reference": "Proverbs 7:21-23",
          "text": "With her great persuasion she entices him; with her flattering lips she lures him. / He follows her on impulse, like an ox going to the slaughter, like a deer bounding into a trap, / until an arrow pierces his liver, like a bird darting into a snare—not knowing it will cost him his life."
        },
        {
          "reference": "Matthew 5:28",
          "text": "But I tell you that anyone who looks at a woman to lust after her has already committed adultery with her in his heart."
        },
        {
          "reference": "Matthew 15:19",
          "text": "For out of the heart come evil thoughts, murder, adultery, sexual immorality, theft, false testimony, and slander."
        },
        {
          "reference": "Mark 7:21-23",
          "text": "For from within the hearts of men come evil thoughts, sexual immorality, theft, murder, adultery, / greed, wickedness, deceit, debauchery, envy, slander, arrogance, and foolishness. / All these evils come from within, and these are what defile a man.”"
        },
        {
          "reference": "John 8:34",
          "text": "Jesus replied, “Truly, truly, I tell you, everyone who sins is a slave to sin."
        }
      ]
    },
    {
      "reference": "Genesis 34:19",
      "book": "Genesis",
      "chapter": 34,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "The young man, who was the most honored of all his father’s family, lost no time in doing what they said, because he was delighted with Jacob’s daughter."
        },
        {
          "version": "NLT",
          "text": "Shechem wasted no time in acting on this request, for he wanted Jacob’s daughter desperately. Shechem was a highly respected member of his family,"
        },
        {
          "version": "ESV",
          "text": "And the young man did not delay to do the thing, because he delighted in Jacob’s daughter. Now he was the most honored of all his father’s house."
        },
        {
          "version": "NKJV",
          "text": "So the young man did not delay to do the thing, because he delighted in Jacob’s daughter. He was more honorable than all the household of his father."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:18",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.”"
        },
        {
          "reference": "Genesis 24:67",
          "text": "And Isaac brought her into the tent of his mother Sarah and took Rebekah as his wife. And Isaac loved her and was comforted after his mother’s death."
        },
        {
          "reference": "Genesis 28:2",
          "text": "“Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 29:20",
          "text": "So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her."
        },
        {
          "reference": "Genesis 24:3-4",
          "text": "and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling, / but will go to my country and my kindred to take a wife for my son Isaac.”"
        },
        {
          "reference": "Genesis 12:11-13",
          "text": "As he was about to enter Egypt, he said to his wife Sarai, “Look, I know that you are a beautiful woman, / and when the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live. / Please say you are my sister, so that I will be treated well for your sake, and on account of you my life will be spared.”"
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 27:46",
          "text": "Then Rebekah said to Isaac, “I am weary of my life because of these Hittite women. If Jacob takes a Hittite wife from among them, what good is my life?”"
        },
        {
          "reference": "Genesis 6:2",
          "text": "the sons of God saw that the daughters of men were beautiful, and they took as wives whomever they chose."
        },
        {
          "reference": "Genesis 21:21",
          "text": "And while he was dwelling in the Wilderness of Paran, his mother got a wife for him from the land of Egypt."
        },
        {
          "reference": "Exodus 2:21",
          "text": "Moses agreed to stay with the man, and he gave his daughter Zipporah to Moses in marriage."
        },
        {
          "reference": "Judges 14:2-3",
          "text": "So he returned and told his father and mother, “I have seen a daughter of the Philistines in Timnah. Now get her for me as a wife.” / But his father and mother replied, “Can’t you find a young woman among your relatives or among any of our people? Must you go to the uncircumcised Philistines to get a wife?” But Samson told his father, “Get her for me, for she is pleasing to my eyes.”"
        },
        {
          "reference": "1 Samuel 18:20-27",
          "text": "Now Saul’s daughter Michal loved David, and when this was reported to Saul, it pleased him. / “I will give her to David,” Saul thought, “so that she may be a snare to him, and the hand of the Philistines may be against him.” So Saul said to David, “For a second time now you can be my son-in-law.” / Then Saul ordered his servants, “Speak to David privately and tell him, ‘Behold, the king is pleased with you, and all his servants love you. Now therefore, become his son-in-law.’” ..."
        },
        {
          "reference": "2 Samuel 13:1-2",
          "text": "After some time, David’s son Amnon fell in love with Tamar, the beautiful sister of David’s son Absalom. / Amnon was sick with frustration over his sister Tamar, for she was a virgin, and it seemed implausible for him to do anything to her."
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        }
      ]
    },
    {
      "reference": "Genesis 34:20",
      "book": "Genesis",
      "chapter": 34,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "So Hamor and his son Shechem went to the gate of their city to speak to the men of their city."
        },
        {
          "version": "NLT",
          "text": "and he went with his father, Hamor, to present this proposal to the leaders at the town gate."
        },
        {
          "version": "ESV",
          "text": "So Hamor and his son Shechem came to the gate of their city and spoke to the men of their city, saying,"
        },
        {
          "version": "NKJV",
          "text": "And Hamor and Shechem his son came to the gate of their city, and spoke with the men of their city, saying:"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 23:10-18",
          "text": "Now Ephron was sitting among the sons of Heth. So in the presence of all the Hittites who had come to the gate of his city, Ephron the Hittite answered Abraham, / “No, my lord. Listen to me. I give you the field, and I give you the cave that is in it. I give it to you in the presence of my people. Bury your dead.” / Again Abraham bowed down before the people of the land ..."
        },
        {
          "reference": "Genesis 34:8-17",
          "text": "But Hamor said to them, “My son Shechem longs for your daughter. Please give her to him as his wife. / Intermarry with us; give us your daughters and take our daughters for yourselves. / You may settle among us, and the land will be open to you. Live here, move about freely, and acquire your own property.” ..."
        },
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Joshua 9:6-15",
          "text": "They went to Joshua in the camp at Gilgal and said to him and the men of Israel, “We have come from a distant land; please make a treaty with us.” / But the men of Israel said to the Hivites, “Perhaps you dwell near us. How can we make a treaty with you?” / “We are your servants,” they said to Joshua. Then Joshua asked them, “Who are you and where have you come from?” ..."
        },
        {
          "reference": "2 Samuel 13:23-29",
          "text": "Two years later, when Absalom’s sheepshearers were at Baal-hazor near Ephraim, he invited all the sons of the king. / And he went to the king and said, “Your servant has just hired shearers. Will the king and his servants please come with me?” / “No, my son,” the king replied, “we should not all go, or we would be a burden to you.” Although Absalom urged him, he was not willing to go, but gave him his blessing. ..."
        },
        {
          "reference": "2 Samuel 13:28-29",
          "text": "Now Absalom had ordered his young men, “Watch Amnon until his heart is merry with wine, and when I order you to strike Amnon down, you are to kill him. Do not be afraid. Have I not commanded you? Be courageous and valiant!” / So Absalom’s young men did to Amnon just as Absalom had ordered. Then all the other sons of the king got up, and each one fled on his mule."
        },
        {
          "reference": "1 Kings 21:8-13",
          "text": "Then Jezebel wrote letters in Ahab’s name, sealed them with his seal, and sent them to the elders and nobles who lived with Naboth in his city. / In the letters she wrote: “Proclaim a fast and give Naboth a seat of honor among the people. / But seat two scoundrels opposite him and have them testify, ‘You have cursed both God and the king!’ Then take him out and stone him to death.” ..."
        },
        {
          "reference": "Proverbs 1:10-19",
          "text": "My son, if sinners entice you, do not yield to them. / If they say, “Come along, let us lie in wait for blood, let us ambush the innocent without cause, / let us swallow them alive like Sheol, and whole like those descending into the Pit. ..."
        },
        {
          "reference": "Proverbs 4:14-17",
          "text": "Do not set foot on the path of the wicked or walk in the way of evildoers. / Avoid it; do not travel on it. Turn from it and pass on by. / For they cannot sleep unless they do evil; they are deprived of slumber until they make someone fall. ..."
        },
        {
          "reference": "Proverbs 6:16-19",
          "text": "There are six things that the LORD hates, seven that are detestable to Him: / haughty eyes, a lying tongue, hands that shed innocent blood, / a heart that devises wicked schemes, feet that run swiftly to evil, ..."
        },
        {
          "reference": "Proverbs 12:5",
          "text": "The plans of the righteous are just, but the counsel of the wicked leads to deceit."
        },
        {
          "reference": "Proverbs 14:15",
          "text": "The simple man believes every word, but the prudent man watches his steps."
        },
        {
          "reference": "Proverbs 26:24-26",
          "text": "A hateful man disguises himself with his speech, but he lays up deceit in his heart. / When he speaks graciously, do not believe him, for seven abominations fill his heart. / Though his hatred is concealed by deception, his wickedness will be exposed in the assembly."
        },
        {
          "reference": "Jeremiah 9:8",
          "text": "Their tongues are deadly arrows; they speak deception. With his mouth a man speaks peace to his neighbor, but in his heart he sets a trap for him."
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        }
      ]
    },
    {
      "reference": "Genesis 34:21",
      "book": "Genesis",
      "chapter": 34,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "“These men are friendly toward us,” they said. “Let them live in our land and trade in it; the land has plenty of room for them. We can marry their daughters and they can marry ours."
        },
        {
          "version": "NLT",
          "text": "“These men are our friends,” they said. “Let’s invite them to live here among us and trade freely. Look, the land is large enough to hold them. We can take their daughters as wives and let them marry ours."
        },
        {
          "version": "ESV",
          "text": "“These men are at peace with us; let them dwell in the land and trade in it, for behold, the land is large enough for them. Let us take their daughters as wives, and let us give them our daughters."
        },
        {
          "version": "NKJV",
          "text": "“These men are at peace with us. Therefore let them dwell in the land and trade in it. For indeed the land is large enough for them. Let us take their daughters to us as wives, and let us give them our daughters."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 9:15",
          "text": "And Joshua made a treaty of peace with them to let them live, and the leaders of the congregation swore an oath to them."
        },
        {
          "reference": "1 Samuel 18:22",
          "text": "Then Saul ordered his servants, “Speak to David privately and tell him, ‘Behold, the king is pleased with you, and all his servants love you. Now therefore, become his son-in-law.’”"
        },
        {
          "reference": "2 Samuel 3:12-13",
          "text": "Then Abner sent messengers on his behalf to say to David, “To whom does the land belong? Make your covenant with me, and surely my hand will be with you to bring all Israel over to you.” / “Good,” replied David, “I will make a covenant with you. But there is one thing I require of you: Do not appear before me unless you bring Saul’s daughter Michal when you come to see me.”"
        },
        {
          "reference": "1 Kings 5:12",
          "text": "And the LORD gave Solomon wisdom, as He had promised him. There was peace between Hiram and Solomon, and the two of them made a treaty."
        },
        {
          "reference": "2 Kings 11:4",
          "text": "Then in the seventh year, Jehoiada sent for the commanders of hundreds, the Carites, and the guards, and had them brought into the house of the LORD. There he made a covenant with them and put them under oath. He showed them the king’s son"
        },
        {
          "reference": "Nehemiah 9:24-25",
          "text": "So their descendants went in and possessed the land; You subdued before them the Canaanites dwelling in the land. You delivered into their hands the kings and peoples of the land, to do with them as they wished. / They captured fortified cities and fertile land and took houses full of all goods, wells already dug, vineyards, olive groves, and fruit trees in abundance. So they ate and were filled; they grew fat and delighted in Your great goodness."
        },
        {
          "reference": "Esther 8:17",
          "text": "In every province and every city, wherever the king’s edict and decree reached, there was joy and gladness among the Jews, with feasting and celebrating. And many of the people of the land themselves became Jews, because the fear of the Jews had fallen upon them."
        },
        {
          "reference": "Psalm 120:7",
          "text": "I am in favor of peace; but when I speak, they want war."
        },
        {
          "reference": "Proverbs 16:7",
          "text": "When a man’s ways please the LORD, He makes even the man’s enemies live at peace with him."
        },
        {
          "reference": "Isaiah 32:18",
          "text": "Then my people will dwell in a peaceful place, in safe and secure places of rest."
        },
        {
          "reference": "Jeremiah 29:7",
          "text": "Seek the prosperity of the city to which I have sent you as exiles. Pray to the LORD on its behalf, for if it prospers, you too will prosper.”"
        },
        {
          "reference": "Ezekiel 16:14",
          "text": "Your fame spread among the nations on account of your beauty, for it was perfect in the splendor I bestowed on you, declares the Lord GOD."
        },
        {
          "reference": "Matthew 5:9",
          "text": "Blessed are the peacemakers, for they will be called sons of God."
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        },
        {
          "reference": "Luke 10:5-6",
          "text": "Whatever house you enter, begin by saying, ‘Peace to this house.’ / If a man of peace is there, your peace will rest on him; if not, it will return to you."
        }
      ]
    },
    {
      "reference": "Genesis 34:22",
      "book": "Genesis",
      "chapter": 34,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "But the men will agree to live with us as one people only on the condition that our males be circumcised, as they themselves are."
        },
        {
          "version": "NLT",
          "text": "But they will consider staying here and becoming one people with us only if all of our men are circumcised, just as they are."
        },
        {
          "version": "ESV",
          "text": "Only on this condition will the men agree to dwell with us to become one people—when every male among us is circumcised as they are circumcised."
        },
        {
          "version": "NKJV",
          "text": "Only on this condition will the men consent to dwell with us, to be one people: if every male among us is circumcised as they are circumcised."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 15:1-5",
          "text": "Then some men came down from Judea and were teaching the brothers, “Unless you are circumcised according to the custom of Moses, you cannot be saved.” / And after engaging these men in sharp debate, Paul and Barnabas were appointed, along with some other believers, to go up to Jerusalem to see the apostles and elders about this question. / Sent on their way by the church, they passed through Phoenicia and Samaria, recounting the conversion of the Gentiles and bringing great joy to all the brothers. ..."
        },
        {
          "reference": "Galatians 5:2-3",
          "text": "Take notice: I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all. / Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law."
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "1 Corinthians 7:18-19",
          "text": "Was a man already circumcised when he was called? He should not become uncircumcised. Was a man still uncircumcised when called? He should not be circumcised. / Circumcision is nothing and uncircumcision is nothing. Keeping God’s commandments is what counts."
        },
        {
          "reference": "Romans 2:25-29",
          "text": "Circumcision has value if you observe the law, but if you break the law, your circumcision has become uncircumcision. / If a man who is not circumcised keeps the requirements of the law, will not his uncircumcision be regarded as circumcision? / The one who is physically uncircumcised yet keeps the law will condemn you who, even though you have the written code and circumcision, are a lawbreaker. ..."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "Acts 16:3",
          "text": "Paul wanted Timothy to accompany him, so he took him and circumcised him on account of the Jews in that area, for they all knew that his father was a Greek."
        },
        {
          "reference": "Philippians 3:2-3",
          "text": "Watch out for those dogs, those workers of evil, those mutilators of the flesh! / For it is we who are the circumcision, we who worship by the Spirit of God, who glory in Christ Jesus, and who put no confidence in the flesh—"
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        },
        {
          "reference": "Colossians 2:11-13",
          "text": "In Him you were also circumcised, in the putting off of your sinful nature, with the circumcision performed by Christ and not by human hands. / And having been buried with Him in baptism, you were raised with Him through your faith in the power of God, who raised Him from the dead. / When you were dead in your trespasses and in the uncircumcision of your sinful nature, God made you alive with Christ. He forgave us all our trespasses,"
        },
        {
          "reference": "Deuteronomy 10:16",
          "text": "Circumcise your hearts, therefore, and stiffen your necks no more."
        },
        {
          "reference": "Acts 21:21",
          "text": "But they are under the impression that you teach all the Jews who live among the Gentiles to forsake Moses, telling them not to circumcise their children or observe our customs."
        },
        {
          "reference": "Jeremiah 4:4",
          "text": "Circumcise yourselves to the LORD, and remove the foreskins of your hearts, O men of Judah and people of Jerusalem. Otherwise, My wrath will break out like fire and burn with no one to extinguish it, because of your evil deeds.”"
        },
        {
          "reference": "Romans 4:11-12",
          "text": "And he received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. So then, he is the father of all who believe but are not circumcised, in order that righteousness might be credited to them. / And he is also the father of the circumcised who not only are circumcised, but who also walk in the footsteps of the faith that our father Abraham had before he was circumcised."
        },
        {
          "reference": "Ezekiel 44:7-9",
          "text": "In addition to all your other abominations, you brought in foreigners uncircumcised in both heart and flesh to occupy My sanctuary; you defiled My temple when you offered My food—the fat and the blood; you broke My covenant. / And you have not kept charge of My holy things, but have appointed others to keep charge of My sanctuary for you.’ / This is what the Lord GOD says: No foreigner uncircumcised in heart and flesh may enter My sanctuary—not even a foreigner who lives among the Israelites."
        }
      ]
    },
    {
      "reference": "Genesis 34:23",
      "book": "Genesis",
      "chapter": 34,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "Won’t their livestock, their property and all their other animals become ours? So let us agree to their terms, and they will settle among us.”"
        },
        {
          "version": "NLT",
          "text": "But if we do this, all their livestock and possessions will eventually be ours. Come, let’s agree to their terms and let them settle here among us.”"
        },
        {
          "version": "ESV",
          "text": "Will not their livestock, their property and all their beasts be ours? Only let us agree with them, and they will dwell with us.”"
        },
        {
          "version": "NKJV",
          "text": "Will not their livestock, their property, and every animal of theirs be ours? Only let us consent to them, and they will dwell with us.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:12-14",
          "text": "Generation after generation, every male must be circumcised when he is eight days old, including those born in your household and those purchased from a foreigner—even those who are not your offspring. / Whether they are born in your household or purchased, they must be circumcised. My covenant in your flesh will be an everlasting covenant. / But if any male is not circumcised, he will be cut off from his people; he has broken My covenant.”"
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "1 Samuel 18:25",
          "text": "Saul replied, “Say to David, ‘The king desires no other dowry but a hundred Philistine foreskins as revenge on his enemies.’” But Saul intended to cause David’s death at the hands of the Philistines."
        },
        {
          "reference": "2 Samuel 3:14",
          "text": "Then David sent messengers to say to Ish-bosheth son of Saul, “Give me back my wife, Michal, whom I betrothed to myself for a hundred Philistine foreskins.”"
        },
        {
          "reference": "1 Kings 3:1",
          "text": "Later, Solomon formed an alliance with Pharaoh king of Egypt by marrying his daughter. Solomon brought her to the City of David until he had finished building his palace and the house of the LORD, as well as the wall around Jerusalem."
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Nehemiah 13:23-27",
          "text": "In those days I also saw Jews who had married women from Ashdod, Ammon, and Moab. / Half of their children spoke the language of Ashdod or of the other peoples, but could not speak the language of Judah. / I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! ..."
        },
        {
          "reference": "Psalm 105:44",
          "text": "He gave them the lands of the nations, that they might inherit the fruit of others’ labor,"
        },
        {
          "reference": "Proverbs 1:19",
          "text": "Such is the fate of all who are greedy, whose unjust gain takes the lives of its possessors."
        },
        {
          "reference": "Proverbs 15:27",
          "text": "He who is greedy for unjust gain brings trouble on his household, but he who hates bribes will live."
        },
        {
          "reference": "Isaiah 56:6-7",
          "text": "And the foreigners who join themselves to the LORD to minister to Him, to love the name of the LORD, and to be His servants—all who keep the Sabbath without profaning it and who hold fast to My covenant— / I will bring them to My holy mountain and make them joyful in My house of prayer. Their burnt offerings and sacrifices will be accepted on My altar, for My house will be called a house of prayer for all the nations.”"
        },
        {
          "reference": "Jeremiah 9:25-26",
          "text": "“Behold, the days are coming,” declares the LORD, “when I will punish all who are circumcised only in the flesh— / Egypt, Judah, Edom, Ammon, Moab, and all the inhabitants of the desert who clip the hair of their temples. For all these nations are uncircumcised, and the whole house of Israel is uncircumcised in heart.”"
        },
        {
          "reference": "Ezekiel 16:26-29",
          "text": "You prostituted yourself with your lustful neighbors, the Egyptians, and increased your promiscuity to provoke Me to anger. / Therefore I stretched out My hand against you and reduced your portion. I gave you over to the desire of those who hate you, the daughters of the Philistines, who were ashamed of your lewd conduct. / Then you prostituted yourself with the Assyrians, because you were not yet satisfied. Even after that, you were still not satisfied. ..."
        },
        {
          "reference": "Hosea 7:8-9",
          "text": "Ephraim mixes with the nations; Ephraim is an unturned cake. / Foreigners consume his strength, but he does not notice. Even his hair is streaked with gray, but he does not know."
        }
      ]
    },
    {
      "reference": "Genesis 34:24",
      "book": "Genesis",
      "chapter": 34,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "All the men who went out of the city gate agreed with Hamor and his son Shechem, and every male in the city was circumcised."
        },
        {
          "version": "NLT",
          "text": "So all the men in the town council agreed with Hamor and Shechem, and every male in the town was circumcised."
        },
        {
          "version": "ESV",
          "text": "And all who went out of the gate of his city listened to Hamor and his son Shechem, and every male was circumcised, all who went out of the gate of his city."
        },
        {
          "version": "NKJV",
          "text": "And all who went out of the gate of his city heeded Hamor and Shechem his son; every male was circumcised, all who went out of the gate of his city."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:10-14",
          "text": "This is My covenant with you and your descendants after you, which you are to keep: Every male among you must be circumcised. / You are to circumcise the flesh of your foreskin, and this will be a sign of the covenant between Me and you. / Generation after generation, every male must be circumcised when he is eight days old, including those born in your household and those purchased from a foreigner—even those who are not your offspring. ..."
        },
        {
          "reference": "Exodus 12:48",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it."
        },
        {
          "reference": "Joshua 5:2-9",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth. / Now this is why Joshua circumcised them: All those who came out of Egypt—all the men of war—had died on the journey in the wilderness after they had left Egypt. ..."
        },
        {
          "reference": "1 Samuel 18:25-27",
          "text": "Saul replied, “Say to David, ‘The king desires no other dowry but a hundred Philistine foreskins as revenge on his enemies.’” But Saul intended to cause David’s death at the hands of the Philistines. / When the servants reported these terms to David, he was pleased to become the king’s son-in-law. Before the wedding day arrived, / David and his men went out and killed two hundred Philistines. He brought their foreskins and presented them as payment in full to become the king’s son-in-law. Then Saul gave his daughter Michal to David in marriage."
        },
        {
          "reference": "2 Samuel 3:14",
          "text": "Then David sent messengers to say to Ish-bosheth son of Saul, “Give me back my wife, Michal, whom I betrothed to myself for a hundred Philistine foreskins.”"
        },
        {
          "reference": "Acts 15:1",
          "text": "Then some men came down from Judea and were teaching the brothers, “Unless you are circumcised according to the custom of Moses, you cannot be saved.”"
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Romans 2:25-29",
          "text": "Circumcision has value if you observe the law, but if you break the law, your circumcision has become uncircumcision. / If a man who is not circumcised keeps the requirements of the law, will not his uncircumcision be regarded as circumcision? / The one who is physically uncircumcised yet keeps the law will condemn you who, even though you have the written code and circumcision, are a lawbreaker. ..."
        },
        {
          "reference": "Galatians 5:2-6",
          "text": "Take notice: I, Paul, tell you that if you let yourselves be circumcised, Christ will be of no value to you at all. / Again I testify to every man who gets himself circumcised that he is obligated to obey the whole law. / You who are trying to be justified by the law have been severed from Christ; you have fallen away from grace. ..."
        },
        {
          "reference": "Colossians 2:11-13",
          "text": "In Him you were also circumcised, in the putting off of your sinful nature, with the circumcision performed by Christ and not by human hands. / And having been buried with Him in baptism, you were raised with Him through your faith in the power of God, who raised Him from the dead. / When you were dead in your trespasses and in the uncircumcision of your sinful nature, God made you alive with Christ. He forgave us all our trespasses,"
        },
        {
          "reference": "Philippians 3:3",
          "text": "For it is we who are the circumcision, we who worship by the Spirit of God, who glory in Christ Jesus, and who put no confidence in the flesh—"
        },
        {
          "reference": "Deuteronomy 10:16",
          "text": "Circumcise your hearts, therefore, and stiffen your necks no more."
        },
        {
          "reference": "Jeremiah 4:4",
          "text": "Circumcise yourselves to the LORD, and remove the foreskins of your hearts, O men of Judah and people of Jerusalem. Otherwise, My wrath will break out like fire and burn with no one to extinguish it, because of your evil deeds.”"
        },
        {
          "reference": "Ezekiel 44:7-9",
          "text": "In addition to all your other abominations, you brought in foreigners uncircumcised in both heart and flesh to occupy My sanctuary; you defiled My temple when you offered My food—the fat and the blood; you broke My covenant. / And you have not kept charge of My holy things, but have appointed others to keep charge of My sanctuary for you.’ / This is what the Lord GOD says: No foreigner uncircumcised in heart and flesh may enter My sanctuary—not even a foreigner who lives among the Israelites."
        },
        {
          "reference": "Leviticus 12:3",
          "text": "And on the eighth day the flesh of the boy’s foreskin is to be circumcised."
        }
      ]
    },
    {
      "reference": "Genesis 34:25",
      "book": "Genesis",
      "chapter": 34,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "Three days later, while all of them were still in pain, two of Jacob’s sons, Simeon and Levi, Dinah’s brothers, took their swords and attacked the unsuspecting city, killing every male."
        },
        {
          "version": "NLT",
          "text": "But three days later, when their wounds were still sore, two of Jacob’s sons, Simeon and Levi, who were Dinah’s full brothers, took their swords and entered the town without opposition. Then they slaughtered every male there,"
        },
        {
          "version": "ESV",
          "text": "On the third day, when they were sore, two of the sons of Jacob, Simeon and Levi, Dinah’s brothers, took their swords and came against the city while it felt secure and killed all the males."
        },
        {
          "version": "NKJV",
          "text": "Now it came to pass on the third day, when they were in pain, that two of the sons of Jacob, Simeon and Levi, Dinah’s brothers, each took his sword and came boldly upon the city and killed all the males."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Joshua 5:2-3",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth."
        },
        {
          "reference": "2 Samuel 13:28-29",
          "text": "Now Absalom had ordered his young men, “Watch Amnon until his heart is merry with wine, and when I order you to strike Amnon down, you are to kill him. Do not be afraid. Have I not commanded you? Be courageous and valiant!” / So Absalom’s young men did to Amnon just as Absalom had ordered. Then all the other sons of the king got up, and each one fled on his mule."
        },
        {
          "reference": "Exodus 32:27-28",
          "text": "He told them, “This is what the LORD, the God of Israel, says: ‘Each of you men is to fasten his sword to his side, go back and forth through the camp from gate to gate, and slay his brother, his friend, and his neighbor.’” / The Levites did as Moses commanded, and that day about three thousand of the people fell dead."
        },
        {
          "reference": "Judges 20:1-48",
          "text": "Then all the Israelites from Dan to Beersheba and from the land of Gilead came out, and the congregation assembled as one man before the LORD at Mizpah. / The leaders of all the people and all the tribes of Israel presented themselves in the assembly of God’s people: 400,000 men on foot, armed with swords. / (Meanwhile the Benjamites heard that the Israelites had gone up to Mizpah.) And the Israelites asked, “Tell us, how did this wicked thing happen?” ..."
        },
        {
          "reference": "1 Samuel 22:18-19",
          "text": "So the king ordered Doeg, “You turn and strike down the priests!” And Doeg the Edomite turned and struck down the priests himself. On that day he killed eighty-five men who wore the linen ephod. / He also put to the sword Nob, the city of the priests, with its men and women, children and infants, oxen, donkeys, and sheep."
        },
        {
          "reference": "2 Kings 10:6-7",
          "text": "Then Jehu wrote them a second letter and said: “If you are on my side, and if you will obey me, then bring the heads of your master’s sons to me at Jezreel by this time tomorrow.” Now the sons of the king, seventy in all, were being brought up by the leading men of the city. / And when the letter arrived, they took the sons of the king and slaughtered all seventy of them. They put their heads in baskets and sent them to Jehu at Jezreel."
        },
        {
          "reference": "1 Chronicles 7:21-22",
          "text": "Zabad his son, and Shuthelah his son. Ezer and Elead were killed by the natives of Gath, because they went down to steal their livestock. / Their father Ephraim mourned for many days, and his relatives came to comfort him."
        },
        {
          "reference": "Matthew 26:51-52",
          "text": "At this, one of Jesus’ companions drew his sword and struck the servant of the high priest, cutting off his ear. / “Put your sword back in its place,” Jesus said to him. “For all who draw the sword will die by the sword."
        },
        {
          "reference": "Luke 22:49-51",
          "text": "Those around Jesus saw what was about to happen and said, “Lord, should we strike with our swords?” / And one of them struck the servant of the high priest, cutting off his right ear. / But Jesus answered, “No more of this!” And He touched the man’s ear and healed him."
        },
        {
          "reference": "John 18:10-11",
          "text": "Then Simon Peter drew his sword and struck the servant of the high priest, cutting off his right ear. The servant’s name was Malchus. / “Put your sword back in its sheath!” Jesus said to Peter. “Shall I not drink the cup the Father has given Me?”"
        },
        {
          "reference": "Acts 7:23-24",
          "text": "When Moses was forty years old, he decided to visit his brothers, the children of Israel. / And when he saw one of them being mistreated, Moses went to his defense and avenged him by striking down the Egyptian who was oppressing him."
        },
        {
          "reference": "Acts 7:54-60",
          "text": "On hearing this, the members of the Sanhedrin were enraged, and they gnashed their teeth at him. / But Stephen, full of the Holy Spirit, looked intently into heaven and saw the glory of God and Jesus standing at the right hand of God. / “Look,” he said, “I see heaven open and the Son of Man standing at the right hand of God.” ..."
        },
        {
          "reference": "Romans 12:19",
          "text": "Do not avenge yourselves, beloved, but leave room for God’s wrath. For it is written: “Vengeance is Mine; I will repay, says the Lord.”"
        },
        {
          "reference": "Hebrews 11:32-34",
          "text": "And what more shall I say? Time will not allow me to tell of Gideon, Barak, Samson, Jephthah, David, Samuel, and the prophets, / who through faith conquered kingdoms, administered justice, and gained what was promised; who shut the mouths of lions, / quenched the raging fire, and escaped the edge of the sword; who gained strength from weakness, became mighty in battle, and put foreign armies to flight."
        }
      ]
    },
    {
      "reference": "Genesis 34:26",
      "book": "Genesis",
      "chapter": 34,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "They put Hamor and his son Shechem to the sword and took Dinah from Shechem’s house and left."
        },
        {
          "version": "NLT",
          "text": "including Hamor and his son Shechem. They killed them with their swords, then took Dinah from Shechem’s house and returned to their camp."
        },
        {
          "version": "ESV",
          "text": "They killed Hamor and his son Shechem with the sword and took Dinah out of Shechem’s house and went away."
        },
        {
          "version": "NKJV",
          "text": "And they killed Hamor and Shechem his son with the edge of the sword, and took Dinah from Shechem’s house, and went out."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Joshua 7:24-25",
          "text": "Then Joshua, together with all Israel, took Achan son of Zerah, the silver, the cloak, the bar of gold, his sons and daughters, his oxen and donkeys and sheep, his tent, and everything else he owned, and brought them to the Valley of Achor. / “Why have you brought this trouble upon us?” said Joshua. “Today the LORD will bring trouble upon you!” And all Israel stoned him to death. Then they stoned the others and burned their bodies."
        },
        {
          "reference": "2 Samuel 13:28-29",
          "text": "Now Absalom had ordered his young men, “Watch Amnon until his heart is merry with wine, and when I order you to strike Amnon down, you are to kill him. Do not be afraid. Have I not commanded you? Be courageous and valiant!” / So Absalom’s young men did to Amnon just as Absalom had ordered. Then all the other sons of the king got up, and each one fled on his mule."
        },
        {
          "reference": "2 Samuel 21:1-9",
          "text": "During the reign of David there was a famine for three successive years, and David sought the face of the LORD. And the LORD said, “It is because of the blood shed by Saul and his family, because he killed the Gibeonites.” / At this, David summoned the Gibeonites and spoke to them. (Now the Gibeonites were not Israelites, but a remnant of the Amorites. The Israelites had taken an oath concerning them, but in his zeal for Israel and Judah, Saul had sought to kill them.) / So David asked the Gibeonites, “What shall I do for you? How can I make amends so that you may bless the inheritance of the LORD?” ..."
        },
        {
          "reference": "Judges 9:5",
          "text": "He went to his father’s house in Ophrah, and on one stone murdered his seventy brothers, the sons of Jerubbaal. But Jotham, the youngest son of Jerubbaal, survived, because he hid himself."
        },
        {
          "reference": "1 Kings 2:31-34",
          "text": "And the king replied, “Do just as he says. Strike him down and bury him, and so remove from me and from the house of my father the innocent blood that Joab shed. / The LORD will bring his bloodshed back upon his own head, for without the knowledge of my father David he struck down two men more righteous and better than he when he put to the sword Abner son of Ner, commander of Israel’s army, and Amasa son of Jether, commander of Judah’s army. / Their blood will come back upon the heads of Joab and his descendants forever; but for David, his descendants, his house, and his throne, there shall be peace from the LORD forever.” ..."
        },
        {
          "reference": "1 Chronicles 2:7",
          "text": "The son of Carmi: Achar, who brought trouble upon Israel by violating the ban on devoted things."
        },
        {
          "reference": "Hosea 6:9",
          "text": "Like raiders who lie in ambush, so does a band of priests; they murder on the way to Shechem; surely they have committed atrocities."
        },
        {
          "reference": "Matthew 2:16",
          "text": "When Herod saw that he had been outwitted by the Magi, he was filled with rage. Sending orders, he put to death all the boys in Bethlehem and its vicinity who were two years old and under, according to the time he had learned from the Magi."
        },
        {
          "reference": "Matthew 26:52",
          "text": "“Put your sword back in its place,” Jesus said to him. “For all who draw the sword will die by the sword."
        },
        {
          "reference": "Luke 22:49-51",
          "text": "Those around Jesus saw what was about to happen and said, “Lord, should we strike with our swords?” / And one of them struck the servant of the high priest, cutting off his right ear. / But Jesus answered, “No more of this!” And He touched the man’s ear and healed him."
        },
        {
          "reference": "John 18:10-11",
          "text": "Then Simon Peter drew his sword and struck the servant of the high priest, cutting off his right ear. The servant’s name was Malchus. / “Put your sword back in its sheath!” Jesus said to Peter. “Shall I not drink the cup the Father has given Me?”"
        },
        {
          "reference": "Acts 7:24",
          "text": "And when he saw one of them being mistreated, Moses went to his defense and avenged him by striking down the Egyptian who was oppressing him."
        },
        {
          "reference": "Romans 12:19",
          "text": "Do not avenge yourselves, beloved, but leave room for God’s wrath. For it is written: “Vengeance is Mine; I will repay, says the Lord.”"
        },
        {
          "reference": "Ephesians 4:31-32",
          "text": "Get rid of all bitterness, rage and anger, outcry and slander, along with every form of malice. / Be kind and tenderhearted to one another, forgiving each other just as in Christ God forgave you."
        }
      ]
    },
    {
      "reference": "Genesis 34:27",
      "book": "Genesis",
      "chapter": 34,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Jacob came upon the dead bodies and looted the city where their sister had been defiled."
        },
        {
          "version": "NLT",
          "text": "Meanwhile, the rest of Jacob’s sons arrived. Finding the men slaughtered, they plundered the town because their sister had been defiled there."
        },
        {
          "version": "ESV",
          "text": "The sons of Jacob came upon the slain and plundered the city, because they had defiled their sister."
        },
        {
          "version": "NKJV",
          "text": "The sons of Jacob came upon the slain, and plundered the city, because their sister had been defiled."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 7:24-25",
          "text": "Then Joshua, together with all Israel, took Achan son of Zerah, the silver, the cloak, the bar of gold, his sons and daughters, his oxen and donkeys and sheep, his tent, and everything else he owned, and brought them to the Valley of Achor. / “Why have you brought this trouble upon us?” said Joshua. “Today the LORD will bring trouble upon you!” And all Israel stoned him to death. Then they stoned the others and burned their bodies."
        },
        {
          "reference": "2 Samuel 21:1-6",
          "text": "During the reign of David there was a famine for three successive years, and David sought the face of the LORD. And the LORD said, “It is because of the blood shed by Saul and his family, because he killed the Gibeonites.” / At this, David summoned the Gibeonites and spoke to them. (Now the Gibeonites were not Israelites, but a remnant of the Amorites. The Israelites had taken an oath concerning them, but in his zeal for Israel and Judah, Saul had sought to kill them.) / So David asked the Gibeonites, “What shall I do for you? How can I make amends so that you may bless the inheritance of the LORD?” ..."
        },
        {
          "reference": "Numbers 31:9-11",
          "text": "The Israelites captured the Midianite women and their children, and they plundered all their herds, flocks, and goods. / Then they burned all the cities where the Midianites had lived, as well as all their encampments, / and carried away all the plunder and spoils, both people and animals."
        },
        {
          "reference": "Deuteronomy 13:12-18",
          "text": "If, regarding one of the cities the LORD your God is giving you to inhabit, you hear it said / that wicked men have arisen from among you and have led the people of their city astray, saying, “Let us go and serve other gods” (which you have not known), / then you must inquire, investigate, and interrogate thoroughly. And if it is established with certainty that this abomination has been committed among you, ..."
        },
        {
          "reference": "1 Samuel 15:3",
          "text": "Now go and attack the Amalekites and devote to destruction all that belongs to them. Do not spare them, but put to death men and women, children and infants, oxen and sheep, camels and donkeys.’”"
        },
        {
          "reference": "2 Kings 5:26-27",
          "text": "But Elisha questioned him, “Did not my spirit go with you when the man got down from his chariot to meet you? Is this the time to accept money and clothing, olive groves and vineyards, sheep and oxen, menservants and maidservants? / Therefore, the leprosy of Naaman will cling to you and your descendants forever!” And as Gehazi left his presence, he was leprous—as white as snow."
        },
        {
          "reference": "2 Chronicles 28:8-15",
          "text": "Then the Israelites took 200,000 captives from their kinsmen—women, sons, and daughters. They also carried off a great deal of plunder and brought it to Samaria. / But a prophet of the LORD named Oded was there, and he went out to meet the army that returned to Samaria. “Look,” he said to them, “because of His wrath against Judah, the LORD, the God of your fathers, has delivered them into your hand. But you have slaughtered them in a rage that reaches up to heaven. / And now you intend to reduce to slavery the men and women of Judah and Jerusalem. But are you not also guilty before the LORD your God? ..."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Obadiah 1:10-14",
          "text": "Because of the violence against your brother Jacob, you will be covered with shame and cut off forever. / On the day you stood aloof while strangers carried off his wealth and foreigners entered his gate and cast lots for Jerusalem, you were just like one of them. / But you should not gloat in that day, your brother’s day of misfortune, nor rejoice over the people of Judah in the day of their destruction, nor boast proudly in the day of their distress. ..."
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Matthew 5:38-39",
          "text": "You have heard that it was said, ‘Eye for eye and tooth for tooth.’ / But I tell you not to resist an evil person. If someone slaps you on your right cheek, turn to him the other also;"
        },
        {
          "reference": "Luke 9:54-56",
          "text": "When the disciples James and John saw this, they asked, “Lord, do You want us to call down fire from heaven to consume them?” / But Jesus turned and rebuked them. / And He and His disciples went on to another village."
        },
        {
          "reference": "Romans 12:19-21",
          "text": "Do not avenge yourselves, beloved, but leave room for God’s wrath. For it is written: “Vengeance is Mine; I will repay, says the Lord.” / On the contrary, “If your enemy is hungry, feed him; if he is thirsty, give him a drink. For in so doing, you will heap burning coals on his head.” / Do not be overcome by evil, but overcome evil with good."
        },
        {
          "reference": "1 Corinthians 6:7-8",
          "text": "The very fact that you have lawsuits among you means that you are thoroughly defeated already. Why not rather be wronged? Why not rather be cheated? / Instead, you yourselves cheat and do wrong, even against your own brothers!"
        },
        {
          "reference": "2 Corinthians 10:3-5",
          "text": "For though we live in the flesh, we do not wage war according to the flesh. / The weapons of our warfare are not the weapons of the flesh. Instead, they have divine power to demolish strongholds. / We demolish arguments and every presumption set up against the knowledge of God; and we take captive every thought to make it obedient to Christ."
        }
      ]
    },
    {
      "reference": "Genesis 34:28",
      "book": "Genesis",
      "chapter": 34,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "They seized their flocks and herds and donkeys and everything else of theirs in the city and out in the fields."
        },
        {
          "version": "NLT",
          "text": "They seized all the flocks and herds and donkeys—everything they could lay their hands on, both inside the town and outside in the fields."
        },
        {
          "version": "ESV",
          "text": "They took their flocks and their herds, their donkeys, and whatever was in the city and in the field."
        },
        {
          "version": "NKJV",
          "text": "They took their sheep, their oxen, and their donkeys, what was in the city and what was in the field,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 21:16",
          "text": "Whoever kidnaps another man must be put to death, whether he sells him or the man is found in his possession."
        },
        {
          "reference": "Deuteronomy 20:14",
          "text": "But the women, children, livestock, and whatever else is in the city—all its spoil—you may take as plunder, and you shall use the spoil of your enemies that the LORD your God gives you."
        },
        {
          "reference": "Joshua 11:14",
          "text": "The Israelites took for themselves all the plunder and livestock of these cities, but they put all the people to the sword until they had completely destroyed them, not sparing anyone who breathed."
        },
        {
          "reference": "1 Samuel 30:20-22",
          "text": "And he took all the flocks and herds, which his men drove ahead of the other livestock, calling out, “This is David’s plunder!” / When David came to the two hundred men who had been too exhausted to follow him and who were left behind at the Brook of Besor, they came out to meet him and the troops with him. As David approached the men, he greeted them, / but all the wicked and worthless men among those who had gone with David said, “Because they did not go with us, we will not share with them the plunder we recovered, except for each man’s wife and children. They may take them and go.”"
        },
        {
          "reference": "2 Chronicles 14:13-15",
          "text": "Then Asa and his army pursued them as far as Gerar. The Cushites fell and could not recover, for they were crushed before the LORD and His army. So the people of Judah carried off a great amount of plunder / and attacked all the cities around Gerar, because the terror of the LORD had fallen upon them. They plundered all the cities, since there was much plunder there. / They also attacked the tents of the herdsmen and carried off many sheep and camels. Then they returned to Jerusalem."
        },
        {
          "reference": "Isaiah 10:6",
          "text": "I will send him against a godless nation; I will dispatch him against a people destined for My rage, to take spoils and seize plunder, and to trample them down like clay in the streets."
        },
        {
          "reference": "Jeremiah 50:37",
          "text": "A sword is against her horses and chariots and against all the foreigners in her midst, and they will become like women. A sword is against her treasuries, and they will be plundered."
        },
        {
          "reference": "Ezekiel 38:12-13",
          "text": "in order to seize the spoil and carry off the plunder, to turn a hand against the desolate places now inhabited and against a people gathered from the nations, who have acquired livestock and possessions and who live at the center of the land.’ / Sheba and Dedan and the merchants of Tarshish with all its villages will ask, ‘Have you come to capture the plunder? Have you assembled your hordes to carry away loot, to make off with silver and gold, to take cattle and goods, to seize great spoil?’"
        },
        {
          "reference": "Hosea 13:15",
          "text": "Although he flourishes among his brothers, an east wind will come—a wind from the LORD rising up from the desert. His fountain will fail, and his spring will run dry. The wind will plunder his treasury of every precious article."
        },
        {
          "reference": "Amos 3:10",
          "text": "“For they know not how to do right,” declares the LORD. “They store up violence and destruction in their citadels.”"
        },
        {
          "reference": "Obadiah 1:13",
          "text": "You should not enter the gate of My people in the day of their disaster, nor gloat over their affliction in the day of their disaster, nor loot their wealth in the day of their disaster."
        },
        {
          "reference": "Nahum 2:9",
          "text": "“Plunder the silver! Plunder the gold!” There is no end to the treasure, an abundance of every precious thing."
        },
        {
          "reference": "Zechariah 14:1-2",
          "text": "Behold, a day of the LORD is coming when your plunder will be divided in your presence. / For I will gather all the nations for battle against Jerusalem, and the city will be captured, the houses looted, and the women ravished. Half of the city will go into exile, but the rest of the people will not be removed from the city."
        },
        {
          "reference": "Matthew 24:43",
          "text": "But understand this: If the homeowner had known in which watch of the night the thief was coming, he would have kept watch and would not have let his house be broken into."
        },
        {
          "reference": "Luke 11:21-22",
          "text": "When a strong man, fully armed, guards his house, his possessions are secure. / But when someone stronger attacks and overpowers him, he takes away the armor in which the man trusted, and then he divides up his plunder."
        }
      ]
    },
    {
      "reference": "Genesis 34:29",
      "book": "Genesis",
      "chapter": 34,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "They carried off all their wealth and all their women and children, taking as plunder everything in the houses."
        },
        {
          "version": "NLT",
          "text": "They looted all their wealth and plundered their houses. They also took all their little children and wives and led them away as captives."
        },
        {
          "version": "ESV",
          "text": "All their wealth, all their little ones and their wives, all that was in the houses, they captured and plundered."
        },
        {
          "version": "NKJV",
          "text": "and all their wealth. All their little ones and their wives they took captive; and they plundered even all that was in the houses."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Numbers 31:9-11",
          "text": "The Israelites captured the Midianite women and their children, and they plundered all their herds, flocks, and goods. / Then they burned all the cities where the Midianites had lived, as well as all their encampments, / and carried away all the plunder and spoils, both people and animals."
        },
        {
          "reference": "Deuteronomy 20:14",
          "text": "But the women, children, livestock, and whatever else is in the city—all its spoil—you may take as plunder, and you shall use the spoil of your enemies that the LORD your God gives you."
        },
        {
          "reference": "Joshua 8:27",
          "text": "Israel took for themselves only the cattle and plunder of that city, as the LORD had commanded Joshua."
        },
        {
          "reference": "2 Chronicles 14:13-15",
          "text": "Then Asa and his army pursued them as far as Gerar. The Cushites fell and could not recover, for they were crushed before the LORD and His army. So the people of Judah carried off a great amount of plunder / and attacked all the cities around Gerar, because the terror of the LORD had fallen upon them. They plundered all the cities, since there was much plunder there. / They also attacked the tents of the herdsmen and carried off many sheep and camels. Then they returned to Jerusalem."
        },
        {
          "reference": "2 Chronicles 20:25",
          "text": "Then Jehoshaphat and his people went to carry off the plunder, and they found on the bodies an abundance of goods and valuables—more than they could carry away. They were gathering the plunder for three days because there was so much."
        },
        {
          "reference": "Isaiah 10:6",
          "text": "I will send him against a godless nation; I will dispatch him against a people destined for My rage, to take spoils and seize plunder, and to trample them down like clay in the streets."
        },
        {
          "reference": "Jeremiah 30:16",
          "text": "Nevertheless, all who devour you will be devoured, and all your adversaries—every one of them—will go off into exile. Those who plundered you will be plundered, and all who raided you will be raided."
        },
        {
          "reference": "Ezekiel 39:10",
          "text": "They will not gather wood from the countryside or cut it from the forests, for they will use the weapons for fuel. They will loot those who looted them and plunder those who plundered them, declares the Lord GOD."
        },
        {
          "reference": "Obadiah 1:13",
          "text": "You should not enter the gate of My people in the day of their disaster, nor gloat over their affliction in the day of their disaster, nor loot their wealth in the day of their disaster."
        },
        {
          "reference": "Zechariah 14:1-2",
          "text": "Behold, a day of the LORD is coming when your plunder will be divided in your presence. / For I will gather all the nations for battle against Jerusalem, and the city will be captured, the houses looted, and the women ravished. Half of the city will go into exile, but the rest of the people will not be removed from the city."
        },
        {
          "reference": "Matthew 12:29",
          "text": "Or again, how can anyone enter a strong man’s house and steal his possessions, unless he first ties up the strong man? Then he can plunder his house."
        },
        {
          "reference": "Luke 11:21-22",
          "text": "When a strong man, fully armed, guards his house, his possessions are secure. / But when someone stronger attacks and overpowers him, he takes away the armor in which the man trusted, and then he divides up his plunder."
        },
        {
          "reference": "John 10:10",
          "text": "The thief comes only to steal and kill and destroy. I have come that they may have life, and have it in all its fullness."
        },
        {
          "reference": "Acts 2:45",
          "text": "Selling their possessions and goods, they shared with anyone who was in need."
        }
      ]
    },
    {
      "reference": "Genesis 34:30",
      "book": "Genesis",
      "chapter": 34,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob said to Simeon and Levi, “You have brought trouble on me by making me obnoxious to the Canaanites and Perizzites, the people living in this land. We are few in number, and if they join forces against me and attack me, I and my household will be destroyed.”"
        },
        {
          "version": "NLT",
          "text": "Afterward Jacob said to Simeon and Levi, “You have ruined me! You’ve made me stink among all the people of this land—among all the Canaanites and Perizzites. We are so few that they will join forces and crush us. I will be ruined, and my entire household will be wiped out!”"
        },
        {
          "version": "ESV",
          "text": "Then Jacob said to Simeon and Levi, “You have brought trouble on me by making me stink to the inhabitants of the land, the Canaanites and the Perizzites. My numbers are few, and if they gather themselves against me and attack me, I shall be destroyed, both I and my household.”"
        },
        {
          "version": "NKJV",
          "text": "Then Jacob said to Simeon and Levi, “You have troubled me by making me obnoxious among the inhabitants of the land, among the Canaanites and the Perizzites; and since I am few in number, they will gather themselves together against me and kill me. I shall be destroyed, my household and I.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Joshua 7:25",
          "text": "“Why have you brought this trouble upon us?” said Joshua. “Today the LORD will bring trouble upon you!” And all Israel stoned him to death. Then they stoned the others and burned their bodies."
        },
        {
          "reference": "1 Chronicles 2:7",
          "text": "The son of Carmi: Achar, who brought trouble upon Israel by violating the ban on devoted things."
        },
        {
          "reference": "Proverbs 29:25",
          "text": "The fear of man is a snare, but whoever trusts in the LORD is set securely on high."
        },
        {
          "reference": "Exodus 5:21",
          "text": "“May the LORD look upon you and judge you,” the foremen said, “for you have made us a stench before Pharaoh and his officials; you have placed in their hand a sword to kill us!”"
        },
        {
          "reference": "1 Samuel 13:13-14",
          "text": "“You have acted foolishly,” Samuel declared. “You have not kept the command that the LORD your God gave you; if you had, the LORD would have established your kingdom over Israel for all time. / But now your kingdom will not endure; the LORD has sought a man after His own heart and appointed him ruler over His people, because you have not kept the command of the LORD.”"
        },
        {
          "reference": "2 Samuel 12:14",
          "text": "Nevertheless, because by this deed you have shown utter contempt for the word of the LORD, the son born to you will surely die.”"
        },
        {
          "reference": "1 Kings 21:20",
          "text": "When Elijah arrived, Ahab said to him, “So you have found me out, my enemy.” He replied, “I have found you out because you have sold yourself to do evil in the sight of the LORD."
        },
        {
          "reference": "2 Kings 21:16",
          "text": "Moreover, Manasseh shed so much innocent blood that he filled Jerusalem from end to end, in addition to the sin that he had caused Judah to commit, doing evil in the sight of the LORD."
        },
        {
          "reference": "Jeremiah 7:6",
          "text": "if you no longer oppress the foreigner and the fatherless and the widow, and if you no longer shed innocent blood in this place or follow other gods to your own harm,"
        },
        {
          "reference": "Matthew 5:9",
          "text": "Blessed are the peacemakers, for they will be called sons of God."
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        },
        {
          "reference": "Matthew 10:22",
          "text": "You will be hated by everyone because of My name, but the one who perseveres to the end will be saved."
        },
        {
          "reference": "Luke 21:17",
          "text": "And you will be hated by everyone because of My name."
        },
        {
          "reference": "John 15:18-19",
          "text": "If the world hates you, understand that it hated Me first. / If you were of the world, it would love you as its own. Instead, the world hates you, because you are not of the world, but I have chosen you out of the world."
        }
      ]
    },
    {
      "reference": "Genesis 34:31",
      "book": "Genesis",
      "chapter": 34,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "But they replied, “Should he have treated our sister like a prostitute?”"
        },
        {
          "version": "NLT",
          "text": "“But why should we let him treat our sister like a prostitute?” they retorted angrily."
        },
        {
          "version": "ESV",
          "text": "But they said, “Should he treat our sister like a prostitute?”"
        },
        {
          "version": "NKJV",
          "text": "But they said, “Should he treat our sister like a harlot?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Exodus 20:13",
          "text": "You shall not murder."
        },
        {
          "reference": "Leviticus 19:29",
          "text": "You must not defile your daughter by making her a prostitute, or the land will be prostituted and filled with depravity."
        },
        {
          "reference": "Deuteronomy 22:25-27",
          "text": "But if the man encounters a betrothed woman in the open country, and he overpowers her and lies with her, only the man who has done this must die. / Do nothing to the young woman, because she has committed no sin worthy of death. This case is just like one in which a man attacks his neighbor and murders him. / When he found her in the field, the betrothed woman cried out, but there was no one to save her."
        },
        {
          "reference": "2 Samuel 13:12-14",
          "text": "“No, my brother!” she cried. “Do not violate me, for such a thing should never be done in Israel. Do not do this disgraceful thing! / Where could I ever take my shame? And you would be like one of the fools in Israel! Please speak to the king, for he will not withhold me from you.” / But Amnon refused to listen to her, and being stronger, he violated her and lay with her."
        },
        {
          "reference": "Judges 19:23-25",
          "text": "The owner of the house went out and said to them, “No, my brothers, do not do this wicked thing! After all, this man is a guest in my house. Do not commit this outrage. / Look, let me bring out my virgin daughter and the man’s concubine, and you can use them and do with them as you wish. But do not do such a vile thing to this man.” / But the men would not listen to him. So the Levite took his concubine and sent her outside to them, and they raped her and abused her throughout the night, and at dawn they let her go."
        },
        {
          "reference": "2 Samuel 13:32-33",
          "text": "But Jonadab, the son of David’s brother Shimeah, spoke up: “My lord must not think they have killed all the sons of the king, for only Amnon is dead. In fact, Absalom has planned this since the day Amnon violated his sister Tamar. / So now, my lord the king, do not take to heart the report that all the sons of the king are dead. Only Amnon is dead.”"
        },
        {
          "reference": "Proverbs 6:34-35",
          "text": "For jealousy enrages a husband, and he will show no mercy in the day of vengeance. / He will not be appeased by any ransom, or persuaded by lavish gifts."
        },
        {
          "reference": "Proverbs 24:29",
          "text": "Do not say, “I will do to him as he has done to me; I will repay the man according to his work.”"
        },
        {
          "reference": "Hosea 4:14",
          "text": "I will not punish your daughters when they prostitute themselves, nor your daughters-in-law when they commit adultery. For the men themselves go off with prostitutes and offer sacrifices with shrine prostitutes. So a people without understanding will come to ruin."
        },
        {
          "reference": "Matthew 5:38-39",
          "text": "You have heard that it was said, ‘Eye for eye and tooth for tooth.’ / But I tell you not to resist an evil person. If someone slaps you on your right cheek, turn to him the other also;"
        },
        {
          "reference": "Matthew 5:44",
          "text": "But I tell you, love your enemies and pray for those who persecute you,"
        },
        {
          "reference": "Matthew 7:12",
          "text": "In everything, then, do to others as you would have them do to you. For this is the essence of the Law and the Prophets."
        },
        {
          "reference": "Luke 6:27-29",
          "text": "But to those of you who will listen, I say: Love your enemies, do good to those who hate you, / bless those who curse you, pray for those who mistreat you. / If someone strikes you on one cheek, turn to him the other also. And if someone takes your cloak, do not withhold your tunic as well."
        },
        {
          "reference": "Luke 6:31",
          "text": "Do to others as you would have them do to you."
        }
      ]
    }
  ]
}