{
  "book": "genesis",
  "chapter": 36,
  "verses": [
    {
      "reference": "Genesis 36:1",
      "book": "Genesis",
      "chapter": 36,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "This is the account of the family line of Esau (that is, Edom)."
        },
        {
          "version": "NLT",
          "text": "This is the account of the descendants of Esau (also known as Edom)."
        },
        {
          "version": "ESV",
          "text": "These are the generations of Esau (that is, Edom)."
        },
        {
          "version": "NKJV",
          "text": "Now this is the genealogy of Esau, who is Edom."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 25:30",
          "text": "He said to Jacob, “Let me eat some of that red stew, for I am famished.” (That is why he was also called Edom.)"
        },
        {
          "reference": "Genesis 25:24-26",
          "text": "When her time came to give birth, there were indeed twins in her womb. / The first one came out red, covered with hair like a fur coat; so they named him Esau. / After this, his brother came out grasping Esau’s heel; so he was named Jacob. And Isaac was sixty years old when the twins were born."
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 33:16",
          "text": "So that day Esau started on his way back to Seir,"
        },
        {
          "reference": "Genesis 36:8",
          "text": "So Esau (that is, Edom) settled in the area of Mount Seir."
        },
        {
          "reference": "Genesis 36:43",
          "text": "Magdiel, and Iram. These were the chiefs of Edom, according to their settlements in the land they possessed. Esau was the father of the Edomites."
        },
        {
          "reference": "Genesis 46:8-27",
          "text": "Now these are the names of the sons of Israel (Jacob and his descendants) who went to Egypt: Reuben, Jacob’s firstborn. / The sons of Reuben: Hanoch, Pallu, Hezron, and Carmi. / The sons of Simeon: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul the son of a Canaanite woman. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us,"
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land."
        },
        {
          "reference": "1 Chronicles 1:34-37",
          "text": "Abraham was the father of Isaac. The sons of Isaac: Esau and Israel. / The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. ..."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        }
      ]
    },
    {
      "reference": "Genesis 36:2",
      "book": "Genesis",
      "chapter": 36,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "Esau took his wives from the women of Canaan: Adah daughter of Elon the Hittite, and Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite—"
        },
        {
          "version": "NLT",
          "text": "Esau married two young women from Canaan: Adah, the daughter of Elon the Hittite; and Oholibamah, the daughter of Anah and granddaughter of Zibeon the Hivite."
        },
        {
          "version": "ESV",
          "text": "Esau took his wives from the Canaanites: Adah the daughter of Elon the Hittite, Oholibamah the daughter of Anah the daughter of Zibeon the Hivite,"
        },
        {
          "version": "NKJV",
          "text": "Esau took his wives from the daughters of Canaan: Adah the daughter of Elon the Hittite; Aholibamah the daughter of Anah, the daughter of Zibeon the Hivite;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 28:8-9",
          "text": "And seeing that his father Isaac disapproved of the Canaanite women, / Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 24:3",
          "text": "and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling,"
        },
        {
          "reference": "Genesis 27:46",
          "text": "Then Rebekah said to Isaac, “I am weary of my life because of these Hittite women. If Jacob takes a Hittite wife from among them, what good is my life?”"
        },
        {
          "reference": "Genesis 34:2",
          "text": "When Shechem son of Hamor the Hivite, the prince of the region, saw her, he took her and lay with her by force."
        },
        {
          "reference": "Genesis 12:11-13",
          "text": "As he was about to enter Egypt, he said to his wife Sarai, “Look, I know that you are a beautiful woman, / and when the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live. / Please say you are my sister, so that I will be treated well for your sake, and on account of you my life will be spared.”"
        },
        {
          "reference": "Genesis 21:21",
          "text": "And while he was dwelling in the Wilderness of Paran, his mother got a wife for him from the land of Egypt."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 46:10",
          "text": "The sons of Simeon: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul the son of a Canaanite woman."
        },
        {
          "reference": "Exodus 34:15-16",
          "text": "Do not make a covenant with the inhabitants of the land, for when they prostitute themselves to their gods and sacrifice to them, they will invite you, and you will eat their sacrifices. / And when you take some of their daughters as brides for your sons, their daughters will prostitute themselves to their gods and cause your sons to do the same."
        },
        {
          "reference": "Deuteronomy 7:3-4",
          "text": "Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons, / because they will turn your sons away from following Me to serve other gods. Then the anger of the LORD will burn against you, and He will swiftly destroy you."
        },
        {
          "reference": "Judges 14:1-3",
          "text": "One day Samson went down to Timnah, where he saw a young Philistine woman. / So he returned and told his father and mother, “I have seen a daughter of the Philistines in Timnah. Now get her for me as a wife.” / But his father and mother replied, “Can’t you find a young woman among your relatives or among any of our people? Must you go to the uncircumcised Philistines to get a wife?” But Samson told his father, “Get her for me, for she is pleasing to my eyes.”"
        },
        {
          "reference": "1 Kings 11:1-2",
          "text": "King Solomon, however, loved many foreign women along with the daughter of Pharaoh—women of Moab, Ammon, Edom, and Sidon, as well as Hittite women. / These women were from the nations about which the LORD had told the Israelites, “You must not intermarry with them, for surely they will turn your hearts after their gods.” Yet Solomon clung to these women in love."
        },
        {
          "reference": "Ezra 9:1-2",
          "text": "After these things had been accomplished, the leaders approached me and said, “The people of Israel, including the priests and Levites, have not kept themselves separate from the surrounding peoples whose abominations are like those of the Canaanites, Hittites, Perizzites, Jebusites, Ammonites, Moabites, Egyptians, and Amorites. / Indeed, the Israelites have taken some of their daughters as wives for themselves and their sons, so that the holy seed has been mixed with the people of the land. And the leaders and officials have taken the lead in this unfaithfulness!”"
        },
        {
          "reference": "Nehemiah 13:23-27",
          "text": "In those days I also saw Jews who had married women from Ashdod, Ammon, and Moab. / Half of their children spoke the language of Ashdod or of the other peoples, but could not speak the language of Judah. / I rebuked them and called down curses on them. I beat some of these men and pulled out their hair. Then I made them take an oath before God and said, “You must not give your daughters in marriage to their sons or take their daughters as wives for your sons or for yourselves! ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:3",
      "book": "Genesis",
      "chapter": 36,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "also Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "version": "NLT",
          "text": "He also married his cousin Basemath, who was the daughter of Ishmael and the sister of Nebaioth."
        },
        {
          "version": "ESV",
          "text": "and Basemath, Ishmael’s daughter, the sister of Nebaioth."
        },
        {
          "version": "NKJV",
          "text": "and Basemath, Ishmael’s daughter, sister of Nebajoth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 27:46",
          "text": "Then Rebekah said to Isaac, “I am weary of my life because of these Hittite women. If Jacob takes a Hittite wife from among them, what good is my life?”"
        },
        {
          "reference": "Genesis 28:8-9",
          "text": "And seeing that his father Isaac disapproved of the Canaanite women, / Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:12-14",
          "text": "Additionally, Timna, a concubine of Esau’s son Eliphaz, gave birth to Amalek. These are the grandsons of Esau’s wife Adah. / These are the sons of Reuel: Nahath, Zerah, Shammah, and Mizzah. They are the grandsons of Esau’s wife Basemath. / These are the sons of Esau’s wife Oholibamah (daughter of Anah and granddaughter of Zibeon) whom she bore to Esau: Jeush, Jalam, and Korah."
        },
        {
          "reference": "Genesis 36:20-21",
          "text": "These are the sons of Seir the Horite, who were living in the land: Lotan, Shobal, Zibeon, Anah, / Dishon, Ezer, and Dishan. They are the chiefs of the Horites, the descendants of Seir in the land of Edom."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:43-54",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Obadiah 1:8-9",
          "text": "In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? / Then your mighty men, O Teman, will be terrified, so that everyone in the mountains of Esau will be cut down in the slaughter."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:4",
      "book": "Genesis",
      "chapter": 36,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "Adah bore Eliphaz to Esau, Basemath bore Reuel,"
        },
        {
          "version": "NLT",
          "text": "Adah gave birth to a son named Eliphaz for Esau. Basemath gave birth to a son named Reuel."
        },
        {
          "version": "ESV",
          "text": "And Adah bore to Esau, Eliphaz; Basemath bore Reuel;"
        },
        {
          "version": "NKJV",
          "text": "Now Adah bore Eliphaz to Esau, and Basemath bore Reuel."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 36:10-14",
          "text": "These are the names of Esau’s sons: Eliphaz son of Esau’s wife Adah, and Reuel son of Esau’s wife Basemath. / The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz. / Additionally, Timna, a concubine of Esau’s son Eliphaz, gave birth to Amalek. These are the grandsons of Esau’s wife Adah. ..."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:31-43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Genesis 36:6-8",
          "text": "Later, Esau took his wives and sons and daughters and all the people of his household, along with his livestock, all his other animals, and all the property he had acquired in Canaan, and he moved to a land far away from his brother Jacob. / For their possessions were too great for them to dwell together; the land where they stayed could not support them because of their livestock. / So Esau (that is, Edom) settled in the area of Mount Seir."
        },
        {
          "reference": "Genesis 36:20-30",
          "text": "These are the sons of Seir the Horite, who were living in the land: Lotan, Shobal, Zibeon, Anah, / Dishon, Ezer, and Dishan. They are the chiefs of the Horites, the descendants of Seir in the land of Edom. / The sons of Lotan were Hori and Hemam. Timna was Lotan’s sister. ..."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Genesis 27:46",
          "text": "Then Rebekah said to Isaac, “I am weary of my life because of these Hittite women. If Jacob takes a Hittite wife from among them, what good is my life?”"
        },
        {
          "reference": "Genesis 36:1-3",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 36:5",
          "text": "and Oholibamah gave birth to Jeush, Jalam, and Korah. These were the sons of Esau, who were born to him in the land of Canaan."
        },
        {
          "reference": "Genesis 36:12",
          "text": "Additionally, Timna, a concubine of Esau’s son Eliphaz, gave birth to Amalek. These are the grandsons of Esau’s wife Adah."
        },
        {
          "reference": "Genesis 36:16",
          "text": "Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah."
        }
      ]
    },
    {
      "reference": "Genesis 36:5",
      "book": "Genesis",
      "chapter": 36,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "and Oholibamah bore Jeush, Jalam and Korah. These were the sons of Esau, who were born to him in Canaan."
        },
        {
          "version": "NLT",
          "text": "Oholibamah gave birth to sons named Jeush, Jalam, and Korah. All these sons were born to Esau in the land of Canaan."
        },
        {
          "version": "ESV",
          "text": "and Oholibamah bore Jeush, Jalam, and Korah. These are the sons of Esau who were born to him in the land of Canaan."
        },
        {
          "version": "NKJV",
          "text": "And Aholibamah bore Jeush, Jaalam, and Korah. These were the sons of Esau who were born to him in the land of Canaan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 27:46",
          "text": "Then Rebekah said to Isaac, “I am weary of my life because of these Hittite women. If Jacob takes a Hittite wife from among them, what good is my life?”"
        },
        {
          "reference": "Genesis 36:1-4",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:6-8",
          "text": "Later, Esau took his wives and sons and daughters and all the people of his household, along with his livestock, all his other animals, and all the property he had acquired in Canaan, and he moved to a land far away from his brother Jacob. / For their possessions were too great for them to dwell together; the land where they stayed could not support them because of their livestock. / So Esau (that is, Edom) settled in the area of Mount Seir."
        },
        {
          "reference": "Genesis 36:9-14",
          "text": "This is the account of Esau, the father of the Edomites, in the area of Mount Seir. / These are the names of Esau’s sons: Eliphaz son of Esau’s wife Adah, and Reuel son of Esau’s wife Basemath. / The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz. ..."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:20-30",
          "text": "These are the sons of Seir the Horite, who were living in the land: Lotan, Shobal, Zibeon, Anah, / Dishon, Ezer, and Dishan. They are the chiefs of the Horites, the descendants of Seir in the land of Edom. / The sons of Lotan were Hori and Hemam. Timna was Lotan’s sister. ..."
        },
        {
          "reference": "Genesis 36:31-43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:38-42",
          "text": "The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan. / The sons of Lotan: Hori and Homam. Timna was Lotan’s sister. / The sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam. The sons of Zibeon: Aiah and Anah. ..."
        },
        {
          "reference": "1 Chronicles 1:43-54",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        }
      ]
    },
    {
      "reference": "Genesis 36:6",
      "book": "Genesis",
      "chapter": 36,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Esau took his wives and sons and daughters and all the members of his household, as well as his livestock and all his other animals and all the goods he had acquired in Canaan, and moved to a land some distance from his brother Jacob."
        },
        {
          "version": "NLT",
          "text": "Esau took his wives, his children, and his entire household, along with his livestock and cattle—all the wealth he had acquired in the land of Canaan—and moved away from his brother, Jacob."
        },
        {
          "version": "ESV",
          "text": "Then Esau took his wives, his sons, his daughters, and all the members of his household, his livestock, all his beasts, and all his property that he had acquired in the land of Canaan. He went into a land away from his brother Jacob."
        },
        {
          "version": "NKJV",
          "text": "Then Esau took his wives, his sons, his daughters, and all the persons of his household, his cattle and all his animals, and all his goods which he had gained in the land of Canaan, and went to a country away from the presence of his brother Jacob."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 13:6",
          "text": "But the land was unable to support both of them while they stayed together, for they had so many possessions that they were unable to coexist."
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 27:40",
          "text": "You shall live by the sword and serve your brother. But when you rebel, you will tear his yoke from your neck.”"
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 33:14-16",
          "text": "Please let my lord go ahead of his servant. I will continue on slowly, at a comfortable pace for the livestock and children, until I come to my lord at Seir.” / “Let me leave some of my people with you,” Esau said. But Jacob replied, “Why do that? Let me find favor in the sight of my lord.” / So that day Esau started on his way back to Seir,"
        },
        {
          "reference": "Genesis 46:6",
          "text": "They also took the livestock and possessions they had acquired in the land of Canaan, and Jacob and all his offspring went to Egypt."
        },
        {
          "reference": "Exodus 12:38",
          "text": "And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "1 Chronicles 1:43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Obadiah 1:18",
          "text": "Then the house of Jacob will be a blazing fire, and the house of Joseph a burning flame; but the house of Esau will be stubble—Jacob will set it ablaze and consume it. Therefore no survivor will remain from the house of Esau.” For the LORD has spoken."
        },
        {
          "reference": "Malachi 1:3",
          "text": "but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        }
      ]
    },
    {
      "reference": "Genesis 36:7",
      "book": "Genesis",
      "chapter": 36,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Their possessions were too great for them to remain together; the land where they were staying could not support them both because of their livestock."
        },
        {
          "version": "NLT",
          "text": "There was not enough land to support them both because of all the livestock and possessions they had acquired."
        },
        {
          "version": "ESV",
          "text": "For their possessions were too great for them to dwell together. The land of their sojournings could not support them because of their livestock."
        },
        {
          "version": "NKJV",
          "text": "For their possessions were too great for them to dwell together, and the land where they were strangers could not support them because of their livestock."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 13:6",
          "text": "But the land was unable to support both of them while they stayed together, for they had so many possessions that they were unable to coexist."
        },
        {
          "reference": "Genesis 13:11-12",
          "text": "So Lot chose the whole plain of the Jordan for himself and set out toward the east. And Abram and Lot parted company. / Abram lived in the land of Canaan, but Lot settled in the cities of the plain and pitched his tent toward Sodom."
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 26:14",
          "text": "He owned so many flocks and herds and servants that the Philistines envied him."
        },
        {
          "reference": "Genesis 31:18",
          "text": "and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 33:9",
          "text": "“I already have plenty, my brother,” Esau replied. “Keep what belongs to you.”"
        },
        {
          "reference": "Genesis 34:23",
          "text": "Will not their livestock, their possessions, and all their animals become ours? Only let us consent to them, and they will dwell among us.”"
        },
        {
          "reference": "Genesis 36:6",
          "text": "Later, Esau took his wives and sons and daughters and all the people of his household, along with his livestock, all his other animals, and all the property he had acquired in Canaan, and he moved to a land far away from his brother Jacob."
        },
        {
          "reference": "Exodus 12:38",
          "text": "And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Numbers 32:1",
          "text": "Now the Reubenites and Gadites, who had very large herds and flocks, surveyed the lands of Jazer and Gilead, and they saw that the region was suitable for livestock."
        },
        {
          "reference": "Deuteronomy 8:18",
          "text": "But remember that it is the LORD your God who gives you the power to gain wealth, in order to confirm His covenant that He swore to your fathers even to this day."
        },
        {
          "reference": "Joshua 22:8",
          "text": "saying, “Return to your homes with your great wealth, with immense herds of livestock, with silver, gold, bronze, iron, and very many clothes. Divide with your brothers the spoil of your enemies.”"
        },
        {
          "reference": "1 Chronicles 5:9",
          "text": "They also settled in the east as far as the edge of the desert that extends to the Euphrates River, because their livestock had increased in the land of Gilead."
        },
        {
          "reference": "1 Chronicles 5:21",
          "text": "They seized the livestock of the Hagrites—50,000 camels, 250,000 sheep, and 2,000 donkeys. They also took 100,000 captives,"
        }
      ]
    },
    {
      "reference": "Genesis 36:8",
      "book": "Genesis",
      "chapter": 36,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "So Esau (that is, Edom) settled in the hill country of Seir."
        },
        {
          "version": "NLT",
          "text": "So Esau (also known as Edom) settled in the hill country of Seir."
        },
        {
          "version": "ESV",
          "text": "So Esau settled in the hill country of Seir. (Esau is Edom.)"
        },
        {
          "version": "NKJV",
          "text": "So Esau dwelt in Mount Seir. Esau is Edom."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Jeremiah 49:8",
          "text": "Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him."
        },
        {
          "reference": "Malachi 1:2-3",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.”"
        },
        {
          "reference": "Romans 9:13",
          "text": "So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "Isaiah 63:1",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.”"
        },
        {
          "reference": "Lamentations 4:21-22",
          "text": "So rejoice and be glad, O Daughter of Edom, you who dwell in the land of Uz. Yet the cup will pass to you as well; you will get drunk and expose yourself. / O Daughter of Zion, your punishment is complete; He will not prolong your exile. But He will punish your iniquity, O Daughter of Edom; He will expose your sins."
        },
        {
          "reference": "Genesis 25:30",
          "text": "He said to Jacob, “Let me eat some of that red stew, for I am famished.” (That is why he was also called Edom.)"
        }
      ]
    },
    {
      "reference": "Genesis 36:9",
      "book": "Genesis",
      "chapter": 36,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "This is the account of the family line of Esau the father of the Edomites in the hill country of Seir."
        },
        {
          "version": "NLT",
          "text": "This is the account of Esau’s descendants, the Edomites, who lived in the hill country of Seir."
        },
        {
          "version": "ESV",
          "text": "These are the generations of Esau the father of the Edomites in the hill country of Seir."
        },
        {
          "version": "NKJV",
          "text": "And this is the genealogy of Esau the father of the Edomites in Mount Seir."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 27:39-40",
          "text": "His father Isaac answered him: “Behold, your dwelling place shall be away from the richness of the land, away from the dew of heaven above. / You shall live by the sword and serve your brother. But when you rebel, you will tear his yoke from your neck.”"
        },
        {
          "reference": "Genesis 28:8-9",
          "text": "And seeing that his father Isaac disapproved of the Canaanite women, / Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 33:16",
          "text": "So that day Esau started on his way back to Seir,"
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:31-43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7-8",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land. / The third generation of children born to them may enter the assembly of the LORD."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:43-54",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        }
      ]
    },
    {
      "reference": "Genesis 36:10",
      "book": "Genesis",
      "chapter": 36,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "These are the names of Esau’s sons: Eliphaz, the son of Esau’s wife Adah, and Reuel, the son of Esau’s wife Basemath."
        },
        {
          "version": "NLT",
          "text": "These are the names of Esau’s sons: Eliphaz, the son of Esau’s wife Adah; and Reuel, the son of Esau’s wife Basemath."
        },
        {
          "version": "ESV",
          "text": "These are the names of Esau’s sons: Eliphaz the son of Adah the wife of Esau, Reuel the son of Basemath the wife of Esau."
        },
        {
          "version": "NKJV",
          "text": "These were the names of Esau’s sons: Eliphaz the son of Adah the wife of Esau, and Reuel the son of Basemath the wife of Esau."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 36:1-9",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:11-14",
          "text": "The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz. / Additionally, Timna, a concubine of Esau’s son Eliphaz, gave birth to Amalek. These are the grandsons of Esau’s wife Adah. / These are the sons of Reuel: Nahath, Zerah, Shammah, and Mizzah. They are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:20-30",
          "text": "These are the sons of Seir the Horite, who were living in the land: Lotan, Shobal, Zibeon, Anah, / Dishon, Ezer, and Dishan. They are the chiefs of the Horites, the descendants of Seir in the land of Edom. / The sons of Lotan were Hori and Hemam. Timna was Lotan’s sister. ..."
        },
        {
          "reference": "Genesis 36:31-39",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Jeremiah 49:7-8",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him."
        }
      ]
    },
    {
      "reference": "Genesis 36:11",
      "book": "Genesis",
      "chapter": 36,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Eliphaz: Teman, Omar, Zepho, Gatam and Kenaz."
        },
        {
          "version": "NLT",
          "text": "The descendants of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz."
        },
        {
          "version": "ESV",
          "text": "The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz."
        },
        {
          "version": "NKJV",
          "text": "And the sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-5",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7-8",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land. / The third generation of children born to them may enter the assembly of the LORD."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "1 Kings 11:14-17",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        },
        {
          "reference": "2 Chronicles 20:10",
          "text": "And now, here are the men of Ammon, Moab, and Mount Seir, whom You did not let Israel invade when they came out of the land of Egypt. So Israel turned away from them and did not destroy them."
        },
        {
          "reference": "Psalm 83:6",
          "text": "the tents of Edom and the Ishmaelites, of Moab and the Hagrites,"
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:12",
      "book": "Genesis",
      "chapter": 36,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "Esau’s son Eliphaz also had a concubine named Timna, who bore him Amalek. These were grandsons of Esau’s wife Adah."
        },
        {
          "version": "NLT",
          "text": "Timna, the concubine of Esau’s son Eliphaz, gave birth to a son named Amalek. These are the descendants of Esau’s wife Adah."
        },
        {
          "version": "ESV",
          "text": "(Timna was a concubine of Eliphaz, Esau’s son; she bore Amalek to Eliphaz.) These are the sons of Adah, Esau’s wife."
        },
        {
          "version": "NKJV",
          "text": "Now Timna was the concubine of Eliphaz, Esau’s son, and she bore Amalek to Eliphaz. These were the sons of Adah, Esau’s wife."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "Exodus 17:8-16",
          "text": "After this, the Amalekites came and attacked the Israelites at Rephidim. / So Moses said to Joshua, “Choose some of our men and go out to fight the Amalekites. Tomorrow I will stand on the hilltop with the staff of God in my hand.” / Joshua did as Moses had instructed him and fought against the Amalekites, while Moses, Aaron, and Hur went up to the top of the hill. ..."
        },
        {
          "reference": "Deuteronomy 25:17-19",
          "text": "Remember what the Amalekites did to you along your way from Egypt, / how they met you on your journey when you were tired and weary, and they attacked all your stragglers; they had no fear of God. / When the LORD your God gives you rest from the enemies around you in the land that He is giving you to possess as an inheritance, you are to blot out the memory of Amalek from under heaven. Do not forget!"
        },
        {
          "reference": "1 Samuel 15:2-3",
          "text": "This is what the LORD of Hosts says: ‘I witnessed what the Amalekites did to the Israelites when they opposed them on their way up from Egypt. / Now go and attack the Amalekites and devote to destruction all that belongs to them. Do not spare them, but put to death men and women, children and infants, oxen and sheep, camels and donkeys.’”"
        },
        {
          "reference": "1 Samuel 30:1-2",
          "text": "On the third day David and his men arrived in Ziklag, and the Amalekites had raided the Negev, attacked Ziklag, and burned it down. / They had taken captive the women and all who were there, both young and old. They had not killed anyone, but had carried them off as they went on their way."
        },
        {
          "reference": "2 Samuel 8:12",
          "text": "from Edom and Moab, from the Ammonites and Philistines and Amalekites, and from the spoil of Hadadezer son of Rehob, king of Zobah."
        },
        {
          "reference": "1 Chronicles 4:42-43",
          "text": "And five hundred of these Simeonites led by Pelatiah, Neariah, Rephaiah, and Uzziel, the sons of Ishi, went to Mount Seir / and struck down the remnant of the Amalekites who had escaped. And they have lived there to this day."
        },
        {
          "reference": "Psalm 83:6-8",
          "text": "the tents of Edom and the Ishmaelites, of Moab and the Hagrites, / of Gebal, Ammon, and Amalek, of Philistia with the people of Tyre. / Even Assyria has joined them, lending strength to the sons of Lot. Selah"
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Obadiah 1:8-10",
          "text": "In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? / Then your mighty men, O Teman, will be terrified, so that everyone in the mountains of Esau will be cut down in the slaughter. / Because of the violence against your brother Jacob, you will be covered with shame and cut off forever."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Numbers 24:20",
          "text": "Then Balaam saw Amalek and lifted up an oracle, saying: “Amalek was first among the nations, but his end is destruction.”"
        },
        {
          "reference": "Judges 3:13",
          "text": "After enlisting the Ammonites and Amalekites to join forces with him, Eglon attacked and defeated Israel, taking possession of the City of Palms."
        },
        {
          "reference": "1 Samuel 14:47-48",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them. / He fought valiantly and defeated the Amalekites, delivering Israel from the hands of its plunderers."
        }
      ]
    },
    {
      "reference": "Genesis 36:13",
      "book": "Genesis",
      "chapter": 36,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Reuel: Nahath, Zerah, Shammah and Mizzah. These were grandsons of Esau’s wife Basemath."
        },
        {
          "version": "NLT",
          "text": "The descendants of Reuel were Nahath, Zerah, Shammah, and Mizzah. These are the descendants of Esau’s wife Basemath."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Reuel: Nahath, Zerah, Shammah, and Mizzah. These are the sons of Basemath, Esau’s wife."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Reuel: Nahath, Zerah, Shammah, and Mizzah. These were the sons of Basemath, Esau’s wife."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:36",
          "text": "The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek."
        },
        {
          "reference": "1 Chronicles 1:37",
          "text": "The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:12",
          "text": "Additionally, Timna, a concubine of Esau’s son Eliphaz, gave birth to Amalek. These are the grandsons of Esau’s wife Adah."
        },
        {
          "reference": "Genesis 36:14",
          "text": "These are the sons of Esau’s wife Oholibamah (daughter of Anah and granddaughter of Zibeon) whom she bore to Esau: Jeush, Jalam, and Korah."
        },
        {
          "reference": "Genesis 36:18",
          "text": "These are the sons of Esau’s wife Oholibamah: Chiefs Jeush, Jalam, and Korah. They are the chiefs descended from Esau’s wife Oholibamah, the daughter of Anah."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 24:18",
          "text": "Edom will become a possession, as will Seir, his enemy; but Israel will perform with valor."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "1 Kings 11:14-17",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        },
        {
          "reference": "Psalm 83:6",
          "text": "the tents of Edom and the Ishmaelites, of Moab and the Hagrites,"
        }
      ]
    },
    {
      "reference": "Genesis 36:14",
      "book": "Genesis",
      "chapter": 36,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Esau’s wife Oholibamah daughter of Anah and granddaughter of Zibeon, whom she bore to Esau: Jeush, Jalam and Korah."
        },
        {
          "version": "NLT",
          "text": "Esau also had sons through Oholibamah, the daughter of Anah and granddaughter of Zibeon. Their names were Jeush, Jalam, and Korah."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Oholibamah the daughter of Anah the daughter of Zibeon, Esau’s wife: she bore to Esau Jeush, Jalam, and Korah."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Aholibamah, Esau’s wife, the daughter of Anah, the daughter of Zibeon. And she bore to Esau: Jeush, Jaalam, and Korah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:2-3",
          "text": "Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 12:11-20",
          "text": "As he was about to enter Egypt, he said to his wife Sarai, “Look, I know that you are a beautiful woman, / and when the Egyptians see you, they will say, ‘This is his wife.’ Then they will kill me but will let you live. / Please say you are my sister, so that I will be treated well for your sake, and on account of you my life will be spared.” ..."
        },
        {
          "reference": "Genesis 21:21",
          "text": "And while he was dwelling in the Wilderness of Paran, his mother got a wife for him from the land of Egypt."
        },
        {
          "reference": "Genesis 24:3-4",
          "text": "and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling, / but will go to my country and my kindred to take a wife for my son Isaac.”"
        },
        {
          "reference": "Genesis 27:46",
          "text": "Then Rebekah said to Isaac, “I am weary of my life because of these Hittite women. If Jacob takes a Hittite wife from among them, what good is my life?”"
        },
        {
          "reference": "Genesis 28:1-2",
          "text": "So Isaac called for Jacob and blessed him. “Do not take a wife from the Canaanite women,” he commanded. / “Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother."
        },
        {
          "reference": "Genesis 29:1-30",
          "text": "Jacob resumed his journey and came to the land of the people of the east. / He looked and saw a well in the field, and near it lay three flocks of sheep, because the sheep were watered from this well. And a large stone covered the mouth of the well. / When all the flocks had been gathered there, the shepherds would roll away the stone from the mouth of the well and water the sheep. Then they would return the stone to its place over the mouth of the well. ..."
        },
        {
          "reference": "Genesis 30:9-13",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife. / And Leah’s servant Zilpah bore Jacob a son. / Then Leah said, “How fortunate!” So she named him Gad. ..."
        },
        {
          "reference": "Genesis 31:50",
          "text": "If you mistreat my daughters or take other wives, although no one is with us, remember that God is a witness between you and me.”"
        },
        {
          "reference": "Genesis 34:1-31",
          "text": "Now Dinah, the daughter Leah had borne to Jacob, went out to visit the daughters of the land. / When Shechem son of Hamor the Hivite, the prince of the region, saw her, he took her and lay with her by force. / And his soul was drawn to Dinah, the daughter of Jacob. He loved the young girl and spoke to her tenderly. ..."
        },
        {
          "reference": "Genesis 35:22-26",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons: / The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. ..."
        },
        {
          "reference": "Genesis 37:2",
          "text": "This is the account of Jacob. When Joseph was seventeen years old, he was tending the flock with his brothers, the sons of his father’s wives Bilhah and Zilpah, and he brought their father a bad report about them."
        }
      ]
    },
    {
      "reference": "Genesis 36:15",
      "book": "Genesis",
      "chapter": 36,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the chiefs among Esau’s descendants: The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz,"
        },
        {
          "version": "NLT",
          "text": "These are the descendants of Esau who became the leaders of various clans: The descendants of Esau’s oldest son, Eliphaz, became the leaders of the clans of Teman, Omar, Zepho, Kenaz,"
        },
        {
          "version": "ESV",
          "text": "These are the chiefs of the sons of Esau. The sons of Eliphaz the firstborn of Esau: the chiefs Teman, Omar, Zepho, Kenaz,"
        },
        {
          "version": "NKJV",
          "text": "These were the chiefs of the sons of Esau. The sons of Eliphaz, the firstborn son of Esau, were Chief Teman, Chief Omar, Chief Zepho, Chief Kenaz,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:51-54",
          "text": "Then Hadad died. Now the chiefs of Edom were Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        },
        {
          "reference": "Jeremiah 49:7-10",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Numbers 24:18-19",
          "text": "Edom will become a possession, as will Seir, his enemy; but Israel will perform with valor. / A ruler will come from Jacob and destroy the survivors of the city.”"
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "2 Samuel 8:14",
          "text": "He placed garrisons throughout Edom, and all the Edomites were subject to David. So the LORD made David victorious wherever he went."
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Isaiah 63:1-6",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.” / Why are Your clothes red, and Your garments like one who treads the winepress? / “I have trodden the winepress alone, and no one from the nations was with Me. I trampled them in My anger and trod them down in My fury; their blood spattered My garments, and all My clothes were stained. ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:16",
      "book": "Genesis",
      "chapter": 36,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "Korah, Gatam and Amalek. These were the chiefs descended from Eliphaz in Edom; they were grandsons of Adah."
        },
        {
          "version": "NLT",
          "text": "Korah, Gatam, and Amalek. These are the clan leaders in the land of Edom who descended from Eliphaz. All these were descendants of Esau’s wife Adah."
        },
        {
          "version": "ESV",
          "text": "Korah, Gatam, and Amalek; these are the chiefs of Eliphaz in the land of Edom; these are the sons of Adah."
        },
        {
          "version": "NKJV",
          "text": "Chief Korah, Chief Gatam, and Chief Amalek. These were the chiefs of Eliphaz in the land of Edom. They were the sons of Adah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:12",
          "text": "Additionally, Timna, a concubine of Esau’s son Eliphaz, gave birth to Amalek. These are the grandsons of Esau’s wife Adah."
        },
        {
          "reference": "Genesis 36:19",
          "text": "All these are the sons of Esau (that is, Edom), and they were their chiefs."
        },
        {
          "reference": "Genesis 36:31-43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7-8",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land. / The third generation of children born to them may enter the assembly of the LORD."
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        },
        {
          "reference": "Jeremiah 49:7-10",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        }
      ]
    },
    {
      "reference": "Genesis 36:17",
      "book": "Genesis",
      "chapter": 36,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah and Mizzah. These were the chiefs descended from Reuel in Edom; they were grandsons of Esau’s wife Basemath."
        },
        {
          "version": "NLT",
          "text": "The descendants of Esau’s son Reuel became the leaders of the clans of Nahath, Zerah, Shammah, and Mizzah. These are the clan leaders in the land of Edom who descended from Reuel. All these were descendants of Esau’s wife Basemath."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Reuel, Esau’s son: the chiefs Nahath, Zerah, Shammah, and Mizzah; these are the chiefs of Reuel in the land of Edom; these are the sons of Basemath, Esau’s wife."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Reuel, Esau’s son: Chief Nahath, Chief Zerah, Chief Shammah, and Chief Mizzah. These were the chiefs of Reuel in the land of Edom. These were the sons of Basemath, Esau’s wife."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-5",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:9-14",
          "text": "This is the account of Esau, the father of the Edomites, in the area of Mount Seir. / These are the names of Esau’s sons: Eliphaz son of Esau’s wife Adah, and Reuel son of Esau’s wife Basemath. / The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz. ..."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "1 Chronicles 1:43-54",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Obadiah 1:1-9",
          "text": "This is the vision of Obadiah: This is what the Lord GOD says about Edom—We have heard a message from the LORD; an envoy has been sent among the nations to say, “Rise up, and let us go to battle against her!”— / “Behold, I will make you small among the nations; you will be deeply despised. / The pride of your heart has deceived you, O dwellers in the clefts of the rocks whose habitation is the heights, who say in your heart, ‘Who can bring me down to the ground?’ ..."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:18",
      "book": "Genesis",
      "chapter": 36,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Esau’s wife Oholibamah: Chiefs Jeush, Jalam and Korah. These were the chiefs descended from Esau’s wife Oholibamah daughter of Anah."
        },
        {
          "version": "NLT",
          "text": "The descendants of Esau and his wife Oholibamah became the leaders of the clans of Jeush, Jalam, and Korah. These are the clan leaders who descended from Esau’s wife Oholibamah, the daughter of Anah."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Oholibamah, Esau’s wife: the chiefs Jeush, Jalam, and Korah; these are the chiefs born of Oholibamah the daughter of Anah, Esau’s wife."
        },
        {
          "version": "NKJV",
          "text": "And these were the sons of Aholibamah, Esau’s wife: Chief Jeush, Chief Jaalam, and Chief Korah. These were the chiefs who descended from Aholibamah, Esau’s wife, the daughter of Anah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:51",
          "text": "Then Hadad died. Now the chiefs of Edom were Timna, Alvah, Jetheth,"
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Ezekiel 25:13",
          "text": "therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword."
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Obadiah 1:1-9",
          "text": "This is the vision of Obadiah: This is what the Lord GOD says about Edom—We have heard a message from the LORD; an envoy has been sent among the nations to say, “Rise up, and let us go to battle against her!”— / “Behold, I will make you small among the nations; you will be deeply despised. / The pride of your heart has deceived you, O dwellers in the clefts of the rocks whose habitation is the heights, who say in your heart, ‘Who can bring me down to the ground?’ ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Isaiah 63:1",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:13",
          "text": "So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        }
      ]
    },
    {
      "reference": "Genesis 36:19",
      "book": "Genesis",
      "chapter": 36,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the sons of Esau (that is, Edom), and these were their chiefs."
        },
        {
          "version": "NLT",
          "text": "These are the clans descended from Esau (also known as Edom), identified by their clan leaders."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Esau (that is, Edom), and these are their chiefs."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Esau, who is Edom, and these were their chiefs."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 27:40",
          "text": "You shall live by the sword and serve your brother. But when you rebel, you will tear his yoke from your neck.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 33:16",
          "text": "So that day Esau started on his way back to Seir,"
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:31-43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7-8",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land. / The third generation of children born to them may enter the assembly of the LORD."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:43-54",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Obadiah 1:18",
          "text": "Then the house of Jacob will be a blazing fire, and the house of Joseph a burning flame; but the house of Esau will be stubble—Jacob will set it ablaze and consume it. Therefore no survivor will remain from the house of Esau.” For the LORD has spoken."
        }
      ]
    },
    {
      "reference": "Genesis 36:20",
      "book": "Genesis",
      "chapter": 36,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the sons of Seir the Horite, who were living in the region: Lotan, Shobal, Zibeon, Anah,"
        },
        {
          "version": "NLT",
          "text": "These are the names of the tribes that descended from Seir the Horite. They lived in the land of Edom: Lotan, Shobal, Zibeon, Anah,"
        },
        {
          "version": "ESV",
          "text": "These are the sons of Seir the Horite, the inhabitants of the land: Lotan, Shobal, Zibeon, Anah,"
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Seir the Horite who inhabited the land: Lotan, Shobal, Zibeon, Anah,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "1 Chronicles 1:38-42",
          "text": "The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan. / The sons of Lotan: Hori and Homam. Timna was Lotan’s sister. / The sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam. The sons of Zibeon: Aiah and Anah. ..."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Isaiah 63:1-6",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.” / Why are Your clothes red, and Your garments like one who treads the winepress? / “I have trodden the winepress alone, and no one from the nations was with Me. I trampled them in My anger and trod them down in My fury; their blood spattered My garments, and all My clothes were stained. ..."
        },
        {
          "reference": "Lamentations 4:21-22",
          "text": "So rejoice and be glad, O Daughter of Edom, you who dwell in the land of Uz. Yet the cup will pass to you as well; you will get drunk and expose yourself. / O Daughter of Zion, your punishment is complete; He will not prolong your exile. But He will punish your iniquity, O Daughter of Edom; He will expose your sins."
        },
        {
          "reference": "Psalm 137:7",
          "text": "Remember, O LORD, the sons of Edom on the day Jerusalem fell: “Destroy it,” they said, “tear it down to its foundations!”"
        }
      ]
    },
    {
      "reference": "Genesis 36:21",
      "book": "Genesis",
      "chapter": 36,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "Dishon, Ezer and Dishan. These sons of Seir in Edom were Horite chiefs."
        },
        {
          "version": "NLT",
          "text": "Dishon, Ezer, and Dishan. These were the Horite clan leaders, the descendants of Seir, who lived in the land of Edom."
        },
        {
          "version": "ESV",
          "text": "Dishon, Ezer, and Dishan; these are the chiefs of the Horites, the sons of Seir in the land of Edom."
        },
        {
          "version": "NKJV",
          "text": "Dishon, Ezer, and Dishan. These were the chiefs of the Horites, the sons of Seir, in the land of Edom."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:38-42",
          "text": "The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan. / The sons of Lotan: Hori and Homam. Timna was Lotan’s sister. / The sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam. The sons of Zibeon: Aiah and Anah. ..."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Isaiah 63:1-6",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.” / Why are Your clothes red, and Your garments like one who treads the winepress? / “I have trodden the winepress alone, and no one from the nations was with Me. I trampled them in My anger and trod them down in My fury; their blood spattered My garments, and all My clothes were stained. ..."
        },
        {
          "reference": "Lamentations 4:21-22",
          "text": "So rejoice and be glad, O Daughter of Edom, you who dwell in the land of Uz. Yet the cup will pass to you as well; you will get drunk and expose yourself. / O Daughter of Zion, your punishment is complete; He will not prolong your exile. But He will punish your iniquity, O Daughter of Edom; He will expose your sins."
        },
        {
          "reference": "Psalm 137:7",
          "text": "Remember, O LORD, the sons of Edom on the day Jerusalem fell: “Destroy it,” they said, “tear it down to its foundations!”"
        }
      ]
    },
    {
      "reference": "Genesis 36:22",
      "book": "Genesis",
      "chapter": 36,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Lotan: Hori and Homam. Timna was Lotan’s sister."
        },
        {
          "version": "NLT",
          "text": "The descendants of Lotan were Hori and Hemam. Lotan’s sister was named Timna."
        },
        {
          "version": "ESV",
          "text": "The sons of Lotan were Hori and Hemam; and Lotan’s sister was Timna."
        },
        {
          "version": "NKJV",
          "text": "And the sons of Lotan were Hori and Hemam. Lotan’s sister was Timna."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:39",
          "text": "The sons of Lotan: Hori and Homam. Timna was Lotan’s sister."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Jeremiah 49:10",
          "text": "But I will strip Esau bare; I will uncover his hiding places, and he will be unable to conceal himself. His descendants will be destroyed along with his relatives and neighbors, and he will be no more."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:13",
          "text": "So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Genesis 25:30",
          "text": "He said to Jacob, “Let me eat some of that red stew, for I am famished.” (That is why he was also called Edom.)"
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        }
      ]
    },
    {
      "reference": "Genesis 36:23",
      "book": "Genesis",
      "chapter": 36,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Shobal: Alvan, Manahath, Ebal, Shepho and Onam."
        },
        {
          "version": "NLT",
          "text": "The descendants of Shobal were Alvan, Manahath, Ebal, Shepho, and Onam."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:40",
          "text": "The sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam. The sons of Zibeon: Aiah and Anah."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-2",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite,"
        },
        {
          "reference": "Genesis 36:9-14",
          "text": "This is the account of Esau, the father of the Edomites, in the area of Mount Seir. / These are the names of Esau’s sons: Eliphaz son of Esau’s wife Adah, and Reuel son of Esau’s wife Basemath. / The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz. ..."
        },
        {
          "reference": "Genesis 36:31-43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7-8",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land. / The third generation of children born to them may enter the assembly of the LORD."
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "1 Kings 11:14-17",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        },
        {
          "reference": "2 Kings 8:20-22",
          "text": "In the days of Jehoram, Edom rebelled against the hand of Judah and appointed their own king. / So Jehoram crossed over to Zair with all his chariots. When the Edomites surrounded him and his chariot commanders, he rose up and attacked by night. His troops, however, fled to their homes. / So to this day Edom has been in rebellion against the hand of Judah. Likewise, Libnah rebelled at the same time."
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:24",
      "book": "Genesis",
      "chapter": 36,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Zibeon: Aiah and Anah. This is the Anah who discovered the hot springs in the desert while he was grazing the donkeys of his father Zibeon."
        },
        {
          "version": "NLT",
          "text": "The descendants of Zibeon were Aiah and Anah. (This is the Anah who discovered the hot springs in the wilderness while he was grazing his father’s donkeys.)"
        },
        {
          "version": "ESV",
          "text": "These are the sons of Zibeon: Aiah and Anah; he is the Anah who found the hot springs in the wilderness, as he pastured the donkeys of Zibeon his father."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Zibeon: both Ajah and Anah. This was the Anah who found the water in the wilderness as he pastured the donkeys of his father Zibeon."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:38-42",
          "text": "The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan. / The sons of Lotan: Hori and Homam. Timna was Lotan’s sister. / The sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam. The sons of Zibeon: Aiah and Anah. ..."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 36:2-3",
          "text": "Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 36:12",
          "text": "Additionally, Timna, a concubine of Esau’s son Eliphaz, gave birth to Amalek. These are the grandsons of Esau’s wife Adah."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:31-39",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "1 Chronicles 1:31",
          "text": "Jetur, Naphish, and Kedemah. These were the sons of Ishmael."
        },
        {
          "reference": "1 Chronicles 1:35",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah."
        },
        {
          "reference": "1 Chronicles 1:36",
          "text": "The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek."
        },
        {
          "reference": "1 Chronicles 1:37",
          "text": "The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        }
      ]
    },
    {
      "reference": "Genesis 36:25",
      "book": "Genesis",
      "chapter": 36,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "The children of Anah: Dishon and Oholibamah daughter of Anah."
        },
        {
          "version": "NLT",
          "text": "The descendants of Anah were his son, Dishon, and his daughter, Oholibamah."
        },
        {
          "version": "ESV",
          "text": "These are the children of Anah: Dishon and Oholibamah the daughter of Anah."
        },
        {
          "version": "NKJV",
          "text": "These were the children of Anah: Dishon and Aholibamah the daughter of Anah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 26:34-35",
          "text": "When Esau was forty years old, he took as his wives Judith daughter of Beeri the Hittite and Basemath daughter of Elon the Hittite. / And they brought grief to Isaac and Rebekah."
        },
        {
          "reference": "Genesis 36:2-3",
          "text": "Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth."
        },
        {
          "reference": "Genesis 36:12",
          "text": "Additionally, Timna, a concubine of Esau’s son Eliphaz, gave birth to Amalek. These are the grandsons of Esau’s wife Adah."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:43-54",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "1 Kings 11:14-17",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:26",
      "book": "Genesis",
      "chapter": 36,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Dishon: Hemdan, Eshban, Ithran and Keran."
        },
        {
          "version": "NLT",
          "text": "The descendants of Dishon were Hemdan, Eshban, Ithran, and Keran."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Dishon: Hemdan, Eshban, Ithran, and Cheran."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Dishon: Hemdan, Eshban, Ithran, and Cheran."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:38-42",
          "text": "The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan. / The sons of Lotan: Hori and Homam. Timna was Lotan’s sister. / The sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam. The sons of Zibeon: Aiah and Anah. ..."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 25:1-4",
          "text": "Now Abraham had taken another wife, named Keturah, / and she bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. / Jokshan was the father of Sheba and Dedan. And the sons of Dedan were the Asshurites, the Letushites, and the Leummites. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:9-14",
          "text": "This is the account of Esau, the father of the Edomites, in the area of Mount Seir. / These are the names of Esau’s sons: Eliphaz son of Esau’s wife Adah, and Reuel son of Esau’s wife Basemath. / The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz. ..."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:20-30",
          "text": "These are the sons of Seir the Horite, who were living in the land: Lotan, Shobal, Zibeon, Anah, / Dishon, Ezer, and Dishan. They are the chiefs of the Horites, the descendants of Seir in the land of Edom. / The sons of Lotan were Hori and Hemam. Timna was Lotan’s sister. ..."
        },
        {
          "reference": "Genesis 36:31-39",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        }
      ]
    },
    {
      "reference": "Genesis 36:27",
      "book": "Genesis",
      "chapter": 36,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Ezer: Bilhan, Zaavan and Akan."
        },
        {
          "version": "NLT",
          "text": "The descendants of Ezer were Bilhan, Zaavan, and Akan."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Ezer: Bilhan, Zaavan, and Akan."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Ezer: Bilhan, Zaavan, and Akan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:42",
          "text": "The sons of Ezer: Bilhan, Zaavan, and Akan. The sons of Dishan: Uz and Aran."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 25:1-4",
          "text": "Now Abraham had taken another wife, named Keturah, / and she bore him Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. / Jokshan was the father of Sheba and Dedan. And the sons of Dedan were the Asshurites, the Letushites, and the Leummites. ..."
        },
        {
          "reference": "Genesis 10:6-7",
          "text": "The sons of Ham: Cush, Mizraim, Put, and Canaan. / The sons of Cush: Seba, Havilah, Sabtah, Raamah, and Sabteca. And the sons of Raamah: Sheba and Dedan."
        },
        {
          "reference": "1 Chronicles 1:31-33",
          "text": "Jetur, Naphish, and Kedemah. These were the sons of Ishmael. / The sons born to Keturah, Abraham’s concubine: Zimran, Jokshan, Medan, Midian, Ishbak, and Shuah. The sons of Jokshan: Sheba and Dedan. / The sons of Midian: Ephah, Epher, Hanoch, Abida, and Eldaah. All of these were Keturah’s sons."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-5",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Jeremiah 49:7-8",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him."
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:28",
      "book": "Genesis",
      "chapter": 36,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Dishan: Uz and Aran."
        },
        {
          "version": "NLT",
          "text": "The descendants of Dishan were Uz and Aran."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Dishan: Uz and Aran."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Dishan: Uz and Aran."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:42",
          "text": "The sons of Ezer: Bilhan, Zaavan, and Akan. The sons of Dishan: Uz and Aran."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Jeremiah 49:10",
          "text": "But I will strip Esau bare; I will uncover his hiding places, and he will be unable to conceal himself. His descendants will be destroyed along with his relatives and neighbors, and he will be no more."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:13",
          "text": "So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Genesis 25:30",
          "text": "He said to Jacob, “Let me eat some of that red stew, for I am famished.” (That is why he was also called Edom.)"
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        }
      ]
    },
    {
      "reference": "Genesis 36:29",
      "book": "Genesis",
      "chapter": 36,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the Horite chiefs: Lotan, Shobal, Zibeon, Anah,"
        },
        {
          "version": "NLT",
          "text": "So these were the leaders of the Horite clans: Lotan, Shobal, Zibeon, Anah,"
        },
        {
          "version": "ESV",
          "text": "These are the chiefs of the Horites: the chiefs Lotan, Shobal, Zibeon, Anah,"
        },
        {
          "version": "NKJV",
          "text": "These were the chiefs of the Horites: Chief Lotan, Chief Shobal, Chief Zibeon, Chief Anah,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:38-42",
          "text": "The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan. / The sons of Lotan: Hori and Homam. Timna was Lotan’s sister. / The sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam. The sons of Zibeon: Aiah and Anah. ..."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Jeremiah 49:10",
          "text": "But I will strip Esau bare; I will uncover his hiding places, and he will be unable to conceal himself. His descendants will be destroyed along with his relatives and neighbors, and he will be no more."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:13",
          "text": "So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Genesis 25:30",
          "text": "He said to Jacob, “Let me eat some of that red stew, for I am famished.” (That is why he was also called Edom.)"
        },
        {
          "reference": "Genesis 27:41",
          "text": "Esau held a grudge against Jacob because of the blessing his father had given him. And Esau said in his heart, “The days of mourning for my father are at hand; then I will kill my brother Jacob.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        }
      ]
    },
    {
      "reference": "Genesis 36:30",
      "book": "Genesis",
      "chapter": 36,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "Dishon, Ezer and Dishan. These were the Horite chiefs, according to their divisions, in the land of Seir."
        },
        {
          "version": "NLT",
          "text": "Dishon, Ezer, and Dishan. The Horite clans are named after their clan leaders, who lived in the land of Seir."
        },
        {
          "version": "ESV",
          "text": "Dishon, Ezer, and Dishan; these are the chiefs of the Horites, chief by chief in the land of Seir."
        },
        {
          "version": "NKJV",
          "text": "Chief Dishon, Chief Ezer, and Chief Dishan. These were the chiefs of the Horites, according to their chiefs in the land of Seir."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "1 Chronicles 1:38-42",
          "text": "The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan. / The sons of Lotan: Hori and Homam. Timna was Lotan’s sister. / The sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam. The sons of Zibeon: Aiah and Anah. ..."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:13",
          "text": "So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Isaiah 63:1-6",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.” / Why are Your clothes red, and Your garments like one who treads the winepress? / “I have trodden the winepress alone, and no one from the nations was with Me. I trampled them in My anger and trod them down in My fury; their blood spattered My garments, and all My clothes were stained. ..."
        },
        {
          "reference": "Lamentations 4:21-22",
          "text": "So rejoice and be glad, O Daughter of Edom, you who dwell in the land of Uz. Yet the cup will pass to you as well; you will get drunk and expose yourself. / O Daughter of Zion, your punishment is complete; He will not prolong your exile. But He will punish your iniquity, O Daughter of Edom; He will expose your sins."
        },
        {
          "reference": "Psalm 137:7",
          "text": "Remember, O LORD, the sons of Edom on the day Jerusalem fell: “Destroy it,” they said, “tear it down to its foundations!”"
        }
      ]
    },
    {
      "reference": "Genesis 36:31",
      "book": "Genesis",
      "chapter": 36,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the kings who reigned in Edom before any Israelite king reigned:"
        },
        {
          "version": "NLT",
          "text": "These are the kings who ruled in the land of Edom before any king ruled over the Israelites:"
        },
        {
          "version": "ESV",
          "text": "These are the kings who reigned in the land of Edom, before any king reigned over the Israelites."
        },
        {
          "version": "NKJV",
          "text": "Now these were the kings who reigned in the land of Edom before any king reigned over the children of Israel:"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:43-50",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Deuteronomy 17:14-15",
          "text": "When you enter the land that the LORD your God is giving you and have taken possession of it and settled in it, and you say, “Let us set a king over us like all the nations around us,” / you are to appoint over yourselves the king whom the LORD your God shall choose. Appoint a king from among your brothers; you are not to set over yourselves a foreigner who is not one of your brothers."
        },
        {
          "reference": "1 Samuel 8:5-9",
          "text": "“Look,” they said, “you are old, and your sons do not walk in your ways. Now appoint a king to judge us like all the other nations.” / But when they said, “Give us a king to judge us,” their demand was displeasing in the sight of Samuel; so he prayed to the LORD. / And the LORD said to Samuel, “Listen to the voice of the people in all that they say to you. For it is not you they have rejected, but they have rejected Me as their king. ..."
        },
        {
          "reference": "1 Samuel 10:19",
          "text": "But today you have rejected your God, who saves you from all your troubles and afflictions, and you have said to Him, ‘No, set a king over us.’ Now therefore present yourselves before the LORD by your tribes and clans.”"
        },
        {
          "reference": "1 Samuel 12:12",
          "text": "But when you saw that Nahash king of the Ammonites was moving against you, you said to me, ‘No, we must have a king to rule over us’—even though the LORD your God was your king."
        },
        {
          "reference": "1 Kings 11:14",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom."
        },
        {
          "reference": "1 Kings 14:21",
          "text": "Meanwhile, Rehoboam son of Solomon reigned in Judah. He was forty-one years old when he became king, and he reigned seventeen years in Jerusalem, the city the LORD had chosen from all the tribes of Israel in which to put His Name. His mother’s name was Naamah the Ammonite."
        },
        {
          "reference": "2 Kings 8:20-22",
          "text": "In the days of Jehoram, Edom rebelled against the hand of Judah and appointed their own king. / So Jehoram crossed over to Zair with all his chariots. When the Edomites surrounded him and his chariot commanders, he rose up and attacked by night. His troops, however, fled to their homes. / So to this day Edom has been in rebellion against the hand of Judah. Likewise, Libnah rebelled at the same time."
        },
        {
          "reference": "2 Kings 3:9",
          "text": "So the king of Israel, the king of Judah, and the king of Edom set out, and after they had traveled a roundabout route for seven days, they had no water for their army or for their animals."
        },
        {
          "reference": "Psalm 2:6",
          "text": "“I have installed My King on Zion, upon My holy mountain.”"
        },
        {
          "reference": "Psalm 89:27",
          "text": "I will indeed appoint him as My firstborn, the highest of the kings of the earth."
        },
        {
          "reference": "Hosea 13:10-11",
          "text": "Where is your king now to save you in all your cities, and the rulers to whom you said, “Give me a king and princes”? / So in My anger I gave you a king, and in My wrath I took him away."
        },
        {
          "reference": "Matthew 2:1-2",
          "text": "After Jesus was born in Bethlehem in Judea, during the time of King Herod, Magi from the east arrived in Jerusalem, / asking, “Where is the One who has been born King of the Jews? We saw His star in the east and have come to worship Him.”"
        },
        {
          "reference": "Matthew 27:11",
          "text": "Meanwhile Jesus stood before the governor, who questioned Him: “Are You the King of the Jews?” “You have said so,” Jesus replied."
        },
        {
          "reference": "John 18:33-37",
          "text": "Pilate went back into the Praetorium, summoned Jesus, and asked Him, “Are You the King of the Jews?” / “Are you saying this on your own,” Jesus asked, “or did others tell you about Me?” / “Am I a Jew?” Pilate replied. “Your own people and chief priests handed You over to me. What have You done?” ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:32",
      "book": "Genesis",
      "chapter": 36,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "Bela son of Beor became king of Edom. His city was named Dinhabah."
        },
        {
          "version": "NLT",
          "text": "Bela son of Beor, who ruled in Edom from his city of Dinhabah."
        },
        {
          "version": "ESV",
          "text": "Bela the son of Beor reigned in Edom, the name of his city being Dinhabah."
        },
        {
          "version": "NKJV",
          "text": "Bela the son of Beor reigned in Edom, and the name of his city was Dinhabah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah."
        },
        {
          "reference": "1 Samuel 8:5",
          "text": "“Look,” they said, “you are old, and your sons do not walk in your ways. Now appoint a king to judge us like all the other nations.”"
        },
        {
          "reference": "1 Samuel 9:16-17",
          "text": "“At this time tomorrow I will send you a man from the land of Benjamin, and you are to anoint him ruler over My people Israel; he will save them from the hand of the Philistines. For I have looked upon My people, because their cry has come to Me.” / When Samuel saw Saul, the LORD told him, “Here is the man of whom I spoke; he shall rule over My people.”"
        },
        {
          "reference": "1 Samuel 10:1",
          "text": "Then Samuel took a flask of oil, poured it on Saul’s head, kissed him, and said, “Has not the LORD anointed you ruler over His inheritance?"
        },
        {
          "reference": "1 Samuel 15:1",
          "text": "Then Samuel said to Saul, “The LORD sent me to anoint you king over His people Israel. Now therefore, listen to the words of the LORD."
        },
        {
          "reference": "1 Samuel 16:1",
          "text": "Now the LORD said to Samuel, “How long are you going to mourn for Saul, since I have rejected him as king over Israel? Fill your horn with oil and go. I am sending you to Jesse of Bethlehem, for I have selected from his sons a king for Myself.”"
        },
        {
          "reference": "1 Samuel 16:12-13",
          "text": "So Jesse sent for his youngest son and brought him in. He was ruddy, with beautiful eyes and a handsome appearance. And the LORD said, “Rise and anoint him, for he is the one.” / So Samuel took the horn of oil and anointed him in the presence of his brothers, and the Spirit of the LORD rushed upon David from that day forward. Then Samuel set out and went to Ramah."
        },
        {
          "reference": "1 Kings 11:43",
          "text": "And Solomon rested with his fathers and was buried in the city of his father David. And his son Rehoboam reigned in his place."
        },
        {
          "reference": "1 Kings 14:20",
          "text": "And the length of Jeroboam’s reign was twenty-two years, and he rested with his fathers, and his son Nadab reigned in his place."
        },
        {
          "reference": "1 Kings 16:28",
          "text": "And Omri rested with his fathers and was buried in Samaria, and his son Ahab reigned in his place."
        },
        {
          "reference": "2 Kings 8:16",
          "text": "In the fifth year of the reign of Joram son of Ahab over Israel, Jehoram son of Jehoshaphat succeeded his father as king of Judah."
        },
        {
          "reference": "2 Kings 14:29",
          "text": "And Jeroboam rested with his fathers, the kings of Israel. And his son Zechariah reigned in his place."
        },
        {
          "reference": "2 Kings 15:7",
          "text": "And Azariah rested with his fathers and was buried near them in the City of David. And his son Jotham reigned in his place."
        },
        {
          "reference": "2 Kings 16:20",
          "text": "And Ahaz rested with his fathers and was buried with them in the City of David, and his son Hezekiah reigned in his place."
        },
        {
          "reference": "Matthew 1:6",
          "text": "and Jesse the father of David the king. Next: David was the father of Solomon by Uriah’s wife,"
        }
      ]
    },
    {
      "reference": "Genesis 36:33",
      "book": "Genesis",
      "chapter": 36,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "When Bela died, Jobab son of Zerah from Bozrah succeeded him as king."
        },
        {
          "version": "NLT",
          "text": "When Bela died, Jobab son of Zerah from Bozrah became king in his place."
        },
        {
          "version": "ESV",
          "text": "Bela died, and Jobab the son of Zerah of Bozrah reigned in his place."
        },
        {
          "version": "NKJV",
          "text": "And when Bela died, Jobab the son of Zerah of Bozrah reigned in his place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:44",
          "text": "When Bela died, Jobab son of Zerah from Bozrah reigned in his place."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 36:31",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites:"
        },
        {
          "reference": "Genesis 36:40-43",
          "text": "These are the names of Esau’s chiefs, according to their families and regions, by their names: Chiefs Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "1 Chronicles 1:43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah."
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 27:29",
          "text": "May peoples serve you and nations bow down to you. May you be the master of your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed, and those who bless you be blessed.”"
        },
        {
          "reference": "Genesis 27:40",
          "text": "You shall live by the sword and serve your brother. But when you rebel, you will tear his yoke from your neck.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:20-30",
          "text": "These are the sons of Seir the Horite, who were living in the land: Lotan, Shobal, Zibeon, Anah, / Dishon, Ezer, and Dishan. They are the chiefs of the Horites, the descendants of Seir in the land of Edom. / The sons of Lotan were Hori and Hemam. Timna was Lotan’s sister. ..."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        }
      ]
    },
    {
      "reference": "Genesis 36:34",
      "book": "Genesis",
      "chapter": 36,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "When Jobab died, Husham from the land of the Temanites succeeded him as king."
        },
        {
          "version": "NLT",
          "text": "When Jobab died, Husham from the land of the Temanites became king in his place."
        },
        {
          "version": "ESV",
          "text": "Jobab died, and Husham of the land of the Temanites reigned in his place."
        },
        {
          "version": "NKJV",
          "text": "When Jobab died, Husham of the land of the Temanites reigned in his place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:43-44",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place."
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 27:40",
          "text": "You shall live by the sword and serve your brother. But when you rebel, you will tear his yoke from your neck.”"
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 33:16",
          "text": "So that day Esau started on his way back to Seir,"
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "2 Samuel 8:14",
          "text": "He placed garrisons throughout Edom, and all the Edomites were subject to David. So the LORD made David victorious wherever he went."
        },
        {
          "reference": "1 Kings 11:14-15",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom."
        },
        {
          "reference": "2 Kings 8:20-22",
          "text": "In the days of Jehoram, Edom rebelled against the hand of Judah and appointed their own king. / So Jehoram crossed over to Zair with all his chariots. When the Edomites surrounded him and his chariot commanders, he rose up and attacked by night. His troops, however, fled to their homes. / So to this day Edom has been in rebellion against the hand of Judah. Likewise, Libnah rebelled at the same time."
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:35",
      "book": "Genesis",
      "chapter": 36,
      "verse": 35,
      "translations": [
        {
          "version": "NIV",
          "text": "When Husham died, Hadad son of Bedad, who defeated Midian in the country of Moab, succeeded him as king. His city was named Avith."
        },
        {
          "version": "NLT",
          "text": "When Husham died, Hadad son of Bedad became king in his place and ruled from the city of Avith. He was the one who defeated the Midianites in the land of Moab."
        },
        {
          "version": "ESV",
          "text": "Husham died, and Hadad the son of Bedad, who defeated Midian in the country of Moab, reigned in his place, the name of his city being Avith."
        },
        {
          "version": "NKJV",
          "text": "And when Husham died, Hadad the son of Bedad, who attacked Midian in the field of Moab, reigned in his place. And the name of his city was Avith."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:46",
          "text": "When Husham died, Hadad son of Bedad, who defeated Midian in the country of Moab, reigned in his place. And the name of his city was Avith."
        },
        {
          "reference": "1 Chronicles 1:43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah."
        },
        {
          "reference": "1 Chronicles 1:51",
          "text": "Then Hadad died. Now the chiefs of Edom were Timna, Alvah, Jetheth,"
        },
        {
          "reference": "1 Chronicles 1:50",
          "text": "When Baal-hanan died, Hadad reigned in his place. His city was named Pau, and his wife’s name was Mehetabel daughter of Matred, the daughter of Me-zahab."
        },
        {
          "reference": "1 Chronicles 1:52",
          "text": "Oholibamah, Elah, Pinon,"
        },
        {
          "reference": "1 Chronicles 1:53",
          "text": "Kenaz, Teman, Mibzar,"
        },
        {
          "reference": "1 Chronicles 1:54",
          "text": "Magdiel, and Iram. These were the chiefs of Edom."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Deuteronomy 2:29",
          "text": "just as the descendants of Esau who live in Seir and the Moabites who live in Ar did for us, until we cross the Jordan into the land that the LORD our God is giving us.”"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Numbers 24:18",
          "text": "Edom will become a possession, as will Seir, his enemy; but Israel will perform with valor."
        },
        {
          "reference": "Obadiah 1:1",
          "text": "This is the vision of Obadiah: This is what the Lord GOD says about Edom—We have heard a message from the LORD; an envoy has been sent among the nations to say, “Rise up, and let us go to battle against her!”—"
        },
        {
          "reference": "Obadiah 1:8-9",
          "text": "In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? / Then your mighty men, O Teman, will be terrified, so that everyone in the mountains of Esau will be cut down in the slaughter."
        },
        {
          "reference": "Obadiah 1:19",
          "text": "Those from the Negev will possess the mountains of Esau; those from the foothills will possess the land of the Philistines. They will occupy the fields of Ephraim and Samaria, and Benjamin will possess Gilead."
        }
      ]
    },
    {
      "reference": "Genesis 36:36",
      "book": "Genesis",
      "chapter": 36,
      "verse": 36,
      "translations": [
        {
          "version": "NIV",
          "text": "When Hadad died, Samlah from Masrekah succeeded him as king."
        },
        {
          "version": "NLT",
          "text": "When Hadad died, Samlah from the city of Masrekah became king in his place."
        },
        {
          "version": "ESV",
          "text": "Hadad died, and Samlah of Masrekah reigned in his place."
        },
        {
          "version": "NKJV",
          "text": "When Hadad died, Samlah of Masrekah reigned in his place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:43-50",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 28:3-4",
          "text": "May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples. / And may He give the blessing of Abraham to you and your descendants, so that you may possess the land where you dwell as a foreigner, the land God gave to Abraham.”"
        },
        {
          "reference": "Genesis 32:28",
          "text": "Then the man said, “Your name will no longer be Jacob, but Israel, because you have struggled with God and with men, and you have prevailed.”"
        },
        {
          "reference": "Genesis 35:11",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 24:18",
          "text": "Edom will become a possession, as will Seir, his enemy; but Israel will perform with valor."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "1 Kings 11:14-17",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:37",
      "book": "Genesis",
      "chapter": 36,
      "verse": 37,
      "translations": [
        {
          "version": "NIV",
          "text": "When Samlah died, Shaul from Rehoboth on the river succeeded him as king."
        },
        {
          "version": "NLT",
          "text": "When Samlah died, Shaul from the city of Rehoboth-on-the-River became king in his place."
        },
        {
          "version": "ESV",
          "text": "Samlah died, and Shaul of Rehoboth on the Euphrates reigned in his place."
        },
        {
          "version": "NKJV",
          "text": "And when Samlah died, Saul of Rehoboth- by -the-River reigned in his place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:43-50",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 27:39-40",
          "text": "His father Isaac answered him: “Behold, your dwelling place shall be away from the richness of the land, away from the dew of heaven above. / You shall live by the sword and serve your brother. But when you rebel, you will tear his yoke from your neck.”"
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 32:3",
          "text": "Jacob sent messengers ahead of him to his brother Esau in the land of Seir, the country of Edom."
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7-8",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land. / The third generation of children born to them may enter the assembly of the LORD."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "2 Samuel 8:14",
          "text": "He placed garrisons throughout Edom, and all the Edomites were subject to David. So the LORD made David victorious wherever he went."
        },
        {
          "reference": "1 Kings 11:14-17",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        },
        {
          "reference": "2 Kings 8:20-22",
          "text": "In the days of Jehoram, Edom rebelled against the hand of Judah and appointed their own king. / So Jehoram crossed over to Zair with all his chariots. When the Edomites surrounded him and his chariot commanders, he rose up and attacked by night. His troops, however, fled to their homes. / So to this day Edom has been in rebellion against the hand of Judah. Likewise, Libnah rebelled at the same time."
        }
      ]
    },
    {
      "reference": "Genesis 36:38",
      "book": "Genesis",
      "chapter": 36,
      "verse": 38,
      "translations": [
        {
          "version": "NIV",
          "text": "When Shaul died, Baal-Hanan son of Akbor succeeded him as king."
        },
        {
          "version": "NLT",
          "text": "When Shaul died, Baal-hanan son of Acbor became king in his place."
        },
        {
          "version": "ESV",
          "text": "Shaul died, and Baal-hanan the son of Achbor reigned in his place."
        },
        {
          "version": "NKJV",
          "text": "When Saul died, Baal-Hanan the son of Achbor reigned in his place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:50",
          "text": "When Baal-hanan died, Hadad reigned in his place. His city was named Pau, and his wife’s name was Mehetabel daughter of Matred, the daughter of Me-zahab."
        },
        {
          "reference": "1 Chronicles 1:51",
          "text": "Then Hadad died. Now the chiefs of Edom were Timna, Alvah, Jetheth,"
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 36:31-39",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "2 Samuel 8:14",
          "text": "He placed garrisons throughout Edom, and all the Edomites were subject to David. So the LORD made David victorious wherever he went."
        },
        {
          "reference": "1 Kings 11:14-17",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        },
        {
          "reference": "2 Kings 8:20-22",
          "text": "In the days of Jehoram, Edom rebelled against the hand of Judah and appointed their own king. / So Jehoram crossed over to Zair with all his chariots. When the Edomites surrounded him and his chariot commanders, he rose up and attacked by night. His troops, however, fled to their homes. / So to this day Edom has been in rebellion against the hand of Judah. Likewise, Libnah rebelled at the same time."
        },
        {
          "reference": "Psalm 60:8",
          "text": "Moab is My washbasin; upon Edom I toss My sandal; over Philistia I shout in triumph.”"
        },
        {
          "reference": "Psalm 108:9",
          "text": "Moab is My washbasin; upon Edom I toss My sandal; over Philistia I shout in triumph.”"
        }
      ]
    },
    {
      "reference": "Genesis 36:39",
      "book": "Genesis",
      "chapter": 36,
      "verse": 39,
      "translations": [
        {
          "version": "NIV",
          "text": "When Baal-Hanan son of Akbor died, Hadad succeeded him as king. His city was named Pau, and his wife’s name was Mehetabel daughter of Matred, the daughter of Me-Zahab."
        },
        {
          "version": "NLT",
          "text": "When Baal-hanan son of Acbor died, Hadad became king in his place and ruled from the city of Pau. His wife was Mehetabel, the daughter of Matred and granddaughter of Me-zahab."
        },
        {
          "version": "ESV",
          "text": "Baal-hanan the son of Achbor died, and Hadar reigned in his place, the name of his city being Pau; his wife’s name was Mehetabel, the daughter of Matred, daughter of Mezahab."
        },
        {
          "version": "NKJV",
          "text": "And when Baal-Hanan the son of Achbor died, Hadar reigned in his place; and the name of his city was Pau. His wife’s name was Mehetabel, the daughter of Matred, the daughter of Mezahab."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:50-51",
          "text": "When Baal-hanan died, Hadad reigned in his place. His city was named Pau, and his wife’s name was Mehetabel daughter of Matred, the daughter of Me-zahab. / Then Hadad died. Now the chiefs of Edom were Timna, Alvah, Jetheth,"
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:31-43",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7-8",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land. / The third generation of children born to them may enter the assembly of the LORD."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "1 Kings 11:14-17",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        },
        {
          "reference": "2 Kings 8:20-22",
          "text": "In the days of Jehoram, Edom rebelled against the hand of Judah and appointed their own king. / So Jehoram crossed over to Zair with all his chariots. When the Edomites surrounded him and his chariot commanders, he rose up and attacked by night. His troops, however, fled to their homes. / So to this day Edom has been in rebellion against the hand of Judah. Likewise, Libnah rebelled at the same time."
        },
        {
          "reference": "Psalm 83:6",
          "text": "the tents of Edom and the Ishmaelites, of Moab and the Hagrites,"
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        }
      ]
    },
    {
      "reference": "Genesis 36:40",
      "book": "Genesis",
      "chapter": 36,
      "verse": 40,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the chiefs descended from Esau, by name, according to their clans and regions: Timna, Alvah, Jetheth,"
        },
        {
          "version": "NLT",
          "text": "These are the names of the leaders of the clans descended from Esau, who lived in the places named for them: Timna, Alvah, Jetheth,"
        },
        {
          "version": "ESV",
          "text": "These are the names of the chiefs of Esau, according to their clans and their dwelling places, by their names: the chiefs Timna, Alvah, Jetheth,"
        },
        {
          "version": "NKJV",
          "text": "And these were the names of the chiefs of Esau, according to their families and their places, by their names: Chief Timnah, Chief Alvah, Chief Jetheth,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:51-54",
          "text": "Then Hadad died. Now the chiefs of Edom were Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Obadiah 1:6-9",
          "text": "But how Esau will be pillaged, his hidden treasures sought out! / All the men allied with you will drive you to the border; the men at peace with you will deceive and overpower you. Those who eat your bread will set a trap for you without your awareness of it. / In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? ..."
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Isaiah 34:5-6",
          "text": "When My sword has drunk its fill in the heavens, then it will come down upon Edom, upon the people I have devoted to destruction. / The sword of the LORD is bathed in blood. It drips with fat—with the blood of lambs and goats, with the fat of the kidneys of rams. For the LORD has a sacrifice in Bozrah, a great slaughter in the land of Edom."
        },
        {
          "reference": "Isaiah 63:1-6",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.” / Why are Your clothes red, and Your garments like one who treads the winepress? / “I have trodden the winepress alone, and no one from the nations was with Me. I trampled them in My anger and trod them down in My fury; their blood spattered My garments, and all My clothes were stained. ..."
        },
        {
          "reference": "Psalm 137:7",
          "text": "Remember, O LORD, the sons of Edom on the day Jerusalem fell: “Destroy it,” they said, “tear it down to its foundations!”"
        },
        {
          "reference": "Lamentations 4:21-22",
          "text": "So rejoice and be glad, O Daughter of Edom, you who dwell in the land of Uz. Yet the cup will pass to you as well; you will get drunk and expose yourself. / O Daughter of Zion, your punishment is complete; He will not prolong your exile. But He will punish your iniquity, O Daughter of Edom; He will expose your sins."
        }
      ]
    },
    {
      "reference": "Genesis 36:41",
      "book": "Genesis",
      "chapter": 36,
      "verse": 41,
      "translations": [
        {
          "version": "NIV",
          "text": "Oholibamah, Elah, Pinon,"
        },
        {
          "version": "NLT",
          "text": "Oholibamah, Elah, Pinon,"
        },
        {
          "version": "ESV",
          "text": "Oholibamah, Elah, Pinon,"
        },
        {
          "version": "NKJV",
          "text": "Chief Aholibamah, Chief Elah, Chief Pinon,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:51",
          "text": "Then Hadad died. Now the chiefs of Edom were Timna, Alvah, Jetheth,"
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:43-54",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: Bela son of Beor. His city was named Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. / When Jobab died, Husham from the land of the Temanites reigned in his place. ..."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Numbers 24:18",
          "text": "Edom will become a possession, as will Seir, his enemy; but Israel will perform with valor."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Obadiah 1:8-9",
          "text": "In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? / Then your mighty men, O Teman, will be terrified, so that everyone in the mountains of Esau will be cut down in the slaughter."
        },
        {
          "reference": "Jeremiah 49:7-22",
          "text": "Concerning Edom, this is what the LORD of Hosts says: “Is there no longer wisdom in Teman? Has counsel perished from the prudent? Has their wisdom decayed? / Turn and run! Lie low, O dwellers of Dedan, for I will bring disaster on Esau at the time I punish him. / If grape gatherers came to you, would they not leave some gleanings? Were thieves to come in the night, would they not steal only what they wanted? ..."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11-12",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly. / So I will send fire upon Teman to consume the citadels of Bozrah.”"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 12:16-17",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright. / For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        }
      ]
    },
    {
      "reference": "Genesis 36:42",
      "book": "Genesis",
      "chapter": 36,
      "verse": 42,
      "translations": [
        {
          "version": "NIV",
          "text": "Kenaz, Teman, Mibzar,"
        },
        {
          "version": "NLT",
          "text": "Kenaz, Teman, Mibzar,"
        },
        {
          "version": "ESV",
          "text": "Kenaz, Teman, Mibzar,"
        },
        {
          "version": "NKJV",
          "text": "Chief Kenaz, Chief Teman, Chief Mibzar,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:53",
          "text": "Kenaz, Teman, Mibzar,"
        },
        {
          "reference": "Genesis 25:13-16",
          "text": "These are the names of the sons of Ishmael in the order of their birth: Nebaioth the firstborn of Ishmael, then Kedar, Adbeel, Mibsam, / Mishma, Dumah, Massa, / Hadad, Tema, Jetur, Naphish, and Kedemah. ..."
        },
        {
          "reference": "Genesis 28:9",
          "text": "Esau went to Ishmael and married Mahalath, the sister of Nebaioth and daughter of Abraham’s son Ishmael, in addition to the wives he already had."
        },
        {
          "reference": "Genesis 36:1-8",
          "text": "This is the account of Esau (that is, Edom). / Esau took his wives from the daughters of Canaan: Adah daughter of Elon the Hittite, Oholibamah daughter of Anah and granddaughter of Zibeon the Hivite, / and Basemath daughter of Ishmael and sister of Nebaioth. ..."
        },
        {
          "reference": "Genesis 36:15-19",
          "text": "These are the chiefs among the sons of Esau. The sons of Eliphaz the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, / Korah, Gatam, and Amalek. They are the chiefs of Eliphaz in the land of Edom, and they are the grandsons of Adah. / These are the sons of Esau’s son Reuel: Chiefs Nahath, Zerah, Shammah, and Mizzah. They are the chiefs descended from Reuel in the land of Edom, and they are the grandsons of Esau’s wife Basemath. ..."
        },
        {
          "reference": "Genesis 36:31-39",
          "text": "These are the kings who reigned in the land of Edom before any king reigned over the Israelites: / Bela son of Beor reigned in Edom; the name of his city was Dinhabah. / When Bela died, Jobab son of Zerah from Bozrah reigned in his place. ..."
        },
        {
          "reference": "Exodus 15:15",
          "text": "Then the chiefs of Edom will be dismayed; trembling will seize the leaders of Moab; those who dwell in Canaan will melt away,"
        },
        {
          "reference": "Numbers 20:14-21",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 2:4-5",
          "text": "and command the people: ‘You will pass through the territory of your brothers, the descendants of Esau, who live in Seir. They will be afraid of you, so you must be very careful. / Do not provoke them, for I will not give you any of their land, not even a footprint, because I have given Mount Seir to Esau as his possession."
        },
        {
          "reference": "Deuteronomy 23:7-8",
          "text": "Do not despise an Edomite, for he is your brother. Do not despise an Egyptian, because you lived as a foreigner in his land. / The third generation of children born to them may enter the assembly of the LORD."
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "1 Samuel 14:47",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them."
        },
        {
          "reference": "1 Kings 11:14-17",
          "text": "Then the LORD raised up against Solomon an adversary, Hadad the Edomite, from the royal line of Edom. / Earlier, when David was in Edom, Joab the commander of the army had gone to bury the dead and had struck down every male in Edom. / Joab and all Israel had stayed there six months, until he had killed every male in Edom. ..."
        },
        {
          "reference": "2 Kings 8:20-22",
          "text": "In the days of Jehoram, Edom rebelled against the hand of Judah and appointed their own king. / So Jehoram crossed over to Zair with all his chariots. When the Edomites surrounded him and his chariot commanders, he rose up and attacked by night. His troops, however, fled to their homes. / So to this day Edom has been in rebellion against the hand of Judah. Likewise, Libnah rebelled at the same time."
        },
        {
          "reference": "Psalm 83:6",
          "text": "the tents of Edom and the Ishmaelites, of Moab and the Hagrites,"
        }
      ]
    },
    {
      "reference": "Genesis 36:43",
      "book": "Genesis",
      "chapter": 36,
      "verse": 43,
      "translations": [
        {
          "version": "NIV",
          "text": "Magdiel and Iram. These were the chiefs of Edom, according to their settlements in the land they occupied. This is the family line of Esau, the father of the Edomites."
        },
        {
          "version": "NLT",
          "text": "Magdiel, and Iram. These are the leaders of the clans of Edom, listed according to their settlements in the land they occupied. They all descended from Esau, the ancestor of the Edomites."
        },
        {
          "version": "ESV",
          "text": "Magdiel, and Iram; these are the chiefs of Edom (that is, Esau, the father of Edom), according to their dwelling places in the land of their possession."
        },
        {
          "version": "NKJV",
          "text": "Chief Magdiel, and Chief Iram. These were the chiefs of Edom, according to their dwelling places in the land of their possession. Esau was the father of the Edomites."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 1:51-54",
          "text": "Then Hadad died. Now the chiefs of Edom were Timna, Alvah, Jetheth, / Oholibamah, Elah, Pinon, / Kenaz, Teman, Mibzar, ..."
        },
        {
          "reference": "Deuteronomy 2:12",
          "text": "The Horites used to live in Seir, but the descendants of Esau drove them out. They destroyed the Horites from before them and settled in their place, just as Israel did in the land that the LORD gave them as their possession.)"
        },
        {
          "reference": "Deuteronomy 2:22",
          "text": "just as He had done for the descendants of Esau who lived in Seir, when He destroyed the Horites from before them. They drove them out and have lived in their place to this day."
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "1 Chronicles 1:35-37",
          "text": "The sons of Esau: Eliphaz, Reuel, Jeush, Jalam, and Korah. / The sons of Eliphaz: Teman, Omar, Zepho, Gatam, and Kenaz; and by Timna, Amalek. / The sons of Reuel: Nahath, Zerah, Shammah, and Mizzah."
        },
        {
          "reference": "1 Chronicles 1:38-42",
          "text": "The sons of Seir: Lotan, Shobal, Zibeon, Anah, Dishon, Ezer, and Dishan. / The sons of Lotan: Hori and Homam. Timna was Lotan’s sister. / The sons of Shobal: Alvan, Manahath, Ebal, Shepho, and Onam. The sons of Zibeon: Aiah and Anah. ..."
        },
        {
          "reference": "Obadiah 1:6",
          "text": "But how Esau will be pillaged, his hidden treasures sought out!"
        },
        {
          "reference": "Obadiah 1:8-9",
          "text": "In that day, declares the LORD, will I not destroy the wise men of Edom and the men of understanding in the mountains of Esau? / Then your mighty men, O Teman, will be terrified, so that everyone in the mountains of Esau will be cut down in the slaughter."
        },
        {
          "reference": "Jeremiah 49:10",
          "text": "But I will strip Esau bare; I will uncover his hiding places, and he will be unable to conceal himself. His descendants will be destroyed along with his relatives and neighbors, and he will be no more."
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Malachi 1:2-4",
          "text": "“I have loved you,” says the LORD. But you ask, “How have You loved us?” “Was not Esau Jacob’s brother?” declares the LORD. “Yet Jacob I have loved, / but Esau I have hated, and I have made his mountains a wasteland and left his inheritance to the desert jackals.” / Though Edom may say, “We have been devastated, but we will rebuild the ruins,” this is what the LORD of Hosts says: “They may build, but I will demolish. They will be called the Land of Wickedness, and a people with whom the LORD is indignant forever."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 11:20",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future."
        },
        {
          "reference": "Romans 9:6-8",
          "text": "It is not as though God’s word has failed. For not all who are descended from Israel are Israel. / Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring."
        },
        {
          "reference": "Romans 9:22-24",
          "text": "What if God, intending to show His wrath and make His power known, bore with great patience the vessels of His wrath, prepared for destruction? / What if He did this to make the riches of His glory known to the vessels of His mercy, whom He prepared in advance for glory— / including us, whom He has called not only from the Jews, but also from the Gentiles?"
        }
      ]
    }
  ]
}