{
  "book": "genesis",
  "chapter": 37,
  "verses": [
    {
      "reference": "Genesis 37:1",
      "book": "Genesis",
      "chapter": 37,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob lived in the land where his father had stayed, the land of Canaan."
        },
        {
          "version": "NLT",
          "text": "So Jacob settled again in the land of Canaan, where his father had lived as a foreigner."
        },
        {
          "version": "ESV",
          "text": "Jacob lived in the land of his father’s sojournings, in the land of Canaan."
        },
        {
          "version": "NKJV",
          "text": "Now Jacob dwelt in the land where his father was a stranger, in the land of Canaan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 28:4",
          "text": "And may He give the blessing of Abraham to you and your descendants, so that you may possess the land where you dwell as a foreigner, the land God gave to Abraham.”"
        },
        {
          "reference": "Genesis 35:27",
          "text": "Jacob returned to his father Isaac at Mamre, near Kiriath-arba (that is, Hebron), where Abraham and Isaac had stayed."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 26:3",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham."
        },
        {
          "reference": "Genesis 50:24",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.”"
        },
        {
          "reference": "Exodus 6:8",
          "text": "And I will bring you into the land that I swore to give to Abraham, Isaac, and Jacob. I will give it to you as a possession. I am the LORD!’”"
        },
        {
          "reference": "Hebrews 11:9",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Acts 7:5",
          "text": "He gave him no inheritance here, not even a foot of ground. But God promised to give possession of the land to Abraham and his descendants, even though he did not yet have a child."
        },
        {
          "reference": "Genesis 13:15",
          "text": "for all the land that you see, I will give to you and your offspring forever."
        },
        {
          "reference": "Genesis 15:7",
          "text": "The LORD also told him, “I am the LORD, who brought you out of Ur of the Chaldeans to give you this land to possess.”"
        },
        {
          "reference": "Genesis 48:4",
          "text": "and told me, ‘Behold, I will make you fruitful and multiply you; I will make you a multitude of peoples, and will give this land to your descendants after you as an everlasting possession.’"
        },
        {
          "reference": "Genesis 28:13",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie."
        },
        {
          "reference": "Genesis 46:4",
          "text": "I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Genesis 47:9",
          "text": "“My travels have lasted 130 years,” Jacob replied. “My years have been few and hard, and they have not matched the years of the travels of my fathers.”"
        }
      ]
    },
    {
      "reference": "Genesis 37:2",
      "book": "Genesis",
      "chapter": 37,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "This is the account of Jacob’s family line. Joseph, a young man of seventeen, was tending the flocks with his brothers, the sons of Bilhah and the sons of Zilpah, his father’s wives, and he brought their father a bad report about them."
        },
        {
          "version": "NLT",
          "text": "This is the account of Jacob and his family. When Joseph was seventeen years old, he often tended his father’s flocks. He worked for his half brothers, the sons of his father’s wives Bilhah and Zilpah. But Joseph reported to his father some of the bad things his brothers were doing."
        },
        {
          "version": "ESV",
          "text": "These are the generations of Jacob. Joseph, being seventeen years old, was pasturing the flock with his brothers. He was a boy with the sons of Bilhah and Zilpah, his father’s wives. And Joseph brought a bad report of them to their father."
        },
        {
          "version": "NKJV",
          "text": "This is the history of Jacob. Joseph, being seventeen years old, was feeding the flock with his brothers. And the lad was with the sons of Bilhah and the sons of Zilpah, his father’s wives; and Joseph brought a bad report of them to his father."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Psalm 105:17",
          "text": "He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "John 7:5",
          "text": "For even His own brothers did not believe in Him."
        },
        {
          "reference": "Matthew 27:18",
          "text": "For he knew it was out of envy that they had handed Jesus over to him."
        },
        {
          "reference": "Acts 7:10",
          "text": "and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 41:46",
          "text": "Now Joseph was thirty years old when he entered the service of Pharaoh king of Egypt. And Joseph left Pharaoh’s presence and traveled throughout the land of Egypt."
        },
        {
          "reference": "Genesis 39:2",
          "text": "And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master."
        },
        {
          "reference": "Genesis 42:6",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground."
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Genesis 29:9",
          "text": "While he was still speaking with them, Rachel arrived with her father’s sheep, for she was a shepherdess."
        },
        {
          "reference": "Genesis 30:35",
          "text": "That very day Laban removed all the streaked or spotted male goats and every speckled or spotted female goat—every one that had any white on it—and every dark-colored lamb, and he placed them under the care of his sons."
        }
      ]
    },
    {
      "reference": "Genesis 37:3",
      "book": "Genesis",
      "chapter": 37,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Israel loved Joseph more than any of his other sons, because he had been born to him in his old age; and he made an ornate robe for him."
        },
        {
          "version": "NLT",
          "text": "Jacob loved Joseph more than any of his other children because Joseph had been born to him in his old age. So one day Jacob had a special gift made for Joseph—a beautiful robe."
        },
        {
          "version": "ESV",
          "text": "Now Israel loved Joseph more than any other of his sons, because he was the son of his old age. And he made him a robe of many colors."
        },
        {
          "version": "NKJV",
          "text": "Now Israel loved Joseph more than all his children, because he was the son of his old age. Also he made him a tunic of many colors."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "John 3:16",
          "text": "For God so loved the world that He gave His one and only Son, that everyone who believes in Him shall not perish but have eternal life."
        },
        {
          "reference": "Matthew 3:17",
          "text": "And a voice from heaven said, “This is My beloved Son, in whom I am well pleased!”"
        },
        {
          "reference": "Luke 3:22",
          "text": "and the Holy Spirit descended on Him in a bodily form like a dove. And a voice came from heaven: “You are My beloved Son; in You I am well pleased.”"
        },
        {
          "reference": "John 1:14",
          "text": "The Word became flesh and made His dwelling among us. We have seen His glory, the glory of the one and only Son from the Father, full of grace and truth."
        },
        {
          "reference": "Romans 8:29",
          "text": "For those God foreknew, He also predestined to be conformed to the image of His Son, so that He would be the firstborn among many brothers."
        },
        {
          "reference": "Colossians 1:13",
          "text": "He has rescued us from the dominion of darkness and brought us into the kingdom of His beloved Son,"
        },
        {
          "reference": "Hebrews 1:2",
          "text": "But in these last days He has spoken to us by His Son, whom He appointed heir of all things, and through whom He made the universe."
        },
        {
          "reference": "1 John 4:9",
          "text": "This is how God’s love was revealed among us: God sent His one and only Son into the world, so that we might live through Him."
        },
        {
          "reference": "Ephesians 1:6",
          "text": "to the praise of His glorious grace, which He has freely given us in the Beloved One."
        },
        {
          "reference": "Philippians 2:9-11",
          "text": "Therefore God exalted Him to the highest place and gave Him the name above all names, / that at the name of Jesus every knee should bow, in heaven and on earth and under the earth, / and every tongue confess that Jesus Christ is Lord, to the glory of God the Father."
        },
        {
          "reference": "1 Peter 2:4",
          "text": "As you come to Him, the living stone, rejected by men but chosen and precious in God’s sight,"
        },
        {
          "reference": "John 5:20",
          "text": "The Father loves the Son and shows Him all He does. And to your amazement, He will show Him even greater works than these."
        },
        {
          "reference": "1 John 3:1",
          "text": "Behold what manner of love the Father has given to us, that we should be called children of God. And that is what we are! The reason the world does not know us is that it did not know Him."
        },
        {
          "reference": "Exodus 33:19",
          "text": "“I will cause all My goodness to pass before you,” the LORD replied, “and I will proclaim My name—the LORD—in your presence. I will have mercy on whom I have mercy, and I will have compassion on whom I have compassion.”"
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        }
      ]
    },
    {
      "reference": "Genesis 37:4",
      "book": "Genesis",
      "chapter": 37,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "When his brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "version": "NLT",
          "text": "But his brothers hated Joseph because their father loved him more than the rest of them. They couldn’t say a kind word to him."
        },
        {
          "version": "ESV",
          "text": "But when his brothers saw that their father loved him more than all his brothers, they hated him and could not speak peacefully to him."
        },
        {
          "version": "NKJV",
          "text": "But when his brothers saw that their father loved him more than all his brothers, they hated him and could not speak peaceably to him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "John 15:18-19",
          "text": "If the world hates you, understand that it hated Me first. / If you were of the world, it would love you as its own. Instead, the world hates you, because you are not of the world, but I have chosen you out of the world."
        },
        {
          "reference": "1 John 3:12-13",
          "text": "Do not be like Cain, who belonged to the evil one and murdered his brother. And why did Cain slay him? Because his own deeds were evil, while those of his brother were righteous. / So do not be surprised, brothers, if the world hates you."
        },
        {
          "reference": "Matthew 10:36",
          "text": "A man’s enemies will be the members of his own household.’"
        },
        {
          "reference": "John 7:5",
          "text": "For even His own brothers did not believe in Him."
        },
        {
          "reference": "1 Samuel 18:8-9",
          "text": "And Saul was furious and resented this song. “They have ascribed tens of thousands to David,” he said, “but only thousands to me. What more can he have but the kingdom?” / And from that day forward Saul kept a jealous eye on David."
        },
        {
          "reference": "Proverbs 27:4",
          "text": "Wrath is cruel and anger is like a flood, but who can withstand jealousy?"
        },
        {
          "reference": "James 3:14-16",
          "text": "But if you harbor bitter jealousy and selfish ambition in your hearts, do not boast in it or deny the truth. / Such wisdom does not come from above, but is earthly, unspiritual, demonic. / For where jealousy and selfish ambition exist, there will be disorder and every evil practice."
        },
        {
          "reference": "1 John 4:20",
          "text": "If anyone says, “I love God,” but hates his brother, he is a liar. For anyone who does not love his brother, whom he has seen, cannot love God, whom he has not seen."
        },
        {
          "reference": "John 15:25",
          "text": "But this is to fulfill what is written in their Law: ‘They hated Me without reason.’"
        },
        {
          "reference": "Matthew 27:18",
          "text": "For he knew it was out of envy that they had handed Jesus over to him."
        },
        {
          "reference": "Mark 15:10",
          "text": "For he knew it was out of envy that the chief priests had handed Jesus over."
        },
        {
          "reference": "Psalm 69:4",
          "text": "Those who hate me without cause outnumber the hairs of my head; many are those who would destroy me—my enemies for no reason. Though I did not steal, I must repay."
        },
        {
          "reference": "Psalm 38:19",
          "text": "Many are my enemies without cause, and many hate me without reason."
        },
        {
          "reference": "Proverbs 10:12",
          "text": "Hatred stirs up dissension, but love covers all transgressions."
        }
      ]
    },
    {
      "reference": "Genesis 37:5",
      "book": "Genesis",
      "chapter": 37,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph had a dream, and when he told it to his brothers, they hated him all the more."
        },
        {
          "version": "NLT",
          "text": "One night Joseph had a dream, and when he told his brothers about it, they hated him more than ever."
        },
        {
          "version": "ESV",
          "text": "Now Joseph had a dream, and when he told it to his brothers they hated him even more."
        },
        {
          "version": "NKJV",
          "text": "Now Joseph had a dream, and he told it to his brothers; and they hated him even more."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:1-32",
          "text": "After two full years had passed, Pharaoh had a dream: He was standing beside the Nile, / when seven cows, sleek and well-fed, came up from the river and began to graze among the reeds. / After them, seven other cows, sickly and thin, came up from the Nile and stood beside the well-fed cows on the bank of the river. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 40:8",
          "text": "“We both had dreams,” they replied, “but there is no one to interpret them.” Then Joseph said to them, “Don’t interpretations belong to God? Tell me your dreams.”"
        },
        {
          "reference": "Daniel 2:1-3",
          "text": "In the second year of his reign, Nebuchadnezzar had dreams that troubled his spirit, and sleep escaped him. / So the king gave orders to summon the magicians, enchanters, sorcerers, and astrologers to explain his dreams. When they came and stood before the king, / he said to them, “I have had a dream, and my spirit is anxious to understand it.”"
        },
        {
          "reference": "Matthew 1:20",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit."
        },
        {
          "reference": "Genesis 42:9",
          "text": "Joseph remembered his dreams about them and said, “You are spies! You have come to see if our land is vulnerable.”"
        },
        {
          "reference": "Daniel 4:5-9",
          "text": "I had a dream, and it frightened me; while I was in my bed, the images and visions in my mind alarmed me. / So I issued a decree that all the wise men of Babylon be brought before me to interpret the dream for me. / When the magicians, enchanters, astrologers, and diviners came in, I told them the dream, but they could not interpret it for me. ..."
        },
        {
          "reference": "Matthew 2:12-13",
          "text": "And having been warned in a dream not to return to Herod, they withdrew to their country by another route. / When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.”"
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Joel 2:28",
          "text": "And afterward, I will pour out My Spirit on all people. Your sons and daughters will prophesy, your old men will dream dreams, your young men will see visions."
        },
        {
          "reference": "Acts 2:17",
          "text": "‘In the last days, God says, I will pour out My Spirit on all people. Your sons and daughters will prophesy, your young men will see visions, your old men will dream dreams."
        },
        {
          "reference": "Genesis 45:5-8",
          "text": "And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. / For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. ..."
        },
        {
          "reference": "Numbers 12:6",
          "text": "He said, “Hear now My words: If there is a prophet among you, I, the LORD, will reveal Myself to him in a vision; I will speak to him in a dream."
        },
        {
          "reference": "Acts 16:9",
          "text": "During the night, Paul had a vision of a man of Macedonia standing and pleading with him, “Come over to Macedonia and help us.”"
        },
        {
          "reference": "Genesis 28:12",
          "text": "And Jacob had a dream about a ladder that rested on the earth with its top reaching up to heaven, and God’s angels were going up and down the ladder."
        }
      ]
    },
    {
      "reference": "Genesis 37:6",
      "book": "Genesis",
      "chapter": 37,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "He said to them, “Listen to this dream I had:"
        },
        {
          "version": "NLT",
          "text": "“Listen to this dream,” he said."
        },
        {
          "version": "ESV",
          "text": "He said to them, “Hear this dream that I have dreamed:"
        },
        {
          "version": "NKJV",
          "text": "So he said to them, “Please hear this dream which I have dreamed:"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:15-16",
          "text": "Pharaoh said to Joseph, “I had a dream, and no one can interpret it. But I have heard it said of you that when you hear a dream you can interpret it.” / “I myself cannot do it,” Joseph replied, “but God will give Pharaoh a sound answer.”"
        },
        {
          "reference": "Genesis 40:8",
          "text": "“We both had dreams,” they replied, “but there is no one to interpret them.” Then Joseph said to them, “Don’t interpretations belong to God? Tell me your dreams.”"
        },
        {
          "reference": "Genesis 42:9",
          "text": "Joseph remembered his dreams about them and said, “You are spies! You have come to see if our land is vulnerable.”"
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Psalm 105:19",
          "text": "until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Daniel 2:28-30",
          "text": "But there is a God in heaven who reveals mysteries, and He has made known to King Nebuchadnezzar what will happen in the latter days. Your dream and the visions that came into your mind as you lay on your bed were these: / As you lay on your bed, O king, your thoughts turned to the future, and the Revealer of Mysteries made known to you what will happen. / And to me this mystery has been revealed, not because I have more wisdom than any man alive, but in order that the interpretation might be made known to the king, and that you may understand the thoughts of your mind."
        },
        {
          "reference": "Daniel 4:18-19",
          "text": "This is the dream that I, King Nebuchadnezzar, saw. Now, Belteshazzar, tell me the interpretation, because none of the wise men of my kingdom can interpret it for me. But you are able, because the spirit of the holy gods is in you.” / For a time, Daniel, who was also known as Belteshazzar, was perplexed, and his thoughts alarmed him. So the king said, “Belteshazzar, do not let the dream or its interpretation alarm you.” “My lord,” replied Belteshazzar, “may the dream apply to those who hate you, and its interpretation to your enemies!"
        },
        {
          "reference": "Matthew 2:12-13",
          "text": "And having been warned in a dream not to return to Herod, they withdrew to their country by another route. / When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.”"
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Acts 2:17",
          "text": "‘In the last days, God says, I will pour out My Spirit on all people. Your sons and daughters will prophesy, your young men will see visions, your old men will dream dreams."
        },
        {
          "reference": "Acts 16:9-10",
          "text": "During the night, Paul had a vision of a man of Macedonia standing and pleading with him, “Come over to Macedonia and help us.” / As soon as Paul had seen the vision, we got ready to leave for Macedonia, concluding that God had called us to preach the gospel to them."
        },
        {
          "reference": "Acts 18:9-10",
          "text": "One night the Lord spoke to Paul in a vision: “Do not be afraid; keep on speaking; do not be silent. / For I am with you and no one will lay a hand on you, because I have many people in this city.”"
        },
        {
          "reference": "1 Corinthians 2:9-10",
          "text": "Rather, as it is written: “No eye has seen, no ear has heard, no heart has imagined, what God has prepared for those who love Him.” / But God has revealed it to us by the Spirit. The Spirit searches all things, even the deep things of God."
        },
        {
          "reference": "Hebrews 1:1-2",
          "text": "On many past occasions and in many different ways, God spoke to our fathers through the prophets. / But in these last days He has spoken to us by His Son, whom He appointed heir of all things, and through whom He made the universe."
        }
      ]
    },
    {
      "reference": "Genesis 37:7",
      "book": "Genesis",
      "chapter": 37,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "We were binding sheaves of grain out in the field when suddenly my sheaf rose and stood upright, while your sheaves gathered around mine and bowed down to it.”"
        },
        {
          "version": "NLT",
          "text": "“We were out in the field, tying up bundles of grain. Suddenly my bundle stood up, and your bundles all gathered around and bowed low before mine!”"
        },
        {
          "version": "ESV",
          "text": "Behold, we were binding sheaves in the field, and behold, my sheaf arose and stood upright. And behold, your sheaves gathered around it and bowed down to my sheaf.”"
        },
        {
          "version": "NKJV",
          "text": "There we were, binding sheaves in the field. Then behold, my sheaf arose and also stood upright; and indeed your sheaves stood all around and bowed down to my sheaf.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        },
        {
          "reference": "Genesis 50:18-20",
          "text": "His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Psalm 105:17-21",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 41:41-44",
          "text": "Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.” / Then Pharaoh removed the signet ring from his finger, put it on Joseph’s finger, clothed him in garments of fine linen, and placed a gold chain around his neck. / He had Joseph ride in his second chariot, with men calling out before him, “Bow the knee!” So he placed him over all the land of Egypt. ..."
        },
        {
          "reference": "Genesis 45:5-8",
          "text": "And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. / For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. ..."
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "Matthew 27:29",
          "text": "And they twisted together a crown of thorns and set it on His head. They put a staff in His right hand, knelt down before Him, and mocked Him, saying, “Hail, King of the Jews!”"
        },
        {
          "reference": "John 19:2-3",
          "text": "The soldiers twisted together a crown of thorns, set it on His head, and dressed Him in a purple robe. / And they went up to Him again and again, saying, “Hail, King of the Jews!” and slapping Him in the face."
        },
        {
          "reference": "Philippians 2:9-11",
          "text": "Therefore God exalted Him to the highest place and gave Him the name above all names, / that at the name of Jesus every knee should bow, in heaven and on earth and under the earth, / and every tongue confess that Jesus Christ is Lord, to the glory of God the Father."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "1 Samuel 2:7-8",
          "text": "The LORD sends poverty and wealth; He humbles and He exalts. / He raises the poor from the dust and lifts the needy from the ash heap. He seats them among princes and bestows on them a throne of honor. For the foundations of the earth are the LORD’s, and upon them He has set the world."
        },
        {
          "reference": "Daniel 2:48-49",
          "text": "Then the king promoted Daniel and gave him many generous gifts. He made him ruler over the entire province of Babylon and chief administrator over all the wise men of Babylon. / And at Daniel’s request, the king appointed Shadrach, Meshach, and Abednego to manage the province of Babylon, while Daniel remained in the king’s court."
        },
        {
          "reference": "Daniel 6:3",
          "text": "Soon, by his extraordinary spirit, Daniel distinguished himself among the administrators and satraps. So the king planned to set him over the whole kingdom."
        },
        {
          "reference": "1 Peter 5:6",
          "text": "Humble yourselves, therefore, under God’s mighty hand, so that in due time He may exalt you."
        }
      ]
    },
    {
      "reference": "Genesis 37:8",
      "book": "Genesis",
      "chapter": 37,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "His brothers said to him, &#8220Do you intend to reign over us? Will you actually rule us?” And they hated him all the more because of his dream and what he had said."
        },
        {
          "version": "NLT",
          "text": "His brothers responded, “So you think you will be our king, do you? Do you actually think you will reign over us?” And they hated him all the more because of his dreams and the way he talked about them."
        },
        {
          "version": "ESV",
          "text": "His brothers said to him, “Are you indeed to reign over us? Or are you indeed to rule over us?” So they hated him even more for his dreams and for his words."
        },
        {
          "version": "NKJV",
          "text": "And his brothers said to him, “Shall you indeed reign over us? Or shall you indeed have dominion over us?” So they hated him even more for his dreams and for his words."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 37:9",
      "book": "Genesis",
      "chapter": 37,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he had another dream, and he told it to his brothers. “Listen,” he said, “I had another dream, and this time the sun and moon and eleven stars were bowing down to me.”"
        },
        {
          "version": "NLT",
          "text": "Soon Joseph had another dream, and again he told his brothers about it. “Listen, I have had another dream,” he said. “The sun, moon, and eleven stars bowed low before me!”"
        },
        {
          "version": "ESV",
          "text": "Then he dreamed another dream and told it to his brothers and said, “Behold, I have dreamed another dream. Behold, the sun, the moon, and eleven stars were bowing down to me.”"
        },
        {
          "version": "NKJV",
          "text": "Then he dreamed still another dream and told it to his brothers, and said, “Look, I have dreamed another dream. And this time, the sun, the moon, and the eleven stars bowed down to me.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 12:1-2",
          "text": "And a great sign appeared in heaven: a woman clothed in the sun, with the moon under her feet and a crown of twelve stars on her head. / She was pregnant and crying out in the pain and agony of giving birth."
        },
        {
          "reference": "Matthew 2:2",
          "text": "asking, “Where is the One who has been born King of the Jews? We saw His star in the east and have come to worship Him.”"
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Daniel 7:13-14",
          "text": "In my vision in the night I continued to watch, and I saw One like the Son of Man coming with the clouds of heaven. He approached the Ancient of Days and was led into His presence. / And He was given dominion, glory, and kingship, that the people of every nation and language should serve Him. His dominion is an everlasting dominion that will not pass away, and His kingdom is one that will never be destroyed."
        },
        {
          "reference": "Luke 1:32-33",
          "text": "He will be great and will be called the Son of the Most High. The Lord God will give Him the throne of His father David, / and He will reign over the house of Jacob forever. His kingdom will never end!”"
        },
        {
          "reference": "John 1:11",
          "text": "He came to His own, and His own did not receive Him."
        },
        {
          "reference": "Isaiah 60:3",
          "text": "Nations will come to your light, and kings to the brightness of your dawn."
        },
        {
          "reference": "Philippians 2:10-11",
          "text": "that at the name of Jesus every knee should bow, in heaven and on earth and under the earth, / and every tongue confess that Jesus Christ is Lord, to the glory of God the Father."
        },
        {
          "reference": "Romans 11:28-29",
          "text": "Regarding the gospel, they are enemies on your account; but regarding election, they are loved on account of the patriarchs. / For God’s gifts and His call are irrevocable."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "1 Corinthians 15:41",
          "text": "The sun has one degree of splendor, the moon another, and the stars another; and star differs from star in splendor."
        },
        {
          "reference": "Isaiah 49:7",
          "text": "Thus says the LORD, the Redeemer and Holy One of Israel, to Him who was despised and abhorred by the nation, to the Servant of rulers: “Kings will see You and rise, and princes will bow down, because of the LORD, who is faithful, the Holy One of Israel, who has chosen You.”"
        },
        {
          "reference": "John 19:12",
          "text": "From then on, Pilate tried to release Him, but the Jews kept shouting, “If you release this man, you are no friend of Caesar. Anyone who declares himself a king is defying Caesar.”"
        },
        {
          "reference": "Acts 2:30",
          "text": "But he was a prophet and knew that God had promised him on oath that He would place one of his descendants on his throne."
        }
      ]
    },
    {
      "reference": "Genesis 37:10",
      "book": "Genesis",
      "chapter": 37,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "When he told his father as well as his brothers, his father rebuked him and said, “What is this dream you had? Will your mother and I and your brothers actually come and bow down to the ground before you?”"
        },
        {
          "version": "NLT",
          "text": "This time he told the dream to his father as well as to his brothers, but his father scolded him. “What kind of dream is that?” he asked. “Will your mother and I and your brothers actually come and bow to the ground before you?”"
        },
        {
          "version": "ESV",
          "text": "But when he told it to his father and to his brothers, his father rebuked him and said to him, “What is this dream that you have dreamed? Shall I and your mother and your brothers indeed come to bow ourselves to the ground before you?”"
        },
        {
          "version": "NKJV",
          "text": "So he told it to his father and his brothers; and his father rebuked him and said to him, “What is this dream that you have dreamed? Shall your mother and I and your brothers indeed come to bow down to the earth before you?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        },
        {
          "reference": "Genesis 50:18-21",
          "text": "His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. ..."
        },
        {
          "reference": "Matthew 2:11",
          "text": "On coming to the house, they saw the Child with His mother Mary, and they fell down and worshiped Him. Then they opened their treasures and presented Him with gifts of gold and frankincense and myrrh."
        },
        {
          "reference": "Luke 2:34-35",
          "text": "Then Simeon blessed them and said to His mother Mary: “Behold, this Child is appointed to cause the rise and fall of many in Israel, and to be a sign that will be spoken against, / so that the thoughts of many hearts will be revealed—and a sword will pierce your soul as well.”"
        },
        {
          "reference": "John 19:27",
          "text": "Then He said to the disciple, “Here is your mother.” So from that hour, this disciple took her into his home."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Philippians 2:10-11",
          "text": "that at the name of Jesus every knee should bow, in heaven and on earth and under the earth, / and every tongue confess that Jesus Christ is Lord, to the glory of God the Father."
        },
        {
          "reference": "Revelation 5:13",
          "text": "And I heard every creature in heaven and on earth and under the earth and in the sea, and all that is in them, saying: “To Him who sits on the throne and to the Lamb be praise and honor and glory and power forever and ever!”"
        },
        {
          "reference": "Genesis 41:39-43",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.” ..."
        },
        {
          "reference": "Genesis 45:8-11",
          "text": "Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt. / Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. ..."
        },
        {
          "reference": "Exodus 4:13-16",
          "text": "But Moses replied, “Please, Lord, send someone else.” / Then the anger of the LORD burned against Moses, and He said, “Is not Aaron the Levite your brother? I know that he can speak well, and he is now on his way to meet you. When he sees you, he will be glad in his heart. / You are to speak to him and put the words in his mouth. I will help both of you to speak, and I will teach you what to do. ..."
        },
        {
          "reference": "Numbers 12:1-8",
          "text": "Then Miriam and Aaron criticized Moses because of the Cushite woman he had married, for he had taken a Cushite wife. / “Does the LORD speak only through Moses?” they said. “Does He not also speak through us?” And the LORD heard this. / Now Moses was a very humble man, more so than any man on the face of the earth. ..."
        },
        {
          "reference": "1 Samuel 2:35",
          "text": "Then I will raise up for Myself a faithful priest. He will do whatever is in My heart and mind. And I will build for him an enduring house, and he will walk before My anointed one for all time."
        },
        {
          "reference": "1 Samuel 16:11-13",
          "text": "And Samuel asked him, “Are these all the sons you have?” “There is still the youngest,” Jesse replied, “but he is tending the sheep.” “Send for him,” Samuel replied. “For we will not sit down to eat until he arrives.” / So Jesse sent for his youngest son and brought him in. He was ruddy, with beautiful eyes and a handsome appearance. And the LORD said, “Rise and anoint him, for he is the one.” / So Samuel took the horn of oil and anointed him in the presence of his brothers, and the Spirit of the LORD rushed upon David from that day forward. Then Samuel set out and went to Ramah."
        },
        {
          "reference": "2 Samuel 7:12-16",
          "text": "And when your days are fulfilled and you rest with your fathers, I will raise up your descendant after you, who will come from your own body, and I will establish his kingdom. / He will build a house for My Name, and I will establish the throne of his kingdom forever. / I will be his Father, and he will be My son. When he does wrong, I will discipline him with the rod of men and with the blows of the sons of men. ..."
        }
      ]
    },
    {
      "reference": "Genesis 37:11",
      "book": "Genesis",
      "chapter": 37,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "His brothers were jealous of him, but his father kept the matter in mind."
        },
        {
          "version": "NLT",
          "text": "But while his brothers were jealous of Joseph, his father wondered what the dreams meant."
        },
        {
          "version": "ESV",
          "text": "And his brothers were jealous of him, but his father kept the saying in mind."
        },
        {
          "version": "NKJV",
          "text": "And his brothers envied him, but his father kept the matter in mind."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Matthew 27:18",
          "text": "For he knew it was out of envy that they had handed Jesus over to him."
        },
        {
          "reference": "Mark 15:10",
          "text": "For he knew it was out of envy that the chief priests had handed Jesus over."
        },
        {
          "reference": "John 7:5",
          "text": "For even His own brothers did not believe in Him."
        },
        {
          "reference": "Acts 13:45",
          "text": "But when the Jews saw the crowds, they were filled with jealousy, and they blasphemously contradicted what Paul was saying."
        },
        {
          "reference": "James 3:14-16",
          "text": "But if you harbor bitter jealousy and selfish ambition in your hearts, do not boast in it or deny the truth. / Such wisdom does not come from above, but is earthly, unspiritual, demonic. / For where jealousy and selfish ambition exist, there will be disorder and every evil practice."
        },
        {
          "reference": "1 Corinthians 3:3",
          "text": "for you are still worldly. For since there is jealousy and dissension among you, are you not worldly? Are you not walking in the way of man?"
        },
        {
          "reference": "Galatians 5:20-21",
          "text": "idolatry and sorcery; hatred, discord, jealousy, and rage; rivalries, divisions, factions, / and envy; drunkenness, orgies, and the like. I warn you, as I did before, that those who practice such things will not inherit the kingdom of God."
        },
        {
          "reference": "Romans 13:13",
          "text": "Let us behave decently, as in the daytime, not in carousing and drunkenness, not in sexual immorality and debauchery, not in dissension and jealousy."
        },
        {
          "reference": "1 Peter 2:1",
          "text": "Rid yourselves, therefore, of all malice, deceit, hypocrisy, envy, and slander."
        },
        {
          "reference": "Proverbs 14:30",
          "text": "A tranquil heart is life to the body, but envy rots the bones."
        },
        {
          "reference": "Proverbs 27:4",
          "text": "Wrath is cruel and anger is like a flood, but who can withstand jealousy?"
        },
        {
          "reference": "Psalm 106:16",
          "text": "In the camp they envied Moses, as well as Aaron, the holy one of the LORD."
        },
        {
          "reference": "Numbers 12:1-2",
          "text": "Then Miriam and Aaron criticized Moses because of the Cushite woman he had married, for he had taken a Cushite wife. / “Does the LORD speak only through Moses?” they said. “Does He not also speak through us?” And the LORD heard this."
        },
        {
          "reference": "1 Samuel 18:8-9",
          "text": "And Saul was furious and resented this song. “They have ascribed tens of thousands to David,” he said, “but only thousands to me. What more can he have but the kingdom?” / And from that day forward Saul kept a jealous eye on David."
        }
      ]
    },
    {
      "reference": "Genesis 37:12",
      "book": "Genesis",
      "chapter": 37,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "Now his brothers had gone to graze their father’s flocks near Shechem,"
        },
        {
          "version": "NLT",
          "text": "Soon after this, Joseph’s brothers went to pasture their father’s flocks at Shechem."
        },
        {
          "version": "ESV",
          "text": "Now his brothers went to pasture their father’s flock near Shechem."
        },
        {
          "version": "NKJV",
          "text": "Then his brothers went to feed their father’s flock in Shechem."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:7",
          "text": "“Look,” said Jacob, “it is still broad daylight; it is not yet time to gather the livestock. Water the sheep and take them back to pasture.”"
        },
        {
          "reference": "Genesis 31:4",
          "text": "So Jacob sent word and called Rachel and Leah to the field where his flocks were,"
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 46:31-34",
          "text": "Joseph said to his brothers and to his father’s household, “I will go up and inform Pharaoh: ‘My brothers and my father’s household from the land of Canaan have come to me. / The men are shepherds; they raise livestock, and they have brought their flocks and herds and all that they own.’ / When Pharaoh summons you and asks, ‘What is your occupation?’ ..."
        },
        {
          "reference": "Genesis 47:3-4",
          "text": "“What is your occupation?” Pharaoh asked Joseph’s brothers. “Your servants are shepherds,” they replied, “both we and our fathers.” / Then they said to Pharaoh, “We have come to live in the land for a time, because there is no pasture for the flocks of your servants, since the famine in the land of Canaan has been severe. So now, please allow your servants to settle in the land of Goshen.”"
        },
        {
          "reference": "1 Samuel 17:15",
          "text": "but David went back and forth from Saul to tend his father’s sheep in Bethlehem."
        },
        {
          "reference": "1 Samuel 17:34-37",
          "text": "David replied, “Your servant has been tending his father’s sheep, and whenever a lion or a bear came and carried off a lamb from the flock, / I went after it, struck it down, and delivered the lamb from its mouth. If it reared up against me, I would grab it by its fur, strike it down, and kill it. / Your servant has killed lions and bears; this uncircumcised Philistine will be like one of them, for he has defied the armies of the living God.” ..."
        },
        {
          "reference": "1 Samuel 25:16",
          "text": "They were a wall around us, both day and night, the whole time we were herding our sheep near them."
        },
        {
          "reference": "1 Chronicles 4:39-41",
          "text": "and they journeyed to the entrance of Gedor, to the east side of the valley, in search of pasture for their flocks. / There they found rich, good pasture, and the land was spacious, peaceful, and quiet; for some Hamites had lived there formerly. / These who were noted by name came in the days of Hezekiah king of Judah. They attacked the Hamites in their dwellings as well as the Meunites who were there, devoting them to destruction even to this day. Then they settled in their place, because there was pasture for their flocks."
        },
        {
          "reference": "Psalm 23:1-2",
          "text": "A Psalm of David. The LORD is my shepherd; I shall not want. / He makes me lie down in green pastures; He leads me beside quiet waters."
        },
        {
          "reference": "Psalm 78:70-72",
          "text": "He chose David His servant and took him from the sheepfolds; / from tending the ewes He brought him to be shepherd of His people Jacob, of Israel His inheritance. / So David shepherded them with integrity of heart and guided them with skillful hands."
        },
        {
          "reference": "Isaiah 40:11",
          "text": "He tends His flock like a shepherd; He gathers the lambs in His arms and carries them close to His heart. He gently leads the nursing ewes."
        },
        {
          "reference": "Jeremiah 23:4",
          "text": "I will raise up shepherds over them who will tend them, and they will no longer be afraid or dismayed, nor will any go missing, declares the LORD."
        },
        {
          "reference": "Ezekiel 34:12-16",
          "text": "As a shepherd looks for his scattered sheep when he is among the flock, so I will look for My flock. I will rescue them from all the places to which they were scattered on a day of clouds and darkness. / I will bring them out from the peoples, gather them from the countries, and bring them into their own land. I will feed them on the mountains of Israel, in the ravines, and in all the settlements of the land. / I will feed them in good pasture, and the lofty mountains of Israel will be their grazing land. There they will lie down in a good grazing land; they will feed in rich pasture on the mountains of Israel. ..."
        },
        {
          "reference": "John 10:11-14",
          "text": "I am the good shepherd. The good shepherd lays down His life for the sheep. / The hired hand is not the shepherd, and the sheep are not his own. When he sees the wolf coming, he abandons the sheep and runs away. Then the wolf pounces on them and scatters the flock. / The man runs away because he is a hired servant and is unconcerned for the sheep. ..."
        }
      ]
    },
    {
      "reference": "Genesis 37:13",
      "book": "Genesis",
      "chapter": 37,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "and Israel said to Joseph, &#8220As you know, your brothers are grazing the flocks near Shechem. Come, I am going to send you to them.” “Very well,” he replied."
        },
        {
          "version": "NLT",
          "text": "When they had been gone for some time, Jacob said to Joseph, “Your brothers are pasturing the sheep at Shechem. Get ready, and I will send you to them.” “I’m ready to go,” Joseph replied."
        },
        {
          "version": "ESV",
          "text": "And Israel said to Joseph, “Are not your brothers pasturing the flock at Shechem? Come, I will send you to them.” And he said to him, “Here I am.”"
        },
        {
          "version": "NKJV",
          "text": "And Israel said to Joseph, “Are not your brothers feeding the flock in Shechem? Come, I will send you to them.” So he said to him, “Here I am.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 37:14",
      "book": "Genesis",
      "chapter": 37,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "So he said to him, “Go and see if all is well with your brothers and with the flocks, and bring word back to me.” Then he sent him off from the Valley of Hebron. When Joseph arrived at Shechem,"
        },
        {
          "version": "NLT",
          "text": "“Go and see how your brothers and the flocks are getting along,” Jacob said. “Then come back and bring me a report.” So Jacob sent him on his way, and Joseph traveled to Shechem from their home in the valley of Hebron."
        },
        {
          "version": "ESV",
          "text": "So he said to him, “Go now, see if it is well with your brothers and with the flock, and bring me word.” So he sent him from the Valley of Hebron, and he came to Shechem."
        },
        {
          "version": "NKJV",
          "text": "Then he said to him, “Please go and see if it is well with your brothers and well with the flocks, and bring back word to me.” So he sent him out of the Valley of Hebron, and he went to Shechem."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:12-13",
          "text": "Some time later, Joseph’s brothers had gone to pasture their father’s flocks near Shechem. / Israel said to him, “Are not your brothers pasturing the flocks at Shechem? Get ready; I am sending you to them.” “I am ready,” Joseph replied."
        },
        {
          "reference": "Genesis 42:18-20",
          "text": "and on the third day he said to them, “I fear God. So do this and you will live: / If you are honest, leave one of your brothers in custody while the rest of you go and take back grain to relieve the hunger of your households. / Then bring your youngest brother to me so that your words can be verified, that you may not die.” And to this they consented."
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 46:28-30",
          "text": "Now Jacob had sent Judah ahead of him to Joseph to get directions to Goshen. When Jacob’s family arrived in the land of Goshen, / Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "1 Samuel 17:17-18",
          "text": "One day Jesse said to his son David, “Take this ephah of roasted grain and these ten loaves of bread for your brothers and hurry to their camp. / Take also these ten portions of cheese to the commander of their unit. Check on the welfare of your brothers and bring back an assurance from them."
        },
        {
          "reference": "1 Samuel 17:20-22",
          "text": "So David got up early in the morning, left the flock with a keeper, loaded up, and set out as Jesse had instructed him. He reached the camp as the army was marching out to its position and shouting the battle cry. / And Israel and the Philistines arrayed in formation against each other. / Then David left his supplies in the care of the quartermaster and ran to the battle line. When he arrived, he asked his brothers how they were doing."
        },
        {
          "reference": "1 Samuel 17:28-29",
          "text": "Now when David’s oldest brother Eliab heard him speaking to the men, his anger burned against David. “Why have you come down here?” he asked. “And with whom did you leave those few sheep in the wilderness? I know your pride and wickedness of heart—you have come down to see the battle!” / “What have I done now?” said David. “Was it not just a question?”"
        },
        {
          "reference": "2 Samuel 18:18",
          "text": "During his lifetime, Absalom had set up for himself a pillar in the King’s Valley, for he had said, “I have no son to preserve the memory of my name.” So he gave the pillar his name, and to this day it is called Absalom’s Monument."
        },
        {
          "reference": "2 Kings 6:13-14",
          "text": "So the king said, “Go and see where he is, that I may send men to capture him.” On receiving the report, “Elisha is in Dothan,” / the king of Aram sent horses, chariots, and a great army. They went there by night and surrounded the city."
        },
        {
          "reference": "Jeremiah 37:17",
          "text": "Later, King Zedekiah sent for Jeremiah and received him in his palace, where he asked him privately, “Is there a word from the LORD?” “There is,” Jeremiah replied. “You will be delivered into the hand of the king of Babylon.”"
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        },
        {
          "reference": "Matthew 21:33-41",
          "text": "Listen to another parable: There was a landowner who planted a vineyard. He put a wall around it, dug a winepress in it, and built a tower. Then he rented it out to some tenants and went away on a journey. / When the harvest time drew near, he sent his servants to the tenants to collect his share of the fruit. / But the tenants seized his servants. They beat one, killed another, and stoned a third. ..."
        },
        {
          "reference": "Luke 20:13-15",
          "text": "‘What shall I do?’ asked the owner of the vineyard. ‘I will send my beloved son. Perhaps they will respect him.’ / But when the tenants saw the son, they discussed it among themselves and said, ‘This is the heir. Let us kill him, and the inheritance will be ours.’ / So they threw him out of the vineyard and killed him. What then will the owner of the vineyard do to them?"
        },
        {
          "reference": "John 7:3-5",
          "text": "So Jesus’ brothers said to Him, “Leave here and go to Judea, so that Your disciples there may see the works You are doing. / For no one who wants to be known publicly acts in secret. Since You are doing these things, show Yourself to the world.” / For even His own brothers did not believe in Him."
        },
        {
          "reference": "John 11:7-8",
          "text": "and then He said to the disciples, “Let us go back to Judea.” / “Rabbi,” they replied, “the Jews just tried to stone You, and You are going back there?”"
        }
      ]
    },
    {
      "reference": "Genesis 37:15",
      "book": "Genesis",
      "chapter": 37,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "a man found him wandering around in the fields and asked him, “What are you looking for?”"
        },
        {
          "version": "NLT",
          "text": "When he arrived there, a man from the area noticed him wandering around the countryside. “What are you looking for?” he asked."
        },
        {
          "version": "ESV",
          "text": "And a man found him wandering in the fields. And the man asked him, “What are you seeking?”"
        },
        {
          "version": "NKJV",
          "text": "Now a certain man found him, and there he was, wandering in the field. And the man asked him, saying, “What are you seeking?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 18:12-14",
          "text": "What do you think? If a man has a hundred sheep and one of them goes astray, will he not leave the ninety-nine on the hills and go out to search for the one that is lost? / And if he finds it, truly I tell you, he rejoices more over that one sheep than over the ninety-nine that did not go astray. / In the same way, your Father in heaven is not willing that any of these little ones should perish."
        },
        {
          "reference": "Luke 15:4-7",
          "text": "“What man among you, if he has a hundred sheep and loses one of them, does not leave the ninety-nine in the pasture and go after the one that is lost, until he finds it? / And when he finds it, he joyfully puts it on his shoulders, / comes home, and calls together his friends and neighbors to tell them, ‘Rejoice with me, for I have found my lost sheep!’ ..."
        },
        {
          "reference": "John 1:38",
          "text": "Jesus turned and saw them following. “What do you want?” He asked. They said to Him, “Rabbi” (which means Teacher), “where are You staying?”"
        },
        {
          "reference": "Acts 9:5-6",
          "text": "“Who are You, Lord?” Saul asked. “I am Jesus, whom you are persecuting,” He replied. / “Now get up and go into the city, and you will be told what you must do.”"
        },
        {
          "reference": "Hebrews 11:8",
          "text": "By faith Abraham, when called to go to a place he would later receive as his inheritance, obeyed and went, without knowing where he was going."
        },
        {
          "reference": "1 Samuel 9:3-6",
          "text": "One day the donkeys of Saul’s father Kish wandered off, and Kish said to his son Saul, “Take one of the servants and go look for the donkeys.” / So Saul passed through the hill country of Ephraim and then through the land of Shalishah, but they did not find the donkeys. He and the servant went through the region of Shaalim, but they were not there. Then they went through the land of Benjamin, and still they did not find them. / When they reached the land of Zuph, Saul said to his servant, “Come, let us go back, or my father will stop worrying about the donkeys and start worrying about us.” ..."
        },
        {
          "reference": "1 Samuel 16:11",
          "text": "And Samuel asked him, “Are these all the sons you have?” “There is still the youngest,” Jesse replied, “but he is tending the sheep.” “Send for him,” Samuel replied. “For we will not sit down to eat until he arrives.”"
        },
        {
          "reference": "2 Kings 6:19",
          "text": "And Elisha told them, “This is not the way, and this is not the city. Follow me, and I will take you to the man you are seeking.” And he led them to Samaria."
        },
        {
          "reference": "Jeremiah 50:6",
          "text": "My people are lost sheep; their shepherds have led them astray, causing them to roam the mountains. They have wandered from mountain to hill; they have forgotten their resting place."
        },
        {
          "reference": "Ezekiel 34:11-12",
          "text": "For this is what the Lord GOD says: ‘Behold, I Myself will search for My flock and seek them out. / As a shepherd looks for his scattered sheep when he is among the flock, so I will look for My flock. I will rescue them from all the places to which they were scattered on a day of clouds and darkness."
        },
        {
          "reference": "Isaiah 53:6",
          "text": "We all like sheep have gone astray, each one has turned to his own way; and the LORD has laid upon Him the iniquity of us all."
        },
        {
          "reference": "Proverbs 3:6",
          "text": "in all your ways acknowledge Him, and He will make your paths straight."
        },
        {
          "reference": "Psalm 119:176",
          "text": "I have strayed like a lost sheep; seek Your servant, for I have not forgotten Your commandments."
        },
        {
          "reference": "Job 23:3",
          "text": "If only I knew where to find Him, so that I could go to His seat."
        },
        {
          "reference": "Exodus 2:15-17",
          "text": "When Pharaoh heard about this matter, he sought to kill Moses. But Moses fled from Pharaoh and settled in the land of Midian, where he sat down beside a well. / Now the priest of Midian had seven daughters, and they came to draw water and fill the troughs to water their father’s flock. / And when some shepherds came along and drove them away, Moses rose up to help them and watered their flock."
        }
      ]
    },
    {
      "reference": "Genesis 37:16",
      "book": "Genesis",
      "chapter": 37,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "He replied, “I’m looking for my brothers. Can you tell me where they are grazing their flocks?”"
        },
        {
          "version": "NLT",
          "text": "“I’m looking for my brothers,” Joseph replied. “Do you know where they are pasturing their sheep?”"
        },
        {
          "version": "ESV",
          "text": "“I am seeking my brothers,” he said. “Tell me, please, where they are pasturing the flock.”"
        },
        {
          "version": "NKJV",
          "text": "So he said, “I am seeking my brothers. Please tell me where they are feeding their flocks. ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:14",
          "text": "Then Israel told him, “Go now and see how your brothers and the flocks are faring, and bring word back to me.” So he sent him off from the Valley of Hebron. And when Joseph arrived in Shechem,"
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 45:4",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt!"
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 42:7-8",
          "text": "And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Genesis 41:51",
          "text": "Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.”"
        },
        {
          "reference": "Genesis 39:1",
          "text": "Meanwhile, Joseph had been taken down to Egypt, where an Egyptian named Potiphar, an officer of Pharaoh and captain of the guard, bought him from the Ishmaelites who had taken him there."
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "Psalm 105:17",
          "text": "He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Acts 7:14",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Genesis 45:8",
          "text": "Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt."
        },
        {
          "reference": "Genesis 46:29",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely."
        }
      ]
    },
    {
      "reference": "Genesis 37:17",
      "book": "Genesis",
      "chapter": 37,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "“They have moved on from here,” the man answered. “I heard them say, ‘Let’s go to Dothan.’” So Joseph went after his brothers and found them near Dothan."
        },
        {
          "version": "NLT",
          "text": "“Yes,” the man told him. “They have moved on from here, but I heard them say, ‘Let’s go on to Dothan.’” So Joseph followed his brothers to Dothan and found them there."
        },
        {
          "version": "ESV",
          "text": "And the man said, “They have gone away, for I heard them say, ‘Let us go to Dothan.’” So Joseph went after his brothers and found them at Dothan."
        },
        {
          "version": "NKJV",
          "text": "And the man said, “They have departed from here, for I heard them say, ‘Let us go to Dothan.’ ” So Joseph went after his brothers and found them in Dothan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:4-8",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. / For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Acts 7:11-14",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. ..."
        },
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Genesis 39:1-2",
          "text": "Meanwhile, Joseph had been taken down to Egypt, where an Egyptian named Potiphar, an officer of Pharaoh and captain of the guard, bought him from the Ishmaelites who had taken him there. / And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master."
        },
        {
          "reference": "Genesis 41:14-16",
          "text": "So Pharaoh sent for Joseph, who was quickly brought out of the dungeon. After he had shaved and changed his clothes, he went in before Pharaoh. / Pharaoh said to Joseph, “I had a dream, and no one can interpret it. But I have heard it said of you that when you hear a dream you can interpret it.” / “I myself cannot do it,” Joseph replied, “but God will give Pharaoh a sound answer.”"
        },
        {
          "reference": "Genesis 45:1-3",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Genesis 39:20-23",
          "text": "So Joseph’s master took him and had him thrown into the prison where the king’s prisoners were confined. While Joseph was there in the prison, / the LORD was with him and extended kindness to him, granting him favor in the eyes of the prison warden. / And the warden put all the prisoners under Joseph’s care, so that he was responsible for all that was done in the prison. ..."
        },
        {
          "reference": "Genesis 40:14-15",
          "text": "But when it goes well for you, please remember me and show me kindness by mentioning me to Pharaoh, that he might bring me out of this prison. / For I was kidnapped from the land of the Hebrews, and even here I have done nothing for which they should have put me in this dungeon.”"
        }
      ]
    },
    {
      "reference": "Genesis 37:18",
      "book": "Genesis",
      "chapter": 37,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "But they saw him in the distance, and before he reached them, they plotted to kill him."
        },
        {
          "version": "NLT",
          "text": "When Joseph’s brothers saw him coming, they recognized him in the distance. As he approached, they made plans to kill him."
        },
        {
          "version": "ESV",
          "text": "They saw him from afar, and before he came near to them they conspired against him to kill him."
        },
        {
          "version": "NKJV",
          "text": "Now when they saw him afar off, even before he came near them, they conspired against him to kill him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 27:1",
          "text": "When morning came, all the chief priests and elders of the people conspired against Jesus to put Him to death."
        },
        {
          "reference": "John 11:53",
          "text": "So from that day on they plotted to kill Him."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Matthew 21:38",
          "text": "But when the tenants saw the son, they said to one another, ‘This is the heir. Come, let us kill him and take his inheritance.’"
        },
        {
          "reference": "Mark 14:1",
          "text": "Now the Passover and the Feast of Unleavened Bread were two days away, and the chief priests and scribes were looking for a covert way to arrest Jesus and kill Him."
        },
        {
          "reference": "John 7:1",
          "text": "After this, Jesus traveled throughout Galilee. He did not want to travel in Judea, because the Jews there were trying to kill Him."
        },
        {
          "reference": "Acts 23:12-15",
          "text": "When daylight came, the Jews formed a conspiracy and bound themselves with an oath not to eat or drink until they had killed Paul. / More than forty of them were involved in this plot. / They went to the chief priests and elders and said, “We have bound ourselves with a solemn oath not to eat anything until we have killed Paul. ..."
        },
        {
          "reference": "Matthew 26:3-4",
          "text": "At that time the chief priests and elders of the people assembled in the courtyard of the high priest, whose name was Caiaphas, / and they conspired to arrest Jesus covertly and kill Him."
        },
        {
          "reference": "John 5:18",
          "text": "Because of this, the Jews tried all the harder to kill Him. Not only was He breaking the Sabbath, but He was even calling God His own Father, making Himself equal with God."
        },
        {
          "reference": "Luke 20:14",
          "text": "But when the tenants saw the son, they discussed it among themselves and said, ‘This is the heir. Let us kill him, and the inheritance will be ours.’"
        },
        {
          "reference": "1 John 3:12",
          "text": "Do not be like Cain, who belonged to the evil one and murdered his brother. And why did Cain slay him? Because his own deeds were evil, while those of his brother were righteous."
        },
        {
          "reference": "Jeremiah 11:19",
          "text": "For I was like a gentle lamb led to slaughter; I did not know that they had plotted against me: “Let us destroy the tree with its fruit; let us cut him off from the land of the living, that his name may be remembered no more.”"
        },
        {
          "reference": "Psalm 37:12",
          "text": "The wicked scheme against the righteous and gnash their teeth at them,"
        },
        {
          "reference": "1 Samuel 19:1",
          "text": "Then Saul ordered his son Jonathan and all his servants to kill David. But Jonathan delighted greatly in David,"
        },
        {
          "reference": "1 Samuel 23:19-20",
          "text": "Then the Ziphites came up to Saul at Gibeah and said, “Is not David hiding among us in the strongholds at Horesh, on the hill of Hachilah south of Jeshimon? / Now, O king, come down whenever your soul desires, and we will be responsible for delivering him into your hand.”"
        }
      ]
    },
    {
      "reference": "Genesis 37:19",
      "book": "Genesis",
      "chapter": 37,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "“Here comes that dreamer!” they said to each other."
        },
        {
          "version": "NLT",
          "text": "“Here comes the dreamer!” they said."
        },
        {
          "version": "ESV",
          "text": "They said to one another, “Here comes this dreamer."
        },
        {
          "version": "NKJV",
          "text": "Then they said to one another, “Look, this dreamer is coming!"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 21:38",
          "text": "But when the tenants saw the son, they said to one another, ‘This is the heir. Come, let us kill him and take his inheritance.’"
        },
        {
          "reference": "John 11:47-53",
          "text": "Then the chief priests and Pharisees convened the Sanhedrin and said, “What are we to do? This man is performing many signs. / If we let Him go on like this, everyone will believe in Him, and then the Romans will come and take away both our place and our nation.” / But one of them, named Caiaphas, who was high priest that year, said to them, “You know nothing at all! ..."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Matthew 27:18",
          "text": "For he knew it was out of envy that they had handed Jesus over to him."
        },
        {
          "reference": "Mark 15:10",
          "text": "For he knew it was out of envy that the chief priests had handed Jesus over."
        },
        {
          "reference": "John 7:1",
          "text": "After this, Jesus traveled throughout Galilee. He did not want to travel in Judea, because the Jews there were trying to kill Him."
        },
        {
          "reference": "John 15:18-25",
          "text": "If the world hates you, understand that it hated Me first. / If you were of the world, it would love you as its own. Instead, the world hates you, because you are not of the world, but I have chosen you out of the world. / Remember the word that I spoke to you: ‘No servant is greater than his master.’ If they persecuted Me, they will persecute you as well; if they kept My word, they will keep yours as well. ..."
        },
        {
          "reference": "Acts 5:17-18",
          "text": "Then the high priest and all his associates, who belonged to the party of the Sadducees, were filled with jealousy. They went out / and arrested the apostles and put them in the public jail."
        },
        {
          "reference": "Acts 13:45",
          "text": "But when the Jews saw the crowds, they were filled with jealousy, and they blasphemously contradicted what Paul was saying."
        },
        {
          "reference": "Acts 17:5",
          "text": "The Jews, however, became jealous. So they brought in some troublemakers from the marketplace, formed a mob, and sent the city into an uproar. They raided Jason’s house in search of Paul and Silas, hoping to bring them out to the people."
        },
        {
          "reference": "1 John 3:12",
          "text": "Do not be like Cain, who belonged to the evil one and murdered his brother. And why did Cain slay him? Because his own deeds were evil, while those of his brother were righteous."
        },
        {
          "reference": "1 John 3:15",
          "text": "Everyone who hates his brother is a murderer, and you know that eternal life does not reside in a murderer."
        },
        {
          "reference": "Genesis 4:8",
          "text": "Then Cain said to his brother Abel, “Let us go out to the field.” And while they were in the field, Cain rose up against his brother Abel and killed him."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:10",
          "text": "Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        }
      ]
    },
    {
      "reference": "Genesis 37:20",
      "book": "Genesis",
      "chapter": 37,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "&#8220Come now, let’s kill him and throw him into one of these cisterns and say that a ferocious animal devoured him. Then we’ll see what comes of his dreams.”"
        },
        {
          "version": "NLT",
          "text": "“Come on, let’s kill him and throw him into one of these cisterns. We can tell our father, ‘A wild animal has eaten him.’ Then we’ll see what becomes of his dreams!”"
        },
        {
          "version": "ESV",
          "text": "Come now, let us kill him and throw him into one of the pits. Then we will say that a fierce animal has devoured him, and we will see what will become of his dreams.”"
        },
        {
          "version": "NKJV",
          "text": "Come therefore, let us now kill him and cast him into some pit; and we shall say, ‘Some wild beast has devoured him.’ We shall see what will become of his dreams!”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 37:21",
      "book": "Genesis",
      "chapter": 37,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "When Reuben heard this, he tried to rescue him from their hands. “Let’s not take his life,” he said."
        },
        {
          "version": "NLT",
          "text": "But when Reuben heard of their scheme, he came to Joseph’s rescue. “Let’s not kill him,” he said."
        },
        {
          "version": "ESV",
          "text": "But when Reuben heard it, he rescued him out of their hands, saying, “Let us not take his life.”"
        },
        {
          "version": "NKJV",
          "text": "But Reuben heard it, and he delivered him out of their hands, and said, “Let us not kill him.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:22",
          "text": "And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 23:7",
          "text": "Stay far away from a false accusation. Do not kill the innocent or the just, for I will not acquit the guilty."
        },
        {
          "reference": "Deuteronomy 19:10",
          "text": "Thus innocent blood will not be shed in the land that the LORD your God is giving you as an inheritance, so that you will not be guilty of bloodshed."
        },
        {
          "reference": "1 Samuel 19:4-5",
          "text": "Then Jonathan spoke well of David to his father Saul and said to him, “The king should not sin against his servant David; he has not sinned against you. In fact, his actions have been highly beneficial to you. / He took his life in his hands when he struck down the Philistine, and the LORD worked a great salvation for all Israel. You saw it and rejoiced, so why would you sin against innocent blood by killing David for no reason?”"
        },
        {
          "reference": "1 Samuel 24:17",
          "text": "and said to David, “You are more righteous than I, for you have rewarded me with good, though I have rewarded you with evil."
        },
        {
          "reference": "2 Samuel 14:11",
          "text": "“Please,” she replied, “may the king invoke the LORD your God to prevent the avenger of blood from increasing the devastation, so that my son may not be destroyed!” “As surely as the LORD lives,” he vowed, “not a hair of your son’s head will fall to the ground.”"
        },
        {
          "reference": "2 Kings 5:7",
          "text": "When the king of Israel read the letter, he tore his clothes and asked, “Am I God, killing and giving life, that this man expects me to cure a leper? Surely you can see that he is seeking a quarrel with me!”"
        },
        {
          "reference": "Psalm 37:32-33",
          "text": "Though the wicked lie in wait for the righteous, and seek to slay them, / the LORD will not leave them in their power or let them be condemned under judgment."
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Proverbs 24:11-12",
          "text": "Rescue those being led away to death, and restrain those stumbling toward the slaughter. / If you say, “Behold, we did not know about this,” does not He who weighs hearts consider it? Does not the One who guards your life know? Will He not repay a man according to his deeds?"
        },
        {
          "reference": "Isaiah 53:9",
          "text": "He was assigned a grave with the wicked, and with a rich man in His death, although He had done no violence, nor was any deceit in His mouth."
        },
        {
          "reference": "Jeremiah 26:15",
          "text": "But know for certain that if you put me to death, you will bring innocent blood upon yourselves, upon this city, and upon its residents; for truly the LORD has sent me to speak all these words in your hearing.”"
        },
        {
          "reference": "Matthew 27:24",
          "text": "When Pilate saw that he was accomplishing nothing, but that instead a riot was breaking out, he took water and washed his hands before the crowd. “I am innocent of this man’s blood,” he said. “You bear the responsibility.”"
        }
      ]
    },
    {
      "reference": "Genesis 37:22",
      "book": "Genesis",
      "chapter": 37,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "&#8220Don’t shed any blood. Throw him into this cistern here in the wilderness, but don’t lay a hand on him.” Reuben said this to rescue him from them and take him back to his father."
        },
        {
          "version": "NLT",
          "text": "“Why should we shed any blood? Let’s just throw him into this empty cistern here in the wilderness. Then he’ll die without our laying a hand on him.” Reuben was secretly planning to rescue Joseph and return him to his father."
        },
        {
          "version": "ESV",
          "text": "And Reuben said to them, “Shed no blood; throw him into this pit here in the wilderness, but do not lay a hand on him”—that he might rescue him out of their hand to restore him to his father."
        },
        {
          "version": "NKJV",
          "text": "And Reuben said to them, “Shed no blood, but cast him into this pit which is in the wilderness, and do not lay a hand on him”—that he might deliver him out of their hands, and bring him back to his father."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 37:23",
      "book": "Genesis",
      "chapter": 37,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "So when Joseph came to his brothers, they stripped him of his robe—the ornate robe he was wearing—"
        },
        {
          "version": "NLT",
          "text": "So when Joseph arrived, his brothers ripped off the beautiful robe he was wearing."
        },
        {
          "version": "ESV",
          "text": "So when Joseph came to his brothers, they stripped him of his robe, the robe of many colors that he wore."
        },
        {
          "version": "NKJV",
          "text": "So it came to pass, when Joseph had come to his brothers, that they stripped Joseph of his tunic, the tunic of many colors that was on him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 27:28-31",
          "text": "They stripped Him and put a scarlet robe on Him. / And they twisted together a crown of thorns and set it on His head. They put a staff in His right hand, knelt down before Him, and mocked Him, saying, “Hail, King of the Jews!” / Then they spit on Him and took the staff and struck Him on the head repeatedly. ..."
        },
        {
          "reference": "John 19:23-24",
          "text": "When the soldiers had crucified Jesus, they divided His garments into four parts, one for each soldier, with the tunic remaining. It was seamless, woven in one piece from top to bottom. / So they said to one another, “Let us not tear it. Instead, let us cast lots to see who will get it.” This was to fulfill the Scripture: “They divided My garments among them, and cast lots for My clothing.” So that is what the soldiers did."
        },
        {
          "reference": "Mark 15:20",
          "text": "After they had mocked Him, they removed the purple robe and put His own clothes back on Him. Then they led Him out to crucify Him."
        },
        {
          "reference": "Luke 23:11",
          "text": "And even Herod and his soldiers ridiculed and mocked Him. Dressing Him in a fine robe, they sent Him back to Pilate."
        },
        {
          "reference": "John 19:1-3",
          "text": "Then Pilate took Jesus and had Him flogged. / The soldiers twisted together a crown of thorns, set it on His head, and dressed Him in a purple robe. / And they went up to Him again and again, saying, “Hail, King of the Jews!” and slapping Him in the face."
        },
        {
          "reference": "Matthew 27:35",
          "text": "When they had crucified Him, they divided up His garments by casting lots."
        },
        {
          "reference": "Mark 15:24",
          "text": "And they crucified Him. They also divided His garments by casting lots to decide what each of them would take."
        },
        {
          "reference": "John 19:5",
          "text": "When Jesus came out wearing the crown of thorns and the purple robe, Pilate said to them, “Here is the man!”"
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Psalm 22:18",
          "text": "They divide my garments among them and cast lots for my clothing."
        },
        {
          "reference": "Isaiah 53:3",
          "text": "He was despised and rejected by men, a man of sorrows, acquainted with grief. Like one from whom men hide their faces, He was despised, and we esteemed Him not."
        },
        {
          "reference": "Zechariah 13:6",
          "text": "If someone asks him, ‘What are these wounds on your chest?’ he will answer, ‘These are the wounds I received in the house of my friends.’"
        },
        {
          "reference": "Job 30:9-10",
          "text": "And now they mock me in song; I have become a byword among them. / They abhor me and keep far from me; they do not hesitate to spit in my face."
        },
        {
          "reference": "Psalm 69:4",
          "text": "Those who hate me without cause outnumber the hairs of my head; many are those who would destroy me—my enemies for no reason. Though I did not steal, I must repay."
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        }
      ]
    },
    {
      "reference": "Genesis 37:24",
      "book": "Genesis",
      "chapter": 37,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "and they took him and threw him into the cistern. The cistern was empty; there was no water in it."
        },
        {
          "version": "NLT",
          "text": "Then they grabbed him and threw him into the cistern. Now the cistern was empty; there was no water in it."
        },
        {
          "version": "ESV",
          "text": "And they took him and threw him into a pit. The pit was empty; there was no water in it."
        },
        {
          "version": "NKJV",
          "text": "Then they took him and cast him into a pit. And the pit was empty; there was no water in it."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 42:21",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.”"
        },
        {
          "reference": "Jeremiah 38:6",
          "text": "So they took Jeremiah and dropped him into the cistern of Malchiah, the king’s son, which was in the courtyard of the guard. They lowered Jeremiah with ropes into the cistern, which had no water but only mud, and Jeremiah sank down into the mud."
        },
        {
          "reference": "Psalm 105:17-18",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons,"
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Matthew 21:38-39",
          "text": "But when the tenants saw the son, they said to one another, ‘This is the heir. Come, let us kill him and take his inheritance.’ / So they seized him and threw him out of the vineyard and killed him."
        },
        {
          "reference": "Mark 12:7-8",
          "text": "But the tenants said to one another, ‘This is the heir. Come, let us kill him, and the inheritance will be ours.’ / So they seized the son, killed him, and threw him out of the vineyard."
        },
        {
          "reference": "Luke 20:14-15",
          "text": "But when the tenants saw the son, they discussed it among themselves and said, ‘This is the heir. Let us kill him, and the inheritance will be ours.’ / So they threw him out of the vineyard and killed him. What then will the owner of the vineyard do to them?"
        },
        {
          "reference": "Genesis 39:20",
          "text": "So Joseph’s master took him and had him thrown into the prison where the king’s prisoners were confined. While Joseph was there in the prison,"
        },
        {
          "reference": "Genesis 40:15",
          "text": "For I was kidnapped from the land of the Hebrews, and even here I have done nothing for which they should have put me in this dungeon.”"
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:10",
          "text": "and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Psalm 40:2",
          "text": "He lifted me up from the pit of despair, out of the miry clay; He set my feet upon a rock, and made my footsteps firm."
        },
        {
          "reference": "Psalm 88:6",
          "text": "You have laid me in the lowest Pit, in the darkest of the depths."
        }
      ]
    },
    {
      "reference": "Genesis 37:25",
      "book": "Genesis",
      "chapter": 37,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "As they sat down to eat their meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were loaded with spices, balm and myrrh, and they were on their way to take them down to Egypt."
        },
        {
          "version": "NLT",
          "text": "Then, just as they were sitting down to eat, they looked up and saw a caravan of camels in the distance coming toward them. It was a group of Ishmaelite traders taking a load of gum, balm, and aromatic resin from Gilead down to Egypt."
        },
        {
          "version": "ESV",
          "text": "Then they sat down to eat. And looking up they saw a caravan of Ishmaelites coming from Gilead, with their camels bearing gum, balm, and myrrh, on their way to carry it down to Egypt."
        },
        {
          "version": "NKJV",
          "text": "And they sat down to eat a meal. Then they lifted their eyes and looked, and there was a company of Ishmaelites, coming from Gilead with their camels, bearing spices, balm, and myrrh, on their way to carry them down to Egypt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 42:21",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.”"
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Judges 8:24",
          "text": "Then he added, “Let me make a request of you, that each of you give me an earring from his plunder.” (For the enemies had gold earrings because they were Ishmaelites.)"
        },
        {
          "reference": "1 Kings 10:2",
          "text": "She arrived in Jerusalem with a very large caravan—with camels bearing spices, gold in great abundance, and precious stones. And she came to Solomon and spoke to him all that was on her mind."
        },
        {
          "reference": "Job 6:19",
          "text": "The caravans of Tema look for water; the travelers of Sheba hope to find it."
        },
        {
          "reference": "Psalm 105:17",
          "text": "He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Isaiah 21:13",
          "text": "This is the burden against Arabia: In the thickets of Arabia you must lodge, O caravans of Dedanites."
        },
        {
          "reference": "Jeremiah 8:22",
          "text": "Is there no balm in Gilead? Is no physician there? Why then has the health of the daughter of my people not been restored?"
        },
        {
          "reference": "Ezekiel 27:17",
          "text": "Judah and the land of Israel traded with you; they exchanged wheat from Minnith, cakes and honey, oil and balm for your merchandise."
        },
        {
          "reference": "Matthew 26:15",
          "text": "and asked, “What are you willing to give me if I hand Him over to you?” And they set out for him thirty pieces of silver."
        },
        {
          "reference": "Matthew 27:3",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders."
        },
        {
          "reference": "Mark 15:1",
          "text": "Early in the morning, the chief priests, elders, scribes, and the whole Sanhedrin devised a plan. They bound Jesus, led Him away, and handed Him over to Pilate."
        },
        {
          "reference": "Luke 22:5",
          "text": "They were delighted and agreed to give him money."
        }
      ]
    },
    {
      "reference": "Genesis 37:26",
      "book": "Genesis",
      "chapter": 37,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "Judah said to his brothers, “What will we gain if we kill our brother and cover up his blood?"
        },
        {
          "version": "NLT",
          "text": "Judah said to his brothers, “What will we gain by killing our brother? We’d have to cover up the crime."
        },
        {
          "version": "ESV",
          "text": "Then Judah said to his brothers, “What profit is it if we kill our brother and conceal his blood?"
        },
        {
          "version": "NKJV",
          "text": "So Judah said to his brothers, “What profit is there if we kill our brother and conceal his blood?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Matthew 27:3-4",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.”"
        },
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Psalm 105:17",
          "text": "He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "John 11:47-50",
          "text": "Then the chief priests and Pharisees convened the Sanhedrin and said, “What are we to do? This man is performing many signs. / If we let Him go on like this, everyone will believe in Him, and then the Romans will come and take away both our place and our nation.” / But one of them, named Caiaphas, who was high priest that year, said to them, “You know nothing at all! ..."
        },
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Amos 2:6",
          "text": "This is what the LORD says: “For three transgressions of Israel, even four, I will not revoke My judgment, because they sell the righteous for silver and the needy for a pair of sandals."
        },
        {
          "reference": "Zechariah 11:12-13",
          "text": "Then I told them, “If it seems right to you, give me my wages; but if not, keep them.” So they weighed out my wages, thirty pieces of silver. / And the LORD said to me, “Throw it to the potter”—this magnificent price at which they valued me. So I took the thirty pieces of silver and threw them to the potter in the house of the LORD."
        },
        {
          "reference": "Matthew 26:14-16",
          "text": "Then one of the Twelve, the one called Judas Iscariot, went to the chief priests / and asked, “What are you willing to give me if I hand Him over to you?” And they set out for him thirty pieces of silver. / So from then on Judas looked for an opportunity to betray Jesus."
        },
        {
          "reference": "Mark 14:10-11",
          "text": "Then Judas Iscariot, one of the Twelve, went to the chief priests to betray Jesus to them. / They were delighted to hear this, and they promised to give him money. So Judas began to look for an opportunity to betray Jesus."
        },
        {
          "reference": "Luke 22:3-6",
          "text": "Then Satan entered Judas Iscariot, who was one of the Twelve. / And Judas went to discuss with the chief priests and temple officers how he might betray Jesus to them. / They were delighted and agreed to give him money. ..."
        },
        {
          "reference": "John 18:2-3",
          "text": "Now Judas His betrayer also knew the place, because Jesus had often met there with His disciples. / So Judas brought a band of soldiers and officers from the chief priests and Pharisees. They arrived at the garden carrying lanterns, torches, and weapons."
        },
        {
          "reference": "Genesis 44:16-18",
          "text": "“What can we say to my lord?” Judah replied. “How can we plead? How can we justify ourselves? God has exposed the iniquity of your servants. We are now my lord’s slaves—both we and the one who was found with the cup.” / But Joseph replied, “Far be it from me to do this. The man who was found with the cup will be my slave. The rest of you may return to your father in peace.” / Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself."
        }
      ]
    },
    {
      "reference": "Genesis 37:27",
      "book": "Genesis",
      "chapter": 37,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "Come, let’s sell him to the Ishmaelites and not lay our hands on him; after all, he is our brother, our own flesh and blood.” His brothers agreed."
        },
        {
          "version": "NLT",
          "text": "Instead of hurting him, let’s sell him to those Ishmaelite traders. After all, he is our brother—our own flesh and blood!” And his brothers agreed."
        },
        {
          "version": "ESV",
          "text": "Come, let us sell him to the Ishmaelites, and let not our hand be upon him, for he is our brother, our own flesh.” And his brothers listened to him."
        },
        {
          "version": "NKJV",
          "text": "Come and let us sell him to the Ishmaelites, and let not our hand be upon him, for he is our brother and our flesh.” And his brothers listened."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Psalm 105:17",
          "text": "He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Matthew 27:3-4",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.”"
        },
        {
          "reference": "Acts 2:23",
          "text": "He was delivered up by God’s set plan and foreknowledge, and you, by the hands of the lawless, put Him to death by nailing Him to the cross."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 49:26",
          "text": "The blessings of your father have surpassed the blessings of the ancient mountains and the bounty of the everlasting hills. May they rest on the head of Joseph, on the brow of the prince of his brothers."
        },
        {
          "reference": "1 Samuel 18:17",
          "text": "Then Saul said to David, “Here is my older daughter Merab. I will give her to you in marriage. Only be valiant for me and fight the LORD’s battles.” But Saul was thinking, “I need not raise my hand against him; let the hand of the Philistines be against him.”"
        },
        {
          "reference": "1 Samuel 19:1",
          "text": "Then Saul ordered his son Jonathan and all his servants to kill David. But Jonathan delighted greatly in David,"
        },
        {
          "reference": "2 Kings 5:20-27",
          "text": "Gehazi, the servant of Elisha the man of God, said, “Look, my master has spared this Aramean, Naaman, by not accepting what he brought. As surely as the LORD lives, I will run after him and get something from him.” / So Gehazi pursued Naaman. And when Naaman saw him running toward him, he got down from the chariot to meet him and asked, “Is everything all right?” / “Everything is all right,” Gehazi replied. “My master has sent me to say, ‘Look, two young men from the sons of the prophets have just now come to me from the hill country of Ephraim. Please give them a talent of silver and two sets of clothing.’” ..."
        },
        {
          "reference": "Proverbs 1:11-14",
          "text": "If they say, “Come along, let us lie in wait for blood, let us ambush the innocent without cause, / let us swallow them alive like Sheol, and whole like those descending into the Pit. / We will find all manner of precious goods; we will fill our houses with plunder. ..."
        },
        {
          "reference": "Isaiah 53:3-4",
          "text": "He was despised and rejected by men, a man of sorrows, acquainted with grief. Like one from whom men hide their faces, He was despised, and we esteemed Him not. / Surely He took up our infirmities and carried our sorrows; yet we considered Him stricken, struck down by God, and afflicted."
        },
        {
          "reference": "Jeremiah 18:18",
          "text": "Then some said, “Come, let us make plans against Jeremiah, for the law will never be lost to the priest, nor counsel to the wise, nor an oracle to the prophet. Come, let us denounce him and pay no heed to any of his words.”"
        }
      ]
    },
    {
      "reference": "Genesis 37:28",
      "book": "Genesis",
      "chapter": 37,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "So when the Midianite merchants came by, his brothers pulled Joseph up out of the cistern and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "version": "NLT",
          "text": "So when the Ishmaelites, who were Midianite traders, came by, Joseph’s brothers pulled him out of the cistern and sold him to them for twenty pieces of silver. And the traders took him to Egypt."
        },
        {
          "version": "ESV",
          "text": "Then Midianite traders passed by. And they drew Joseph up and lifted him out of the pit, and sold him to the Ishmaelites for twenty shekels of silver. They took Joseph to Egypt."
        },
        {
          "version": "NKJV",
          "text": "Then Midianite traders passed by; so the brothers pulled Joseph up and lifted him out of the pit, and sold him to the Ishmaelites for twenty shekels of silver. And they took Joseph to Egypt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Psalm 105:17",
          "text": "He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Judges 6:1-2",
          "text": "Again the Israelites did evil in the sight of the LORD; so He delivered them into the hand of Midian for seven years, / and the hand of Midian prevailed against Israel. Because of the Midianites, the Israelites prepared shelters for themselves in the mountains, caves, and strongholds."
        },
        {
          "reference": "Matthew 27:3-4",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.”"
        },
        {
          "reference": "Zechariah 11:12-13",
          "text": "Then I told them, “If it seems right to you, give me my wages; but if not, keep them.” So they weighed out my wages, thirty pieces of silver. / And the LORD said to me, “Throw it to the potter”—this magnificent price at which they valued me. So I took the thirty pieces of silver and threw them to the potter in the house of the LORD."
        },
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 39:1",
          "text": "Meanwhile, Joseph had been taken down to Egypt, where an Egyptian named Potiphar, an officer of Pharaoh and captain of the guard, bought him from the Ishmaelites who had taken him there."
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "Exodus 21:16",
          "text": "Whoever kidnaps another man must be put to death, whether he sells him or the man is found in his possession."
        },
        {
          "reference": "Amos 2:6",
          "text": "This is what the LORD says: “For three transgressions of Israel, even four, I will not revoke My judgment, because they sell the righteous for silver and the needy for a pair of sandals."
        },
        {
          "reference": "Obadiah 1:10-11",
          "text": "Because of the violence against your brother Jacob, you will be covered with shame and cut off forever. / On the day you stood aloof while strangers carried off his wealth and foreigners entered his gate and cast lots for Jerusalem, you were just like one of them."
        },
        {
          "reference": "John 19:16-18",
          "text": "Then Pilate handed Jesus over to be crucified, and the soldiers took Him away. / Carrying His own cross, He went out to The Place of the Skull, which in Hebrew is called Golgotha. / There they crucified Him, and with Him two others, one on each side, with Jesus in the middle."
        },
        {
          "reference": "Matthew 26:14-16",
          "text": "Then one of the Twelve, the one called Judas Iscariot, went to the chief priests / and asked, “What are you willing to give me if I hand Him over to you?” And they set out for him thirty pieces of silver. / So from then on Judas looked for an opportunity to betray Jesus."
        }
      ]
    },
    {
      "reference": "Genesis 37:29",
      "book": "Genesis",
      "chapter": 37,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "When Reuben returned to the cistern and saw that Joseph was not there, he tore his clothes."
        },
        {
          "version": "NLT",
          "text": "Some time later, Reuben returned to get Joseph out of the cistern. When he discovered that Joseph was missing, he tore his clothes in grief."
        },
        {
          "version": "ESV",
          "text": "When Reuben returned to the pit and saw that Joseph was not in the pit, he tore his clothes"
        },
        {
          "version": "NKJV",
          "text": "Then Reuben returned to the pit, and indeed Joseph was not in the pit; and he tore his clothes."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 44:13",
          "text": "Then they all tore their clothes, loaded their donkeys, and returned to the city."
        },
        {
          "reference": "Genesis 45:3",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 50:15-17",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept."
        },
        {
          "reference": "Jeremiah 31:15",
          "text": "This is what the LORD says: “A voice is heard in Ramah, mourning and great weeping, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Matthew 27:3-5",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.” / So Judas threw the silver into the temple and left. Then he went away and hanged himself."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Psalm 105:17-18",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons,"
        },
        {
          "reference": "Zechariah 12:10",
          "text": "Then I will pour out on the house of David and on the people of Jerusalem a spirit of grace and prayer, and they will look on Me, the One they have pierced. They will mourn for Him as one mourns for an only child, and grieve bitterly for Him as one grieves for a firstborn son."
        },
        {
          "reference": "John 11:33-35",
          "text": "When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled. / “Where have you put him?” He asked. “Come and see, Lord,” they answered. / Jesus wept."
        },
        {
          "reference": "Romans 9:1-2",
          "text": "I speak the truth in Christ; I am not lying, as confirmed by my conscience in the Holy Spirit. / I have deep sorrow and unceasing anguish in my heart."
        },
        {
          "reference": "2 Corinthians 7:10",
          "text": "Godly sorrow brings repentance that leads to salvation without regret, but worldly sorrow brings death."
        },
        {
          "reference": "Hebrews 12:17",
          "text": "For you know that afterward, when he wanted to inherit the blessing, he was rejected. He could find no ground for repentance, though he sought the blessing with tears."
        },
        {
          "reference": "Revelation 18:9-11",
          "text": "Then the kings of the earth who committed sexual immorality and lived in luxury with her will weep and wail at the sight of the smoke rising from the fire that consumes her. / In fear of her torment, they will stand at a distance and cry out: “Woe, woe to the great city, the mighty city of Babylon! For in a single hour your judgment has come.” / And the merchants of the earth will weep and mourn over her, because there is no one left to buy their cargo—"
        },
        {
          "reference": "Job 1:20-21",
          "text": "Then Job stood up, tore his robe, and shaved his head. He fell to the ground and worshiped, / saying: “Naked I came from my mother’s womb, and naked I will return. The LORD gave, and the LORD has taken away. Blessed be the name of the LORD.”"
        }
      ]
    },
    {
      "reference": "Genesis 37:30",
      "book": "Genesis",
      "chapter": 37,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "He went back to his brothers and said, “The boy isn’t there! Where can I turn now?”"
        },
        {
          "version": "NLT",
          "text": "Then he went back to his brothers and lamented, “The boy is gone! What will I do now?”"
        },
        {
          "version": "ESV",
          "text": "and returned to his brothers and said, “The boy is gone, and I, where shall I go?”"
        },
        {
          "version": "NKJV",
          "text": "And he returned to his brothers and said, “The lad is no more; and I, where shall I go?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 44:20",
          "text": "And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 42:36",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!”"
        },
        {
          "reference": "Genesis 44:28",
          "text": "When one of them was gone, I said: “Surely he has been torn to pieces.” And I have not seen him since."
        },
        {
          "reference": "Genesis 42:38",
          "text": "But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 44:31",
          "text": "sees that the boy is not with us, he will die. Then your servants will have brought the gray hair of your servant our father down to Sheol in sorrow."
        },
        {
          "reference": "Genesis 45:26",
          "text": "“Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Matthew 27:3-5",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.” / So Judas threw the silver into the temple and left. Then he went away and hanged himself."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "John 11:32",
          "text": "When Mary came to Jesus and saw Him, she fell at His feet and said, “Lord, if You had been here, my brother would not have died.”"
        },
        {
          "reference": "Luke 15:24",
          "text": "For this son of mine was dead and is alive again! He was lost and is found!’ So they began to celebrate."
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "John 20:13",
          "text": "“Woman, why are you weeping?” they asked. “Because they have taken my Lord away,” she said, “and I do not know where they have put Him.”"
        },
        {
          "reference": "Luke 24:17",
          "text": "He asked them, “What are you discussing so intently as you walk along?” They stood still, with sadness on their faces."
        }
      ]
    },
    {
      "reference": "Genesis 37:31",
      "book": "Genesis",
      "chapter": 37,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "Then they got Joseph’s robe, slaughtered a goat and dipped the robe in the blood."
        },
        {
          "version": "NLT",
          "text": "Then the brothers killed a young goat and dipped Joseph’s robe in its blood."
        },
        {
          "version": "ESV",
          "text": "Then they took Joseph’s robe and slaughtered a goat and dipped the robe in the blood."
        },
        {
          "version": "NKJV",
          "text": "So they took Joseph’s tunic, killed a kid of the goats, and dipped the tunic in the blood."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 4:10",
          "text": "“What have you done?” replied the LORD. “The voice of your brother’s blood cries out to Me from the ground."
        },
        {
          "reference": "Genesis 9:4-6",
          "text": "But you must not eat meat with its lifeblood still in it. / And surely I will require the life of any man or beast by whose hand your lifeblood is shed. I will demand an accounting from anyone who takes the life of his fellow man: / Whoever sheds the blood of man, by man his blood will be shed; for in His own image God has made mankind."
        },
        {
          "reference": "Genesis 44:28",
          "text": "When one of them was gone, I said: “Surely he has been torn to pieces.” And I have not seen him since."
        },
        {
          "reference": "Exodus 12:7",
          "text": "They are to take some of the blood and put it on the sides and tops of the doorframes of the houses where they eat the lambs."
        },
        {
          "reference": "Leviticus 17:11",
          "text": "For the life of the flesh is in the blood, and I have given it to you to make atonement for your souls upon the altar; for it is the blood that makes atonement for the soul."
        },
        {
          "reference": "Deuteronomy 21:1-9",
          "text": "If one is found slain, lying in a field in the land that the LORD your God is giving you to possess, and it is not known who killed him, / your elders and judges must come out and measure the distance from the victim to the neighboring cities. / Then the elders of the city nearest the victim shall take a heifer that has never been yoked or used for work, ..."
        },
        {
          "reference": "1 Samuel 18:17-19",
          "text": "Then Saul said to David, “Here is my older daughter Merab. I will give her to you in marriage. Only be valiant for me and fight the LORD’s battles.” But Saul was thinking, “I need not raise my hand against him; let the hand of the Philistines be against him.” / And David said to Saul, “Who am I, and what is my family or my father’s clan in Israel, that I should become the son-in-law of the king?” / So when it was time to give Saul’s daughter Merab to David, she was given in marriage to Adriel of Meholah."
        },
        {
          "reference": "1 Kings 21:19",
          "text": "Tell him that this is what the LORD says: ‘Have you not murdered a man and seized his land?’ Then tell him that this is also what the LORD says: ‘In the place where the dogs licked up the blood of Naboth, there also the dogs will lick up your blood—yes, yours!’”"
        },
        {
          "reference": "2 Kings 9:26",
          "text": "‘As surely as I saw the blood of Naboth and the blood of his sons yesterday, declares the LORD, so will I repay you on this plot of ground, declares the LORD.’ Now then, according to the word of the LORD, pick him up and throw him on the plot of ground.”"
        },
        {
          "reference": "Psalm 9:12",
          "text": "For the Avenger of bloodshed remembers; He does not ignore the cry of the afflicted."
        },
        {
          "reference": "Psalm 106:38",
          "text": "They shed innocent blood—the blood of their sons and daughters, whom they sacrificed to the idols of Canaan, and the land was polluted with blood."
        },
        {
          "reference": "Isaiah 1:15",
          "text": "When you spread out your hands in prayer, I will hide My eyes from you; even though you multiply your prayers, I will not listen. Your hands are covered with blood."
        },
        {
          "reference": "Jeremiah 2:34",
          "text": "Moreover, your skirts are stained with the blood of the innocent poor, though you did not find them breaking in. But in spite of all these things"
        },
        {
          "reference": "Ezekiel 24:7-8",
          "text": "For the blood she shed is still within her; she poured it out on the bare rock; she did not pour it on the ground to cover it with dust. / In order to stir up wrath and take vengeance, I have placed her blood on the bare rock, so that it would not be covered.’"
        },
        {
          "reference": "Matthew 23:35",
          "text": "And so upon you will come all the righteous blood shed on earth, from the blood of righteous Abel to the blood of Zechariah son of Berechiah, whom you murdered between the temple and the altar."
        }
      ]
    },
    {
      "reference": "Genesis 37:32",
      "book": "Genesis",
      "chapter": 37,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "They took the ornate robe back to their father and said, “We found this. Examine it to see whether it is your son’s robe.”"
        },
        {
          "version": "NLT",
          "text": "They sent the beautiful robe to their father with this message: “Look at what we found. Doesn’t this robe belong to your son?”"
        },
        {
          "version": "ESV",
          "text": "And they sent the robe of many colors and brought it to their father and said, “This we have found; please identify whether it is your son’s robe or not.”"
        },
        {
          "version": "NKJV",
          "text": "Then they sent the tunic of many colors, and they brought it to their father and said, “We have found this. Do you know whether it is your son’s tunic or not?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:31",
          "text": "Then they took Joseph’s robe, slaughtered a young goat, and dipped the robe in its blood."
        },
        {
          "reference": "Genesis 44:28",
          "text": "When one of them was gone, I said: “Surely he has been torn to pieces.” And I have not seen him since."
        },
        {
          "reference": "Genesis 44:20",
          "text": "And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 45:26",
          "text": "“Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them."
        },
        {
          "reference": "Genesis 50:15-18",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "1 Kings 21:8-14",
          "text": "Then Jezebel wrote letters in Ahab’s name, sealed them with his seal, and sent them to the elders and nobles who lived with Naboth in his city. / In the letters she wrote: “Proclaim a fast and give Naboth a seat of honor among the people. / But seat two scoundrels opposite him and have them testify, ‘You have cursed both God and the king!’ Then take him out and stone him to death.” ..."
        },
        {
          "reference": "2 Samuel 13:30-33",
          "text": "While they were on the way, a report reached David: “Absalom has struck down all the sons of the king; not one of them is left!” / Then the king stood up, tore his clothes, and lay down on the ground. And all his servants stood by with their clothes torn. / But Jonadab, the son of David’s brother Shimeah, spoke up: “My lord must not think they have killed all the sons of the king, for only Amnon is dead. In fact, Absalom has planned this since the day Amnon violated his sister Tamar. ..."
        },
        {
          "reference": "Jeremiah 31:15",
          "text": "This is what the LORD says: “A voice is heard in Ramah, mourning and great weeping, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Matthew 27:24-25",
          "text": "When Pilate saw that he was accomplishing nothing, but that instead a riot was breaking out, he took water and washed his hands before the crowd. “I am innocent of this man’s blood,” he said. “You bear the responsibility.” / All the people answered, “His blood be on us and on our children!”"
        },
        {
          "reference": "Matthew 26:14-16",
          "text": "Then one of the Twelve, the one called Judas Iscariot, went to the chief priests / and asked, “What are you willing to give me if I hand Him over to you?” And they set out for him thirty pieces of silver. / So from then on Judas looked for an opportunity to betray Jesus."
        },
        {
          "reference": "Matthew 26:48-50",
          "text": "Now the betrayer had arranged a signal with them: “The One I kiss is the man; arrest Him.” / Going directly to Jesus, he said, “Greetings, Rabbi!” and kissed Him. / “Friend,” Jesus replied, “do what you came for.” Then the men stepped forward, seized Jesus, and arrested Him."
        },
        {
          "reference": "Matthew 27:3-5",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.” / So Judas threw the silver into the temple and left. Then he went away and hanged himself."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        }
      ]
    },
    {
      "reference": "Genesis 37:33",
      "book": "Genesis",
      "chapter": 37,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "He recognized it and said, “It is my son’s robe! Some ferocious animal has devoured him. Joseph has surely been torn to pieces.”"
        },
        {
          "version": "NLT",
          "text": "Their father recognized it immediately. “Yes,” he said, “it is my son’s robe. A wild animal must have eaten him. Joseph has clearly been torn to pieces!”"
        },
        {
          "version": "ESV",
          "text": "And he identified it and said, “It is my son’s robe. A fierce animal has devoured him. Joseph is without doubt torn to pieces.”"
        },
        {
          "version": "NKJV",
          "text": "And he recognized it and said, “ It is my son’s tunic. A wild beast has devoured him. Without doubt Joseph is torn to pieces.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 44:28",
          "text": "When one of them was gone, I said: “Surely he has been torn to pieces.” And I have not seen him since."
        },
        {
          "reference": "Genesis 42:36",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!”"
        },
        {
          "reference": "Genesis 45:26-28",
          "text": "“Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them. / However, when they relayed all that Joseph had told them, and when he saw the wagons that Joseph had sent to carry him back, the spirit of their father Jacob was revived. / “Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 37:31-32",
          "text": "Then they took Joseph’s robe, slaughtered a young goat, and dipped the robe in its blood. / They sent the robe of many colors to their father and said, “We found this. Examine it to see whether it is your son’s robe or not.”"
        },
        {
          "reference": "Genesis 37:34-35",
          "text": "Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 50:15-20",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "1 Kings 13:26",
          "text": "When the prophet who had brought him back from his journey heard this, he said, “It is the man of God who disobeyed the command of the LORD. Therefore the LORD has delivered him to the lion, and it has mauled him and killed him, according to the word that the LORD had spoken to him.”"
        },
        {
          "reference": "2 Samuel 18:33",
          "text": "The king was shaken and went up to the chamber over the gate and wept. And as he walked, he cried out, “O my son Absalom! My son, my son Absalom! If only I had died instead of you, O Absalom, my son, my son!”"
        },
        {
          "reference": "Jeremiah 31:15",
          "text": "This is what the LORD says: “A voice is heard in Ramah, mourning and great weeping, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Matthew 27:5",
          "text": "So Judas threw the silver into the temple and left. Then he went away and hanged himself."
        },
        {
          "reference": "Luke 24:21",
          "text": "But we were hoping He was the One who would redeem Israel. And besides all this, it is the third day since these things took place."
        },
        {
          "reference": "John 11:32-35",
          "text": "When Mary came to Jesus and saw Him, she fell at His feet and said, “Lord, if You had been here, my brother would not have died.” / When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled. / “Where have you put him?” He asked. “Come and see, Lord,” they answered. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        }
      ]
    },
    {
      "reference": "Genesis 37:34",
      "book": "Genesis",
      "chapter": 37,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob tore his clothes, put on sackcloth and mourned for his son many days."
        },
        {
          "version": "NLT",
          "text": "Then Jacob tore his clothes and dressed himself in burlap. He mourned deeply for his son for a long time."
        },
        {
          "version": "ESV",
          "text": "Then Jacob tore his garments and put sackcloth on his loins and mourned for his son many days."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob tore his clothes, put sackcloth on his waist, and mourned for his son many days."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "2 Samuel 1:11-12",
          "text": "Then David took hold of his own clothes and tore them, and all the men who were with him did the same. / They mourned and wept and fasted until evening for Saul and his son Jonathan, and for the people of the LORD and the house of Israel, because they had fallen by the sword."
        },
        {
          "reference": "Job 1:20",
          "text": "Then Job stood up, tore his robe, and shaved his head. He fell to the ground and worshiped,"
        },
        {
          "reference": "2 Samuel 3:31",
          "text": "Then David ordered Joab and all the people with him, “Tear your clothes, put on sackcloth, and mourn before Abner.” And King David himself walked behind the funeral bier."
        },
        {
          "reference": "Jeremiah 31:15",
          "text": "This is what the LORD says: “A voice is heard in Ramah, mourning and great weeping, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Matthew 26:75",
          "text": "Then Peter remembered the word that Jesus had spoken: “Before the rooster crows, you will deny Me three times.” And he went outside and wept bitterly."
        },
        {
          "reference": "2 Samuel 13:19",
          "text": "And Tamar put ashes on her head and tore her robe. And putting her hand on her head, she went away crying aloud."
        },
        {
          "reference": "Job 2:12",
          "text": "When they lifted up their eyes from afar, they could barely recognize Job. They began to weep aloud, and each man tore his robe and threw dust in the air over his head."
        },
        {
          "reference": "1 Kings 21:27",
          "text": "When Ahab heard these words, he tore his clothes, put on sackcloth, and fasted. He lay down in sackcloth and walked around meekly."
        },
        {
          "reference": "Matthew 27:51-54",
          "text": "At that moment the veil of the temple was torn in two from top to bottom. The earth quaked, and the rocks were split. / The tombs broke open, and the bodies of many saints who had fallen asleep were raised. / After Jesus’ resurrection, when they had come out of the tombs, they entered the holy city and appeared to many people. ..."
        },
        {
          "reference": "Esther 4:1",
          "text": "When Mordecai learned of all that had happened, he tore his clothes, put on sackcloth and ashes, and went out into the middle of the city, wailing loudly and bitterly."
        },
        {
          "reference": "Lamentations 2:10",
          "text": "The elders of the Daughter of Zion sit on the ground in silence. They have thrown dust on their heads and put on sackcloth. The young women of Jerusalem have bowed their heads to the ground."
        },
        {
          "reference": "Luke 22:62",
          "text": "And he went outside and wept bitterly."
        },
        {
          "reference": "Joel 1:13",
          "text": "Put on sackcloth and lament, O priests; wail, O ministers of the altar. Come, spend the night in sackcloth, O ministers of my God, because the grain and drink offerings are withheld from the house of your God."
        },
        {
          "reference": "Acts 8:2",
          "text": "God-fearing men buried Stephen and mourned deeply over him."
        },
        {
          "reference": "Ezekiel 27:30-31",
          "text": "They will raise their voices for you and cry out bitterly. They will throw dust on their heads and roll in ashes. / They will shave their heads for you and wrap themselves in sackcloth. They will weep over you with anguish of soul and bitter mourning."
        }
      ]
    },
    {
      "reference": "Genesis 37:35",
      "book": "Genesis",
      "chapter": 37,
      "verse": 35,
      "translations": [
        {
          "version": "NIV",
          "text": "All his sons and daughters came to comfort him, but he refused to be comforted. “No,” he said, “I will continue to mourn until I join my son in the grave.” So his father wept for him."
        },
        {
          "version": "NLT",
          "text": "His family all tried to comfort him, but he refused to be comforted. “I will go to my grave mourning for my son,” he would say, and then he would weep."
        },
        {
          "version": "ESV",
          "text": "All his sons and all his daughters rose up to comfort him, but he refused to be comforted and said, “No, I shall go down to Sheol to my son, mourning.” Thus his father wept for him."
        },
        {
          "version": "NKJV",
          "text": "And all his sons and all his daughters arose to comfort him; but he refused to be comforted, and he said, “For I shall go down into the grave to my son in mourning.” Thus his father wept for him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "2 Samuel 12:23",
          "text": "But now that he is dead, why should I fast? Can I bring him back again? I will go to him, but he will not return to me.”"
        },
        {
          "reference": "Jeremiah 31:15",
          "text": "This is what the LORD says: “A voice is heard in Ramah, mourning and great weeping, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Job 2:11",
          "text": "Now when Job’s three friends—Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite—heard about all this adversity that had come upon him, each of them came from his home, and they met together to go and sympathize with Job and comfort him."
        },
        {
          "reference": "Job 42:11",
          "text": "All his brothers and sisters and prior acquaintances came and dined with him in his house. They consoled him and comforted him over all the adversity that the LORD had brought upon him. And each one gave him a piece of silver and a gold ring."
        },
        {
          "reference": "Ruth 1:20-21",
          "text": "“Do not call me Naomi,” she replied. “Call me Mara, because the Almighty has dealt quite bitterly with me. / I went away full, but the LORD has brought me back empty. Why call me Naomi? After all, the LORD has testified against me, and the Almighty has afflicted me.”"
        },
        {
          "reference": "Psalm 77:2",
          "text": "In the day of trouble I sought the Lord; through the night my outstretched hands did not grow weary; my soul refused to be comforted."
        },
        {
          "reference": "Psalm 88:18",
          "text": "You have removed my beloved and my friend; darkness is my closest companion."
        },
        {
          "reference": "Isaiah 51:11",
          "text": "So the redeemed of the LORD will return and enter Zion with singing, crowned with everlasting joy. Gladness and joy will overtake them, and sorrow and sighing will flee."
        },
        {
          "reference": "Lamentations 1:2",
          "text": "She weeps aloud in the night, with tears upon her cheeks. Among all her lovers there is no one to comfort her. All her friends have betrayed her; they have become her enemies."
        },
        {
          "reference": "John 11:31-33",
          "text": "When the Jews who were in the house consoling Mary saw how quickly she got up and went out, they followed her, supposing she was going to the tomb to mourn there. / When Mary came to Jesus and saw Him, she fell at His feet and said, “Lord, if You had been here, my brother would not have died.” / When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled."
        },
        {
          "reference": "John 16:20",
          "text": "Truly, truly, I tell you, you will weep and wail while the world rejoices. You will grieve, but your grief will turn to joy."
        },
        {
          "reference": "Romans 12:15",
          "text": "Rejoice with those who rejoice; weep with those who weep."
        },
        {
          "reference": "1 Thessalonians 4:13",
          "text": "Brothers, we do not want you to be uninformed about those who sleep in death, so that you will not grieve like the rest, who are without hope."
        },
        {
          "reference": "Revelation 21:4",
          "text": "‘He will wipe away every tear from their eyes,’ and there will be no more death or mourning or crying or pain, for the former things have passed away.”"
        }
      ]
    },
    {
      "reference": "Genesis 37:36",
      "book": "Genesis",
      "chapter": 37,
      "verse": 36,
      "translations": [
        {
          "version": "NIV",
          "text": "Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, one of Pharaoh’s officials, the captain of the guard."
        },
        {
          "version": "NLT",
          "text": "Meanwhile, the Midianite traders arrived in Egypt, where they sold Joseph to Potiphar, an officer of Pharaoh, the king of Egypt. Potiphar was captain of the palace guard."
        },
        {
          "version": "ESV",
          "text": "Meanwhile the Midianites had sold him in Egypt to Potiphar, an officer of Pharaoh, the captain of the guard."
        },
        {
          "version": "NKJV",
          "text": "Now the Midianites had sold him in Egypt to Potiphar, an officer of Pharaoh and captain of the guard."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 39:1",
          "text": "Meanwhile, Joseph had been taken down to Egypt, where an Egyptian named Potiphar, an officer of Pharaoh and captain of the guard, bought him from the Ishmaelites who had taken him there."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Psalm 105:17",
          "text": "He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Acts 7:10",
          "text": "and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 41:41-44",
          "text": "Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.” / Then Pharaoh removed the signet ring from his finger, put it on Joseph’s finger, clothed him in garments of fine linen, and placed a gold chain around his neck. / He had Joseph ride in his second chariot, with men calling out before him, “Bow the knee!” So he placed him over all the land of Egypt. ..."
        },
        {
          "reference": "Genesis 42:6",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground."
        },
        {
          "reference": "Genesis 45:8",
          "text": "Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt."
        },
        {
          "reference": "Genesis 50:18-21",
          "text": "His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. ..."
        },
        {
          "reference": "Psalm 105:19-22",
          "text": "until his prediction came true and the word of the LORD proved him right. / The king sent and released him; the ruler of peoples set him free. / He made him master of his household, ruler over all his substance, ..."
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Genesis 39:2-6",
          "text": "And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master. / When his master saw that the LORD was with him and made him prosper in all he did, / Joseph found favor in his sight and became his personal attendant. Potiphar put him in charge of his household and entrusted him with everything he owned. ..."
        },
        {
          "reference": "Genesis 40:1-4",
          "text": "Some time later, the king’s cupbearer and baker offended their master, the king of Egypt. / Pharaoh was angry with his two officers, the chief cupbearer and the chief baker, / and imprisoned them in the house of the captain of the guard, the same prison where Joseph was confined. ..."
        }
      ]
    }
  ]
}