{
  "book": "genesis",
  "chapter": 39,
  "verses": [
    {
      "reference": "Genesis 39:1",
      "book": "Genesis",
      "chapter": 39,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Joseph had been taken down to Egypt. Potiphar, an Egyptian who was one of Pharaoh’s officials, the captain of the guard, bought him from the Ishmaelites who had taken him there."
        },
        {
          "version": "NLT",
          "text": "When Joseph was taken to Egypt by the Ishmaelite traders, he was purchased by Potiphar, an Egyptian officer. Potiphar was captain of the guard for Pharaoh, the king of Egypt."
        },
        {
          "version": "ESV",
          "text": "Now Joseph had been brought down to Egypt, and Potiphar, an officer of Pharaoh, the captain of the guard, an Egyptian, had bought him from the Ishmaelites who had brought him down there."
        },
        {
          "version": "NKJV",
          "text": "Now Joseph had been taken down to Egypt. And Potiphar, an officer of Pharaoh, captain of the guard, an Egyptian, bought him from the Ishmaelites who had taken him down there."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 37:36",
          "text": "Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, an officer of Pharaoh and captain of the guard."
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "1 Samuel 2:7-8",
          "text": "The LORD sends poverty and wealth; He humbles and He exalts. / He raises the poor from the dust and lifts the needy from the ash heap. He seats them among princes and bestows on them a throne of honor. For the foundations of the earth are the LORD’s, and upon them He has set the world."
        },
        {
          "reference": "1 Samuel 16:1",
          "text": "Now the LORD said to Samuel, “How long are you going to mourn for Saul, since I have rejected him as king over Israel? Fill your horn with oil and go. I am sending you to Jesse of Bethlehem, for I have selected from his sons a king for Myself.”"
        },
        {
          "reference": "2 Kings 5:1-3",
          "text": "Now Naaman, the commander of the army of the king of Aram, was a great man in his master’s sight and highly regarded, for through him the LORD had given victory to Aram. And he was a mighty man of valor, but he was a leper. / At this time the Arameans had gone out in bands and had taken a young girl from the land of Israel, and she was serving Naaman’s wife. / She said to her mistress, “If only my master would go to the prophet who is in Samaria, he would cure him of his leprosy.”"
        },
        {
          "reference": "Nehemiah 9:27",
          "text": "So You delivered them into the hands of enemies who oppressed them, and in their time of distress they cried out to You. From heaven You heard them, and in Your great compassion You gave them deliverers who saved them from the hands of their enemies."
        },
        {
          "reference": "Isaiah 45:1-4",
          "text": "This is what the LORD says to Cyrus His anointed, whose right hand I have grasped to subdue nations before him, to disarm kings, to open the doors before him, so that the gates will not be shut: / “I will go before you and level the mountains; I will break down the gates of bronze and cut through the bars of iron. / I will give you the treasures of darkness and the riches hidden in secret places, so that you may know that I am the LORD, the God of Israel, who calls you by name. ..."
        },
        {
          "reference": "Daniel 1:9",
          "text": "Now God had granted Daniel favor and compassion from the chief official,"
        },
        {
          "reference": "Daniel 6:3",
          "text": "Soon, by his extraordinary spirit, Daniel distinguished himself among the administrators and satraps. So the king planned to set him over the whole kingdom."
        },
        {
          "reference": "Matthew 5:10-12",
          "text": "Blessed are those who are persecuted because of righteousness, for theirs is the kingdom of heaven. / Blessed are you when people insult you, persecute you, and falsely say all kinds of evil against you because of Me. / Rejoice and be glad, because great is your reward in heaven, for in the same way they persecuted the prophets before you."
        }
      ]
    },
    {
      "reference": "Genesis 39:2",
      "book": "Genesis",
      "chapter": 39,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "The LORD was with Joseph so that he prospered, and he lived in the house of his Egyptian master."
        },
        {
          "version": "NLT",
          "text": "The LORD was with Joseph, so he succeeded in everything he did as he served in the home of his Egyptian master."
        },
        {
          "version": "ESV",
          "text": "The LORD was with Joseph, and he became a successful man, and he was in the house of his Egyptian master."
        },
        {
          "version": "NKJV",
          "text": "The LORD was with Joseph, and he was a successful man; and he was in the house of his master the Egyptian."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "1 Samuel 18:14",
          "text": "and he continued to prosper in all his ways, because the LORD was with him."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Joshua 1:5",
          "text": "No one shall stand against you all the days of your life. As I was with Moses, so will I be with you; I will never leave you nor forsake you."
        },
        {
          "reference": "1 Samuel 16:18",
          "text": "One of the servants answered, “I have seen a son of Jesse of Bethlehem who knows how to play the harp. He is a mighty man of valor, a warrior, eloquent and handsome, and the LORD is with him.”"
        },
        {
          "reference": "2 Kings 18:7",
          "text": "And the LORD was with Hezekiah, and he prospered wherever he went. He rebelled against the king of Assyria and refused to serve him."
        },
        {
          "reference": "Deuteronomy 31:6",
          "text": "Be strong and courageous; do not be afraid or terrified of them, for it is the LORD your God who goes with you; He will never leave you nor forsake you.”"
        },
        {
          "reference": "Philippians 4:13",
          "text": "I can do all things through Christ who gives me strength."
        },
        {
          "reference": "2 Chronicles 15:2",
          "text": "So he went out to meet Asa and said to him, “Listen to me, Asa and all Judah and Benjamin. The LORD is with you when you are with Him. If you seek Him, He will be found by you, but if you forsake Him, He will forsake you."
        },
        {
          "reference": "Matthew 28:20",
          "text": "and teaching them to obey all that I have commanded you. And surely I am with you always, even to the end of the age.”"
        },
        {
          "reference": "1 Corinthians 15:10",
          "text": "But by the grace of God I am what I am, and His grace to me was not in vain. No, I worked harder than all of them—yet not I, but the grace of God that was with me."
        },
        {
          "reference": "Isaiah 43:2",
          "text": "When you pass through the waters, I will be with you; and when you go through the rivers, they will not overwhelm you. When you walk through the fire, you will not be scorched; the flames will not set you ablaze."
        },
        {
          "reference": "Hebrews 13:5",
          "text": "Keep your lives free from the love of money and be content with what you have, for God has said: “Never will I leave you, never will I forsake you.”"
        }
      ]
    },
    {
      "reference": "Genesis 39:3",
      "book": "Genesis",
      "chapter": 39,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "When his master saw that the LORD was with him and that the LORD gave him success in everything he did,"
        },
        {
          "version": "NLT",
          "text": "Potiphar noticed this and realized that the LORD was with Joseph, giving him success in everything he did."
        },
        {
          "version": "ESV",
          "text": "His master saw that the LORD was with him and that the LORD caused all that he did to succeed in his hands."
        },
        {
          "version": "NKJV",
          "text": "And his master saw that the LORD was with him and that the LORD made all he did to prosper in his hand."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 21:22",
          "text": "At that time Abimelech and Phicol the commander of his army said to Abraham, “God is with you in all that you do."
        },
        {
          "reference": "Genesis 26:28",
          "text": "“We can plainly see that the LORD has been with you,” they replied. “We recommend that there should now be an oath between us and you. Let us make a covenant with you"
        },
        {
          "reference": "Genesis 30:27",
          "text": "But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.”"
        },
        {
          "reference": "Genesis 41:38-39",
          "text": "So Pharaoh asked them, “Can we find anyone like this man, in whom the Spirit of God abides?” / Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you."
        },
        {
          "reference": "1 Samuel 18:14",
          "text": "and he continued to prosper in all his ways, because the LORD was with him."
        },
        {
          "reference": "1 Samuel 18:28",
          "text": "When Saul realized that the LORD was with David and that his daughter Michal loved David,"
        },
        {
          "reference": "2 Samuel 5:10",
          "text": "And David became greater and greater, for the LORD God of Hosts was with him."
        },
        {
          "reference": "1 Kings 2:3",
          "text": "And keep the charge of the LORD your God to walk in His ways and to keep His statutes, commandments, ordinances, and decrees, as written in the Law of Moses, so that you may prosper in all you do and wherever you turn,"
        },
        {
          "reference": "1 Kings 8:57",
          "text": "May the LORD our God be with us, as He was with our fathers. May He never leave us or forsake us."
        },
        {
          "reference": "2 Kings 18:7",
          "text": "And the LORD was with Hezekiah, and he prospered wherever he went. He rebelled against the king of Assyria and refused to serve him."
        },
        {
          "reference": "1 Chronicles 22:11",
          "text": "Now, my son, may the LORD be with you, and may you succeed in building the house of the LORD your God, as He said you would."
        },
        {
          "reference": "1 Chronicles 22:16",
          "text": "in gold and silver, bronze and iron—craftsmen beyond number. Now begin the work, and may the LORD be with you.”"
        },
        {
          "reference": "2 Chronicles 1:1",
          "text": "Now Solomon son of David established himself securely over his kingdom, and the LORD his God was with him and highly exalted him."
        },
        {
          "reference": "Psalm 1:3",
          "text": "He is like a tree planted by streams of water, yielding its fruit in season, whose leaf does not wither, and who prospers in all he does."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        }
      ]
    },
    {
      "reference": "Genesis 39:4",
      "book": "Genesis",
      "chapter": 39,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph found favor in his eyes and became his attendant. Potiphar put him in charge of his household, and he entrusted to his care everything he owned."
        },
        {
          "version": "NLT",
          "text": "This pleased Potiphar, so he soon made Joseph his personal attendant. He put him in charge of his entire household and everything he owned."
        },
        {
          "version": "ESV",
          "text": "So Joseph found favor in his sight and attended him, and he made him overseer of his house and put him in charge of all that he had."
        },
        {
          "version": "NKJV",
          "text": "So Joseph found favor in his sight, and served him. Then he made him overseer of his house, and all that he had he put under his authority."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Genesis 41:46",
          "text": "Now Joseph was thirty years old when he entered the service of Pharaoh king of Egypt. And Joseph left Pharaoh’s presence and traveled throughout the land of Egypt."
        },
        {
          "reference": "1 Samuel 16:21-22",
          "text": "When David came to Saul and entered his service, Saul loved him very much, and David became his armor-bearer. / Then Saul sent word to Jesse, saying, “Let David remain in my service, for I am pleased with him.”"
        },
        {
          "reference": "Daniel 6:3",
          "text": "Soon, by his extraordinary spirit, Daniel distinguished himself among the administrators and satraps. So the king planned to set him over the whole kingdom."
        },
        {
          "reference": "1 Kings 11:28",
          "text": "Now Jeroboam was a mighty man of valor. So when Solomon noticed that the young man was industrious, he put him in charge of the whole labor force of the house of Joseph."
        },
        {
          "reference": "Nehemiah 2:6",
          "text": "Then the king, with the queen seated beside him, asked me, “How long will your journey take, and when will you return?” So it pleased the king to send me, and I set a time."
        },
        {
          "reference": "Proverbs 22:29",
          "text": "Do you see a man skilled in his work? He will be stationed in the presence of kings; he will not stand before obscure men."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "1 Peter 2:18-20",
          "text": "Servants, submit yourselves to your masters with all respect, not only to those who are good and gentle, but even to those who are unreasonable. / For if anyone endures the pain of unjust suffering because he is conscious of God, this is to be commended. / How is it to your credit if you are beaten for doing wrong and you endure it? But if you suffer for doing good and you endure it, this is commendable before God."
        },
        {
          "reference": "Colossians 3:22-24",
          "text": "Slaves, obey your earthly masters in everything, not only to please them while they are watching, but with sincerity of heart and fear of the Lord. / Whatever you do, work at it with your whole being, as for the Lord and not for men, / because you know that you will receive an inheritance from the Lord as your reward. It is the Lord Christ you are serving."
        },
        {
          "reference": "Ephesians 6:5-8",
          "text": "Slaves, obey your earthly masters with respect and fear and sincerity of heart, just as you would obey Christ. / And do this not only to please them while they are watching, but as servants of Christ, doing the will of God from your heart. / Serve with good will, as to the Lord and not to men, ..."
        },
        {
          "reference": "Luke 16:10-12",
          "text": "Whoever is faithful with very little will also be faithful with much, and whoever is dishonest with very little will also be dishonest with much. / So if you have not been faithful with worldly wealth, who will entrust you with true riches? / And if you have not been faithful with the belongings of another, who will give you belongings of your own?"
        },
        {
          "reference": "Matthew 25:21",
          "text": "His master replied, ‘Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things. Enter into the joy of your master!’"
        },
        {
          "reference": "1 Timothy 6:1-2",
          "text": "All who are under the yoke of slavery should regard their masters as fully worthy of honor, so that God’s name and our teaching will not be discredited. / Those who have believing masters should not show disrespect because they are brothers, but should serve them all the more, since those receiving their good service are beloved believers. Teach and encourage these principles."
        },
        {
          "reference": "Titus 2:9-10",
          "text": "Slaves are to submit to their own masters in everything, to be well-pleasing, not argumentative, / not stealing from them, but showing all good faith, so that in every respect they will adorn the teaching about God our Savior."
        }
      ]
    },
    {
      "reference": "Genesis 39:5",
      "book": "Genesis",
      "chapter": 39,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "From the time he put him in charge of his household and of all that he owned, the LORD blessed the household of the Egyptian because of Joseph. The blessing of the LORD was on everything Potiphar had, both in the house and in the field."
        },
        {
          "version": "NLT",
          "text": "From the day Joseph was put in charge of his master’s household and property, the LORD began to bless Potiphar’s household for Joseph’s sake. All his household affairs ran smoothly, and his crops and livestock flourished."
        },
        {
          "version": "ESV",
          "text": "From the time that he made him overseer in his house and over all that he had, the LORD blessed the Egyptian’s house for Joseph’s sake; the blessing of the LORD was on all that he had, in house and field."
        },
        {
          "version": "NKJV",
          "text": "So it was, from the time that he had made him overseer of his house and all that he had, that the LORD blessed the Egyptian’s house for Joseph’s sake; and the blessing of the LORD was on all that he had in the house and in the field."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 30:27",
          "text": "But Laban replied, “If I have found favor in your eyes, please stay. I have learned by divination that the LORD has blessed me because of you.”"
        },
        {
          "reference": "Genesis 26:24",
          "text": "and that night the LORD appeared to him and said, “I am the God of your father Abraham. Do not be afraid, for I am with you. I will bless you and multiply your descendants for the sake of My servant Abraham.”"
        },
        {
          "reference": "Genesis 28:14",
          "text": "Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Exodus 23:25",
          "text": "So you shall serve the LORD your God, and He will bless your bread and your water. And I will take away sickness from among you."
        },
        {
          "reference": "Deuteronomy 28:2-6",
          "text": "And all these blessings will come upon you and overtake you, if you will obey the voice of the LORD your God: / You will be blessed in the city and blessed in the country. / The fruit of your womb will be blessed, as well as the produce of your land and the offspring of your livestock—the calves of your herds and the lambs of your flocks. ..."
        },
        {
          "reference": "2 Samuel 6:11",
          "text": "Thus the ark of the LORD remained in the house of Obed-edom the Gittite for three months, and the LORD blessed him and all his household."
        },
        {
          "reference": "1 Kings 17:12-16",
          "text": "But she replied, “As surely as the LORD your God lives, I have no bread—only a handful of flour in a jar and a little oil in a jug. Look, I am gathering a couple of sticks to take home and prepare a meal for myself and my son, so that we may eat it and die.” / “Do not be afraid,” Elijah said to her. “Go and do as you have said. But first make me a small cake of bread from what you have, and bring it out to me. Afterward, make some for yourself and your son, / for this is what the LORD, the God of Israel, says: ‘The jar of flour will not be exhausted and the jug of oil will not run dry until the day the LORD sends rain upon the face of the earth.’” ..."
        },
        {
          "reference": "Psalm 1:3",
          "text": "He is like a tree planted by streams of water, yielding its fruit in season, whose leaf does not wither, and who prospers in all he does."
        },
        {
          "reference": "Psalm 37:11",
          "text": "But the meek will inherit the land and delight in abundant prosperity."
        },
        {
          "reference": "Proverbs 10:22",
          "text": "The blessing of the LORD enriches, and He adds no sorrow to it."
        },
        {
          "reference": "Isaiah 61:9",
          "text": "Their descendants will be known among the nations, and their offspring among the peoples. All who see them will acknowledge that they are a people the LORD has blessed."
        },
        {
          "reference": "Matthew 5:16",
          "text": "In the same way, let your light shine before men, that they may see your good deeds and glorify your Father in heaven."
        },
        {
          "reference": "Matthew 25:21",
          "text": "His master replied, ‘Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things. Enter into the joy of your master!’"
        }
      ]
    },
    {
      "reference": "Genesis 39:6",
      "book": "Genesis",
      "chapter": 39,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "So Potiphar left everything he had in Joseph’s care; with Joseph in charge, he did not concern himself with anything except the food he ate. Now Joseph was well-built and handsome,"
        },
        {
          "version": "NLT",
          "text": "So Potiphar gave Joseph complete administrative responsibility over everything he owned. With Joseph there, he didn’t worry about a thing—except what kind of food to eat! Joseph was a very handsome and well-built young man,"
        },
        {
          "version": "ESV",
          "text": "So he left all that he had in Joseph’s charge, and because of him he had no concern about anything but the food he ate. Now Joseph was handsome in form and appearance."
        },
        {
          "version": "NKJV",
          "text": "Thus he left all that he had in Joseph’s hand, and he did not know what he had except for the bread which he ate. Now Joseph was handsome in form and appearance."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 39:2-4",
          "text": "And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master. / When his master saw that the LORD was with him and made him prosper in all he did, / Joseph found favor in his sight and became his personal attendant. Potiphar put him in charge of his household and entrusted him with everything he owned."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "1 Samuel 16:21-22",
          "text": "When David came to Saul and entered his service, Saul loved him very much, and David became his armor-bearer. / Then Saul sent word to Jesse, saying, “Let David remain in my service, for I am pleased with him.”"
        },
        {
          "reference": "1 Kings 11:28",
          "text": "Now Jeroboam was a mighty man of valor. So when Solomon noticed that the young man was industrious, he put him in charge of the whole labor force of the house of Joseph."
        },
        {
          "reference": "Daniel 6:3",
          "text": "Soon, by his extraordinary spirit, Daniel distinguished himself among the administrators and satraps. So the king planned to set him over the whole kingdom."
        },
        {
          "reference": "Proverbs 22:29",
          "text": "Do you see a man skilled in his work? He will be stationed in the presence of kings; he will not stand before obscure men."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "1 Peter 2:18-20",
          "text": "Servants, submit yourselves to your masters with all respect, not only to those who are good and gentle, but even to those who are unreasonable. / For if anyone endures the pain of unjust suffering because he is conscious of God, this is to be commended. / How is it to your credit if you are beaten for doing wrong and you endure it? But if you suffer for doing good and you endure it, this is commendable before God."
        },
        {
          "reference": "Colossians 3:22-24",
          "text": "Slaves, obey your earthly masters in everything, not only to please them while they are watching, but with sincerity of heart and fear of the Lord. / Whatever you do, work at it with your whole being, as for the Lord and not for men, / because you know that you will receive an inheritance from the Lord as your reward. It is the Lord Christ you are serving."
        },
        {
          "reference": "Ephesians 6:5-8",
          "text": "Slaves, obey your earthly masters with respect and fear and sincerity of heart, just as you would obey Christ. / And do this not only to please them while they are watching, but as servants of Christ, doing the will of God from your heart. / Serve with good will, as to the Lord and not to men, ..."
        },
        {
          "reference": "Matthew 25:21",
          "text": "His master replied, ‘Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things. Enter into the joy of your master!’"
        },
        {
          "reference": "Luke 16:10-12",
          "text": "Whoever is faithful with very little will also be faithful with much, and whoever is dishonest with very little will also be dishonest with much. / So if you have not been faithful with worldly wealth, who will entrust you with true riches? / And if you have not been faithful with the belongings of another, who will give you belongings of your own?"
        },
        {
          "reference": "1 Corinthians 4:2",
          "text": "Now it is required of stewards that they be found faithful."
        },
        {
          "reference": "1 Timothy 6:1-2",
          "text": "All who are under the yoke of slavery should regard their masters as fully worthy of honor, so that God’s name and our teaching will not be discredited. / Those who have believing masters should not show disrespect because they are brothers, but should serve them all the more, since those receiving their good service are beloved believers. Teach and encourage these principles."
        },
        {
          "reference": "Titus 2:9-10",
          "text": "Slaves are to submit to their own masters in everything, to be well-pleasing, not argumentative, / not stealing from them, but showing all good faith, so that in every respect they will adorn the teaching about God our Savior."
        }
      ]
    },
    {
      "reference": "Genesis 39:7",
      "book": "Genesis",
      "chapter": 39,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "and after a while his master’s wife took notice of Joseph and said, &#8220Come to bed with me!”"
        },
        {
          "version": "NLT",
          "text": "and Potiphar’s wife soon began to look at him lustfully. “Come and sleep with me,” she demanded."
        },
        {
          "version": "ESV",
          "text": "And after a time his master’s wife cast her eyes on Joseph and said, “Lie with me.”"
        },
        {
          "version": "NKJV",
          "text": "And it came to pass after these things that his master’s wife cast longing eyes on Joseph, and she said, “Lie with me.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Proverbs 6:25",
          "text": "Do not lust in your heart for her beauty or let her captivate you with her eyes."
        },
        {
          "reference": "2 Samuel 11:2-4",
          "text": "One evening David got up from his bed and strolled around on the roof of the palace. And from the roof he saw a woman bathing—a very beautiful woman. / So David sent and inquired about the woman, and he was told, “This is Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite.” / Then David sent messengers to get her, and when she came to him, he slept with her. (Now she had just purified herself from her uncleanness.) Then she returned home."
        },
        {
          "reference": "Matthew 5:28",
          "text": "But I tell you that anyone who looks at a woman to lust after her has already committed adultery with her in his heart."
        },
        {
          "reference": "1 Corinthians 6:18",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body."
        },
        {
          "reference": "Exodus 20:14",
          "text": "You shall not commit adultery."
        },
        {
          "reference": "2 Timothy 2:22",
          "text": "Flee from youthful passions and pursue righteousness, faith, love, and peace, together with those who call on the Lord out of a pure heart."
        },
        {
          "reference": "James 1:14-15",
          "text": "But each one is tempted when by his own evil desires he is lured away and enticed. / Then after desire has conceived, it gives birth to sin; and sin, when it is full-grown, gives birth to death."
        },
        {
          "reference": "Proverbs 7:13-21",
          "text": "She seizes him and kisses him; she brazenly says to him: / “I have made my peace offerings; today I have paid my vows. / So I came out to meet you; I sought you, and I have found you. ..."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "Job 31:1",
          "text": "“I have made a covenant with my eyes. How then could I gaze with desire at a virgin?"
        },
        {
          "reference": "Romans 13:14",
          "text": "Instead, clothe yourselves with the Lord Jesus Christ, and make no provision for the desires of the flesh."
        },
        {
          "reference": "Leviticus 18:20",
          "text": "You must not lie carnally with your neighbor’s wife and thus defile yourself with her."
        },
        {
          "reference": "Ephesians 5:3",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed."
        },
        {
          "reference": "1 Peter 2:11",
          "text": "Beloved, I urge you, as foreigners and exiles, to abstain from the desires of the flesh, which war against your soul."
        },
        {
          "reference": "Deuteronomy 5:18",
          "text": "You shall not commit adultery."
        }
      ]
    },
    {
      "reference": "Genesis 39:8",
      "book": "Genesis",
      "chapter": 39,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "But he refused. “With me in charge,” he told her, “my master does not concern himself with anything in the house; everything he owns he has entrusted to my care."
        },
        {
          "version": "NLT",
          "text": "But Joseph refused. “Look,” he told her, “my master trusts me with everything in his entire household."
        },
        {
          "version": "ESV",
          "text": "But he refused and said to his master’s wife, “Behold, because of me my master has no concern about anything in the house, and he has put everything that he has in my charge."
        },
        {
          "version": "NKJV",
          "text": "But he refused and said to his master’s wife, “Look, my master does not know what is with me in the house, and he has committed all that he has to my hand."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 20:14",
          "text": "You shall not commit adultery."
        },
        {
          "reference": "Proverbs 6:32",
          "text": "He who commits adultery lacks judgment; whoever does so destroys himself."
        },
        {
          "reference": "Proverbs 7:25-27",
          "text": "Do not let your heart turn aside to her ways; do not stray into her paths. / For she has brought many down to death; her slain are many in number. / Her house is the road to Sheol, descending to the chambers of death."
        },
        {
          "reference": "2 Samuel 11:2-4",
          "text": "One evening David got up from his bed and strolled around on the roof of the palace. And from the roof he saw a woman bathing—a very beautiful woman. / So David sent and inquired about the woman, and he was told, “This is Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite.” / Then David sent messengers to get her, and when she came to him, he slept with her. (Now she had just purified herself from her uncleanness.) Then she returned home."
        },
        {
          "reference": "Job 31:1",
          "text": "“I have made a covenant with my eyes. How then could I gaze with desire at a virgin?"
        },
        {
          "reference": "Proverbs 5:3-8",
          "text": "Though the lips of the forbidden woman drip honey and her speech is smoother than oil, / in the end she is bitter as wormwood, sharp as a double-edged sword. / Her feet go down to death; her steps lead straight to Sheol. ..."
        },
        {
          "reference": "Matthew 5:27-28",
          "text": "You have heard that it was said, ‘Do not commit adultery.’ / But I tell you that anyone who looks at a woman to lust after her has already committed adultery with her in his heart."
        },
        {
          "reference": "1 Corinthians 6:18-20",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body. / Do you not know that your body is a temple of the Holy Spirit who is in you, whom you have received from God? You are not your own; / you were bought at a price. Therefore glorify God with your body."
        },
        {
          "reference": "2 Timothy 2:22",
          "text": "Flee from youthful passions and pursue righteousness, faith, love, and peace, together with those who call on the Lord out of a pure heart."
        },
        {
          "reference": "Hebrews 13:4",
          "text": "Marriage should be honored by all and the marriage bed kept undefiled, for God will judge the sexually immoral and adulterers."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "Ephesians 5:3",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed."
        },
        {
          "reference": "Colossians 3:5",
          "text": "Put to death, therefore, the components of your earthly nature: sexual immorality, impurity, lust, evil desires, and greed, which is idolatry."
        },
        {
          "reference": "Romans 13:13-14",
          "text": "Let us behave decently, as in the daytime, not in carousing and drunkenness, not in sexual immorality and debauchery, not in dissension and jealousy. / Instead, clothe yourselves with the Lord Jesus Christ, and make no provision for the desires of the flesh."
        },
        {
          "reference": "1 Peter 2:11",
          "text": "Beloved, I urge you, as foreigners and exiles, to abstain from the desires of the flesh, which war against your soul."
        }
      ]
    },
    {
      "reference": "Genesis 39:9",
      "book": "Genesis",
      "chapter": 39,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "No one is greater in this house than I am. My master has withheld nothing from me except you, because you are his wife. How then could I do such a wicked thing and sin against God?”"
        },
        {
          "version": "NLT",
          "text": "No one here has more authority than I do. He has held back nothing from me except you, because you are his wife. How could I do such a wicked thing? It would be a great sin against God.”"
        },
        {
          "version": "ESV",
          "text": "He is not greater in this house than I am, nor has he kept back anything from me except you, because you are his wife. How then can I do this great wickedness and sin against God?”"
        },
        {
          "version": "NKJV",
          "text": "There is no one greater in this house than I, nor has he kept back anything from me but you, because you are his wife. How then can I do this great wickedness, and sin against God?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 20:14",
          "text": "You shall not commit adultery."
        },
        {
          "reference": "Proverbs 6:32",
          "text": "He who commits adultery lacks judgment; whoever does so destroys himself."
        },
        {
          "reference": "2 Samuel 12:13",
          "text": "Then David said to Nathan, “I have sinned against the LORD.” “The LORD has taken away your sin,” Nathan replied. “You will not die."
        },
        {
          "reference": "Matthew 5:28",
          "text": "But I tell you that anyone who looks at a woman to lust after her has already committed adultery with her in his heart."
        },
        {
          "reference": "1 Corinthians 6:18",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body."
        },
        {
          "reference": "Hebrews 13:4",
          "text": "Marriage should be honored by all and the marriage bed kept undefiled, for God will judge the sexually immoral and adulterers."
        },
        {
          "reference": "2 Timothy 2:22",
          "text": "Flee from youthful passions and pursue righteousness, faith, love, and peace, together with those who call on the Lord out of a pure heart."
        },
        {
          "reference": "James 1:14-15",
          "text": "But each one is tempted when by his own evil desires he is lured away and enticed. / Then after desire has conceived, it gives birth to sin; and sin, when it is full-grown, gives birth to death."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "Romans 13:14",
          "text": "Instead, clothe yourselves with the Lord Jesus Christ, and make no provision for the desires of the flesh."
        },
        {
          "reference": "Job 31:1",
          "text": "“I have made a covenant with my eyes. How then could I gaze with desire at a virgin?"
        },
        {
          "reference": "Leviticus 18:20",
          "text": "You must not lie carnally with your neighbor’s wife and thus defile yourself with her."
        },
        {
          "reference": "Deuteronomy 5:18",
          "text": "You shall not commit adultery."
        },
        {
          "reference": "Proverbs 7:6-27",
          "text": "For at the window of my house I looked through the lattice. / I saw among the simple, I noticed among the youths, a young man lacking judgment, / crossing the street near her corner, strolling down the road to her house, ..."
        },
        {
          "reference": "Psalm 51:4",
          "text": "Against You, You only, have I sinned and done what is evil in Your sight, so that You may be proved right when You speak and blameless when You judge."
        }
      ]
    },
    {
      "reference": "Genesis 39:10",
      "book": "Genesis",
      "chapter": 39,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "And though she spoke to Joseph day after day, he refused to go to bed with her or even be with her."
        },
        {
          "version": "NLT",
          "text": "She kept putting pressure on Joseph day after day, but he refused to sleep with her, and he kept out of her way as much as possible."
        },
        {
          "version": "ESV",
          "text": "And as she spoke to Joseph day after day, he would not listen to her, to lie beside her or to be with her."
        },
        {
          "version": "NKJV",
          "text": "So it was, as she spoke to Joseph day by day, that he did not heed her, to lie with her or to be with her."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Proverbs 7:13-15",
          "text": "She seizes him and kisses him; she brazenly says to him: / “I have made my peace offerings; today I have paid my vows. / So I came out to meet you; I sought you, and I have found you."
        },
        {
          "reference": "2 Samuel 11:2-4",
          "text": "One evening David got up from his bed and strolled around on the roof of the palace. And from the roof he saw a woman bathing—a very beautiful woman. / So David sent and inquired about the woman, and he was told, “This is Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite.” / Then David sent messengers to get her, and when she came to him, he slept with her. (Now she had just purified herself from her uncleanness.) Then she returned home."
        },
        {
          "reference": "Proverbs 6:25-29",
          "text": "Do not lust in your heart for her beauty or let her captivate you with her eyes. / For the levy of the prostitute is poverty, and the adulteress preys upon your very life. / Can a man embrace fire and his clothes not be burned? ..."
        },
        {
          "reference": "Matthew 5:28",
          "text": "But I tell you that anyone who looks at a woman to lust after her has already committed adultery with her in his heart."
        },
        {
          "reference": "1 Corinthians 6:18",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body."
        },
        {
          "reference": "2 Timothy 2:22",
          "text": "Flee from youthful passions and pursue righteousness, faith, love, and peace, together with those who call on the Lord out of a pure heart."
        },
        {
          "reference": "James 1:14-15",
          "text": "But each one is tempted when by his own evil desires he is lured away and enticed. / Then after desire has conceived, it gives birth to sin; and sin, when it is full-grown, gives birth to death."
        },
        {
          "reference": "Proverbs 5:3-8",
          "text": "Though the lips of the forbidden woman drip honey and her speech is smoother than oil, / in the end she is bitter as wormwood, sharp as a double-edged sword. / Her feet go down to death; her steps lead straight to Sheol. ..."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "Romans 13:14",
          "text": "Instead, clothe yourselves with the Lord Jesus Christ, and make no provision for the desires of the flesh."
        },
        {
          "reference": "1 Peter 2:11",
          "text": "Beloved, I urge you, as foreigners and exiles, to abstain from the desires of the flesh, which war against your soul."
        },
        {
          "reference": "Proverbs 9:13-18",
          "text": "The woman named Folly is loud; she is naive and knows nothing. / She sits at the door of her house, on a seat in the heights of the city, / calling out to those who pass by, who make their paths straight. ..."
        },
        {
          "reference": "1 Corinthians 10:13",
          "text": "No temptation has seized you except what is common to man. And God is faithful; He will not let you be tempted beyond what you can bear. But when you are tempted, He will also provide an escape, so that you can stand up under it."
        },
        {
          "reference": "Ephesians 5:3",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed."
        },
        {
          "reference": "Colossians 3:5",
          "text": "Put to death, therefore, the components of your earthly nature: sexual immorality, impurity, lust, evil desires, and greed, which is idolatry."
        }
      ]
    },
    {
      "reference": "Genesis 39:11",
      "book": "Genesis",
      "chapter": 39,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "One day he went into the house to attend to his duties, and none of the household servants was inside."
        },
        {
          "version": "NLT",
          "text": "One day, however, no one else was around when he went in to do his work."
        },
        {
          "version": "ESV",
          "text": "But one day, when he went into the house to do his work and none of the men of the house was there in the house,"
        },
        {
          "version": "NKJV",
          "text": "But it happened about this time, when Joseph went into the house to do his work, and none of the men of the house was inside,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Proverbs 7:13-23",
          "text": "She seizes him and kisses him; she brazenly says to him: / “I have made my peace offerings; today I have paid my vows. / So I came out to meet you; I sought you, and I have found you. ..."
        },
        {
          "reference": "2 Samuel 11:2-4",
          "text": "One evening David got up from his bed and strolled around on the roof of the palace. And from the roof he saw a woman bathing—a very beautiful woman. / So David sent and inquired about the woman, and he was told, “This is Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite.” / Then David sent messengers to get her, and when she came to him, he slept with her. (Now she had just purified herself from her uncleanness.) Then she returned home."
        },
        {
          "reference": "1 Corinthians 10:13",
          "text": "No temptation has seized you except what is common to man. And God is faithful; He will not let you be tempted beyond what you can bear. But when you are tempted, He will also provide an escape, so that you can stand up under it."
        },
        {
          "reference": "Matthew 5:28",
          "text": "But I tell you that anyone who looks at a woman to lust after her has already committed adultery with her in his heart."
        },
        {
          "reference": "2 Timothy 2:22",
          "text": "Flee from youthful passions and pursue righteousness, faith, love, and peace, together with those who call on the Lord out of a pure heart."
        },
        {
          "reference": "James 1:14-15",
          "text": "But each one is tempted when by his own evil desires he is lured away and enticed. / Then after desire has conceived, it gives birth to sin; and sin, when it is full-grown, gives birth to death."
        },
        {
          "reference": "1 Peter 5:8",
          "text": "Be sober-minded and alert. Your adversary the devil prowls around like a roaring lion, seeking someone to devour."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "Romans 13:14",
          "text": "Instead, clothe yourselves with the Lord Jesus Christ, and make no provision for the desires of the flesh."
        },
        {
          "reference": "1 Corinthians 6:18",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body."
        },
        {
          "reference": "Exodus 20:14",
          "text": "You shall not commit adultery."
        },
        {
          "reference": "Proverbs 6:23-29",
          "text": "For this commandment is a lamp, this teaching is a light, and the reproofs of discipline are the way to life, / to keep you from the evil woman, from the smooth tongue of the adulteress. / Do not lust in your heart for her beauty or let her captivate you with her eyes. ..."
        },
        {
          "reference": "Job 31:1",
          "text": "“I have made a covenant with my eyes. How then could I gaze with desire at a virgin?"
        },
        {
          "reference": "Psalm 119:9",
          "text": "How can a young man keep his way pure? By guarding it according to Your word."
        },
        {
          "reference": "Proverbs 5:3-8",
          "text": "Though the lips of the forbidden woman drip honey and her speech is smoother than oil, / in the end she is bitter as wormwood, sharp as a double-edged sword. / Her feet go down to death; her steps lead straight to Sheol. ..."
        }
      ]
    },
    {
      "reference": "Genesis 39:12",
      "book": "Genesis",
      "chapter": 39,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "She caught him by his cloak and said, &#8220Come to bed with me!” But he left his cloak in her hand and ran out of the house."
        },
        {
          "version": "NLT",
          "text": "She came and grabbed him by his cloak, demanding, “Come on, sleep with me!” Joseph tore himself away, but he left his cloak in her hand as he ran from the house."
        },
        {
          "version": "ESV",
          "text": "she caught him by his garment, saying, “Lie with me.” But he left his garment in her hand and fled and got out of the house."
        },
        {
          "version": "NKJV",
          "text": "that she caught him by his garment, saying, “Lie with me.” But he left his garment in her hand, and fled and ran outside."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "2 Samuel 11:2-4",
          "text": "One evening David got up from his bed and strolled around on the roof of the palace. And from the roof he saw a woman bathing—a very beautiful woman. / So David sent and inquired about the woman, and he was told, “This is Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite.” / Then David sent messengers to get her, and when she came to him, he slept with her. (Now she had just purified herself from her uncleanness.) Then she returned home."
        },
        {
          "reference": "Proverbs 7:13-27",
          "text": "She seizes him and kisses him; she brazenly says to him: / “I have made my peace offerings; today I have paid my vows. / So I came out to meet you; I sought you, and I have found you. ..."
        },
        {
          "reference": "2 Timothy 2:22",
          "text": "Flee from youthful passions and pursue righteousness, faith, love, and peace, together with those who call on the Lord out of a pure heart."
        },
        {
          "reference": "1 Corinthians 6:18",
          "text": "Flee from sexual immorality. Every other sin a man can commit is outside his body, but he who sins sexually sins against his own body."
        },
        {
          "reference": "Matthew 5:28",
          "text": "But I tell you that anyone who looks at a woman to lust after her has already committed adultery with her in his heart."
        },
        {
          "reference": "Proverbs 6:23-29",
          "text": "For this commandment is a lamp, this teaching is a light, and the reproofs of discipline are the way to life, / to keep you from the evil woman, from the smooth tongue of the adulteress. / Do not lust in your heart for her beauty or let her captivate you with her eyes. ..."
        },
        {
          "reference": "1 Thessalonians 4:3-5",
          "text": "For it is God’s will that you should be holy: You must abstain from sexual immorality; / each of you must know how to control his own body in holiness and honor, / not in lustful passion like the Gentiles who do not know God;"
        },
        {
          "reference": "James 1:14-15",
          "text": "But each one is tempted when by his own evil desires he is lured away and enticed. / Then after desire has conceived, it gives birth to sin; and sin, when it is full-grown, gives birth to death."
        },
        {
          "reference": "1 Peter 2:11",
          "text": "Beloved, I urge you, as foreigners and exiles, to abstain from the desires of the flesh, which war against your soul."
        },
        {
          "reference": "Proverbs 5:3-8",
          "text": "Though the lips of the forbidden woman drip honey and her speech is smoother than oil, / in the end she is bitter as wormwood, sharp as a double-edged sword. / Her feet go down to death; her steps lead straight to Sheol. ..."
        },
        {
          "reference": "1 Corinthians 10:13",
          "text": "No temptation has seized you except what is common to man. And God is faithful; He will not let you be tempted beyond what you can bear. But when you are tempted, He will also provide an escape, so that you can stand up under it."
        },
        {
          "reference": "Romans 13:13-14",
          "text": "Let us behave decently, as in the daytime, not in carousing and drunkenness, not in sexual immorality and debauchery, not in dissension and jealousy. / Instead, clothe yourselves with the Lord Jesus Christ, and make no provision for the desires of the flesh."
        },
        {
          "reference": "Ephesians 5:3",
          "text": "But among you, as is proper among the saints, there must not be even a hint of sexual immorality, or of any kind of impurity, or of greed."
        },
        {
          "reference": "Galatians 5:16-17",
          "text": "So I say, walk by the Spirit, and you will not gratify the desires of the flesh. / For the flesh craves what is contrary to the Spirit, and the Spirit what is contrary to the flesh. They are opposed to each other, so that you do not do what you want."
        },
        {
          "reference": "Job 31:1",
          "text": "“I have made a covenant with my eyes. How then could I gaze with desire at a virgin?"
        }
      ]
    },
    {
      "reference": "Genesis 39:13",
      "book": "Genesis",
      "chapter": 39,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "When she saw that he had left his cloak in her hand and had run out of the house,"
        },
        {
          "version": "NLT",
          "text": "When she saw that she was holding his cloak and he had fled,"
        },
        {
          "version": "ESV",
          "text": "And as soon as she saw that he had left his garment in her hand and had fled out of the house,"
        },
        {
          "version": "NKJV",
          "text": "And so it was, when she saw that he had left his garment in her hand and fled outside,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 23:1",
          "text": "“You shall not spread a false report. Do not join the wicked by being a malicious witness."
        },
        {
          "reference": "Proverbs 6:16-19",
          "text": "There are six things that the LORD hates, seven that are detestable to Him: / haughty eyes, a lying tongue, hands that shed innocent blood, / a heart that devises wicked schemes, feet that run swiftly to evil, ..."
        },
        {
          "reference": "Proverbs 19:5",
          "text": "A false witness will not go unpunished, and one who utters lies will not escape."
        },
        {
          "reference": "Proverbs 19:9",
          "text": "A false witness will not go unpunished, and one who pours out lies will perish."
        },
        {
          "reference": "Proverbs 21:28",
          "text": "A lying witness will perish, but the man who listens to truth will speak forever."
        },
        {
          "reference": "Deuteronomy 19:16-19",
          "text": "If a false witness testifies against someone, accusing him of a crime, / both parties to the dispute must stand in the presence of the LORD, before the priests and judges who are in office at that time. / The judges shall investigate thoroughly, and if the witness is proven to be a liar who has falsely accused his brother, ..."
        },
        {
          "reference": "Psalm 27:12",
          "text": "Do not hand me over to the will of my foes, for false witnesses rise up against me, breathing out violence."
        },
        {
          "reference": "Psalm 35:11",
          "text": "Hostile witnesses come forward; they make charges I know nothing about."
        },
        {
          "reference": "Psalm 109:2-3",
          "text": "For wicked and deceitful mouths open against me; they speak against me with lying tongues. / They surround me with hateful words and attack me without cause."
        },
        {
          "reference": "Matthew 26:59-61",
          "text": "Now the chief priests and the whole Sanhedrin were seeking false testimony against Jesus in order to put Him to death. / But they did not find any, though many false witnesses came forward. Finally two came forward / and declared, “This man said, ‘I am able to destroy the temple of God and rebuild it in three days.’”"
        },
        {
          "reference": "Mark 14:56-59",
          "text": "For many bore false witness against Jesus, but their testimony was inconsistent. / Then some men stood up and testified falsely against Him: / “We heard Him say, ‘I will destroy this man-made temple, and in three days I will build another that is made without hands.’” ..."
        },
        {
          "reference": "Luke 23:2",
          "text": "And they began to accuse Him, saying, “We found this man subverting our nation, forbidding payment of taxes to Caesar, and proclaiming Himself to be Christ, a King.”"
        },
        {
          "reference": "Acts 6:11-13",
          "text": "Then they prompted some men to say, “We heard Stephen speak words of blasphemy against Moses and against God.” / So they stirred up the people, elders, and scribes and confronted Stephen. They seized him and brought him before the Sanhedrin, / where they presented false witnesses who said, “This man never stops speaking against this holy place and against the law."
        },
        {
          "reference": "Acts 24:5-9",
          "text": "We have found this man to be a pestilence, stirring up dissension among the Jews all over the world. He is a ringleader of the sect of the Nazarenes, / and he even tried to desecrate the temple; so we seized him. / but Lysias the commander came with great force and took him out of our hands, ..."
        },
        {
          "reference": "Romans 3:8",
          "text": "Why not say, as some slanderously claim that we say, “Let us do evil that good may result”? Their condemnation is deserved!"
        }
      ]
    },
    {
      "reference": "Genesis 39:14",
      "book": "Genesis",
      "chapter": 39,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "she called her household servants. “Look,” she said to them, “this Hebrew has been brought to us to make sport of us! He came in here to sleep with me, but I screamed."
        },
        {
          "version": "NLT",
          "text": "she called out to her servants. Soon all the men came running. “Look!” she said. “My husband has brought this Hebrew slave here to make fools of us! He came into my room to rape me, but I screamed."
        },
        {
          "version": "ESV",
          "text": "she called to the men of her household and said to them, “See, he has brought among us a Hebrew to laugh at us. He came in to me to lie with me, and I cried out with a loud voice."
        },
        {
          "version": "NKJV",
          "text": "that she called to the men of her house and spoke to them, saying, “See, he has brought in to us a Hebrew to mock us. He came in to me to lie with me, and I cried out with a loud voice."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 23:1",
          "text": "“You shall not spread a false report. Do not join the wicked by being a malicious witness."
        },
        {
          "reference": "Deuteronomy 22:24-27",
          "text": "you must take both of them out to the gate of that city and stone them to death—the young woman because she did not cry out in the city, and the man because he has violated his neighbor’s wife. So you must purge the evil from among you. / But if the man encounters a betrothed woman in the open country, and he overpowers her and lies with her, only the man who has done this must die. / Do nothing to the young woman, because she has committed no sin worthy of death. This case is just like one in which a man attacks his neighbor and murders him. ..."
        },
        {
          "reference": "Proverbs 6:29-35",
          "text": "So is he who sleeps with another man’s wife; no one who touches her will go unpunished. / Men do not despise the thief if he steals to satisfy his hunger. / Yet if caught, he must pay sevenfold; he must give up all the wealth of his house. ..."
        },
        {
          "reference": "Proverbs 19:5",
          "text": "A false witness will not go unpunished, and one who utters lies will not escape."
        },
        {
          "reference": "Proverbs 19:9",
          "text": "A false witness will not go unpunished, and one who pours out lies will perish."
        },
        {
          "reference": "Proverbs 25:18",
          "text": "Like a club or sword or sharp arrow is a man who bears false witness against his neighbor."
        },
        {
          "reference": "Psalm 35:11",
          "text": "Hostile witnesses come forward; they make charges I know nothing about."
        },
        {
          "reference": "Psalm 109:2-3",
          "text": "For wicked and deceitful mouths open against me; they speak against me with lying tongues. / They surround me with hateful words and attack me without cause."
        },
        {
          "reference": "Jeremiah 9:4-6",
          "text": "“Let everyone guard against his neighbor; do not trust any brother, for every brother deals craftily, and every friend spreads slander. / Each one betrays his friend; no one tells the truth. They have taught their tongues to lie; they wear themselves out committing iniquity. / You dwell in the midst of deception; in their deceit they refuse to know Me,” declares the LORD."
        },
        {
          "reference": "Jeremiah 20:10",
          "text": "For I have heard the whispering of many: “Terror is on every side! Report him; let us report him!” All my trusted friends watch for my fall: “Perhaps he will be deceived so that we may prevail against him and take our vengeance upon him.”"
        },
        {
          "reference": "Matthew 5:11",
          "text": "Blessed are you when people insult you, persecute you, and falsely say all kinds of evil against you because of Me."
        },
        {
          "reference": "Matthew 26:59-61",
          "text": "Now the chief priests and the whole Sanhedrin were seeking false testimony against Jesus in order to put Him to death. / But they did not find any, though many false witnesses came forward. Finally two came forward / and declared, “This man said, ‘I am able to destroy the temple of God and rebuild it in three days.’”"
        },
        {
          "reference": "Mark 14:56-59",
          "text": "For many bore false witness against Jesus, but their testimony was inconsistent. / Then some men stood up and testified falsely against Him: / “We heard Him say, ‘I will destroy this man-made temple, and in three days I will build another that is made without hands.’” ..."
        },
        {
          "reference": "Luke 6:22",
          "text": "Blessed are you when people hate you, and when they exclude you and insult you and reject your name as evil because of the Son of Man."
        },
        {
          "reference": "John 8:44",
          "text": "You belong to your father, the devil, and you want to carry out his desires. He was a murderer from the beginning, refusing to uphold the truth, because there is no truth in him. When he lies, he speaks his native language, because he is a liar and the father of lies."
        }
      ]
    },
    {
      "reference": "Genesis 39:15",
      "book": "Genesis",
      "chapter": 39,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "When he heard me scream for help, he left his cloak beside me and ran out of the house.”"
        },
        {
          "version": "NLT",
          "text": "When he heard me scream, he ran outside and got away, but he left his cloak behind with me.”"
        },
        {
          "version": "ESV",
          "text": "And as soon as he heard that I lifted up my voice and cried out, he left his garment beside me and fled and got out of the house.”"
        },
        {
          "version": "NKJV",
          "text": "And it happened, when he heard that I lifted my voice and cried out, that he left his garment with me, and fled and went outside.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 23:1",
          "text": "“You shall not spread a false report. Do not join the wicked by being a malicious witness."
        },
        {
          "reference": "Proverbs 6:19",
          "text": "a false witness who gives false testimony, and one who stirs up discord among brothers."
        },
        {
          "reference": "Psalm 101:5",
          "text": "Whoever slanders his neighbor in secret, I will put to silence; the one with haughty eyes and a proud heart, I will not endure."
        },
        {
          "reference": "Deuteronomy 19:16-19",
          "text": "If a false witness testifies against someone, accusing him of a crime, / both parties to the dispute must stand in the presence of the LORD, before the priests and judges who are in office at that time. / The judges shall investigate thoroughly, and if the witness is proven to be a liar who has falsely accused his brother, ..."
        },
        {
          "reference": "Proverbs 19:5",
          "text": "A false witness will not go unpunished, and one who utters lies will not escape."
        },
        {
          "reference": "Matthew 26:59-61",
          "text": "Now the chief priests and the whole Sanhedrin were seeking false testimony against Jesus in order to put Him to death. / But they did not find any, though many false witnesses came forward. Finally two came forward / and declared, “This man said, ‘I am able to destroy the temple of God and rebuild it in three days.’”"
        },
        {
          "reference": "Acts 6:13",
          "text": "where they presented false witnesses who said, “This man never stops speaking against this holy place and against the law."
        },
        {
          "reference": "1 Peter 3:16",
          "text": "keeping a clear conscience, so that those who slander you may be put to shame by your good behavior in Christ."
        },
        {
          "reference": "Psalm 35:11",
          "text": "Hostile witnesses come forward; they make charges I know nothing about."
        },
        {
          "reference": "Proverbs 12:17",
          "text": "He who speaks the truth declares what is right, but a false witness speaks deceit."
        },
        {
          "reference": "Matthew 5:11",
          "text": "Blessed are you when people insult you, persecute you, and falsely say all kinds of evil against you because of Me."
        },
        {
          "reference": "1 Timothy 5:19",
          "text": "Do not entertain an accusation against an elder, except on the testimony of two or three witnesses."
        },
        {
          "reference": "Luke 23:2",
          "text": "And they began to accuse Him, saying, “We found this man subverting our nation, forbidding payment of taxes to Caesar, and proclaiming Himself to be Christ, a King.”"
        },
        {
          "reference": "Mark 14:56-57",
          "text": "For many bore false witness against Jesus, but their testimony was inconsistent. / Then some men stood up and testified falsely against Him:"
        },
        {
          "reference": "John 8:44",
          "text": "You belong to your father, the devil, and you want to carry out his desires. He was a murderer from the beginning, refusing to uphold the truth, because there is no truth in him. When he lies, he speaks his native language, because he is a liar and the father of lies."
        }
      ]
    },
    {
      "reference": "Genesis 39:16",
      "book": "Genesis",
      "chapter": 39,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "She kept his cloak beside her until his master came home."
        },
        {
          "version": "NLT",
          "text": "She kept the cloak with her until her husband came home."
        },
        {
          "version": "ESV",
          "text": "Then she laid up his garment by her until his master came home,"
        },
        {
          "version": "NKJV",
          "text": "So she kept his garment with her until his master came home."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:31-33",
          "text": "Then they took Joseph’s robe, slaughtered a young goat, and dipped the robe in its blood. / They sent the robe of many colors to their father and said, “We found this. Examine it to see whether it is your son’s robe or not.” / His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!”"
        },
        {
          "reference": "Exodus 23:1",
          "text": "“You shall not spread a false report. Do not join the wicked by being a malicious witness."
        },
        {
          "reference": "Proverbs 6:16-19",
          "text": "There are six things that the LORD hates, seven that are detestable to Him: / haughty eyes, a lying tongue, hands that shed innocent blood, / a heart that devises wicked schemes, feet that run swiftly to evil, ..."
        },
        {
          "reference": "Psalm 35:11",
          "text": "Hostile witnesses come forward; they make charges I know nothing about."
        },
        {
          "reference": "Psalm 109:2-3",
          "text": "For wicked and deceitful mouths open against me; they speak against me with lying tongues. / They surround me with hateful words and attack me without cause."
        },
        {
          "reference": "Proverbs 19:5",
          "text": "A false witness will not go unpunished, and one who utters lies will not escape."
        },
        {
          "reference": "Proverbs 19:9",
          "text": "A false witness will not go unpunished, and one who pours out lies will perish."
        },
        {
          "reference": "Deuteronomy 19:16-19",
          "text": "If a false witness testifies against someone, accusing him of a crime, / both parties to the dispute must stand in the presence of the LORD, before the priests and judges who are in office at that time. / The judges shall investigate thoroughly, and if the witness is proven to be a liar who has falsely accused his brother, ..."
        },
        {
          "reference": "1 Kings 21:8-13",
          "text": "Then Jezebel wrote letters in Ahab’s name, sealed them with his seal, and sent them to the elders and nobles who lived with Naboth in his city. / In the letters she wrote: “Proclaim a fast and give Naboth a seat of honor among the people. / But seat two scoundrels opposite him and have them testify, ‘You have cursed both God and the king!’ Then take him out and stone him to death.” ..."
        },
        {
          "reference": "Jeremiah 9:3-6",
          "text": "“They bend their tongues like bows; lies prevail over truth in the land. For they proceed from evil to evil, and they do not take Me into account,” declares the LORD. / “Let everyone guard against his neighbor; do not trust any brother, for every brother deals craftily, and every friend spreads slander. / Each one betrays his friend; no one tells the truth. They have taught their tongues to lie; they wear themselves out committing iniquity. ..."
        },
        {
          "reference": "Matthew 26:59-61",
          "text": "Now the chief priests and the whole Sanhedrin were seeking false testimony against Jesus in order to put Him to death. / But they did not find any, though many false witnesses came forward. Finally two came forward / and declared, “This man said, ‘I am able to destroy the temple of God and rebuild it in three days.’”"
        },
        {
          "reference": "Mark 14:56-59",
          "text": "For many bore false witness against Jesus, but their testimony was inconsistent. / Then some men stood up and testified falsely against Him: / “We heard Him say, ‘I will destroy this man-made temple, and in three days I will build another that is made without hands.’” ..."
        },
        {
          "reference": "Luke 23:2",
          "text": "And they began to accuse Him, saying, “We found this man subverting our nation, forbidding payment of taxes to Caesar, and proclaiming Himself to be Christ, a King.”"
        },
        {
          "reference": "Acts 6:11-13",
          "text": "Then they prompted some men to say, “We heard Stephen speak words of blasphemy against Moses and against God.” / So they stirred up the people, elders, and scribes and confronted Stephen. They seized him and brought him before the Sanhedrin, / where they presented false witnesses who said, “This man never stops speaking against this holy place and against the law."
        },
        {
          "reference": "Acts 24:5-9",
          "text": "We have found this man to be a pestilence, stirring up dissension among the Jews all over the world. He is a ringleader of the sect of the Nazarenes, / and he even tried to desecrate the temple; so we seized him. / but Lysias the commander came with great force and took him out of our hands, ..."
        }
      ]
    },
    {
      "reference": "Genesis 39:17",
      "book": "Genesis",
      "chapter": 39,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Then she told him this story: “That Hebrew slave you brought us came to me to make sport of me."
        },
        {
          "version": "NLT",
          "text": "Then she told him her story. “That Hebrew slave you’ve brought into our house tried to come in and fool around with me,” she said."
        },
        {
          "version": "ESV",
          "text": "and she told him the same story, saying, “The Hebrew servant, whom you have brought among us, came in to me to laugh at me."
        },
        {
          "version": "NKJV",
          "text": "Then she spoke to him with words like these, saying, “The Hebrew servant whom you brought to us came in to me to mock me;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 23:1",
          "text": "“You shall not spread a false report. Do not join the wicked by being a malicious witness."
        },
        {
          "reference": "Proverbs 6:16-19",
          "text": "There are six things that the LORD hates, seven that are detestable to Him: / haughty eyes, a lying tongue, hands that shed innocent blood, / a heart that devises wicked schemes, feet that run swiftly to evil, ..."
        },
        {
          "reference": "Psalm 35:11",
          "text": "Hostile witnesses come forward; they make charges I know nothing about."
        },
        {
          "reference": "Deuteronomy 19:16-19",
          "text": "If a false witness testifies against someone, accusing him of a crime, / both parties to the dispute must stand in the presence of the LORD, before the priests and judges who are in office at that time. / The judges shall investigate thoroughly, and if the witness is proven to be a liar who has falsely accused his brother, ..."
        },
        {
          "reference": "Matthew 5:11",
          "text": "Blessed are you when people insult you, persecute you, and falsely say all kinds of evil against you because of Me."
        },
        {
          "reference": "1 Peter 3:16",
          "text": "keeping a clear conscience, so that those who slander you may be put to shame by your good behavior in Christ."
        },
        {
          "reference": "Acts 24:13",
          "text": "Nor can they prove to you any of their charges against me."
        },
        {
          "reference": "1 Timothy 5:19",
          "text": "Do not entertain an accusation against an elder, except on the testimony of two or three witnesses."
        },
        {
          "reference": "Matthew 26:59-60",
          "text": "Now the chief priests and the whole Sanhedrin were seeking false testimony against Jesus in order to put Him to death. / But they did not find any, though many false witnesses came forward. Finally two came forward"
        },
        {
          "reference": "Mark 14:56-57",
          "text": "For many bore false witness against Jesus, but their testimony was inconsistent. / Then some men stood up and testified falsely against Him:"
        },
        {
          "reference": "Luke 23:2",
          "text": "And they began to accuse Him, saying, “We found this man subverting our nation, forbidding payment of taxes to Caesar, and proclaiming Himself to be Christ, a King.”"
        },
        {
          "reference": "John 18:29-30",
          "text": "So Pilate went out to them and asked, “What accusation are you bringing against this man?” / “If He were not a criminal,” they replied, “we would not have handed Him over to you.”"
        },
        {
          "reference": "Acts 6:13",
          "text": "where they presented false witnesses who said, “This man never stops speaking against this holy place and against the law."
        },
        {
          "reference": "2 Corinthians 6:8",
          "text": "through glory and dishonor, slander and praise; viewed as imposters, yet genuine;"
        },
        {
          "reference": "Psalm 109:2-3",
          "text": "For wicked and deceitful mouths open against me; they speak against me with lying tongues. / They surround me with hateful words and attack me without cause."
        }
      ]
    },
    {
      "reference": "Genesis 39:18",
      "book": "Genesis",
      "chapter": 39,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "But as soon as I screamed for help, he left his cloak beside me and ran out of the house.”"
        },
        {
          "version": "NLT",
          "text": "“But when I screamed, he ran outside, leaving his cloak with me!”"
        },
        {
          "version": "ESV",
          "text": "But as soon as I lifted up my voice and cried, he left his garment beside me and fled out of the house.”"
        },
        {
          "version": "NKJV",
          "text": "so it happened, as I lifted my voice and cried out, that he left his garment with me and fled outside.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 23:1",
          "text": "“You shall not spread a false report. Do not join the wicked by being a malicious witness."
        },
        {
          "reference": "Proverbs 6:34-35",
          "text": "For jealousy enrages a husband, and he will show no mercy in the day of vengeance. / He will not be appeased by any ransom, or persuaded by lavish gifts."
        },
        {
          "reference": "Proverbs 19:5",
          "text": "A false witness will not go unpunished, and one who utters lies will not escape."
        },
        {
          "reference": "Proverbs 19:9",
          "text": "A false witness will not go unpunished, and one who pours out lies will perish."
        },
        {
          "reference": "Deuteronomy 19:16-19",
          "text": "If a false witness testifies against someone, accusing him of a crime, / both parties to the dispute must stand in the presence of the LORD, before the priests and judges who are in office at that time. / The judges shall investigate thoroughly, and if the witness is proven to be a liar who has falsely accused his brother, ..."
        },
        {
          "reference": "Psalm 35:11",
          "text": "Hostile witnesses come forward; they make charges I know nothing about."
        },
        {
          "reference": "Psalm 109:2-3",
          "text": "For wicked and deceitful mouths open against me; they speak against me with lying tongues. / They surround me with hateful words and attack me without cause."
        },
        {
          "reference": "Matthew 5:11",
          "text": "Blessed are you when people insult you, persecute you, and falsely say all kinds of evil against you because of Me."
        },
        {
          "reference": "Matthew 26:59-61",
          "text": "Now the chief priests and the whole Sanhedrin were seeking false testimony against Jesus in order to put Him to death. / But they did not find any, though many false witnesses came forward. Finally two came forward / and declared, “This man said, ‘I am able to destroy the temple of God and rebuild it in three days.’”"
        },
        {
          "reference": "Mark 14:56-57",
          "text": "For many bore false witness against Jesus, but their testimony was inconsistent. / Then some men stood up and testified falsely against Him:"
        },
        {
          "reference": "Luke 23:2",
          "text": "And they began to accuse Him, saying, “We found this man subverting our nation, forbidding payment of taxes to Caesar, and proclaiming Himself to be Christ, a King.”"
        },
        {
          "reference": "Acts 6:13",
          "text": "where they presented false witnesses who said, “This man never stops speaking against this holy place and against the law."
        },
        {
          "reference": "Acts 24:5-9",
          "text": "We have found this man to be a pestilence, stirring up dissension among the Jews all over the world. He is a ringleader of the sect of the Nazarenes, / and he even tried to desecrate the temple; so we seized him. / but Lysias the commander came with great force and took him out of our hands, ..."
        },
        {
          "reference": "1 Peter 3:16",
          "text": "keeping a clear conscience, so that those who slander you may be put to shame by your good behavior in Christ."
        },
        {
          "reference": "1 Peter 4:14",
          "text": "If you are insulted for the name of Christ, you are blessed, because the Spirit of glory and of God rests on you."
        }
      ]
    },
    {
      "reference": "Genesis 39:19",
      "book": "Genesis",
      "chapter": 39,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "When his master heard the story his wife told him, saying, “This is how your slave treated me,” he burned with anger."
        },
        {
          "version": "NLT",
          "text": "Potiphar was furious when he heard his wife’s story about how Joseph had treated her."
        },
        {
          "version": "ESV",
          "text": "As soon as his master heard the words that his wife spoke to him, “This is the way your servant treated me,” his anger was kindled."
        },
        {
          "version": "NKJV",
          "text": "So it was, when his master heard the words which his wife spoke to him, saying, “Your servant did to me after this manner,” that his anger was aroused."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 41:14",
          "text": "So Pharaoh sent for Joseph, who was quickly brought out of the dungeon. After he had shaved and changed his clothes, he went in before Pharaoh."
        },
        {
          "reference": "Exodus 1:12-14",
          "text": "But the more they were oppressed, the more they multiplied and flourished; so the Egyptians came to dread the Israelites. / They worked the Israelites ruthlessly / and made their lives bitter with hard labor in brick and mortar, and with all kinds of work in the fields. Every service they imposed was harsh."
        },
        {
          "reference": "Exodus 2:11-15",
          "text": "One day, after Moses had grown up, he went out to his own people and observed their hard labor. He saw an Egyptian beating a Hebrew, one of his own people. / After looking this way and that and seeing no one, he struck down the Egyptian and hid his body in the sand. / The next day Moses went out and saw two Hebrews fighting. He asked the one in the wrong, “Why are you attacking your companion?” ..."
        },
        {
          "reference": "1 Samuel 18:8-9",
          "text": "And Saul was furious and resented this song. “They have ascribed tens of thousands to David,” he said, “but only thousands to me. What more can he have but the kingdom?” / And from that day forward Saul kept a jealous eye on David."
        },
        {
          "reference": "1 Samuel 19:9-10",
          "text": "But as Saul was sitting in his house with his spear in his hand, a spirit of distress from the LORD came upon him. While David was playing the harp, / Saul tried to pin him to the wall with his spear. But David eluded him and the spear struck the wall. And David fled and escaped that night."
        },
        {
          "reference": "1 Samuel 22:9-18",
          "text": "But Doeg the Edomite, who had stationed himself with Saul’s servants, answered: “I saw the son of Jesse come to Ahimelech son of Ahitub at Nob. / Ahimelech inquired of the LORD for him and gave him provisions. He also gave him the sword of Goliath the Philistine.” / Then the king sent messengers to summon Ahimelech the priest, the son of Ahitub, and his father’s whole family, who were priests at Nob. And all of them came to the king. ..."
        },
        {
          "reference": "2 Samuel 11:14-15",
          "text": "The next morning David wrote a letter to Joab and sent it with Uriah. / In the letter he wrote: “Put Uriah at the front of the fiercest battle; then withdraw from him, so that he may be struck down and killed.”"
        },
        {
          "reference": "Esther 3:5-6",
          "text": "When Haman saw that Mordecai would not bow down or pay him homage, he was filled with rage. / And when he learned the identity of Mordecai’s people, he scorned the notion of laying hands on Mordecai alone. Instead, he sought to destroy all of Mordecai’s people, the Jews, throughout the kingdom of Xerxes."
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Proverbs 6:34-35",
          "text": "For jealousy enrages a husband, and he will show no mercy in the day of vengeance. / He will not be appeased by any ransom, or persuaded by lavish gifts."
        },
        {
          "reference": "Daniel 6:4-5",
          "text": "Thus the administrators and satraps sought a charge against Daniel concerning the kingdom, but they could find no charge or corruption, because he was trustworthy, and no negligence or corruption was found in him. / Finally these men said, “We will never find any charge against this Daniel unless we find something against him concerning the law of his God.”"
        },
        {
          "reference": "Matthew 27:18",
          "text": "For he knew it was out of envy that they had handed Jesus over to him."
        },
        {
          "reference": "Mark 15:10",
          "text": "For he knew it was out of envy that the chief priests had handed Jesus over."
        },
        {
          "reference": "Luke 23:20-25",
          "text": "Wanting to release Jesus, Pilate addressed them again, / but they kept shouting, “Crucify Him! Crucify Him!” / A third time he said to them, “What evil has this man done? I have found in Him no offense worthy of death. So after I punish Him, I will release Him.” ..."
        }
      ]
    },
    {
      "reference": "Genesis 39:20",
      "book": "Genesis",
      "chapter": 39,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph’s master took him and put him in prison, the place where the king’s prisoners were confined. But while Joseph was there in the prison,"
        },
        {
          "version": "NLT",
          "text": "So he took Joseph and threw him into the prison where the king’s prisoners were held, and there he remained."
        },
        {
          "version": "ESV",
          "text": "And Joseph’s master took him and put him into the prison, the place where the king’s prisoners were confined, and he was there in prison."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph’s master took him and put him into the prison, a place where the king’s prisoners were confined. And he was there in the prison."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "1 Peter 2:19-20",
          "text": "For if anyone endures the pain of unjust suffering because he is conscious of God, this is to be commended. / How is it to your credit if you are beaten for doing wrong and you endure it? But if you suffer for doing good and you endure it, this is commendable before God."
        },
        {
          "reference": "1 Samuel 18:11-12",
          "text": "and he hurled it, thinking, “I will pin David to the wall.” But David eluded him twice. / So Saul was afraid of David, because the LORD was with David but had departed from Saul."
        },
        {
          "reference": "2 Timothy 3:11",
          "text": "my persecutions, and the sufferings that came upon me in Antioch, Iconium, and Lystra. What persecutions I endured! Yet the Lord rescued me from all of them."
        },
        {
          "reference": "Hebrews 11:36-39",
          "text": "Still others endured mocking and flogging, and even chains and imprisonment. / They were stoned, they were sawed in two, they were put to death by the sword. They went around in sheepskins and goatskins, destitute, oppressed, and mistreated. / The world was not worthy of them. They wandered in deserts and mountains, and hid in caves and holes in the ground. ..."
        },
        {
          "reference": "Matthew 5:10-12",
          "text": "Blessed are those who are persecuted because of righteousness, for theirs is the kingdom of heaven. / Blessed are you when people insult you, persecute you, and falsely say all kinds of evil against you because of Me. / Rejoice and be glad, because great is your reward in heaven, for in the same way they persecuted the prophets before you."
        },
        {
          "reference": "1 Peter 4:12-16",
          "text": "Beloved, do not be surprised at the fiery trial that has come upon you, as though something strange were happening to you. / But rejoice that you share in the sufferings of Christ, so that you may be overjoyed at the revelation of His glory. / If you are insulted for the name of Christ, you are blessed, because the Spirit of glory and of God rests on you. ..."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Philippians 1:12-14",
          "text": "Now I want you to know, brothers, that my circumstances have actually served to advance the gospel. / As a result, it has become clear throughout the whole palace guard and to everyone else that I am in chains for Christ. / And most of the brothers, confident in the Lord by my chains, now dare more greatly to speak the word without fear."
        },
        {
          "reference": "2 Corinthians 11:23-27",
          "text": "Are they servants of Christ? (I am speaking as if I were out of my mind.) I am so much more: in harder labor, in more imprisonments, in worse beatings, in frequent danger of death. / Five times I received from the Jews the forty lashes minus one. / Three times I was beaten with rods, once I was stoned, three times I was shipwrecked. I spent a night and a day in the open sea. ..."
        },
        {
          "reference": "Daniel 6:16-23",
          "text": "So the king gave the order, and they brought Daniel and threw him into the den of lions. The king said to Daniel, “May your God, whom you serve continually, deliver you!” / A stone was brought and placed over the mouth of the den, and the king sealed it with his own signet ring and with the rings of his nobles, so that nothing concerning Daniel could be changed. / Then the king went to his palace and spent the night fasting. No entertainment was brought before him, and sleep fled from him. ..."
        },
        {
          "reference": "Jeremiah 38:6-13",
          "text": "So they took Jeremiah and dropped him into the cistern of Malchiah, the king’s son, which was in the courtyard of the guard. They lowered Jeremiah with ropes into the cistern, which had no water but only mud, and Jeremiah sank down into the mud. / Now Ebed-melech the Cushite, a court official in the royal palace, heard that Jeremiah had been put into the cistern. While the king was sitting at the Gate of Benjamin, / Ebed-melech went out from the king’s palace and said to the king, ..."
        },
        {
          "reference": "Acts 16:23-26",
          "text": "And after striking them with many blows, they threw them into prison and ordered the jailer to guard them securely. / On receiving this order, he placed them in the inner cell and fastened their feet in the stocks. / About midnight Paul and Silas were praying and singing hymns to God, and the other prisoners were listening to them. ..."
        },
        {
          "reference": "2 Kings 25:27-30",
          "text": "On the twenty-seventh day of the twelfth month of the thirty-seventh year of the exile of Judah’s King Jehoiachin, in the year Evil-merodach became king of Babylon, he released King Jehoiachin of Judah from prison. / And he spoke kindly to Jehoiachin and set his throne above the thrones of the other kings who were with him in Babylon. / So Jehoiachin changed out of his prison clothes, and he dined regularly at the king’s table for the rest of his life. ..."
        }
      ]
    },
    {
      "reference": "Genesis 39:21",
      "book": "Genesis",
      "chapter": 39,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "the LORD was with him; he showed him kindness and granted him favor in the eyes of the prison warden."
        },
        {
          "version": "NLT",
          "text": "But the LORD was with Joseph in the prison and showed him his faithful love. And the LORD made Joseph a favorite with the prison warden."
        },
        {
          "version": "ESV",
          "text": "But the LORD was with Joseph and showed him steadfast love and gave him favor in the sight of the keeper of the prison."
        },
        {
          "version": "NKJV",
          "text": "But the LORD was with Joseph and showed him mercy, and He gave him favor in the sight of the keeper of the prison."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Psalm 105:19-22",
          "text": "until his prediction came true and the word of the LORD proved him right. / The king sent and released him; the ruler of peoples set him free. / He made him master of his household, ruler over all his substance, ..."
        },
        {
          "reference": "1 Samuel 16:18",
          "text": "One of the servants answered, “I have seen a son of Jesse of Bethlehem who knows how to play the harp. He is a mighty man of valor, a warrior, eloquent and handsome, and the LORD is with him.”"
        },
        {
          "reference": "Daniel 1:9",
          "text": "Now God had granted Daniel favor and compassion from the chief official,"
        },
        {
          "reference": "Exodus 3:21",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed."
        },
        {
          "reference": "Nehemiah 1:11",
          "text": "O Lord, may Your ear be attentive to my prayer and to the prayers of Your servants who delight to revere Your name. Give Your servant success this day, I pray, and grant him mercy in the sight of this man.” (At that time I was the cupbearer to the king.)"
        },
        {
          "reference": "Proverbs 16:7",
          "text": "When a man’s ways please the LORD, He makes even the man’s enemies live at peace with him."
        },
        {
          "reference": "1 Kings 8:50",
          "text": "May You forgive Your people who have sinned against You and all the transgressions they have committed against You, and may You grant them compassion in the eyes of their captors to show them mercy."
        },
        {
          "reference": "Psalm 106:46",
          "text": "He made them objects of compassion to all who held them captive."
        },
        {
          "reference": "Isaiah 43:2",
          "text": "When you pass through the waters, I will be with you; and when you go through the rivers, they will not overwhelm you. When you walk through the fire, you will not be scorched; the flames will not set you ablaze."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "2 Corinthians 12:9",
          "text": "But He said to me, “My grace is sufficient for you, for My power is perfected in weakness.” Therefore I will boast all the more gladly in my weaknesses, so that the power of Christ may rest on me."
        },
        {
          "reference": "Hebrews 13:5-6",
          "text": "Keep your lives free from the love of money and be content with what you have, for God has said: “Never will I leave you, never will I forsake you.” / So we say with confidence: “The Lord is my helper; I will not be afraid. What can man do to me?”"
        },
        {
          "reference": "1 Peter 2:19-20",
          "text": "For if anyone endures the pain of unjust suffering because he is conscious of God, this is to be commended. / How is it to your credit if you are beaten for doing wrong and you endure it? But if you suffer for doing good and you endure it, this is commendable before God."
        },
        {
          "reference": "James 1:12",
          "text": "Blessed is the man who perseveres under trial, because when he has stood the test, he will receive the crown of life that God has promised to those who love Him."
        }
      ]
    },
    {
      "reference": "Genesis 39:22",
      "book": "Genesis",
      "chapter": 39,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "So the warden put Joseph in charge of all those held in the prison, and he was made responsible for all that was done there."
        },
        {
          "version": "NLT",
          "text": "Before long, the warden put Joseph in charge of all the other prisoners and over everything that happened in the prison."
        },
        {
          "version": "ESV",
          "text": "And the keeper of the prison put Joseph in charge of all the prisoners who were in the prison. Whatever was done there, he was the one who did it."
        },
        {
          "version": "NKJV",
          "text": "And the keeper of the prison committed to Joseph’s hand all the prisoners who were in the prison; whatever they did there, it was his doing."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:40-41",
          "text": "You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Daniel 6:3",
          "text": "Soon, by his extraordinary spirit, Daniel distinguished himself among the administrators and satraps. So the king planned to set him over the whole kingdom."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "1 Samuel 18:14-15",
          "text": "and he continued to prosper in all his ways, because the LORD was with him. / When Saul saw that David was very successful, he was afraid of him."
        },
        {
          "reference": "Proverbs 16:7",
          "text": "When a man’s ways please the LORD, He makes even the man’s enemies live at peace with him."
        },
        {
          "reference": "Psalm 105:19-22",
          "text": "until his prediction came true and the word of the LORD proved him right. / The king sent and released him; the ruler of peoples set him free. / He made him master of his household, ruler over all his substance, ..."
        },
        {
          "reference": "1 Peter 2:19-20",
          "text": "For if anyone endures the pain of unjust suffering because he is conscious of God, this is to be commended. / How is it to your credit if you are beaten for doing wrong and you endure it? But if you suffer for doing good and you endure it, this is commendable before God."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "1 Corinthians 10:13",
          "text": "No temptation has seized you except what is common to man. And God is faithful; He will not let you be tempted beyond what you can bear. But when you are tempted, He will also provide an escape, so that you can stand up under it."
        },
        {
          "reference": "2 Timothy 2:9-10",
          "text": "for which I suffer to the extent of being chained like a criminal. But the word of God cannot be chained! / For this reason I endure all things for the sake of the elect, so that they too may obtain the salvation that is in Christ Jesus, with eternal glory."
        },
        {
          "reference": "Nehemiah 2:8",
          "text": "And may I have a letter to Asaph, keeper of the king’s forest, so that he will give me timber to make beams for the gates of the citadel to the temple, for the city wall, and for the house I will occupy.” And because the gracious hand of my God was upon me, the king granted my requests."
        },
        {
          "reference": "Daniel 1:9",
          "text": "Now God had granted Daniel favor and compassion from the chief official,"
        },
        {
          "reference": "Exodus 3:21",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed."
        },
        {
          "reference": "1 Kings 8:50",
          "text": "May You forgive Your people who have sinned against You and all the transgressions they have committed against You, and may You grant them compassion in the eyes of their captors to show them mercy."
        },
        {
          "reference": "Matthew 5:10-12",
          "text": "Blessed are those who are persecuted because of righteousness, for theirs is the kingdom of heaven. / Blessed are you when people insult you, persecute you, and falsely say all kinds of evil against you because of Me. / Rejoice and be glad, because great is your reward in heaven, for in the same way they persecuted the prophets before you."
        }
      ]
    },
    {
      "reference": "Genesis 39:23",
      "book": "Genesis",
      "chapter": 39,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "The warden paid no attention to anything under Joseph’s care, because the LORD was with Joseph and gave him success in whatever he did."
        },
        {
          "version": "NLT",
          "text": "The warden had no more worries, because Joseph took care of everything. The LORD was with him and caused everything he did to succeed."
        },
        {
          "version": "ESV",
          "text": "The keeper of the prison paid no attention to anything that was in Joseph’s charge, because the LORD was with him. And whatever he did, the LORD made it succeed."
        },
        {
          "version": "NKJV",
          "text": "The keeper of the prison did not look into anything that was under Joseph’s authority, because the LORD was with him; and whatever he did, the LORD made it prosper."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 39:2",
          "text": "And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master."
        },
        {
          "reference": "Genesis 39:21",
          "text": "the LORD was with him and extended kindness to him, granting him favor in the eyes of the prison warden."
        },
        {
          "reference": "Genesis 41:38-40",
          "text": "So Pharaoh asked them, “Can we find anyone like this man, in whom the Spirit of God abides?” / Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.”"
        },
        {
          "reference": "1 Samuel 18:14",
          "text": "and he continued to prosper in all his ways, because the LORD was with him."
        },
        {
          "reference": "1 Samuel 18:28",
          "text": "When Saul realized that the LORD was with David and that his daughter Michal loved David,"
        },
        {
          "reference": "Daniel 6:3",
          "text": "Soon, by his extraordinary spirit, Daniel distinguished himself among the administrators and satraps. So the king planned to set him over the whole kingdom."
        },
        {
          "reference": "Daniel 6:22",
          "text": "My God sent His angel and shut the mouths of the lions. They have not hurt me, for I was found innocent in His sight, and I have done no wrong against you, O king.”"
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Psalm 105:19-22",
          "text": "until his prediction came true and the word of the LORD proved him right. / The king sent and released him; the ruler of peoples set him free. / He made him master of his household, ruler over all his substance, ..."
        },
        {
          "reference": "Proverbs 16:7",
          "text": "When a man’s ways please the LORD, He makes even the man’s enemies live at peace with him."
        },
        {
          "reference": "Proverbs 21:1",
          "text": "The king’s heart is a waterway in the hand of the LORD; He directs it where He pleases."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Isaiah 43:2",
          "text": "When you pass through the waters, I will be with you; and when you go through the rivers, they will not overwhelm you. When you walk through the fire, you will not be scorched; the flames will not set you ablaze."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Romans 8:31",
          "text": "What then shall we say in response to these things? If God is for us, who can be against us?"
        }
      ]
    }
  ]
}