{
  "book": "genesis",
  "chapter": 40,
  "verses": [
    {
      "reference": "Genesis 40:1",
      "book": "Genesis",
      "chapter": 40,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Some time later, the cupbearer and the baker of the king of Egypt offended their master, the king of Egypt."
        },
        {
          "version": "NLT",
          "text": "Some time later, Pharaoh’s chief cup-bearer and chief baker offended their royal master."
        },
        {
          "version": "ESV",
          "text": "Some time after this, the cupbearer of the king of Egypt and his baker committed an offense against their lord the king of Egypt."
        },
        {
          "version": "NKJV",
          "text": "It came to pass after these things that the butler and the baker of the king of Egypt offended their lord, the king of Egypt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 39:20",
          "text": "So Joseph’s master took him and had him thrown into the prison where the king’s prisoners were confined. While Joseph was there in the prison,"
        },
        {
          "reference": "Genesis 41:9-13",
          "text": "Then the chief cupbearer said to Pharaoh, “Today I recall my failures. / Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard. / One night both the chief baker and I had dreams, and each dream had its own meaning. ..."
        },
        {
          "reference": "Nehemiah 1:11",
          "text": "O Lord, may Your ear be attentive to my prayer and to the prayers of Your servants who delight to revere Your name. Give Your servant success this day, I pray, and grant him mercy in the sight of this man.” (At that time I was the cupbearer to the king.)"
        },
        {
          "reference": "Esther 2:21-23",
          "text": "In those days, while Mordecai was sitting at the king’s gate, Bigthan and Teresh, two of the king’s eunuchs who guarded the entrance, grew angry and conspired to assassinate King Xerxes. / When Mordecai learned of the plot, he reported it to Queen Esther, and she informed the king on Mordecai’s behalf. / After the report had been investigated and verified, both officials were hanged on the gallows. And all this was recorded in the Book of the Chronicles in the presence of the king."
        },
        {
          "reference": "Daniel 1:9",
          "text": "Now God had granted Daniel favor and compassion from the chief official,"
        },
        {
          "reference": "Daniel 2:48-49",
          "text": "Then the king promoted Daniel and gave him many generous gifts. He made him ruler over the entire province of Babylon and chief administrator over all the wise men of Babylon. / And at Daniel’s request, the king appointed Shadrach, Meshach, and Abednego to manage the province of Babylon, while Daniel remained in the king’s court."
        },
        {
          "reference": "Daniel 5:11-14",
          "text": "There is a man in your kingdom who has the spirit of the holy gods in him. In the days of your father he was found to have insight, intelligence, and wisdom like that of the gods. Your father, King Nebuchadnezzar, appointed him chief of the magicians, enchanters, astrologers, and diviners. Your own father, the king, / did this because Daniel, the one he named Belteshazzar, was found to have an extraordinary spirit, as well as knowledge, understanding, and the ability to interpret dreams, explain riddles, and solve difficult problems. Summon Daniel, therefore, and he will give you the interpretation.” / So Daniel was brought before the king, who asked him, “Are you Daniel, one of the exiles my father the king brought from Judah? ..."
        },
        {
          "reference": "Matthew 14:3-4",
          "text": "Now Herod had arrested John and bound him and put him in prison on account of Herodias, his brother Philip’s wife, / because John had been telling him, “It is not lawful for you to have her.”"
        },
        {
          "reference": "Matthew 27:15-18",
          "text": "Now it was the governor’s custom at the feast to release to the crowd a prisoner of their choosing. / At that time they were holding a notorious prisoner named Barabbas. / So when the crowd had assembled, Pilate asked them, “Which one do you want me to release to you: Barabbas, or Jesus who is called Christ?” ..."
        },
        {
          "reference": "Mark 6:17-20",
          "text": "For Herod himself had ordered that John be arrested and bound and imprisoned, on account of his brother Philip’s wife Herodias, whom Herod had married. / For John had been telling Herod, “It is not lawful for you to have your brother’s wife!” / So Herodias held a grudge against John and wanted to kill him. But she had been unable, ..."
        },
        {
          "reference": "Luke 3:19-20",
          "text": "But when he rebuked Herod the tetrarch regarding his brother’s wife Herodias and all the evils he had done, / Herod added this to them all: He locked John up in prison."
        },
        {
          "reference": "Luke 23:19",
          "text": "(Barabbas had been imprisoned for an insurrection in the city, and for murder.)"
        },
        {
          "reference": "Acts 5:17-18",
          "text": "Then the high priest and all his associates, who belonged to the party of the Sadducees, were filled with jealousy. They went out / and arrested the apostles and put them in the public jail."
        },
        {
          "reference": "Acts 12:1-4",
          "text": "About that time, King Herod reached out to harm some who belonged to the church. / He had James, the brother of John, put to death with the sword. / And seeing that this pleased the Jews, Herod proceeded to seize Peter during the Feast of Unleavened Bread. ..."
        },
        {
          "reference": "Acts 16:23-24",
          "text": "And after striking them with many blows, they threw them into prison and ordered the jailer to guard them securely. / On receiving this order, he placed them in the inner cell and fastened their feet in the stocks."
        }
      ]
    },
    {
      "reference": "Genesis 40:2",
      "book": "Genesis",
      "chapter": 40,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "Pharaoh was angry with his two officials, the chief cupbearer and the chief baker,"
        },
        {
          "version": "NLT",
          "text": "Pharaoh became angry with these two officials,"
        },
        {
          "version": "ESV",
          "text": "And Pharaoh was angry with his two officers, the chief cupbearer and the chief baker,"
        },
        {
          "version": "NKJV",
          "text": "And Pharaoh was angry with his two officers, the chief butler and the chief baker."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 39:20",
          "text": "So Joseph’s master took him and had him thrown into the prison where the king’s prisoners were confined. While Joseph was there in the prison,"
        },
        {
          "reference": "Genesis 41:10",
          "text": "Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard."
        },
        {
          "reference": "Nehemiah 1:11",
          "text": "O Lord, may Your ear be attentive to my prayer and to the prayers of Your servants who delight to revere Your name. Give Your servant success this day, I pray, and grant him mercy in the sight of this man.” (At that time I was the cupbearer to the king.)"
        },
        {
          "reference": "Esther 1:10-12",
          "text": "On the seventh day, when the king’s heart was merry with wine, he ordered the seven eunuchs who served him—Mehuman, Biztha, Harbona, Bigtha, Abagtha, Zethar, and Carkas— / to bring Queen Vashti before him, wearing her royal crown, to display her beauty to the people and officials. For she was beautiful to behold. / Queen Vashti, however, refused to come at the king’s command brought by his eunuchs. And the king became furious, and his anger burned within him."
        },
        {
          "reference": "Daniel 1:3-5",
          "text": "Then the king ordered Ashpenaz, the chief of his court officials, to bring in some Israelites from the royal family and the nobility— / young men without blemish, handsome, gifted in all wisdom, knowledgeable, quick to understand, and qualified to serve in the king’s palace—and to teach them the language and literature of the Chaldeans. / The king assigned them daily provisions of the royal food and wine. They were to be trained for three years, after which they were to enter the king’s service."
        },
        {
          "reference": "Daniel 2:12-14",
          "text": "This response made the king so angry and furious that he gave orders to destroy all the wise men of Babylon. / So the decree went out that the wise men were to be executed, and men went to look for Daniel and his friends to execute them. / When Arioch, the commander of the king’s guard, went out to execute the wise men of Babylon, Daniel responded with discretion and tact."
        },
        {
          "reference": "Matthew 14:3-4",
          "text": "Now Herod had arrested John and bound him and put him in prison on account of Herodias, his brother Philip’s wife, / because John had been telling him, “It is not lawful for you to have her.”"
        },
        {
          "reference": "Matthew 18:23-25",
          "text": "Because of this, the kingdom of heaven is like a king who wanted to settle accounts with his servants. / As he began the settlements, a debtor owing ten thousand talents was brought to him. / Since the man was unable to pay, the master ordered that he be sold to pay his debt, along with his wife and children and everything he owned."
        },
        {
          "reference": "Mark 6:17-18",
          "text": "For Herod himself had ordered that John be arrested and bound and imprisoned, on account of his brother Philip’s wife Herodias, whom Herod had married. / For John had been telling Herod, “It is not lawful for you to have your brother’s wife!”"
        },
        {
          "reference": "Luke 3:19-20",
          "text": "But when he rebuked Herod the tetrarch regarding his brother’s wife Herodias and all the evils he had done, / Herod added this to them all: He locked John up in prison."
        },
        {
          "reference": "Luke 23:19",
          "text": "(Barabbas had been imprisoned for an insurrection in the city, and for murder.)"
        },
        {
          "reference": "Acts 5:17-18",
          "text": "Then the high priest and all his associates, who belonged to the party of the Sadducees, were filled with jealousy. They went out / and arrested the apostles and put them in the public jail."
        },
        {
          "reference": "Acts 12:1-4",
          "text": "About that time, King Herod reached out to harm some who belonged to the church. / He had James, the brother of John, put to death with the sword. / And seeing that this pleased the Jews, Herod proceeded to seize Peter during the Feast of Unleavened Bread. ..."
        },
        {
          "reference": "Acts 16:23-24",
          "text": "And after striking them with many blows, they threw them into prison and ordered the jailer to guard them securely. / On receiving this order, he placed them in the inner cell and fastened their feet in the stocks."
        },
        {
          "reference": "Acts 23:35",
          "text": "he said, “I will hear your case when your accusers arrive.” Then he ordered that Paul be kept under guard in Herod’s Praetorium."
        }
      ]
    },
    {
      "reference": "Genesis 40:3",
      "book": "Genesis",
      "chapter": 40,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "and put them in custody in the house of the captain of the guard, in the same prison where Joseph was confined."
        },
        {
          "version": "NLT",
          "text": "and he put them in the prison where Joseph was, in the palace of the captain of the guard."
        },
        {
          "version": "ESV",
          "text": "and he put them in custody in the house of the captain of the guard, in the prison where Joseph was confined."
        },
        {
          "version": "NKJV",
          "text": "So he put them in custody in the house of the captain of the guard, in the prison, the place where Joseph was confined."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 39:20",
          "text": "So Joseph’s master took him and had him thrown into the prison where the king’s prisoners were confined. While Joseph was there in the prison,"
        },
        {
          "reference": "Genesis 41:10-14",
          "text": "Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard. / One night both the chief baker and I had dreams, and each dream had its own meaning. / Now a young Hebrew was there with us, a servant of the captain of the guard. We told him our dreams and he interpreted them for us individually. ..."
        },
        {
          "reference": "Psalm 105:18-19",
          "text": "They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Nehemiah 1:11",
          "text": "O Lord, may Your ear be attentive to my prayer and to the prayers of Your servants who delight to revere Your name. Give Your servant success this day, I pray, and grant him mercy in the sight of this man.” (At that time I was the cupbearer to the king.)"
        },
        {
          "reference": "Daniel 1:9",
          "text": "Now God had granted Daniel favor and compassion from the chief official,"
        },
        {
          "reference": "1 Kings 22:27",
          "text": "and tell them that this is what the king says: ‘Put this man in prison and feed him only bread and water until I return safely.’”"
        },
        {
          "reference": "Jeremiah 37:15-16",
          "text": "The officials were angry with Jeremiah, and they beat him and placed him in jail in the house of Jonathan the scribe, for it had been made into a prison. / So Jeremiah went into a cell in the dungeon and remained there a long time."
        },
        {
          "reference": "Matthew 5:25-26",
          "text": "Reconcile quickly with your adversary, while you are still on the way to court. Otherwise, he may hand you over to the judge, and the judge may hand you over to the officer, and you may be thrown into prison. / Truly I tell you, you will not get out until you have paid the last penny."
        },
        {
          "reference": "Acts 12:4-5",
          "text": "He arrested him and put him in prison, handing him over to be guarded by four squads of four soldiers each. Herod intended to bring him out to the people after the Passover. / So Peter was kept in prison, but the church was fervently praying to God for him."
        },
        {
          "reference": "2 Kings 25:27-30",
          "text": "On the twenty-seventh day of the twelfth month of the thirty-seventh year of the exile of Judah’s King Jehoiachin, in the year Evil-merodach became king of Babylon, he released King Jehoiachin of Judah from prison. / And he spoke kindly to Jehoiachin and set his throne above the thrones of the other kings who were with him in Babylon. / So Jehoiachin changed out of his prison clothes, and he dined regularly at the king’s table for the rest of his life. ..."
        },
        {
          "reference": "Jeremiah 52:31-34",
          "text": "On the twenty-fifth day of the twelfth month of the thirty-seventh year of the exile of Jehoiachin king of Judah, in the first year of the reign of Evil-merodach king of Babylon, he pardoned Jehoiachin king of Judah and released him from prison. / And he spoke kindly to Jehoiachin and set his throne above the thrones of the other kings who were with him in Babylon. / So Jehoiachin changed out of his prison clothes, and he dined regularly at the king’s table for the rest of his life. ..."
        },
        {
          "reference": "Luke 23:19",
          "text": "(Barabbas had been imprisoned for an insurrection in the city, and for murder.)"
        },
        {
          "reference": "Acts 16:23-24",
          "text": "And after striking them with many blows, they threw them into prison and ordered the jailer to guard them securely. / On receiving this order, he placed them in the inner cell and fastened their feet in the stocks."
        },
        {
          "reference": "2 Timothy 1:16-17",
          "text": "May the Lord grant mercy to the household of Onesiphorus, because he has often refreshed me and was unashamed of my chains. / Indeed, when he arrived in Rome, he searched diligently until he found me."
        }
      ]
    },
    {
      "reference": "Genesis 40:4",
      "book": "Genesis",
      "chapter": 40,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "The captain of the guard assigned them to Joseph, and he attended them. After they had been in custody for some time,"
        },
        {
          "version": "NLT",
          "text": "They remained in prison for quite some time, and the captain of the guard assigned them to Joseph, who looked after them."
        },
        {
          "version": "ESV",
          "text": "The captain of the guard appointed Joseph to be with them, and he attended them. They continued for some time in custody."
        },
        {
          "version": "NKJV",
          "text": "And the captain of the guard charged Joseph with them, and he served them; so they were in custody for a while."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 39:21-23",
          "text": "the LORD was with him and extended kindness to him, granting him favor in the eyes of the prison warden. / And the warden put all the prisoners under Joseph’s care, so that he was responsible for all that was done in the prison. / The warden did not concern himself with anything under Joseph’s care, because the LORD was with Joseph and gave him success in whatever he did."
        },
        {
          "reference": "Genesis 41:10-13",
          "text": "Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard. / One night both the chief baker and I had dreams, and each dream had its own meaning. / Now a young Hebrew was there with us, a servant of the captain of the guard. We told him our dreams and he interpreted them for us individually. ..."
        },
        {
          "reference": "1 Samuel 16:22",
          "text": "Then Saul sent word to Jesse, saying, “Let David remain in my service, for I am pleased with him.”"
        },
        {
          "reference": "1 Kings 17:9-16",
          "text": "“Get up and go to Zarephath of Sidon, and stay there. Behold, I have commanded a widow there to provide for you.” / So Elijah got up and went to Zarephath. When he arrived at the city gate, there was a widow gathering sticks. Elijah called to her and said, “Please bring me a little water in a cup, so that I may drink.” / And as she was going to get it, he called to her and said, “Please bring me a piece of bread.” ..."
        },
        {
          "reference": "Nehemiah 2:1-8",
          "text": "Now in the month of Nisan, in the twentieth year of King Artaxerxes, when wine was set before him, I took the wine and gave it to the king. I had never been sad in his presence, / so the king said to me, “Why is your face sad, though you are not ill? This could only be sadness of the heart.” I was overwhelmed with fear / and replied to the king, “May the king live forever! Why should I not be sad when the city where my fathers are buried lies in ruins, and its gates have been destroyed by fire?” ..."
        },
        {
          "reference": "Daniel 1:9-21",
          "text": "Now God had granted Daniel favor and compassion from the chief official, / but he said to Daniel, “I fear my lord the king, who has assigned your food and drink. For why should he see your faces looking thinner than those of the other young men your age? You would endanger my head before the king!” / Then Daniel said to the steward whom the chief official had appointed over Daniel, Hananiah, Mishael, and Azariah, ..."
        },
        {
          "reference": "Daniel 2:48-49",
          "text": "Then the king promoted Daniel and gave him many generous gifts. He made him ruler over the entire province of Babylon and chief administrator over all the wise men of Babylon. / And at Daniel’s request, the king appointed Shadrach, Meshach, and Abednego to manage the province of Babylon, while Daniel remained in the king’s court."
        },
        {
          "reference": "Matthew 25:21",
          "text": "His master replied, ‘Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things. Enter into the joy of your master!’"
        },
        {
          "reference": "Matthew 27:57-60",
          "text": "When it was evening, there came a rich man from Arimathea named Joseph, who himself was a disciple of Jesus. / He went to Pilate to ask for the body of Jesus, and Pilate ordered that it be given to him. / So Joseph took the body, wrapped it in a clean linen cloth, ..."
        },
        {
          "reference": "Luke 23:50-53",
          "text": "Now there was a Council member named Joseph, a good and righteous man, / who had not consented to their decision or action. He was from the Judean town of Arimathea and was waiting for the kingdom of God. / He went to Pilate to ask for the body of Jesus. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Acts 16:25-34",
          "text": "About midnight Paul and Silas were praying and singing hymns to God, and the other prisoners were listening to them. / Suddenly a strong earthquake shook the foundations of the prison. At once all the doors flew open and everyone’s chains came loose. / When the jailer woke up and saw the prison doors open, he drew his sword and was about to kill himself, presuming that the prisoners had escaped. ..."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Philippians 1:12-14",
          "text": "Now I want you to know, brothers, that my circumstances have actually served to advance the gospel. / As a result, it has become clear throughout the whole palace guard and to everyone else that I am in chains for Christ. / And most of the brothers, confident in the Lord by my chains, now dare more greatly to speak the word without fear."
        },
        {
          "reference": "Philippians 2:7",
          "text": "but emptied Himself, taking the form of a servant, being made in human likeness."
        }
      ]
    },
    {
      "reference": "Genesis 40:5",
      "book": "Genesis",
      "chapter": 40,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "each of the two men—the cupbearer and the baker of the king of Egypt, who were being held in prison—had a dream the same night, and each dream had a meaning of its own."
        },
        {
          "version": "NLT",
          "text": "While they were in prison, Pharaoh’s cup-bearer and baker each had a dream one night, and each dream had its own meaning."
        },
        {
          "version": "ESV",
          "text": "And one night they both dreamed—the cupbearer and the baker of the king of Egypt, who were confined in the prison—each his own dream, and each dream with its own interpretation."
        },
        {
          "version": "NKJV",
          "text": "Then the butler and the baker of the king of Egypt, who were confined in the prison, had a dream, both of them, each man’s dream in one night and each man’s dream with its own interpretation."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Daniel 2:1-3",
          "text": "In the second year of his reign, Nebuchadnezzar had dreams that troubled his spirit, and sleep escaped him. / So the king gave orders to summon the magicians, enchanters, sorcerers, and astrologers to explain his dreams. When they came and stood before the king, / he said to them, “I have had a dream, and my spirit is anxious to understand it.”"
        },
        {
          "reference": "Daniel 4:5-9",
          "text": "I had a dream, and it frightened me; while I was in my bed, the images and visions in my mind alarmed me. / So I issued a decree that all the wise men of Babylon be brought before me to interpret the dream for me. / When the magicians, enchanters, astrologers, and diviners came in, I told them the dream, but they could not interpret it for me. ..."
        },
        {
          "reference": "Judges 7:13-15",
          "text": "And as Gideon arrived, a man was telling his friend about a dream. “Behold, I had a dream,” he said, “and I saw a loaf of barley bread come tumbling into the Midianite camp. It struck the tent so hard that the tent overturned and collapsed.” / His friend replied: “This is nothing less than the sword of Gideon son of Joash, the Israelite. God has delivered Midian and the whole camp into his hand.” / When Gideon heard the dream and its interpretation, he bowed in worship. He returned to the camp of Israel and said, “Get up, for the LORD has delivered the camp of Midian into your hand.”"
        },
        {
          "reference": "1 Kings 3:5",
          "text": "One night at Gibeon the LORD appeared to Solomon in a dream, and God said, “Ask, and I will give it to you!”"
        },
        {
          "reference": "Daniel 7:1-2",
          "text": "In the first year of the reign of Belshazzar over Babylon, Daniel had a dream, and visions passed through his mind as he lay on his bed. He wrote down the dream, and this is the summary of his account. / Daniel declared: “In my vision in the night I looked, and suddenly the four winds of heaven were churning up the great sea."
        },
        {
          "reference": "Daniel 2:19",
          "text": "During the night, the mystery was revealed to Daniel in a vision, and he blessed the God of heaven"
        },
        {
          "reference": "Daniel 2:45",
          "text": "And just as you saw a stone being cut out of the mountain without human hands, and it shattered the iron, bronze, clay, silver, and gold, so the great God has told the king what will happen in the future. The dream is true, and its interpretation is trustworthy.”"
        },
        {
          "reference": "Daniel 4:18",
          "text": "This is the dream that I, King Nebuchadnezzar, saw. Now, Belteshazzar, tell me the interpretation, because none of the wise men of my kingdom can interpret it for me. But you are able, because the spirit of the holy gods is in you.”"
        },
        {
          "reference": "Matthew 1:20",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit."
        },
        {
          "reference": "Matthew 2:12-13",
          "text": "And having been warned in a dream not to return to Herod, they withdrew to their country by another route. / When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.”"
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Acts 10:10-16",
          "text": "He became hungry and wanted something to eat, but while the meal was being prepared, he fell into a trance. / He saw heaven open and something like a large sheet being let down to earth by its four corners. / It contained all kinds of four-footed animals and reptiles of the earth, as well as birds of the air. ..."
        },
        {
          "reference": "Acts 16:9-10",
          "text": "During the night, Paul had a vision of a man of Macedonia standing and pleading with him, “Come over to Macedonia and help us.” / As soon as Paul had seen the vision, we got ready to leave for Macedonia, concluding that God had called us to preach the gospel to them."
        },
        {
          "reference": "Acts 18:9-10",
          "text": "One night the Lord spoke to Paul in a vision: “Do not be afraid; keep on speaking; do not be silent. / For I am with you and no one will lay a hand on you, because I have many people in this city.”"
        },
        {
          "reference": "Acts 23:11",
          "text": "The following night the Lord stood near Paul and said, “Take courage! As you have testified about Me in Jerusalem, so also you must testify in Rome.”"
        }
      ]
    },
    {
      "reference": "Genesis 40:6",
      "book": "Genesis",
      "chapter": 40,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "When Joseph came to them the next morning, he saw that they were dejected."
        },
        {
          "version": "NLT",
          "text": "When Joseph saw them the next morning, he noticed that they both looked upset."
        },
        {
          "version": "ESV",
          "text": "When Joseph came to them in the morning, he saw that they were troubled."
        },
        {
          "version": "NKJV",
          "text": "And Joseph came in to them in the morning and looked at them, and saw that they were sad."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:8",
          "text": "In the morning his spirit was troubled, so he summoned all the magicians and wise men of Egypt. Pharaoh told them his dreams, but no one could interpret them for him."
        },
        {
          "reference": "Daniel 2:1-3",
          "text": "In the second year of his reign, Nebuchadnezzar had dreams that troubled his spirit, and sleep escaped him. / So the king gave orders to summon the magicians, enchanters, sorcerers, and astrologers to explain his dreams. When they came and stood before the king, / he said to them, “I have had a dream, and my spirit is anxious to understand it.”"
        },
        {
          "reference": "Daniel 4:5-6",
          "text": "I had a dream, and it frightened me; while I was in my bed, the images and visions in my mind alarmed me. / So I issued a decree that all the wise men of Babylon be brought before me to interpret the dream for me."
        },
        {
          "reference": "Nehemiah 2:2",
          "text": "so the king said to me, “Why is your face sad, though you are not ill? This could only be sadness of the heart.” I was overwhelmed with fear"
        },
        {
          "reference": "1 Samuel 1:18",
          "text": "“May your maidservant find favor with you,” said Hannah. Then she went on her way, and she began to eat, and her face was no longer downcast."
        },
        {
          "reference": "1 Kings 21:4",
          "text": "So Ahab went to his palace, sullen and angry because Naboth the Jezreelite had told him, “I will not give you the inheritance of my fathers.” He lay down on his bed, turned his face away, and refused to eat."
        },
        {
          "reference": "Job 29:24",
          "text": "If I smiled at them, they did not believe it; the light of my countenance was precious."
        },
        {
          "reference": "Proverbs 15:13",
          "text": "A joyful heart makes a cheerful countenance, but sorrow of the heart crushes the spirit."
        },
        {
          "reference": "Proverbs 17:22",
          "text": "A joyful heart is good medicine, but a broken spirit dries up the bones."
        },
        {
          "reference": "Ecclesiastes 7:3",
          "text": "Sorrow is better than laughter, for a sad countenance is good for the heart."
        },
        {
          "reference": "Matthew 6:16",
          "text": "When you fast, do not be somber like the hypocrites, for they disfigure their faces to show men they are fasting. Truly I tell you, they already have their full reward."
        },
        {
          "reference": "Matthew 26:37-38",
          "text": "He took with Him Peter and the two sons of Zebedee and began to be sorrowful and deeply distressed. / Then He said to them, “My soul is consumed with sorrow to the point of death. Stay here and keep watch with Me.”"
        },
        {
          "reference": "Mark 14:33-34",
          "text": "He took with Him Peter, James, and John, and began to be deeply troubled and distressed. / Then He said to them, “My soul is consumed with sorrow to the point of death. Stay here and keep watch.”"
        },
        {
          "reference": "Luke 24:17",
          "text": "He asked them, “What are you discussing so intently as you walk along?” They stood still, with sadness on their faces."
        },
        {
          "reference": "John 16:6",
          "text": "Instead, your hearts are filled with sorrow because I have told you these things."
        }
      ]
    },
    {
      "reference": "Genesis 40:7",
      "book": "Genesis",
      "chapter": 40,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "So he asked Pharaoh’s officials who were in custody with him in his master’s house, “Why do you look so sad today?”"
        },
        {
          "version": "NLT",
          "text": "“Why do you look so worried today?” he asked them."
        },
        {
          "version": "ESV",
          "text": "So he asked Pharaoh’s officers who were with him in custody in his master’s house, “Why are your faces downcast today?”"
        },
        {
          "version": "NKJV",
          "text": "So he asked Pharaoh’s officers who were with him in the custody of his lord’s house, saying, “Why do you look so sad today?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Daniel 2:1-3",
          "text": "In the second year of his reign, Nebuchadnezzar had dreams that troubled his spirit, and sleep escaped him. / So the king gave orders to summon the magicians, enchanters, sorcerers, and astrologers to explain his dreams. When they came and stood before the king, / he said to them, “I have had a dream, and my spirit is anxious to understand it.”"
        },
        {
          "reference": "Daniel 4:5-6",
          "text": "I had a dream, and it frightened me; while I was in my bed, the images and visions in my mind alarmed me. / So I issued a decree that all the wise men of Babylon be brought before me to interpret the dream for me."
        },
        {
          "reference": "Nehemiah 2:2",
          "text": "so the king said to me, “Why is your face sad, though you are not ill? This could only be sadness of the heart.” I was overwhelmed with fear"
        },
        {
          "reference": "1 Samuel 1:15-16",
          "text": "“No, my lord,” Hannah replied. “I am a woman troubled in spirit. I have not had any wine or strong drink, but I have poured out my soul before the LORD. / Do not take your servant for a wicked woman, for all this time I have been praying out of the depth of my anguish and grief.”"
        },
        {
          "reference": "1 Kings 21:5-7",
          "text": "Soon his wife Jezebel came in and asked, “Why are you so sullen that you refuse to eat?” / Ahab answered, “Because I spoke to Naboth the Jezreelite and told him, ‘Give me your vineyard for silver, or if you wish, I will give you another vineyard in its place.’ And he replied, ‘I will not give you my vineyard!’” / But his wife Jezebel said to him, “Do you not reign over Israel? Get up, eat some food, and be cheerful, for I will get you the vineyard of Naboth the Jezreelite.”"
        },
        {
          "reference": "Esther 7:3-4",
          "text": "Queen Esther replied, “If I have found favor in your sight, O king, and if it pleases the king, grant me my life as my petition, and the lives of my people as my request. / For my people and I have been sold out to destruction, death, and annihilation. If we had merely been sold as menservants and maidservants, I would have remained silent, because no such distress would justify burdening the king.”"
        },
        {
          "reference": "Job 7:13-14",
          "text": "When I think my bed will comfort me and my couch will ease my complaint, / then You frighten me with dreams and terrify me with visions,"
        },
        {
          "reference": "Job 33:15-16",
          "text": "In a dream, in a vision in the night, when deep sleep falls upon men as they slumber on their beds, / He opens their ears and terrifies them with warnings"
        },
        {
          "reference": "Proverbs 15:13",
          "text": "A joyful heart makes a cheerful countenance, but sorrow of the heart crushes the spirit."
        },
        {
          "reference": "Proverbs 17:22",
          "text": "A joyful heart is good medicine, but a broken spirit dries up the bones."
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Matthew 11:28-30",
          "text": "Come to Me, all you who are weary and burdened, and I will give you rest. / Take My yoke upon you and learn from Me, for I am gentle and humble in heart, and you will find rest for your souls. / For My yoke is easy and My burden is light.”"
        },
        {
          "reference": "Luke 24:17",
          "text": "He asked them, “What are you discussing so intently as you walk along?” They stood still, with sadness on their faces."
        },
        {
          "reference": "John 16:6",
          "text": "Instead, your hearts are filled with sorrow because I have told you these things."
        },
        {
          "reference": "Acts 16:9-10",
          "text": "During the night, Paul had a vision of a man of Macedonia standing and pleading with him, “Come over to Macedonia and help us.” / As soon as Paul had seen the vision, we got ready to leave for Macedonia, concluding that God had called us to preach the gospel to them."
        }
      ]
    },
    {
      "reference": "Genesis 40:8",
      "book": "Genesis",
      "chapter": 40,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "“We both had dreams,” they answered, &#8220but there is no one to interpret them.” Then Joseph said to them, &#8220Do not interpretations belong to God? Tell me your dreams.&#8221<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nlt/genesis/40.htm\">New Living Translation</a></span><br />And they replied, &#8220;We both had dreams last night, but no one can tell us what they mean.&#8221; &#8220;Interpreting dreams is God&#8217;s business,&#8221; Joseph replied. &#8220;Go ahead and tell me your dreams.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/esv/genesis/40.htm\">English Standard Version</a></span><br />They said to him, &#8220;We have had dreams, and there is no one to interpret them.&#8221; And Joseph said to them, &#8220;Do not interpretations belong to God? Please tell them to me.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/bsb/genesis/40.htm\">Berean Standard Bible</a></span><br />&#8220;We both had dreams,&#8221; they replied, &#8220;but there is no one to interpret them.&#8221; Then Joseph said to them, &#8220;Don&#8217;t interpretations belong to God? Tell me your dreams.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/kjv/genesis/40.htm\">King James Bible</a></span><br />And they said unto him, We have dreamed a dream, and <i>there is</i> no interpreter of it. And Joseph said unto them, <i>Do</i> not interpretations <i>belong</i> to God? tell me <i>them</i>, I pray you.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nkjv/genesis/40.htm\">New King James Version</a></span><br />And they said to him, &#8220;We each have had a dream, and <i>there is</i> no interpreter of it.&#8221; So Joseph said to them, &#8220;Do not interpretations belong to God? Tell <i>them</i> to me, please.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nasb_/genesis/40.htm\">New American Standard Bible</a></span><br />And they said to him, &#8220;We have had a dream, and there is no one to interpret it.&#8221; Then Joseph said to them, &#8220;Do interpretations not belong to God? Tell <i>it</i> to me, please.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nasb/genesis/40.htm\">NASB 1995</a></span><br />Then they said to him, &#8220We have had a dream and there is no one to interpret it.&#8221 Then Joseph said to them, &#8220Do not interpretations belong to God? Tell it to me, please.&#8221<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nasb77/genesis/40.htm\">NASB 1977 </a></span><br />Then they said to him, &#8220;We have had a dream and there is no one to interpret it.&#8221; Then Joseph said to them, &#8220;Do not interpretations belong to God? Tell <i>it</i> to me, please.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/lsb/genesis/40.htm\">Legacy Standard Bible </a></span><br />Then they said to him, &#8220;We have had a dream, and there is no one to interpret it.&#8221; Then Joseph said to them, &#8220;Do not interpretations belong to God? Recount <i>it</i> to me, please.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/amp/genesis/40.htm\">Amplified Bible</a></span><br />And they said to him, &#8220;We have [each] dreamed [distinct] dreams and there is no one to interpret them.&#8221; So Joseph said to them, &#8220;Do not interpretations belong to God? Please tell me [your dreams].&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/csb/genesis/40.htm\">Christian Standard Bible</a></span><br />&#8220;We had dreams,&#8221; they said to him, &#8220;but there is no one to interpret them.&#8221; Then Joseph said to them, &#8220;Don&#8217;t interpretations belong to God? Tell me your dreams.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/hcsb/genesis/40.htm\">Holman Christian Standard Bible</a></span><br />We had dreams,&#8221 they said to him, &#8220but there is no one to interpret them.&#8221 Then Joseph said to them, &#8220Don&#8217t interpretations belong to God? Tell me your dreams.&#8221 <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/asv/genesis/40.htm\">American Standard Version</a></span><br />And they said unto him, We have dreamed a dream, and there is none that can interpret it. And Joseph said unto them, Do not interpretations belong to God? tell it me, I pray you.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/cev/genesis/40.htm\">Contemporary English Version</a></span><br />\"We each had a dream last night,\" they answered, \"and there is no one to tell us what they mean.\" Joseph replied, \"Doesn't God know the meaning of dreams? Now tell me what you dreamed.\" <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/erv/genesis/40.htm\">English Revised Version</a></span><br />And they said unto him, We have dreamed a dream, and there is none that can interpret it. And Joseph said unto them, Do not interpretations belong to God? tell it me, I pray you.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/gwt/genesis/40.htm\">GOD'S WORD&reg; Translation</a></span><br />\"We both had dreams,\" they answered him, \"but there's no one to tell us what they mean.\" \"Isn't God the only one who can tell what they mean?\" Joseph asked them. \"Why don't you tell me all about them.\"<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/gnt/genesis/40.htm\">Good News Translation</a></span><br />They answered, \"Each of us had a dream, and there is no one here to explain what the dreams mean.\" \"It is God who gives the ability to interpret dreams,\" Joseph said. \"Tell me your dreams.\" <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/isv/genesis/40.htm\">International Standard Version</a></span><br />\"We had a dream,\" they replied, \"but there's no one to interpret it.\" \"Interpretations belong to God,\" Joseph told them, \"so please tell me your stories.\"<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/net/genesis/40.htm\">NET Bible</a></span><br />They told him, \"We both had dreams, but there is no one to interpret them.\" Joseph responded, \"Don't interpretations belong to God? Tell them to me.\" <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nheb/genesis/40.htm\">New Heart English Bible</a></span><br />They said to him, \"We both had dreams, but there is no one who can interpret it.\" Joseph said to them, \"Do not interpretations belong to God? Please tell it to me.\"<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/wbt/genesis/40.htm\">Webster's Bible Translation</a></span><br />And they said to him, We have dreamed a dream, and there is no interpreter of it. And Joseph said to them, Do not interpretations belong to God? tell me them, I pray you.<div class=\"vheading2\"><b>Majority Text Translations</b></div><span class=\"versiontext\"><a href=\"/msb/genesis/40.htm\">Majority Standard Bible</a></span><br />&#8220;We both had dreams,&#8221; they replied, &#8220;but there is no one to interpret them.&#8221; Then Joseph said to them, &#8220;Don&#8217;t interpretations belong to God? Tell me your dreams.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/web/genesis/40.htm\">World English Bible</a></span><br />They said to him, &#8220;We have dreamed a dream, and there is no one who can interpret it.&#8221; Joseph said to them, &#8220;Don&#8217;t interpretations belong to God? Please tell it to me.&#8221; <div class=\"vheading2\"><b>Literal Translations</b></div><span class=\"versiontext\"><a href=\"/lsv/genesis/40.htm\">Literal Standard Version</a></span><br />And they say to him, &#8220;We have dreamed a dream, and there is no interpreter of it&#8221;; and Joseph says to them, &#8220;Are interpretations not with God? Please recount to me.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/ylt/genesis/40.htm\">Young's Literal Translation</a></span><br /> And they say unto him, 'A dream we have dreamed, and there is no interpreter of it;' and Joseph saith unto them, 'Are not interpretations with God? recount, I pray you, to me.'<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/slt/genesis/40.htm\">Smith's Literal Translation</a></span><br />And they will say to him, We dreamed a dream, and there is none interpreting it And Joseph will say to them, Are not interpretations to God? Relate now to me.<div class=\"vheading2\"><b>Catholic Translations</b></div><span class=\"versiontext\"><a href=\"/drb/genesis/40.htm\">Douay-Rheims Bible</a></span><br />They answered: We have dreamed a dream, and there is nobody to interpret it to us. And Joseph said to them: Both not interpretation belong to God? Tell me what you have dreamed. <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/cpdv/genesis/40.htm\">Catholic Public Domain Version</a></span><br />They responded, &#8220;We have seen a dream, and there is no one to interpret it for us.&#8221; And Joseph said to them, &#8220;Doesn&#8217;t interpretation belong to God? Recount for me what you have seen.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nabre/genesis/40.htm\">New American Bible</a></span><br />They answered him, &#8220;We have had dreams, but there is no one to interpret them.&#8221; Joseph said to them, &#8220;Do interpretations not come from God? Please tell me the dreams.&#8221;<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/nrsvce/genesis/40.htm\">New Revised Standard Version</a></span><br />They said to him, &#8220;We have had dreams, and there is no one to interpret them.&#8221; And Joseph said to them, &#8220;Do not interpretations belong to God? Please tell them to me.&#8221;<div class=\"vheading2\"><b>Translations from Aramaic</b></div><span class=\"versiontext\"><a href=\"/lamsa/genesis/40.htm\">Lamsa Bible</a></span><br />And they said to him, We have dreamed a dream, and there is no one to interpret it. And Joseph said to them, Behold, the interpretations belong to God; tell them to me.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/hpbt/genesis/40.htm\">Peshitta Holy Bible Translated</a></span><br />And they said to him, &#8220;We dreamed a dream and there is no interpreter for it.&#8221; Yoseph said to them, &#8220;Behold, interpretations are of God; relate them to me.&#8221;<div class=\"vheading2\"><b>OT Translations</b></div><span class=\"versiontext\"><a href=\"/jps/genesis/40.htm\">JPS Tanakh 1917</a></span><br />And they said unto him: 'We have dreamed a dream, and there is none that can interpret it.' And Joseph said unto them: 'Do not interpretations belong to God? tell it me, I pray you.'<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/sep/genesis/40.htm\">Brenton Septuagint Translation</a></span><br />And they said to him, We have seen a dream, and there is no interpreter of it. And Joseph said to them, Is not the interpretation of them through god? tell <i>them</i> than to me.<span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/parallel/genesis/40-8.htm\">Additional Translations ...</a></span></div></div></div><div id=\"centbox\"><div class=\"padcent\"><a name=\"audio\" id=\"audio\"></a><div class=\"vheadingv\"><b>Audio Bible</b></div><iframe width=\"100%\" src=\"https://www.youtube.com/embed/7ehevn8iSgc?start=10153\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe><span class=\"p\"><br /><br /><br /></span><div class=\"vheadingv\"><b>Context</b></div><span class=\"hdg\"><a href=\"/bsb/genesis/40.htm\">The Cupbearer and the Baker</a></span><br>&#8230;<span class=\"reftext\">7</span>So he asked the officials of Pharaoh who were in custody with him in his master&#8217;s house, &#8220;Why are your faces so downcast today?&#8221; <span class=\"reftext\">8</span><span class=\"highl\"><a href=\"/hebrew/2472.htm\" title=\"2472: &#7717;a&#774;&#183;l&#333;&#183;wm (N-ms) -- A dream. Or chalom; from chalam; a dream.\">&#8220;We both had dreams,&#8221;</a> <a href=\"/hebrew/2492.htm\" title=\"2492: &#7717;&#257;&#183;lam&#183;n&#363; (V-Qal-Perf-1cp) -- To bind firmly, to be, plump, to dream. A primitive root; properly, to bind firmly, i.e. to be plump; also to dream.\"></a> <a href=\"/hebrew/559.htm\" title=\"559: way&#183;y&#333;&#183;m&#601;&#183;r&#363; (Conj-w:: V-Qal-ConsecImperf-3mp) -- To utter, say. A primitive root; to say.\">they replied,</a> <a href=\"/hebrew/413.htm\" title=\"413: &#8217;&#234;&#183;l&#257;w (Prep:: 3ms) -- To, into, towards. \"></a> <a href=\"/hebrew/369.htm\" title=\"369: &#8217;&#234;n (Adv) -- As if from a primitive root meaning to be nothing or not exist; a non-entity; generally used as a negative particle.\">&#8220;but there is no one</a> <a href=\"/hebrew/853.htm\" title=\"853: &#8217;&#333;&#183;&#7791;&#333;w (DirObjM:: 3ms) -- Apparent contracted from 'owth in the demonstrative sense of entity; properly, self.\"></a> <a href=\"/hebrew/6622.htm\" title=\"6622: &#363;&#183;p&#772;&#333;&#183;&#7791;&#234;r (Conj-w:: V-Qal-Prtcpl-ms) -- To interpret. A primitive root; to open up, i.e. interpret.\">to interpret them.&#8221;</a> <a href=\"/hebrew/3130.htm\" title=\"3130: y&#333;&#183;w&#183;s&#234;p&#772; (N-proper-ms) -- Future of yacaph; let him add; Joseph, the name of seven Israelites.\">Then Joseph</a> <a href=\"/hebrew/559.htm\" title=\"559: way&#183;y&#333;&#183;mer (Conj-w:: V-Qal-ConsecImperf-3ms) -- To utter, say. A primitive root; to say.\">said</a> <a href=\"/hebrew/413.htm\" title=\"413: &#8217;a&#774;&#183;l&#234;&#183;hem (Prep:: 3mp) -- To, into, towards. \">to them,</a> <a href=\"/hebrew/3808.htm\" title=\"3808: ha&#774;&#183;l&#333;&#183;w (Adv-NegPrt) -- Not. Or lowi; or loh; a primitive particle; not; by implication, no; often used with other particles.\">&#8220;Don&#8217;t</a> <a href=\"/hebrew/6623.htm\" title=\"6623: pi&#7791;&#183;r&#333;&#183;n&#238;m (N-mp) -- Interpretation. Or pithron; from pathar; interpretation.\">interpretations</a> <a href=\"/hebrew/430.htm\" title=\"430: l&#234;&#183;l&#333;&#183;h&#238;m (Prep-l:: N-mp) -- Plural of 'elowahh; gods in the ordinary sense; but specifically used of the supreme God\">belong to God?</a> <a href=\"/hebrew/5608.htm\" title=\"5608: sap&#183;p&#601;&#183;r&#363;- (V-Piel-Imp-mp) -- To count, recount, relate. \">Tell me your dreams.&#8221;</a> <a href=\"/hebrew/4994.htm\" title=\"4994: n&#257; (Interjection) -- I (we) pray, now. \"></a> <a href=\"/hebrew/l&#238; (Prep:: 1cs) -- \"></a> </span><span class=\"reftext\">9</span>So the chief cupbearer told Joseph his dream: &#8220;In my dream there was a vine before me,&#8230;<div class=\"cred\"><a href=\"//berean.bible\">Berean Standard Bible</a> &middot; <a href=\"//berean.bible/downloads.htm\">Download</a></div><span class=\"p\"><br /><br /></span><a name=\"crossref\" id=\"crossref\"></a><div class=\"vheading\">Cross References</div><div id=\"crf\"><span class=\"crossverse\"><a href=\"/daniel/2-27.htm\">Daniel 2:27-28</a></span><br />Daniel answered the king, &#8220;No wise man, enchanter, medium, or magician can explain to the king the mystery of which he inquires. / But there is a God in heaven who reveals mysteries, and He has made known to King Nebuchadnezzar what will happen in the latter days. Your dream and the visions that came into your mind as you lay on your bed were these:<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/daniel/2-47.htm\">Daniel 2:47</a></span><br />The king said to Daniel, &#8220;Your God is truly the God of gods and Lord of kings, the Revealer of Mysteries, since you were able to reveal this mystery.&#8221;<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/daniel/4-8.htm\">Daniel 4:8-9</a></span><br />But at last, into my presence came Daniel (whose name is Belteshazzar after the name of my god, and in whom is the spirit of the holy gods). And I told him the dream: / &#8220;O Belteshazzar, chief of the magicians, I know that the spirit of the holy gods is in you and that no mystery baffles you. So explain to me the visions I saw in my dream, and their interpretation.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/daniel/5-12.htm\">Daniel 5:12</a></span><br />did this because Daniel, the one he named Belteshazzar, was found to have an extraordinary spirit, as well as knowledge, understanding, and the ability to interpret dreams, explain riddles, and solve difficult problems. Summon Daniel, therefore, and he will give you the interpretation.&#8221;<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/daniel/5-16.htm\">Daniel 5:16</a></span><br />But I have heard about you, that you are able to give interpretations and solve difficult problems. Therefore, if you can read this inscription and give me its interpretation, you will be clothed in purple and have a gold chain placed around your neck, and you will be made the third highest ruler in the kingdom.&#8221;<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/1_corinthians/12-10.htm\">1 Corinthians 12:10</a></span><br />to another the working of miracles, to another prophecy, to another distinguishing between spirits, to another speaking in various tongues, and to still another the interpretation of tongues.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/1_corinthians/14-26.htm\">1 Corinthians 14:26</a></span><br />What then shall we say, brothers? When you come together, everyone has a psalm or a teaching, a revelation, a tongue, or an interpretation. All of these must be done to build up the church.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/acts/2-17.htm\">Acts 2:17</a></span><br />&#8216;In the last days, God says, I will pour out My Spirit on all people. Your sons and daughters will prophesy, your young men will see visions, your old men will dream dreams.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/acts/2-30.htm\">Acts 2:30</a></span><br />But he was a prophet and knew that God had promised him on oath that He would place one of his descendants on his throne.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/acts/16-9.htm\">Acts 16:9-10</a></span><br />During the night, Paul had a vision of a man of Macedonia standing and pleading with him, &#8220;Come over to Macedonia and help us.&#8221; / As soon as Paul had seen the vision, we got ready to leave for Macedonia, concluding that God had called us to preach the gospel to them.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/acts/18-9.htm\">Acts 18:9-10</a></span><br />One night the Lord spoke to Paul in a vision: &#8220;Do not be afraid; keep on speaking; do not be silent. / For I am with you and no one will lay a hand on you, because I have many people in this city.&#8221;<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/numbers/12-6.htm\">Numbers 12:6</a></span><br />He said, &#8220;Hear now My words: If there is a prophet among you, I, the LORD, will reveal Myself to him in a vision; I will speak to him in a dream.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/judges/7-13.htm\">Judges 7:13-15</a></span><br />And as Gideon arrived, a man was telling his friend about a dream. &#8220;Behold, I had a dream,&#8221; he said, &#8220;and I saw a loaf of barley bread come tumbling into the Midianite camp. It struck the tent so hard that the tent overturned and collapsed.&#8221; / His friend replied: &#8220;This is nothing less than the sword of Gideon son of Joash, the Israelite. God has delivered Midian and the whole camp into his hand.&#8221; / When Gideon heard the dream and its interpretation, he bowed in worship. He returned to the camp of Israel and said, &#8220;Get up, for the LORD has delivered the camp of Midian into your hand.&#8221;<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/1_samuel/28-6.htm\">1 Samuel 28:6</a></span><br />He inquired of the LORD, but the LORD did not answer him by dreams or Urim or prophets.<span class=\"p\"><br /><br /></span><span class=\"crossverse\"><a href=\"/1_kings/3-5.htm\">1 Kings 3:5</a></span><br />One night at Gibeon the LORD appeared to Solomon in a dream, and God said, &#8220;Ask, and I will give it to you!&#8221;</div><span class=\"p\"><br /><br /></span><a name=\"tsk\" id=\"tsk\"><div class=\"vheading\">Treasury of Scripture</div><p class=\"tsk2\">And they said to him, We have dreamed a dream, and there is no interpreter of it. And Joseph said to them, Do not interpretations belong to God? tell me them, I pray you.</p><p class=\"hdg\">Do not, etc.</p><p class=\"tskverse\"><b><a href=\"/genesis/41-15.htm\">Genesis 41:15,16</a></b></br> And Pharaoh said unto Joseph, I have dreamed a dream, and <i>there is</i> none that can interpret it: and I have heard say of thee, <i>that</i> thou canst understand a dream to interpret it&#8230; </p><p class=\"tskverse\"><b><a href=\"/job/33-15.htm\">Job 33:15,16</a></b></br> In a dream, in a vision of the night, when deep sleep falleth upon men, in slumberings upon the bed; &#8230; </p><p class=\"tskverse\"><b><a href=\"/psalms/25-14.htm\">Psalm 25:14</a></b></br> The secret of the LORD <i>is</i> with them that fear him; and he will shew them his covenant.</p><div class=\"vheading\">Jump to Previous</div><a href=\"/genesis/37-4.htm\">Able</a> <a href=\"/genesis/38-25.htm\">Belong</a> <a href=\"/genesis/40-5.htm\">Dream</a> <a href=\"/genesis/40-5.htm\">Dreamed</a> <a href=\"/genesis/40-5.htm\">Dreams</a> <a href=\"/hebrews/5-11.htm\">Interpret</a> <a href=\"/daniel/5-16.htm\">Interpretations</a> <a href=\"/1_corinthians/14-28.htm\">Interpreter</a> <a href=\"/genesis/40-6.htm\">Joseph</a> <a href=\"/genesis/38-25.htm\">Please</a> <a href=\"/nahum/2-5.htm\">Recount</a> <a href=\"/genesis/11-9.htm\">Sense</a><div class=\"vheading2\">Jump to Next</div><a href=\"/genesis/41-8.htm\">Able</a> <a href=\"/genesis/45-11.htm\">Belong</a> <a href=\"/genesis/40-9.htm\">Dream</a> <a href=\"/genesis/41-1.htm\">Dreamed</a> <a href=\"/genesis/41-8.htm\">Dreams</a> <a href=\"/genesis/41-8.htm\">Interpret</a> <a href=\"/daniel/5-16.htm\">Interpretations</a> <a href=\"/genesis/41-15.htm\">Interpreter</a> <a href=\"/genesis/40-9.htm\">Joseph</a> <a href=\"/genesis/40-14.htm\">Please</a> <a href=\"/genesis/41-12.htm\">Recount</a> <a href=\"/genesis/40-12.htm\">Sense</a><div class=\"vheading2\">Genesis 40</div><span class=\"reftext\">1. </span><span class=\"outlinetext\"><a href=\"/genesis/40-1.htm\">The chief butler and baker of Pharaoh are also imprisoned.</a></span><br><span class=\"reftext\">5. </span><span class=\"outlinetext\"><a href=\"/genesis/40-5.htm\">Joseph interprets their dreams.</a></span><br><span class=\"reftext\">20. </span><span class=\"outlinetext\"><a href=\"/genesis/40-20.htm\">They are accomplished according to his interpretation.</a></span><br><span class=\"reftext\">23. </span><span class=\"outlinetext\"><a href=\"/genesis/40-23.htm\">The ingratitude of the butler, in forgetting Joseph.</a></span><br></div></div><div id=\"mdd\"><div align=\"center\"><div class=\"bot2\"><table align=\"center\" width=\"100%\"><tr><td><div align=\"center\"> <script id=\"3d27ed63fc4348d5b062c4527ae09445\"> (new Image()).src = 'https://capi.connatix.com/tr/si?token=51ce25d5-1a8c-424a-8695-4bd48c750f35&cid=3a9f82d0-4344-4f8d-ac0c-e1a0eb43a405'; </script> <script id=\"b817b7107f1d4a7997da1b3c33457e03\"> (new Image()).src = 'https://capi.connatix.com/tr/si?token=cb0edd8b-b416-47eb-8c6d-3cc96561f7e8&cid=3a9f82d0-4344-4f8d-ac0c-e1a0eb43a405'; </script><br /><br /> <!-- /1078254/BH-728x90-ATF --> <div id='div-gpt-ad-1529103594582-2'> </div><br /><br /> <!-- /1078254/BH-300x250-ATF --> <div id='div-gpt-ad-1529103594582-0' style='max-width: 300px;'> </div><br /><br /> <!-- /1078254/BH-728x90-BTF --> <div id='div-gpt-ad-1529103594582-3'> </div><br /><br /> <!-- /1078254/BH-300x250-BTF --> <div id='div-gpt-ad-1529103594582-1' style='max-width: 300px;'> </div><br /><br /> <!-- /1078254/BH-728x90-BTF2 --> <div align=\"center\" id='div-gpt-ad-1531425649696-0'> </div><br /><br /> <ins class=\"adsbygoogle\" style=\"display:inline-block;width:200px;height:200px\" data-ad-client=\"ca-pub-3753401421161123\" data-ad-slot=\"3592799687\"></ins> <script> (adsbygoogle = window.adsbygoogle || []).push({}); </script> <br /><br /> </div> </td></tr></table></div></div></div><div id=\"combox\"><div class=\"padcom\"><a name=\"study\" id=\"study\"></a><div class=\"vheading\"><table width=\"100%\"><tr><td width=\"99%\" valign=\"top\"><a href=\"/study/genesis/40.htm\">Study Bible</a></td><td width=\"1%\" valign=\"top\"><a href=\"/study/genesis/\" title=\"Book Summary and Study\">Book&nbsp;&#9702;</a>&nbsp;<a href=\"/study/chapters/genesis/40.htm\" title=\"Chapter summary and Study\">Chapter&nbsp;</a></tr></table></div><b>&#8220;We both had dreams,&#8221; they replied</b><br>In the ancient Near East, dreams were often considered significant and could be seen as messages from the divine. The context here is Joseph's imprisonment in Egypt, where he encounters Pharaoh's cupbearer and baker. Dreams in this culture were not just personal experiences but were often believed to have implications for the future or for the community. The fact that both men had dreams on the same night suggests a divine orchestration, setting the stage for Joseph's role in God's plan.<p><b>&#8220;but there is no one to interpret them.&#8221;</b><br>In Egyptian culture, professional dream interpreters were common, often serving in the royal court. The cupbearer and baker's statement highlights their isolation and the absence of these professionals in prison. This sets the stage for Joseph, who, unlike the Egyptian magicians, attributes the ability to interpret dreams to God. This moment underscores the limitations of human wisdom and the need for divine insight.<p><b>Then Joseph said to them,</b><br>Joseph's response is immediate and confident, reflecting his faith and trust in God. Despite his own unjust circumstances, Joseph remains attentive to the needs of others, demonstrating his character and leadership qualities. This interaction is pivotal, as it eventually leads to his rise to power in Egypt.<p><b>&#8220;Don&#8217;t interpretations belong to God?</b><br>Joseph's rhetorical question emphasizes the sovereignty of God over all things, including the mysteries of dreams. This statement is a declaration of monotheism in a polytheistic culture, asserting that true wisdom and understanding come from the one true God. It also foreshadows Joseph's role as a prophet-like figure, through whom God reveals His plans.<p><b>Tell me your dreams.&#8221;</b><br>Joseph invites the men to share their dreams, positioning himself as a vessel through which God can work. This act of faith and service is a turning point in Joseph's life, leading to his eventual release and rise to power. It also prefigures the role of Jesus Christ, who invites humanity to bring their burdens to Him, offering divine insight and redemption.<div class=\"vheading2\">Persons / Places / Events</div>1. <b><a href=\"/topical/j/joseph.htm\">Joseph</a></b><br>A Hebrew man who was sold into slavery by his brothers and ended up in Egypt. He is currently imprisoned but remains faithful to God and is given the ability to interpret dreams.<br><br>2. <b><a href=\"/topical/c/cupbearer_and_baker.htm\">Cupbearer and Baker</a></b><br>Two officials of Pharaoh who were imprisoned with Joseph. They each had a dream that troubled them, leading to the events of this passage.<br><br>3. <b><a href=\"/topical/p/prison_in_egypt.htm\">Prison in Egypt</a></b><br>The setting of this passage, where Joseph is held and where he encounters the cupbearer and baker.<div class=\"vheading2\">Teaching Points</div><b><a href=\"/topical/d/dependence_on_god_for_wisdom.htm\">Dependence on God for Wisdom</a></b><br>Joseph's response highlights the importance of seeking God's wisdom in all matters, recognizing that true understanding comes from Him.<br><br><b><a href=\"/topical/f/faithfulness_in_adversity.htm\">Faithfulness in Adversity</a></b><br>Despite his circumstances, Joseph remains faithful and uses his God-given gifts to serve others, demonstrating integrity and trust in God's plan.<br><br><b><a href=\"/topical/g/god's_sovereignty_in_interpretation.htm\">God's Sovereignty in Interpretation</a></b><br>Joseph acknowledges that interpretations belong to God, reminding us of His ultimate authority and control over all things.<br><br><b><a href=\"/topical/u/using_spiritual_gifts_for_god's_glory.htm\">Using Spiritual Gifts for God's Glory</a></b><br>Joseph uses his gift of interpretation to help others, setting an example of how we should use our spiritual gifts to serve and glorify God.<div class=\"vheading2\">Bible Study Questions and Answers</div><span class=\"count\">1. </span><a href=\"/q/What_does_Genesis_40_8_mean.htm\">What is the meaning of Genesis 40:8?</a><span class=\"p\"><br /><br /></span><span class=\"count\">2. </span><a href=\"/q/Genesis_40_8_God_s_role_in_dream_interpretation.htm\">How does Genesis 40:8 emphasize God's role in interpreting dreams?</a><span class=\"p\"><br /><br /></span><span class=\"count\">3. </span><a href=\"/q/Insights_on_God_s_sovereignty_in_Gen_40_8.htm\">What can we learn about God's sovereignty from Genesis 40:8?</a><span class=\"p\"><br /><br /></span><span class=\"count\">4. </span><a href=\"/q/Joseph_s_faith_in_God_in_Gen_40_8.htm\">How does Joseph's response in Genesis 40:8 demonstrate his faith in God?</a><span class=\"p\"><br /><br /></span><span class=\"count\">5. </span><a href=\"/q/How_to_seek_God_s_guidance_today_2.htm\">How can we seek God's guidance in interpreting life's challenges today?</a><span class=\"p\"><br /><br /></span><span class=\"count\">6. </span><a href=\"/q/Which_scriptures_show_God_s_wisdom.htm\">What other scriptures highlight God's wisdom in revealing mysteries to His people?</a><span class=\"p\"><br /><br /></span><span class=\"count\">7. </span><a href=\"/q/Genesis_40_8_God_s_role_in_dreams.htm\">How does Genesis 40:8 emphasize God's role in interpreting dreams?</a><span class=\"p\"><br /><br /></span><span class=\"count\">8. </span><a href=\"/q/Why_is_divine_insight_key_in_Gen_40_8.htm\">Why is divine interpretation significant in Genesis 40:8?</a><span class=\"p\"><br /><br /></span><span class=\"count\">9. </span><a href=\"/q/Genesis_40_8_Joseph_s_faith_in_God.htm\">What does Genesis 40:8 reveal about Joseph's faith in God?</a><span class=\"p\"><br /><br /></span><span class=\"count\">10. </span><a href=\"/top10/lessons_from_genesis_40.htm\">What are the top 10 Lessons from Genesis 40?</a><span class=\"p\"><br /><br /></span><span class=\"count\">11. </span><a href=\"/q/how_does_genesis_40_8_fit_science.htm\">How can the seemingly supernatural power to interpret dreams in Genesis 40:8 be reconciled with a scientific worldview? </a><span class=\"p\"><br /><br /></span><span class=\"count\">12. </span><a href=\"/q/what_does_the_bible_say_on_dreams.htm\">What does the Bible say about interpreting dreams?</a><span class=\"p\"><br /><br /></span><span class=\"count\">13. </span><a href=\"/q/why_trust_joseph_with_dream_interpretation.htm\">Why would a prisoner like Joseph be entrusted with interpreting dreams for high-ranking officials (Genesis 40:5-8)?</a><span class=\"p\"><br /><br /></span><span class=\"count\">14. </span><a href=\"/q/are_angel_numbers_biblical.htm\">Are angel numbers biblical?</a><a name=\"commentary\" id=\"commentary\"></a><div class=\"vheading2\">What Does Genesis 40:8 Mean</div><b>We both had dreams</b><p>- The cupbearer and baker awaken troubled. Their admission, &#8220;We both had dreams,&#8221; (<a href=\"/genesis/40-8.htm\">Genesis 40:8</a>a) spotlights God&#8217;s sovereign use of dreams for revelation, just as He did with Abraham (<a href=\"/genesis/15-12.htm\">Genesis 15:12-16</a>), Jacob (<a href=\"/genesis/28-12.htm\">Genesis 28:12-15</a>), and later with Pharaoh (<a href=\"/genesis/41-1.htm\">Genesis 41:1-7</a>).<p>- Dreams in Scripture aren&#8217;t random nighttime images; they can be divine messages requiring discernment. Compare <a href=\"/numbers/12-6.htm\">Numbers 12:6</a>, where the Lord says, &#8220;I speak with him in dreams,&#8221; affirming that God sometimes chooses this medium to guide His purposes.<p>- Practical implication: when God speaks, He does so intentionally and coherently, never by accident (<a href=\"/psalms/33-11.htm\">Psalm 33:11</a>).<p><hr color=\"#eeeeee\"><b>But there is no one to interpret them</b><p>- Their anxiety flows from the absence of an interpreter. In Egyptian culture, professional &#8220;dream readers&#8221; existed (<a href=\"/genesis/41-8.htm\">Genesis 41:8</a>). Yet in the prison, such experts are unavailable.<p>- Scripture often shows human wisdom reaching its limits (<a href=\"/daniel/2-10.htm\">Daniel 2:10-11</a>). The cupbearer and baker thus feel stranded&#8212;an acknowledgment that purely human resources cannot unlock divine mysteries (<a href=\"/1_corinthians/2-14.htm\">1 Corinthians 2:14</a>).<p>- This tension prepares the stage for God&#8217;s servant to step forward.<p><hr color=\"#eeeeee\"><b>Don&#8217;t interpretations belong to God?</b><p>- Joseph&#8217;s question is both correction and confession. He declares the exclusive prerogative of the Lord: &#8220;interpretations belong to God&#8221; (<a href=\"/genesis/40-8.htm\">Genesis 40:8</a>b).<p>- Other passages echo this truth: <a href=\"/daniel/2-28.htm\">Daniel 2:28</a>, &#8220;There is a God in heaven who reveals mysteries,&#8221; and <a href=\"/amos/3-7.htm\">Amos 3:7</a>, &#8220;Surely the Lord GOD does nothing without revealing His plan to His servants the prophets.&#8221;<p>- Joseph&#8217;s statement guards against self-glory. Unlike pagan diviners, he refuses credit, pointing all recognition to the Lord (<a href=\"/isaiah/42-8.htm\">Isaiah 42:8</a>).<p>- Application bullet points:<p>&#8226; Seek God first when facing unclear circumstances (<a href=\"/james/1-5.htm\">James 1:5</a>).<p>&#8226; Trust that divine wisdom surpasses every human method (<a href=\"/proverbs/3-5.htm\">Proverbs 3:5-6</a>).<p><hr color=\"#eeeeee\"><b>Tell me your dreams</b><p>- Having acknowledged God as the true interpreter, Joseph invites them to speak. This shows confident faith: he expects God to act through him (<a href=\"/hebrews/11-22.htm\">Hebrews 11:22</a>).<p>- Joseph positions himself as a conduit, much like Samuel who said, &#8220;Speak, LORD, for Your servant is listening&#8221; (<a href=\"/1_samuel/3-9.htm\">1 Samuel 3:9-10</a>).<p>- The invitation also illustrates compassionate ministry. Even in confinement, Joseph serves others, foreshadowing Christ who came &#8220;not to be served, but to serve&#8221; (<a href=\"/mark/10-45.htm\">Mark 10:45</a>).<p>- Note the blend of humility and boldness: humility in relying on God; boldness in acting once reliance is clear (<a href=\"/acts/4-13.htm\">Acts 4:13</a>).<p><hr color=\"#eeeeee\"><b>summary</b><p><a href=\"/genesis/40-8.htm\">Genesis 40:8</a> teaches that while people may sense divine communication, only God supplies the true meaning. Human expertise falters, but the Lord reveals mysteries through faithful servants who humbly depend on Him. Joseph&#8217;s response models how believers today should handle ambiguity: recognize God&#8217;s sovereign voice, reject self-reliance, and step forward in obedient confidence to serve others.<div class=\"vheading2\"><a href=\"/commentaries/ellicott/genesis/40.htm\">Ellicott's Commentary for English Readers</a></div>(8) <span class= \"bld\">There is no interpreter.</span>--In Egypt it was the business of men trained for the purpose, called in <a href=\"/genesis/41-8.htm\" title=\"And it came to pass in the morning that his spirit was troubled; and he sent and called for all the magicians of Egypt, and all the wise men thereof: and Pharaoh told them his dream; but there was none that could interpret them to Pharaoh.\">Genesis 41:8</a>, <span class= \"ital\">magicians </span>and <span class= \"ital\">wise men, </span>to interpret dreams, and to such the butler and baker could have no access from their prison. But Joseph denies that art and training can really avail, and claims that the interpretation belongs to God.<p><div class=\"vheading2\"><a href=\"/commentaries/pulpit/genesis/40.htm\">Pulpit Commentary</a></div><span class=\"cmt_sub_title\">Verse 8.</span> - <span class=\"cmt_word\">And they said unto him, We hays dreamed a dream, and there is no interpreter of it</span> - literally, <span class=\"accented\">a dream have we dreamt, and interpreting it there is none</span>. This must be noted as a third peculiarity connected with these dreams, that both of their recipients were similarly affected by them, though there was much in the butler s dream to inspire hope rather than dejection. <span class=\"cmt_word\">And Joseph said unto them, Do not interpretations belong to God</span>? - literally, <span class=\"accented\">Are not interpretations to Elohim? i.e.</span> the Supreme Being (cf. <a href=\"/genesis/41-16.htm\">Genesis 41:16</a>; <a href=\"/daniel/2-11.htm\">Daniel 2:11, 28, 47</a>). The Egyptians believed <span class=\"greek\">&#x1f45;&#x3c4;&#x3b9;&#x20;&#x1f00;&#x3bd;&#x3b8;&#x3c1;&#x1f7d;&#x3c0;&#x3c9;&#x3bd;&#x20;&#x3bc;&#x1f72;&#x3bd;</span> <span class=\"greek\">&#x3bf;&#x1f50;&#x3b4;&#x3b5;&#x3bd;&#x1f76;&#x20;&#x3c0;&#x3c1;&#x3bf;&#x3c3;&#x3ba;&#x1f73;&#x3b5;&#x3c4;&#x3b1;&#x3b9;&#x20;&#x1f21;&#x20;&#x3c4;&#x1f73;&#x3c7;&#x3bd;&#x3b7;&#x20;&#x3bc;&#x3b1;&#x3bd;&#x3c4;&#x3b9;&#x3ba;&#x1f74;&#x20;&#x3c4;&#x1ff6;&#x3bd;&#x20;&#x3b4;&#x1f72;</span> <span class=\"greek\">&#x3b8;&#x3b5;&#x1ff6;&#x3bd;&#x20;&#x3bc;&#x3b5;&#x3c4;&#x3b5;&#x3be;&#x3b5;&#x3c4;&#x1f73;&#x3c1;&#x3bf;&#x3b9;&#x3c3;&#x3b5;</span> (Herod., 2:83). <span class=\"cmt_word\">Tell me them, I pray you.</span> Joseph's request implies that the consciousness of his Divine calling to be a prophet had begun to dawn upon him, and that he was now speaking from an inward conviction, doubtless produced within his mind by Elohim, that he could unfold the true significance of the dreams. <span class=\"p\"><br /><br /></span><span class=\"versiontext\"><a href=\"/commentaries/genesis/40-8.htm\">Parallel Commentaries ...</a></span><span class=\"p\"><br /><br /><br /></span><a name=\"lexicon\" id=\"lexicon\"></a><div class=\"vheading\">Hebrew</div><span class=\"word\">&#8220;We both had dreams,&#8221;</span><br /><span class=\"heb\">&#1495;&#1458;&#1500;&#1443;&#1493;&#1465;&#1501;</span> <span class=\"translit\">(&#7717;a&#774;&#183;l&#333;&#183;wm)</span><br /><span class=\"parse\">Noun - masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_2472.htm\">Strong's 2472: </a> </span><span class=\"str2\">A dream</span><br /><br /><span class=\"word\">they replied,</span><br /><span class=\"heb\">&#1493;&#1463;&#1497;&#1468;&#1465;&#1488;&#1502;&#1456;&#1512;&#1443;&#1493;&#1468;</span> <span class=\"translit\">(way&#183;y&#333;&#183;m&#601;&#183;r&#363;)</span><br /><span class=\"parse\">Conjunctive waw &#124; Verb - Qal - Consecutive imperfect - third person masculine plural<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_559.htm\">Strong's 559: </a> </span><span class=\"str2\">To utter, say</span><br /><br /><span class=\"word\">&#8220;but there is no one</span><br /><span class=\"heb\">&#1488;&#1461;&#1443;&#1497;&#1503;</span> <span class=\"translit\">(&#8217;&#234;n)</span><br /><span class=\"parse\">Adverb<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_369.htm\">Strong's 369: </a> </span><span class=\"str2\">A non-entity, a negative particle</span><br /><br /><span class=\"word\">to interpret them.&#8221;</span><br /><span class=\"heb\">&#1493;&#1468;&#1508;&#1465;&#1514;&#1461;&#1430;&#1512;</span> <span class=\"translit\">(&#363;&#183;p&#772;&#333;&#183;&#7791;&#234;r)</span><br /><span class=\"parse\">Conjunctive waw &#124; Verb - Qal - Participle - masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_6622.htm\">Strong's 6622: </a> </span><span class=\"str2\">To open up, interpret</span><br /><br /><span class=\"word\">Then Joseph</span><br /><span class=\"heb\">&#1497;&#1493;&#1465;&#1505;&#1461;&#1431;&#1507;</span> <span class=\"translit\">(y&#333;&#183;w&#183;s&#234;p&#772;)</span><br /><span class=\"parse\">Noun - proper - masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_3130.htm\">Strong's 3130: </a> </span><span class=\"str2\">Joseph -- 'he increases', a son of Jacob, also the name of several Israelites</span><br /><br /><span class=\"word\">said</span><br /><span class=\"heb\">&#1493;&#1463;&#1497;&#1468;&#1465;&#1448;&#1488;&#1502;&#1462;&#1512;</span> <span class=\"translit\">(way&#183;y&#333;&#183;mer)</span><br /><span class=\"parse\">Conjunctive waw &#124; Verb - Qal - Consecutive imperfect - third person masculine singular<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_559.htm\">Strong's 559: </a> </span><span class=\"str2\">To utter, say</span><br /><br /><span class=\"word\">to them,</span><br /><span class=\"heb\">&#1488;&#1458;&#1500;&#1461;&#1492;&#1462;&#1436;&#1501;</span> <span class=\"translit\">(&#8217;a&#774;&#183;l&#234;&#183;hem)</span><br /><span class=\"parse\">Preposition &#124; third person masculine plural<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_413.htm\">Strong's 413: </a> </span><span class=\"str2\">Near, with, among, to</span><br /><br /><span class=\"word\">&#8220;Don&#8217;t</span><br /><span class=\"heb\">&#1492;&#1458;&#1500;&#1444;&#1493;&#1465;&#1488;</span> <span class=\"translit\">(ha&#774;&#183;l&#333;&#183;w)</span><br /><span class=\"parse\">Adverb - Negative particle<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_3808.htm\">Strong's 3808: </a> </span><span class=\"str2\">Not, no</span><br /><br /><span class=\"word\">interpretations</span><br /><span class=\"heb\">&#1508;&#1468;&#1460;&#1514;&#1456;&#1512;&#1465;&#1504;&#1460;&#1428;&#1497;&#1501;</span> <span class=\"translit\">(pi&#7791;&#183;r&#333;&#183;n&#238;m)</span><br /><span class=\"parse\">Noun - masculine plural<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_6623.htm\">Strong's 6623: </a> </span><span class=\"str2\">Interpretation</span><br /><br /><span class=\"word\">belong to God?</span><br /><span class=\"heb\">&#1500;&#1469;&#1461;&#1488;&#1500;&#1465;&#1492;&#1460;&#1497;&#1501;&#1433;</span> <span class=\"translit\">(l&#234;&#183;l&#333;&#183;h&#238;m)</span><br /><span class=\"parse\">Preposition-l &#124; Noun - masculine plural<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_430.htm\">Strong's 430: </a> </span><span class=\"str2\">gods -- the supreme God, magistrates, a superlative</span><br /><br /><span class=\"word\">Tell me your dreams.&#8221;</span><br /><span class=\"heb\">&#1505;&#1463;&#1508;&#1468;&#1456;&#1512;&#1493;&#1468;&#1470;</span> <span class=\"translit\">(sap&#183;p&#601;&#183;r&#363;-)</span><br /><span class=\"parse\">Verb - Piel - Imperative - masculine plural<br /></span><span class=\"str\"><a href=\"/hebrew/strongs_5608.htm\">Strong's 5608: </a> </span><span class=\"str2\">To count, recount, relate</span><br /><span class=\"p\"><br /><br /></span><div class=\"vheading\">Links</div><a href=\"/niv/genesis/40-8.htm\">Genesis 40:8 NIV</a><br /><a href=\"/nlt/genesis/40-8.htm\">Genesis 40:8 NLT</a><br /><a href=\"/esv/genesis/40-8.htm\">Genesis 40:8 ESV</a><br /><a href=\"/nasb/genesis/40-8.htm\">Genesis 40:8 NASB</a><br /><a href=\"/kjv/genesis/40-8.htm\">Genesis 40:8 KJV</a><span class=\"p\"><br /><br /></span><a href=\"//bibleapps.com/genesis/40-8.htm\">Genesis 40:8 BibleApps.com</a><br /><a href=\"//bibliaparalela.com/genesis/40-8.htm\">Genesis 40:8 Biblia Paralela</a><br /><a href=\"//holybible.com.cn/genesis/40-8.htm\">Genesis 40:8 Chinese Bible</a><br /><a href=\"//saintebible.com/genesis/40-8.htm\">Genesis 40:8 French Bible</a><br /><a href=\"/catholic/genesis/40-8.htm\">Genesis 40:8 Catholic Bible</a><span class=\"p\"><br /><br /></span><a href=\"/genesis/40-8.htm\">OT Law: Genesis 40:8 They said to him We have dreamed (Gen. Ge Gn)</a></div></div></td></tr></table></div><div id=\"left\"><a href=\"/genesis/40-7.htm\" onmouseover='lft.src=\"/leftgif.png\"' onmouseout='lft.src=\"/left.png\"' title=\"Genesis 40:7\"><img src=\"/left.png\" name=\"lft\" border=\"0\" alt=\"Genesis 40:7\" /></a></div><div id=\"right\"><a href=\"/genesis/40-9.htm\" onmouseover='rght.src=\"/rightgif.png\"' onmouseout='rght.src=\"/right.png\"' title=\"Genesis 40:9\"><img src=\"/right.png\" name=\"rght\" border=\"0\" alt=\"Genesis 40:9\" /></a></div><div id=\"botleft\"><a href=\"#\" onmouseover='botleft.src=\"/botleftgif.png\"' onmouseout='botleft.src=\"/botleft.png\"' title=\"Top of Page\"><img src=\"/botleft.png\" name=\"botleft\" border=\"0\" alt=\"Top of Page\" /></a></div><div id=\"botright\"><a href=\"#\" onmouseover='botright.src=\"/botrightgif.png\"' onmouseout='botright.src=\"/botright.png\"' title=\"Top of Page\"><img src=\"/botright.png\" name=\"botright\" border=\"0\" alt=\"Top of Page\" /></a></div><div id=\"bot\"><iframe width=\"100%\" height=\"1500\" scrolling=\"no\" src=\"/botmenubhnew2.htm\" frameborder=\"0\"></iframe></div></td></tr></table></div></body></html>"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 40:9",
      "book": "Genesis",
      "chapter": 40,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "So the chief cupbearer told Joseph his dream. He said to him, “In my dream I saw a vine in front of me,"
        },
        {
          "version": "NLT",
          "text": "So the chief cup-bearer told Joseph his dream first. “In my dream,” he said, “I saw a grapevine in front of me."
        },
        {
          "version": "ESV",
          "text": "So the chief cupbearer told his dream to Joseph and said to him, “In my dream there was a vine before me,"
        },
        {
          "version": "NKJV",
          "text": "Then the chief butler told his dream to Joseph, and said to him, “Behold, in my dream a vine was before me,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Daniel 2:19-23",
          "text": "During the night, the mystery was revealed to Daniel in a vision, and he blessed the God of heaven / and declared: “Blessed be the name of God forever and ever, for wisdom and power belong to Him. / He changes the times and seasons; He removes kings and establishes them. He gives wisdom to the wise and knowledge to the discerning. ..."
        },
        {
          "reference": "Daniel 4:8-9",
          "text": "But at last, into my presence came Daniel (whose name is Belteshazzar after the name of my god, and in whom is the spirit of the holy gods). And I told him the dream: / “O Belteshazzar, chief of the magicians, I know that the spirit of the holy gods is in you and that no mystery baffles you. So explain to me the visions I saw in my dream, and their interpretation."
        },
        {
          "reference": "Daniel 5:12",
          "text": "did this because Daniel, the one he named Belteshazzar, was found to have an extraordinary spirit, as well as knowledge, understanding, and the ability to interpret dreams, explain riddles, and solve difficult problems. Summon Daniel, therefore, and he will give you the interpretation.”"
        },
        {
          "reference": "1 Kings 3:5-15",
          "text": "One night at Gibeon the LORD appeared to Solomon in a dream, and God said, “Ask, and I will give it to you!” / Solomon replied, “You have shown much loving devotion to Your servant, my father David, because he walked before You in faithfulness, righteousness, and uprightness of heart. And You have maintained this loving devotion by giving him a son to sit on his throne this very day. / And now, O LORD my God, You have made Your servant king in my father David’s place. But I am only a little child, not knowing how to go out or come in. ..."
        },
        {
          "reference": "Numbers 12:6",
          "text": "He said, “Hear now My words: If there is a prophet among you, I, the LORD, will reveal Myself to him in a vision; I will speak to him in a dream."
        },
        {
          "reference": "Acts 2:17",
          "text": "‘In the last days, God says, I will pour out My Spirit on all people. Your sons and daughters will prophesy, your young men will see visions, your old men will dream dreams."
        },
        {
          "reference": "Acts 10:10-16",
          "text": "He became hungry and wanted something to eat, but while the meal was being prepared, he fell into a trance. / He saw heaven open and something like a large sheet being let down to earth by its four corners. / It contained all kinds of four-footed animals and reptiles of the earth, as well as birds of the air. ..."
        },
        {
          "reference": "Acts 16:9-10",
          "text": "During the night, Paul had a vision of a man of Macedonia standing and pleading with him, “Come over to Macedonia and help us.” / As soon as Paul had seen the vision, we got ready to leave for Macedonia, concluding that God had called us to preach the gospel to them."
        },
        {
          "reference": "Matthew 1:20-21",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit. / She will give birth to a Son, and you are to give Him the name Jesus, because He will save His people from their sins.”"
        },
        {
          "reference": "Matthew 2:12-13",
          "text": "And having been warned in a dream not to return to Herod, they withdrew to their country by another route. / When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.”"
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Judges 7:13-15",
          "text": "And as Gideon arrived, a man was telling his friend about a dream. “Behold, I had a dream,” he said, “and I saw a loaf of barley bread come tumbling into the Midianite camp. It struck the tent so hard that the tent overturned and collapsed.” / His friend replied: “This is nothing less than the sword of Gideon son of Joash, the Israelite. God has delivered Midian and the whole camp into his hand.” / When Gideon heard the dream and its interpretation, he bowed in worship. He returned to the camp of Israel and said, “Get up, for the LORD has delivered the camp of Midian into your hand.”"
        },
        {
          "reference": "1 Samuel 28:6",
          "text": "He inquired of the LORD, but the LORD did not answer him by dreams or Urim or prophets."
        },
        {
          "reference": "Job 33:14-16",
          "text": "For God speaks in one way and in another, yet no one notices. / In a dream, in a vision in the night, when deep sleep falls upon men as they slumber on their beds, / He opens their ears and terrifies them with warnings"
        },
        {
          "reference": "Joel 2:28",
          "text": "And afterward, I will pour out My Spirit on all people. Your sons and daughters will prophesy, your old men will dream dreams, your young men will see visions."
        }
      ]
    },
    {
      "reference": "Genesis 40:10",
      "book": "Genesis",
      "chapter": 40,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "and on the vine were three branches. As soon as it budded, it blossomed, and its clusters ripened into grapes."
        },
        {
          "version": "NLT",
          "text": "The vine had three branches that began to bud and blossom, and soon it produced clusters of ripe grapes."
        },
        {
          "version": "ESV",
          "text": "and on the vine there were three branches. As soon as it budded, its blossoms shot forth, and the clusters ripened into grapes."
        },
        {
          "version": "NKJV",
          "text": "and in the vine were three branches; it was as though it budded, its blossoms shot forth, and its clusters brought forth ripe grapes."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "John 15:1-5",
          "text": "“I am the true vine, and My Father is the keeper of the vineyard. / He cuts off every branch in Me that bears no fruit, and every branch that does bear fruit, He prunes to make it even more fruitful. / You are already clean because of the word I have spoken to you. ..."
        },
        {
          "reference": "Isaiah 5:1-7",
          "text": "I will sing for my beloved a song of his vineyard: My beloved had a vineyard on a very fertile hill. / He dug it up and cleared the stones and planted the finest vines. He built a watchtower in the middle and dug out a winepress as well. He waited for the vineyard to yield good grapes, but the fruit it produced was sour! / “And now, O dwellers of Jerusalem and men of Judah, I exhort you to judge between Me and My vineyard. ..."
        },
        {
          "reference": "Matthew 21:33-41",
          "text": "Listen to another parable: There was a landowner who planted a vineyard. He put a wall around it, dug a winepress in it, and built a tower. Then he rented it out to some tenants and went away on a journey. / When the harvest time drew near, he sent his servants to the tenants to collect his share of the fruit. / But the tenants seized his servants. They beat one, killed another, and stoned a third. ..."
        },
        {
          "reference": "Psalm 80:8-16",
          "text": "You uprooted a vine from Egypt; You drove out the nations and transplanted it. / You cleared the ground for it, and it took root and filled the land. / The mountains were covered by its shade, and the mighty cedars with its branches. ..."
        },
        {
          "reference": "Ezekiel 17:3-10",
          "text": "and tell them that this is what the Lord GOD says: ‘A great eagle with great wings and long pinions, full of feathers of many colors, came to Lebanon and took away the top of the cedar. / He plucked off its topmost shoot, carried it to the land of merchants, and planted it in a city of traders. / He took some of the seed of the land and planted it in fertile soil; he placed it by abundant waters and set it out like a willow. ..."
        },
        {
          "reference": "Mark 12:1-9",
          "text": "Then Jesus began to speak to them in parables: “A man planted a vineyard. He put a wall around it, dug a wine vat, and built a watchtower. Then he rented it out to some tenants and went away on a journey. / At harvest time, he sent a servant to the tenants to collect his share of the fruit of the vineyard. / But they seized the servant, beat him, and sent him away empty-handed. ..."
        },
        {
          "reference": "Luke 13:6-9",
          "text": "Then Jesus told this parable: “A man had a fig tree that was planted in his vineyard. He went to look for fruit on it but did not find any. / So he said to the keeper of the vineyard, ‘Look, for the past three years I have come to search for fruit on this fig tree and haven’t found any. Therefore cut it down! Why should it use up the soil?’ / ‘Sir,’ the man replied, ‘leave it alone again this year, until I dig around it and fertilize it. ..."
        },
        {
          "reference": "Hosea 10:1",
          "text": "Israel was a luxuriant vine, yielding fruit for himself. The more his fruit increased, the more he increased the altars. The better his land produced, the better he made the sacred pillars."
        },
        {
          "reference": "Jeremiah 2:21",
          "text": "I had planted you like a choice vine from the very best seed. How could you turn yourself before Me into a rotten, wild vine?"
        },
        {
          "reference": "John 15:16",
          "text": "You did not choose Me, but I chose you. And I appointed you to go and bear fruit—fruit that will remain—so that whatever you ask the Father in My name, He will give you."
        },
        {
          "reference": "Numbers 6:3-4",
          "text": "he is to abstain from wine and strong drink. He must not drink vinegar made from wine or strong drink, and he must not drink any grape juice or eat fresh grapes or raisins. / All the days of his separation, he is not to eat anything that comes from the grapevine, not even the seeds or skins."
        },
        {
          "reference": "Deuteronomy 8:8",
          "text": "a land of wheat, barley, vines, fig trees, and pomegranates; a land of olive oil and honey;"
        },
        {
          "reference": "Judges 9:12-13",
          "text": "Then the trees said to the grapevine, ‘Come and reign over us.’ / But the grapevine replied, ‘Should I stop giving my wine that cheers both God and man, to hold sway over the trees?’"
        },
        {
          "reference": "1 Kings 4:25",
          "text": "Throughout the days of Solomon, Judah and Israel dwelt securely from Dan to Beersheba, each man under his own vine and his own fig tree."
        },
        {
          "reference": "1 Kings 21:1-2",
          "text": "Some time after these events, Naboth the Jezreelite owned a vineyard in Jezreel next to the palace of Ahab king of Samaria. / So Ahab said to Naboth, “Give me your vineyard to use as a vegetable garden, since it is next to my palace. I will give you a better vineyard in its place—or if you prefer, I will give you its value in silver.”"
        }
      ]
    },
    {
      "reference": "Genesis 40:11",
      "book": "Genesis",
      "chapter": 40,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Pharaoh’s cup was in my hand, and I took the grapes, squeezed them into Pharaoh’s cup and put the cup in his hand.”"
        },
        {
          "version": "NLT",
          "text": "I was holding Pharaoh’s wine cup in my hand, so I took a cluster of grapes and squeezed the juice into the cup. Then I placed the cup in Pharaoh’s hand.”"
        },
        {
          "version": "ESV",
          "text": "Pharaoh’s cup was in my hand, and I took the grapes and pressed them into Pharaoh’s cup and placed the cup in Pharaoh’s hand.”"
        },
        {
          "version": "NKJV",
          "text": "Then Pharaoh’s cup was in my hand; and I took the grapes and pressed them into Pharaoh’s cup, and placed the cup in Pharaoh’s hand.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Nehemiah 2:1",
          "text": "Now in the month of Nisan, in the twentieth year of King Artaxerxes, when wine was set before him, I took the wine and gave it to the king. I had never been sad in his presence,"
        },
        {
          "reference": "1 Kings 10:5",
          "text": "the food at his table, the seating of his servants, the service and attire of his attendants, his cupbearers, and the burnt offerings he presented at the house of the LORD, it took her breath away."
        },
        {
          "reference": "Esther 1:7",
          "text": "Beverages were served in an array of goblets of gold, each with a different design, and the royal wine flowed freely, according to the king’s bounty."
        },
        {
          "reference": "Daniel 1:5",
          "text": "The king assigned them daily provisions of the royal food and wine. They were to be trained for three years, after which they were to enter the king’s service."
        },
        {
          "reference": "Daniel 5:1-2",
          "text": "Later, King Belshazzar held a great feast for a thousand of his nobles, and he drank wine with them. / Under the influence of the wine, Belshazzar gave orders to bring in the gold and silver vessels that Nebuchadnezzar his father had taken from the temple in Jerusalem, so that the king could drink from them, along with his nobles, his wives, and his concubines."
        },
        {
          "reference": "Matthew 26:27-29",
          "text": "Then He took the cup, gave thanks, and gave it to them, saying, “Drink from it, all of you. / This is My blood of the covenant, which is poured out for many for the forgiveness of sins. / I tell you, I will not drink of this fruit of the vine from now on until that day when I drink it anew with you in My Father’s kingdom.”"
        },
        {
          "reference": "Mark 14:23-25",
          "text": "Then He took the cup, gave thanks, and gave it to them, and they all drank from it. / He said to them, “This is My blood of the covenant, which is poured out for many. / Truly I tell you, I will no longer drink of the fruit of the vine until that day when I drink it anew in the kingdom of God.”"
        },
        {
          "reference": "Luke 22:17-18",
          "text": "After taking the cup, He gave thanks and said, “Take this and divide it among yourselves. / For I tell you that I will not drink of the fruit of the vine from now on until the kingdom of God comes.”"
        },
        {
          "reference": "John 2:3-10",
          "text": "When the wine ran out, Jesus’ mother said to Him, “They have no more wine.” / “Woman, what is that to you and to Me?” Jesus replied. “My hour has not yet come.” / His mother said to the servants, “Do whatever He tells you.” ..."
        },
        {
          "reference": "John 15:1-5",
          "text": "“I am the true vine, and My Father is the keeper of the vineyard. / He cuts off every branch in Me that bears no fruit, and every branch that does bear fruit, He prunes to make it even more fruitful. / You are already clean because of the word I have spoken to you. ..."
        },
        {
          "reference": "John 19:29-30",
          "text": "A jar of sour wine was sitting there. So they soaked a sponge in the wine, put it on a stalk of hyssop, and lifted it to His mouth. / When Jesus had received the sour wine, He said, “It is finished.” And bowing His head, He yielded up His spirit."
        },
        {
          "reference": "Revelation 14:10",
          "text": "he too will drink the wine of God’s anger, poured undiluted into the cup of His wrath. And he will be tormented in fire and sulfur in the presence of the holy angels and of the Lamb."
        },
        {
          "reference": "Revelation 18:3",
          "text": "All the nations have drunk the wine of the passion of her immorality. The kings of the earth were immoral with her, and the merchants of the earth have grown wealthy from the extravagance of her luxury.”"
        },
        {
          "reference": "Psalm 104:15",
          "text": "wine that gladdens the heart of man, oil that makes his face to shine, and bread that sustains his heart."
        },
        {
          "reference": "Proverbs 3:10",
          "text": "then your barns will be filled with plenty, and your vats will overflow with new wine."
        }
      ]
    },
    {
      "reference": "Genesis 40:12",
      "book": "Genesis",
      "chapter": 40,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "“This is what it means,” Joseph said to him. “The three branches are three days."
        },
        {
          "version": "NLT",
          "text": "“This is what the dream means,” Joseph said. “The three branches represent three days."
        },
        {
          "version": "ESV",
          "text": "Then Joseph said to him, “This is its interpretation: the three branches are three days."
        },
        {
          "version": "NKJV",
          "text": "And Joseph said to him, “This is the interpretation of it: The three branches are three days."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Daniel 2:36-45",
          "text": "This was the dream; now we will tell the king its interpretation. / You, O king, are the king of kings, to whom the God of heaven has given sovereignty, power, strength, and glory. / Wherever the sons of men or beasts of the field or birds of the air dwell, He has given them into your hand and has made you ruler over them all. You are that head of gold. ..."
        },
        {
          "reference": "Daniel 4:19-27",
          "text": "For a time, Daniel, who was also known as Belteshazzar, was perplexed, and his thoughts alarmed him. So the king said, “Belteshazzar, do not let the dream or its interpretation alarm you.” “My lord,” replied Belteshazzar, “may the dream apply to those who hate you, and its interpretation to your enemies! / The tree you saw that grew large and strong, whose top reached the sky and was visible to all the earth, / whose foliage was beautiful and whose fruit was abundant, providing food for all, under which the beasts of the field lived, and in whose branches the birds of the air nested— ..."
        },
        {
          "reference": "Genesis 41:12-13",
          "text": "Now a young Hebrew was there with us, a servant of the captain of the guard. We told him our dreams and he interpreted them for us individually. / And it happened to us just as he had interpreted: I was restored to my position, and the other man was hanged.”"
        },
        {
          "reference": "Genesis 41:25-32",
          "text": "At this, Joseph said to Pharaoh, “The dreams of Pharaoh are one and the same. God has revealed to Pharaoh what He is about to do. / The seven good cows are seven years, and the seven ripe heads of grain are seven years. The dreams have the same meaning. / Moreover, the seven thin, ugly cows that came up after them are seven years, and so are the seven worthless heads of grain scorched by the east wind—they are seven years of famine. ..."
        },
        {
          "reference": "Judges 7:14",
          "text": "His friend replied: “This is nothing less than the sword of Gideon son of Joash, the Israelite. God has delivered Midian and the whole camp into his hand.”"
        },
        {
          "reference": "1 Samuel 28:6",
          "text": "He inquired of the LORD, but the LORD did not answer him by dreams or Urim or prophets."
        },
        {
          "reference": "1 Kings 3:5-15",
          "text": "One night at Gibeon the LORD appeared to Solomon in a dream, and God said, “Ask, and I will give it to you!” / Solomon replied, “You have shown much loving devotion to Your servant, my father David, because he walked before You in faithfulness, righteousness, and uprightness of heart. And You have maintained this loving devotion by giving him a son to sit on his throne this very day. / And now, O LORD my God, You have made Your servant king in my father David’s place. But I am only a little child, not knowing how to go out or come in. ..."
        },
        {
          "reference": "1 Kings 22:15-18",
          "text": "When Micaiah arrived, the king asked him, “Micaiah, should we go to war against Ramoth-gilead, or should we refrain?” “Go up and triumph,” Micaiah replied, “for the LORD will deliver it into the hand of the king.” / But the king said to him, “How many times must I make you swear not to tell me anything but the truth in the name of the LORD?” / So Micaiah declared: “I saw all Israel scattered on the hills like sheep without a shepherd. And the LORD said, ‘These people have no master; let each one return home in peace.’” ..."
        },
        {
          "reference": "2 Kings 8:10-13",
          "text": "Elisha answered, “Go and tell him, ‘You will surely recover.’ But the LORD has shown me that in fact he will die.” / Elisha fixed his gaze steadily on him until Hazael became uncomfortable. Then the man of God began to weep. / “Why is my lord weeping?” asked Hazael. “Because I know the evil you will do to the Israelites,” Elisha replied. “You will set fire to their fortresses, kill their young men with the sword, dash their little ones to pieces, and rip open their pregnant women.” ..."
        },
        {
          "reference": "Jeremiah 23:28",
          "text": "Let the prophet who has a dream retell it, but let him who has My word speak it truthfully. For what is straw compared to grain?” declares the LORD."
        },
        {
          "reference": "Matthew 1:20-21",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit. / She will give birth to a Son, and you are to give Him the name Jesus, because He will save His people from their sins.”"
        },
        {
          "reference": "Matthew 2:12-13",
          "text": "And having been warned in a dream not to return to Herod, they withdrew to their country by another route. / When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.”"
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Acts 2:17",
          "text": "‘In the last days, God says, I will pour out My Spirit on all people. Your sons and daughters will prophesy, your young men will see visions, your old men will dream dreams."
        },
        {
          "reference": "Acts 10:10-16",
          "text": "He became hungry and wanted something to eat, but while the meal was being prepared, he fell into a trance. / He saw heaven open and something like a large sheet being let down to earth by its four corners. / It contained all kinds of four-footed animals and reptiles of the earth, as well as birds of the air. ..."
        }
      ]
    },
    {
      "reference": "Genesis 40:13",
      "book": "Genesis",
      "chapter": 40,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "Within three days Pharaoh will lift up your head and restore you to your position, and you will put Pharaoh’s cup in his hand, just as you used to do when you were his cupbearer."
        },
        {
          "version": "NLT",
          "text": "Within three days Pharaoh will lift you up and restore you to your position as his chief cup-bearer."
        },
        {
          "version": "ESV",
          "text": "In three days Pharaoh will lift up your head and restore you to your office, and you shall place Pharaoh’s cup in his hand as formerly, when you were his cupbearer."
        },
        {
          "version": "NKJV",
          "text": "Now within three days Pharaoh will lift up your head and restore you to your place, and you will put Pharaoh’s cup in his hand according to the former manner, when you were his butler."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:13",
          "text": "And it happened to us just as he had interpreted: I was restored to my position, and the other man was hanged.”"
        },
        {
          "reference": "Nehemiah 2:1",
          "text": "Now in the month of Nisan, in the twentieth year of King Artaxerxes, when wine was set before him, I took the wine and gave it to the king. I had never been sad in his presence,"
        },
        {
          "reference": "Esther 1:10-11",
          "text": "On the seventh day, when the king’s heart was merry with wine, he ordered the seven eunuchs who served him—Mehuman, Biztha, Harbona, Bigtha, Abagtha, Zethar, and Carkas— / to bring Queen Vashti before him, wearing her royal crown, to display her beauty to the people and officials. For she was beautiful to behold."
        },
        {
          "reference": "1 Kings 10:5",
          "text": "the food at his table, the seating of his servants, the service and attire of his attendants, his cupbearers, and the burnt offerings he presented at the house of the LORD, it took her breath away."
        },
        {
          "reference": "2 Kings 25:27-30",
          "text": "On the twenty-seventh day of the twelfth month of the thirty-seventh year of the exile of Judah’s King Jehoiachin, in the year Evil-merodach became king of Babylon, he released King Jehoiachin of Judah from prison. / And he spoke kindly to Jehoiachin and set his throne above the thrones of the other kings who were with him in Babylon. / So Jehoiachin changed out of his prison clothes, and he dined regularly at the king’s table for the rest of his life. ..."
        },
        {
          "reference": "Daniel 1:19-20",
          "text": "And the king spoke with them, and among all the young men he found no one equal to Daniel, Hananiah, Mishael, and Azariah. So they entered the king’s service. / In every matter of wisdom and understanding about which the king consulted them, he found them ten times better than all the magicians and enchanters in his entire kingdom."
        },
        {
          "reference": "Daniel 2:25-28",
          "text": "Arioch hastily brought Daniel before the king and said to him, “I have found a man among the exiles from Judah who will tell the king the interpretation.” / The king responded to Daniel, whose name was Belteshazzar, “Are you able to tell me what I saw in the dream, as well as its interpretation?” / Daniel answered the king, “No wise man, enchanter, medium, or magician can explain to the king the mystery of which he inquires. ..."
        },
        {
          "reference": "Daniel 5:13-16",
          "text": "So Daniel was brought before the king, who asked him, “Are you Daniel, one of the exiles my father the king brought from Judah? / I have heard that the spirit of the gods is in you, and that you have insight, intelligence, and extraordinary wisdom. / Now the wise men and enchanters were brought before me to read this inscription and interpret it for me, but they could not give its interpretation. ..."
        },
        {
          "reference": "Matthew 14:6-11",
          "text": "On Herod’s birthday, however, the daughter of Herodias danced before them and pleased Herod / so much that he promised with an oath to give to her whatever she asked. / Prompted by her mother, she said, “Give me here on a platter the head of John the Baptist.” ..."
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Mark 6:21-28",
          "text": "On Herod’s birthday, her opportunity arose. Herod held a banquet for his nobles and military commanders and the leading men of Galilee. / When the daughter of Herodias came and danced, she pleased Herod and his guests, and the king said to the girl, “Ask me for whatever you wish, and I will give it to you.” / And he swore to her, “Whatever you ask of me, I will give you, up to half my kingdom!” ..."
        },
        {
          "reference": "Luke 23:42-43",
          "text": "Then he said, “Jesus, remember me when You come into Your kingdom!” / And Jesus said to him, “Truly I tell you, today you will be with Me in Paradise.”"
        },
        {
          "reference": "John 2:1-10",
          "text": "On the third day a wedding took place at Cana in Galilee. Jesus’ mother was there, / and Jesus and His disciples had also been invited to the wedding. / When the wine ran out, Jesus’ mother said to Him, “They have no more wine.” ..."
        },
        {
          "reference": "John 19:19-22",
          "text": "Pilate also had a notice posted on the cross. It read: JESUS OF NAZARETH, THE KING OF THE JEWS. / Many of the Jews read this sign, because the place where Jesus was crucified was near the city, and it was written in Hebrew, Latin, and Greek. / So the chief priests of the Jews said to Pilate, “Do not write, ‘The King of the Jews,’ but only that He said, ‘I am the King of the Jews.’” ..."
        },
        {
          "reference": "Acts 12:20-23",
          "text": "Now Herod was in a furious dispute with the people of Tyre and Sidon, and they convened before him. Having secured the support of Blastus, the king’s chamberlain, they asked for peace, because their region depended on the king’s country for food. / On the appointed day, Herod donned his royal robes, sat on his throne, and addressed the people. / And they began to shout, “This is the voice of a god, not a man!” ..."
        }
      ]
    },
    {
      "reference": "Genesis 40:14",
      "book": "Genesis",
      "chapter": 40,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "But when all goes well with you, remember me and show me kindness; mention me to Pharaoh and get me out of this prison."
        },
        {
          "version": "NLT",
          "text": "And please remember me and do me a favor when things go well for you. Mention me to Pharaoh, so he might let me out of this place."
        },
        {
          "version": "ESV",
          "text": "Only remember me, when it is well with you, and please do me the kindness to mention me to Pharaoh, and so get me out of this house."
        },
        {
          "version": "NKJV",
          "text": "But remember me when it is well with you, and please show kindness to me; make mention of me to Pharaoh, and get me out of this house."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:9-13",
          "text": "Then the chief cupbearer said to Pharaoh, “Today I recall my failures. / Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard. / One night both the chief baker and I had dreams, and each dream had its own meaning. ..."
        },
        {
          "reference": "1 Samuel 25:31",
          "text": "then my lord will have no remorse or guilt of conscience over needless bloodshed and revenge. And when the LORD has dealt well with my lord, may you remember your servant.”"
        },
        {
          "reference": "1 Samuel 20:14-15",
          "text": "And as long as I live, treat me with the LORD’s loving devotion, that I may not die, / and do not ever cut off your loving devotion from my household—not even when the LORD cuts off every one of David’s enemies from the face of the earth.”"
        },
        {
          "reference": "1 Kings 2:7",
          "text": "But show loving devotion to the sons of Barzillai the Gileadite, and let them be among those who eat at your table, because they stood by me when I fled from your brother Absalom."
        },
        {
          "reference": "Nehemiah 5:19",
          "text": "Remember me favorably, O my God, for all that I have done for this people."
        },
        {
          "reference": "Esther 6:1-3",
          "text": "That night sleep escaped the king; so he ordered the Book of Records, the Chronicles, to be brought in and read to him. / And there it was found recorded that Mordecai had exposed Bigthana and Teresh, two of the eunuchs who guarded the king’s entrance, when they had conspired to assassinate King Xerxes. / The king inquired, “What honor or dignity has been bestowed on Mordecai for this act?” “Nothing has been done for him,” replied the king’s attendants."
        },
        {
          "reference": "Psalm 105:19",
          "text": "until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Psalm 106:4",
          "text": "Remember me, O LORD, in Your favor to Your people; visit me with Your salvation,"
        },
        {
          "reference": "Proverbs 14:21",
          "text": "He who despises his neighbor sins, but blessed is he who shows kindness to the poor."
        },
        {
          "reference": "Proverbs 19:17",
          "text": "Kindness to the poor is a loan to the LORD, and He will repay the lender."
        },
        {
          "reference": "Ecclesiastes 9:15",
          "text": "Now a poor wise man was found in the city, and he saved the city by his wisdom. Yet no one remembered that poor man."
        },
        {
          "reference": "Matthew 25:36",
          "text": "I was naked and you clothed Me, I was sick and you looked after Me, I was in prison and you visited Me.’"
        },
        {
          "reference": "Luke 23:42",
          "text": "Then he said, “Jesus, remember me when You come into Your kingdom!”"
        },
        {
          "reference": "Acts 7:10",
          "text": "and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Romans 16:3-4",
          "text": "Greet Prisca and Aquila, my fellow workers in Christ Jesus, / who have risked their lives for me. Not only I but all the churches of the Gentiles are grateful to them."
        }
      ]
    },
    {
      "reference": "Genesis 40:15",
      "book": "Genesis",
      "chapter": 40,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "I was forcibly carried off from the land of the Hebrews, and even here I have done nothing to deserve being put in a dungeon.”"
        },
        {
          "version": "NLT",
          "text": "For I was kidnapped from my homeland, the land of the Hebrews, and now I’m here in prison, but I did nothing to deserve it.”"
        },
        {
          "version": "ESV",
          "text": "For I was indeed stolen out of the land of the Hebrews, and here also I have done nothing that they should put me into the pit.”"
        },
        {
          "version": "NKJV",
          "text": "For indeed I was stolen away from the land of the Hebrews; and also I have done nothing here that they should put me into the dungeon.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 39:20",
          "text": "So Joseph’s master took him and had him thrown into the prison where the king’s prisoners were confined. While Joseph was there in the prison,"
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 37:36",
          "text": "Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, an officer of Pharaoh and captain of the guard."
        },
        {
          "reference": "Genesis 41:14",
          "text": "So Pharaoh sent for Joseph, who was quickly brought out of the dungeon. After he had shaved and changed his clothes, he went in before Pharaoh."
        },
        {
          "reference": "Acts 7:11-14",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. ..."
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Acts 2:23",
          "text": "He was delivered up by God’s set plan and foreknowledge, and you, by the hands of the lawless, put Him to death by nailing Him to the cross."
        },
        {
          "reference": "Acts 4:27-28",
          "text": "In fact, this is the very city where Herod and Pontius Pilate conspired with the Gentiles and the people of Israel against Your holy servant Jesus, whom You anointed. / They carried out what Your hand and will had decided beforehand would happen."
        },
        {
          "reference": "1 Peter 2:19-20",
          "text": "For if anyone endures the pain of unjust suffering because he is conscious of God, this is to be commended. / How is it to your credit if you are beaten for doing wrong and you endure it? But if you suffer for doing good and you endure it, this is commendable before God."
        },
        {
          "reference": "1 Peter 3:17",
          "text": "For it is better, if it is God’s will, to suffer for doing good than for doing evil."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        }
      ]
    },
    {
      "reference": "Genesis 40:16",
      "book": "Genesis",
      "chapter": 40,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "When the chief baker saw that Joseph had given a favorable interpretation, he said to Joseph, “I too had a dream: On my head were three baskets of bread."
        },
        {
          "version": "NLT",
          "text": "When the chief baker saw that Joseph had given the first dream such a positive interpretation, he said to Joseph, “I had a dream, too. In my dream there were three baskets of white pastries stacked on my head."
        },
        {
          "version": "ESV",
          "text": "When the chief baker saw that the interpretation was favorable, he said to Joseph, “I also had a dream: there were three cake baskets on my head,"
        },
        {
          "version": "NKJV",
          "text": "When the chief baker saw that the interpretation was good, he said to Joseph, “I also was in my dream, and there were three white baskets on my head."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Daniel 2:36-45",
          "text": "This was the dream; now we will tell the king its interpretation. / You, O king, are the king of kings, to whom the God of heaven has given sovereignty, power, strength, and glory. / Wherever the sons of men or beasts of the field or birds of the air dwell, He has given them into your hand and has made you ruler over them all. You are that head of gold. ..."
        },
        {
          "reference": "Daniel 4:19-27",
          "text": "For a time, Daniel, who was also known as Belteshazzar, was perplexed, and his thoughts alarmed him. So the king said, “Belteshazzar, do not let the dream or its interpretation alarm you.” “My lord,” replied Belteshazzar, “may the dream apply to those who hate you, and its interpretation to your enemies! / The tree you saw that grew large and strong, whose top reached the sky and was visible to all the earth, / whose foliage was beautiful and whose fruit was abundant, providing food for all, under which the beasts of the field lived, and in whose branches the birds of the air nested— ..."
        },
        {
          "reference": "Matthew 27:19",
          "text": "While Pilate was sitting on the judgment seat, his wife sent him this message: “Have nothing to do with that innocent man, for I have suffered terribly in a dream today because of Him.”"
        },
        {
          "reference": "Acts 2:17",
          "text": "‘In the last days, God says, I will pour out My Spirit on all people. Your sons and daughters will prophesy, your young men will see visions, your old men will dream dreams."
        },
        {
          "reference": "Acts 10:10-16",
          "text": "He became hungry and wanted something to eat, but while the meal was being prepared, he fell into a trance. / He saw heaven open and something like a large sheet being let down to earth by its four corners. / It contained all kinds of four-footed animals and reptiles of the earth, as well as birds of the air. ..."
        },
        {
          "reference": "Acts 16:9",
          "text": "During the night, Paul had a vision of a man of Macedonia standing and pleading with him, “Come over to Macedonia and help us.”"
        },
        {
          "reference": "Acts 18:9-10",
          "text": "One night the Lord spoke to Paul in a vision: “Do not be afraid; keep on speaking; do not be silent. / For I am with you and no one will lay a hand on you, because I have many people in this city.”"
        },
        {
          "reference": "Acts 23:11",
          "text": "The following night the Lord stood near Paul and said, “Take courage! As you have testified about Me in Jerusalem, so also you must testify in Rome.”"
        },
        {
          "reference": "Acts 27:23-24",
          "text": "For just last night an angel of the God to whom I belong and whom I serve stood beside me / and said, ‘Do not be afraid, Paul; you must stand before Caesar. And look, God has granted you the lives of all who sail with you.’"
        },
        {
          "reference": "1 Corinthians 12:10",
          "text": "to another the working of miracles, to another prophecy, to another distinguishing between spirits, to another speaking in various tongues, and to still another the interpretation of tongues."
        },
        {
          "reference": "1 Corinthians 14:26",
          "text": "What then shall we say, brothers? When you come together, everyone has a psalm or a teaching, a revelation, a tongue, or an interpretation. All of these must be done to build up the church."
        },
        {
          "reference": "Hebrews 1:1",
          "text": "On many past occasions and in many different ways, God spoke to our fathers through the prophets."
        },
        {
          "reference": "Genesis 37:5-10",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 41:1-7",
          "text": "After two full years had passed, Pharaoh had a dream: He was standing beside the Nile, / when seven cows, sleek and well-fed, came up from the river and began to graze among the reeds. / After them, seven other cows, sickly and thin, came up from the Nile and stood beside the well-fed cows on the bank of the river. ..."
        },
        {
          "reference": "Genesis 41:12-13",
          "text": "Now a young Hebrew was there with us, a servant of the captain of the guard. We told him our dreams and he interpreted them for us individually. / And it happened to us just as he had interpreted: I was restored to my position, and the other man was hanged.”"
        }
      ]
    },
    {
      "reference": "Genesis 40:17",
      "book": "Genesis",
      "chapter": 40,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "In the top basket were all kinds of baked goods for Pharaoh, but the birds were eating them out of the basket on my head.”"
        },
        {
          "version": "NLT",
          "text": "The top basket contained all kinds of pastries for Pharaoh, but the birds came and ate them from the basket on my head.”"
        },
        {
          "version": "ESV",
          "text": "and in the uppermost basket there were all sorts of baked food for Pharaoh, but the birds were eating it out of the basket on my head.”"
        },
        {
          "version": "NKJV",
          "text": "In the uppermost basket were all kinds of baked goods for Pharaoh, and the birds ate them out of the basket on my head.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:10-13",
          "text": "Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard. / One night both the chief baker and I had dreams, and each dream had its own meaning. / Now a young Hebrew was there with us, a servant of the captain of the guard. We told him our dreams and he interpreted them for us individually. ..."
        },
        {
          "reference": "Genesis 41:16",
          "text": "“I myself cannot do it,” Joseph replied, “but God will give Pharaoh a sound answer.”"
        },
        {
          "reference": "Genesis 41:25-32",
          "text": "At this, Joseph said to Pharaoh, “The dreams of Pharaoh are one and the same. God has revealed to Pharaoh what He is about to do. / The seven good cows are seven years, and the seven ripe heads of grain are seven years. The dreams have the same meaning. / Moreover, the seven thin, ugly cows that came up after them are seven years, and so are the seven worthless heads of grain scorched by the east wind—they are seven years of famine. ..."
        },
        {
          "reference": "Genesis 41:38-40",
          "text": "So Pharaoh asked them, “Can we find anyone like this man, in whom the Spirit of God abides?” / Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.”"
        },
        {
          "reference": "Genesis 41:55-57",
          "text": "When extreme hunger came to all the land of Egypt and the people cried out to Pharaoh for food, he told all the Egyptians, “Go to Joseph and do whatever he tells you.” / When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        },
        {
          "reference": "Genesis 42:21-23",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!” / They did not realize that Joseph understood them, since there was an interpreter between them."
        },
        {
          "reference": "Genesis 42:36-38",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!” / Then Reuben said to his father, “You may kill my two sons if I fail to bring him back to you. Put him in my care, and I will return him.” / But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 44:14-17",
          "text": "When Judah and his brothers arrived at Joseph’s house, he was still there, and they fell to the ground before him. / “What is this deed you have done?” Joseph declared. “Do you not know that a man like me can surely divine the truth?” / “What can we say to my lord?” Judah replied. “How can we plead? How can we justify ourselves? God has exposed the iniquity of your servants. We are now my lord’s slaves—both we and the one who was found with the cup.” ..."
        },
        {
          "reference": "Genesis 45:4-8",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. / For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. ..."
        },
        {
          "reference": "Genesis 50:19-21",
          "text": "But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. / Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Daniel 2:27-30",
          "text": "Daniel answered the king, “No wise man, enchanter, medium, or magician can explain to the king the mystery of which he inquires. / But there is a God in heaven who reveals mysteries, and He has made known to King Nebuchadnezzar what will happen in the latter days. Your dream and the visions that came into your mind as you lay on your bed were these: / As you lay on your bed, O king, your thoughts turned to the future, and the Revealer of Mysteries made known to you what will happen. ..."
        },
        {
          "reference": "Daniel 2:47",
          "text": "The king said to Daniel, “Your God is truly the God of gods and Lord of kings, the Revealer of Mysteries, since you were able to reveal this mystery.”"
        },
        {
          "reference": "Daniel 4:18-19",
          "text": "This is the dream that I, King Nebuchadnezzar, saw. Now, Belteshazzar, tell me the interpretation, because none of the wise men of my kingdom can interpret it for me. But you are able, because the spirit of the holy gods is in you.” / For a time, Daniel, who was also known as Belteshazzar, was perplexed, and his thoughts alarmed him. So the king said, “Belteshazzar, do not let the dream or its interpretation alarm you.” “My lord,” replied Belteshazzar, “may the dream apply to those who hate you, and its interpretation to your enemies!"
        }
      ]
    },
    {
      "reference": "Genesis 40:18",
      "book": "Genesis",
      "chapter": 40,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "“This is what it means,” Joseph said. “The three baskets are three days."
        },
        {
          "version": "NLT",
          "text": "“This is what the dream means,” Joseph told him. “The three baskets also represent three days."
        },
        {
          "version": "ESV",
          "text": "And Joseph answered and said, “This is its interpretation: the three baskets are three days."
        },
        {
          "version": "NKJV",
          "text": "So Joseph answered and said, “This is the interpretation of it: The three baskets are three days."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Daniel 2:36-45",
          "text": "This was the dream; now we will tell the king its interpretation. / You, O king, are the king of kings, to whom the God of heaven has given sovereignty, power, strength, and glory. / Wherever the sons of men or beasts of the field or birds of the air dwell, He has given them into your hand and has made you ruler over them all. You are that head of gold. ..."
        },
        {
          "reference": "Daniel 4:19-27",
          "text": "For a time, Daniel, who was also known as Belteshazzar, was perplexed, and his thoughts alarmed him. So the king said, “Belteshazzar, do not let the dream or its interpretation alarm you.” “My lord,” replied Belteshazzar, “may the dream apply to those who hate you, and its interpretation to your enemies! / The tree you saw that grew large and strong, whose top reached the sky and was visible to all the earth, / whose foliage was beautiful and whose fruit was abundant, providing food for all, under which the beasts of the field lived, and in whose branches the birds of the air nested— ..."
        },
        {
          "reference": "Matthew 16:21",
          "text": "From that time on Jesus began to show His disciples that He must go to Jerusalem and suffer many things at the hands of the elders, chief priests, and scribes, and that He must be killed and on the third day be raised to life."
        },
        {
          "reference": "Matthew 26:2",
          "text": "“You know that the Passover is two days away, and the Son of Man will be handed over to be crucified.”"
        },
        {
          "reference": "Matthew 27:26",
          "text": "So Pilate released Barabbas to them. But he had Jesus flogged, and handed Him over to be crucified."
        },
        {
          "reference": "Mark 10:33-34",
          "text": "“Look, we are going up to Jerusalem, and the Son of Man will be delivered over to the chief priests and scribes. They will condemn Him to death and will deliver Him over to the Gentiles, / who will mock Him and spit on Him and flog Him and kill Him. And after three days He will rise again.”"
        },
        {
          "reference": "Mark 15:15",
          "text": "And wishing to satisfy the crowd, Pilate released Barabbas to them. But he had Jesus flogged, and handed Him over to be crucified."
        },
        {
          "reference": "Luke 18:32-33",
          "text": "He will be delivered over to the Gentiles and will be mocked and insulted and spit upon. / They will flog Him and kill Him, and on the third day He will rise again.”"
        },
        {
          "reference": "Luke 23:24",
          "text": "So Pilate sentenced that their demand be met."
        },
        {
          "reference": "John 19:16",
          "text": "Then Pilate handed Jesus over to be crucified, and the soldiers took Him away."
        },
        {
          "reference": "Acts 2:23",
          "text": "He was delivered up by God’s set plan and foreknowledge, and you, by the hands of the lawless, put Him to death by nailing Him to the cross."
        },
        {
          "reference": "Acts 4:27-28",
          "text": "In fact, this is the very city where Herod and Pontius Pilate conspired with the Gentiles and the people of Israel against Your holy servant Jesus, whom You anointed. / They carried out what Your hand and will had decided beforehand would happen."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "1 Corinthians 15:3-4",
          "text": "For what I received I passed on to you as of first importance: that Christ died for our sins according to the Scriptures, / that He was buried, that He was raised on the third day according to the Scriptures,"
        },
        {
          "reference": "1 Peter 2:23",
          "text": "When they heaped abuse on Him, He did not retaliate; when He suffered, He made no threats, but entrusted Himself to Him who judges justly."
        }
      ]
    },
    {
      "reference": "Genesis 40:19",
      "book": "Genesis",
      "chapter": 40,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "Within three days Pharaoh will lift off your head and impale your body on a pole. And the birds will eat away your flesh.”"
        },
        {
          "version": "NLT",
          "text": "Three days from now Pharaoh will lift you up and impale your body on a pole. Then birds will come and peck away at your flesh.”"
        },
        {
          "version": "ESV",
          "text": "In three days Pharaoh will lift up your head—from you!—and hang you on a tree. And the birds will eat the flesh from you.”"
        },
        {
          "version": "NKJV",
          "text": "Within three days Pharaoh will lift off your head from you and hang you on a tree; and the birds will eat your flesh from you.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 27:26",
          "text": "So Pilate released Barabbas to them. But he had Jesus flogged, and handed Him over to be crucified."
        },
        {
          "reference": "Mark 15:15",
          "text": "And wishing to satisfy the crowd, Pilate released Barabbas to them. But he had Jesus flogged, and handed Him over to be crucified."
        },
        {
          "reference": "Luke 23:24",
          "text": "So Pilate sentenced that their demand be met."
        },
        {
          "reference": "John 19:16",
          "text": "Then Pilate handed Jesus over to be crucified, and the soldiers took Him away."
        },
        {
          "reference": "Acts 12:2",
          "text": "He had James, the brother of John, put to death with the sword."
        },
        {
          "reference": "2 Kings 25:27",
          "text": "On the twenty-seventh day of the twelfth month of the thirty-seventh year of the exile of Judah’s King Jehoiachin, in the year Evil-merodach became king of Babylon, he released King Jehoiachin of Judah from prison."
        },
        {
          "reference": "Jeremiah 52:31",
          "text": "On the twenty-fifth day of the twelfth month of the thirty-seventh year of the exile of Jehoiachin king of Judah, in the first year of the reign of Evil-merodach king of Babylon, he pardoned Jehoiachin king of Judah and released him from prison."
        },
        {
          "reference": "Esther 7:10",
          "text": "So they hanged Haman on the gallows he had prepared for Mordecai. Then the fury of the king subsided."
        },
        {
          "reference": "Daniel 5:30",
          "text": "That very night Belshazzar king of the Chaldeans was slain,"
        },
        {
          "reference": "1 Samuel 31:9",
          "text": "They cut off Saul’s head, stripped off his armor, and sent messengers throughout the land of the Philistines to proclaim the news in the temples of their idols and among their people."
        },
        {
          "reference": "2 Samuel 4:12",
          "text": "So David commanded his young men, and they killed Rechab and Baanah. They cut off their hands and feet and hung their bodies by the pool in Hebron, but they took the head of Ish-bosheth and buried it in Abner’s tomb in Hebron."
        },
        {
          "reference": "2 Kings 9:30-37",
          "text": "Now when Jehu arrived in Jezreel, Jezebel heard of it. So she painted her eyes, adorned her head, and looked down from a window. / And as Jehu entered the gate, she asked, “Have you come in peace, O Zimri, murderer of your master?” / He looked up at the window and called out, “Who is on my side? Who?” And two or three eunuchs looked down at him. ..."
        },
        {
          "reference": "2 Kings 10:7",
          "text": "And when the letter arrived, they took the sons of the king and slaughtered all seventy of them. They put their heads in baskets and sent them to Jehu at Jezreel."
        },
        {
          "reference": "2 Chronicles 24:21",
          "text": "But they conspired against Zechariah, and by order of the king, they stoned him in the courtyard of the house of the LORD."
        },
        {
          "reference": "Matthew 14:10",
          "text": "and sent to have John beheaded in the prison."
        }
      ]
    },
    {
      "reference": "Genesis 40:20",
      "book": "Genesis",
      "chapter": 40,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "Now the third day was Pharaoh’s birthday, and he gave a feast for all his officials. He lifted up the heads of the chief cupbearer and the chief baker in the presence of his officials:"
        },
        {
          "version": "NLT",
          "text": "Pharaoh’s birthday came three days later, and he prepared a banquet for all his officials and staff. He summoned his chief cup-bearer and chief baker to join the other officials."
        },
        {
          "version": "ESV",
          "text": "On the third day, which was Pharaoh’s birthday, he made a feast for all his servants and lifted up the head of the chief cupbearer and the head of the chief baker among his servants."
        },
        {
          "version": "NKJV",
          "text": "Now it came to pass on the third day, which was Pharaoh’s birthday, that he made a feast for all his servants; and he lifted up the head of the chief butler and of the chief baker among his servants."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 14:6-10",
          "text": "On Herod’s birthday, however, the daughter of Herodias danced before them and pleased Herod / so much that he promised with an oath to give to her whatever she asked. / Prompted by her mother, she said, “Give me here on a platter the head of John the Baptist.” ..."
        },
        {
          "reference": "Mark 6:21-28",
          "text": "On Herod’s birthday, her opportunity arose. Herod held a banquet for his nobles and military commanders and the leading men of Galilee. / When the daughter of Herodias came and danced, she pleased Herod and his guests, and the king said to the girl, “Ask me for whatever you wish, and I will give it to you.” / And he swore to her, “Whatever you ask of me, I will give you, up to half my kingdom!” ..."
        },
        {
          "reference": "Esther 1:3-5",
          "text": "In the third year of his reign, Xerxes held a feast for all his officials and servants. The military leaders of Persia and Media were there, along with the nobles and princes of the provinces. / And for a full 180 days he displayed the glorious riches of his kingdom and the magnificent splendor of his greatness. / At the end of this time, in the garden court of the royal palace, the king held a seven-day feast for all the people in the citadel of Susa, from the least to the greatest."
        },
        {
          "reference": "Daniel 5:1-4",
          "text": "Later, King Belshazzar held a great feast for a thousand of his nobles, and he drank wine with them. / Under the influence of the wine, Belshazzar gave orders to bring in the gold and silver vessels that Nebuchadnezzar his father had taken from the temple in Jerusalem, so that the king could drink from them, along with his nobles, his wives, and his concubines. / Thus they brought in the gold vessels that had been taken from the temple, the house of God in Jerusalem, and the king drank from them, along with his nobles, his wives, and his concubines. ..."
        },
        {
          "reference": "1 Samuel 25:36-38",
          "text": "When Abigail returned to Nabal, there he was in the house, holding a feast fit for a king, in high spirits and very drunk. So she told him nothing until morning light. / In the morning when Nabal was sober, his wife told him about these events, and his heart failed within him, and he became like a stone. / About ten days later, the LORD struck Nabal dead."
        },
        {
          "reference": "2 Kings 25:27-30",
          "text": "On the twenty-seventh day of the twelfth month of the thirty-seventh year of the exile of Judah’s King Jehoiachin, in the year Evil-merodach became king of Babylon, he released King Jehoiachin of Judah from prison. / And he spoke kindly to Jehoiachin and set his throne above the thrones of the other kings who were with him in Babylon. / So Jehoiachin changed out of his prison clothes, and he dined regularly at the king’s table for the rest of his life. ..."
        },
        {
          "reference": "Matthew 27:15-26",
          "text": "Now it was the governor’s custom at the feast to release to the crowd a prisoner of their choosing. / At that time they were holding a notorious prisoner named Barabbas. / So when the crowd had assembled, Pilate asked them, “Which one do you want me to release to you: Barabbas, or Jesus who is called Christ?” ..."
        },
        {
          "reference": "Luke 23:16-25",
          "text": "Therefore I will punish Him and release Him.” / Now Pilate was obliged to release to the people one prisoner at the feast. / But they all cried out in unison: “Away with this man! Release Barabbas to us!” ..."
        },
        {
          "reference": "1 Kings 3:15",
          "text": "Then Solomon awoke, and indeed it had been a dream. So he returned to Jerusalem, stood before the ark of the covenant of the Lord, and offered burnt offerings and peace offerings. Then he held a feast for all his servants."
        },
        {
          "reference": "Hosea 7:5",
          "text": "The princes are inflamed with wine on the day of our king; so he joins hands with those who mock him."
        },
        {
          "reference": "2 Chronicles 18:9",
          "text": "Dressed in royal attire, the king of Israel and Jehoshaphat king of Judah were sitting on their thrones at the threshing floor by the entrance of the gate of Samaria, with all the prophets prophesying before them."
        },
        {
          "reference": "Nehemiah 2:1",
          "text": "Now in the month of Nisan, in the twentieth year of King Artaxerxes, when wine was set before him, I took the wine and gave it to the king. I had never been sad in his presence,"
        },
        {
          "reference": "Esther 2:18",
          "text": "Then the king held a great banquet, Esther’s banquet, for all his officials and servants. He proclaimed a tax holiday in the provinces and gave gifts worthy of the king’s bounty."
        },
        {
          "reference": "Mark 15:6-15",
          "text": "Now it was Pilate’s custom at the feast to release to the people a prisoner of their choosing. / And a man named Barabbas was imprisoned with the rebels who had committed murder during the insurrection. / So the crowd went up and began asking Pilate to keep his custom. ..."
        },
        {
          "reference": "John 18:39-40",
          "text": "But it is your custom that I release to you one prisoner at the Passover. So then, do you want me to release to you the King of the Jews?” / “Not this man,” they shouted, “but Barabbas!” (Now Barabbas was an insurrectionist.)"
        }
      ]
    },
    {
      "reference": "Genesis 40:21",
      "book": "Genesis",
      "chapter": 40,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "He restored the chief cupbearer to his position, so that he once again put the cup into Pharaoh’s hand—"
        },
        {
          "version": "NLT",
          "text": "He then restored the chief cup-bearer to his former position, so he could again hand Pharaoh his cup."
        },
        {
          "version": "ESV",
          "text": "He restored the chief cupbearer to his position, and he placed the cup in Pharaoh’s hand."
        },
        {
          "version": "NKJV",
          "text": "Then he restored the chief butler to his butlership again, and he placed the cup in Pharaoh’s hand."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:13",
          "text": "And it happened to us just as he had interpreted: I was restored to my position, and the other man was hanged.”"
        },
        {
          "reference": "Genesis 41:10-12",
          "text": "Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard. / One night both the chief baker and I had dreams, and each dream had its own meaning. / Now a young Hebrew was there with us, a servant of the captain of the guard. We told him our dreams and he interpreted them for us individually."
        },
        {
          "reference": "Esther 6:1-3",
          "text": "That night sleep escaped the king; so he ordered the Book of Records, the Chronicles, to be brought in and read to him. / And there it was found recorded that Mordecai had exposed Bigthana and Teresh, two of the eunuchs who guarded the king’s entrance, when they had conspired to assassinate King Xerxes. / The king inquired, “What honor or dignity has been bestowed on Mordecai for this act?” “Nothing has been done for him,” replied the king’s attendants."
        },
        {
          "reference": "Daniel 2:25-28",
          "text": "Arioch hastily brought Daniel before the king and said to him, “I have found a man among the exiles from Judah who will tell the king the interpretation.” / The king responded to Daniel, whose name was Belteshazzar, “Are you able to tell me what I saw in the dream, as well as its interpretation?” / Daniel answered the king, “No wise man, enchanter, medium, or magician can explain to the king the mystery of which he inquires. ..."
        },
        {
          "reference": "Daniel 5:12-14",
          "text": "did this because Daniel, the one he named Belteshazzar, was found to have an extraordinary spirit, as well as knowledge, understanding, and the ability to interpret dreams, explain riddles, and solve difficult problems. Summon Daniel, therefore, and he will give you the interpretation.” / So Daniel was brought before the king, who asked him, “Are you Daniel, one of the exiles my father the king brought from Judah? / I have heard that the spirit of the gods is in you, and that you have insight, intelligence, and extraordinary wisdom."
        },
        {
          "reference": "1 Samuel 2:7-8",
          "text": "The LORD sends poverty and wealth; He humbles and He exalts. / He raises the poor from the dust and lifts the needy from the ash heap. He seats them among princes and bestows on them a throne of honor. For the foundations of the earth are the LORD’s, and upon them He has set the world."
        },
        {
          "reference": "Psalm 75:6-7",
          "text": "For exaltation comes neither from east nor west, nor out of the desert, / but it is God who judges; He brings down one and exalts another."
        },
        {
          "reference": "Proverbs 21:1",
          "text": "The king’s heart is a waterway in the hand of the LORD; He directs it where He pleases."
        },
        {
          "reference": "Nehemiah 2:1-6",
          "text": "Now in the month of Nisan, in the twentieth year of King Artaxerxes, when wine was set before him, I took the wine and gave it to the king. I had never been sad in his presence, / so the king said to me, “Why is your face sad, though you are not ill? This could only be sadness of the heart.” I was overwhelmed with fear / and replied to the king, “May the king live forever! Why should I not be sad when the city where my fathers are buried lies in ruins, and its gates have been destroyed by fire?” ..."
        },
        {
          "reference": "Matthew 27:15-26",
          "text": "Now it was the governor’s custom at the feast to release to the crowd a prisoner of their choosing. / At that time they were holding a notorious prisoner named Barabbas. / So when the crowd had assembled, Pilate asked them, “Which one do you want me to release to you: Barabbas, or Jesus who is called Christ?” ..."
        },
        {
          "reference": "Mark 15:6-15",
          "text": "Now it was Pilate’s custom at the feast to release to the people a prisoner of their choosing. / And a man named Barabbas was imprisoned with the rebels who had committed murder during the insurrection. / So the crowd went up and began asking Pilate to keep his custom. ..."
        },
        {
          "reference": "Luke 23:16-25",
          "text": "Therefore I will punish Him and release Him.” / Now Pilate was obliged to release to the people one prisoner at the feast. / But they all cried out in unison: “Away with this man! Release Barabbas to us!” ..."
        },
        {
          "reference": "John 19:10-12",
          "text": "So Pilate said to Him, “Do You refuse to speak to me? Do You not know that I have authority to release You and authority to crucify You?” / Jesus answered, “You would have no authority over Me if it were not given to you from above. Therefore the one who handed Me over to you is guilty of greater sin.” / From then on, Pilate tried to release Him, but the Jews kept shouting, “If you release this man, you are no friend of Caesar. Anyone who declares himself a king is defying Caesar.”"
        },
        {
          "reference": "Acts 12:6-11",
          "text": "On the night before Herod was to bring him to trial, Peter was sleeping between two soldiers, bound with two chains, with sentries standing guard at the entrance to the prison. / Suddenly an angel of the Lord appeared and a light shone in the cell. He tapped Peter on the side and woke him up, saying, “Get up quickly.” And the chains fell off his wrists. / “Get dressed and put on your sandals,” said the angel. Peter did so, and the angel told him, “Wrap your cloak around you and follow me.” ..."
        },
        {
          "reference": "Acts 16:25-26",
          "text": "About midnight Paul and Silas were praying and singing hymns to God, and the other prisoners were listening to them. / Suddenly a strong earthquake shook the foundations of the prison. At once all the doors flew open and everyone’s chains came loose."
        }
      ]
    },
    {
      "reference": "Genesis 40:22",
      "book": "Genesis",
      "chapter": 40,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "but he impaled the chief baker, just as Joseph had said to them in his interpretation."
        },
        {
          "version": "NLT",
          "text": "But Pharaoh impaled the chief baker, just as Joseph had predicted when he interpreted his dream."
        },
        {
          "version": "ESV",
          "text": "But he hanged the chief baker, as Joseph had interpreted to them."
        },
        {
          "version": "NKJV",
          "text": "But he hanged the chief baker, as Joseph had interpreted to them."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:13",
          "text": "And it happened to us just as he had interpreted: I was restored to my position, and the other man was hanged.”"
        },
        {
          "reference": "Genesis 41:10-11",
          "text": "Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard. / One night both the chief baker and I had dreams, and each dream had its own meaning."
        },
        {
          "reference": "Genesis 39:20",
          "text": "So Joseph’s master took him and had him thrown into the prison where the king’s prisoners were confined. While Joseph was there in the prison,"
        },
        {
          "reference": "Genesis 41:21-23",
          "text": "When they had devoured them, however, no one could tell that they had done so; their appearance was as ugly as it had been before. Then I awoke. / In my dream I also saw seven heads of grain, plump and ripe, growing on a single stalk. / After them, seven other heads of grain sprouted—withered, thin, and scorched by the east wind."
        },
        {
          "reference": "Genesis 41:9",
          "text": "Then the chief cupbearer said to Pharaoh, “Today I recall my failures."
        },
        {
          "reference": "Genesis 37:36",
          "text": "Meanwhile, the Midianites sold Joseph in Egypt to Potiphar, an officer of Pharaoh and captain of the guard."
        },
        {
          "reference": "Genesis 42:21",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.”"
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 12:29",
          "text": "Now at midnight the LORD struck down every firstborn male in the land of Egypt, from the firstborn of Pharaoh, who sat on his throne, to the firstborn of the prisoner in the dungeon, as well as all the firstborn among the livestock."
        },
        {
          "reference": "Esther 7:10",
          "text": "So they hanged Haman on the gallows he had prepared for Mordecai. Then the fury of the king subsided."
        },
        {
          "reference": "Matthew 27:3-5",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.” / So Judas threw the silver into the temple and left. Then he went away and hanged himself."
        },
        {
          "reference": "Matthew 14:10",
          "text": "and sent to have John beheaded in the prison."
        },
        {
          "reference": "Mark 6:27-28",
          "text": "So without delay, the king commanded that John’s head be brought in. He sent an executioner, who went and beheaded him in the prison. / The man brought John’s head on a platter and presented it to the girl, who gave it to her mother."
        },
        {
          "reference": "Luke 23:39-43",
          "text": "One of the criminals who hung there heaped abuse on Him. “Are You not the Christ?” he said. “Save Yourself and us!” / But the other one rebuked him, saying, “Do you not even fear God, since you are under the same judgment? / We are punished justly, for we are receiving what our actions deserve. But this man has done nothing wrong.” ..."
        },
        {
          "reference": "Acts 12:1-2",
          "text": "About that time, King Herod reached out to harm some who belonged to the church. / He had James, the brother of John, put to death with the sword."
        }
      ]
    },
    {
      "reference": "Genesis 40:23",
      "book": "Genesis",
      "chapter": 40,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "The chief cupbearer, however, did not remember Joseph; he forgot him."
        },
        {
          "version": "NLT",
          "text": "Pharaoh’s chief cup-bearer, however, forgot all about Joseph, never giving him another thought."
        },
        {
          "version": "ESV",
          "text": "Yet the chief cupbearer did not remember Joseph, but forgot him."
        },
        {
          "version": "NKJV",
          "text": "Yet the chief butler did not remember Joseph, but forgot him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:8",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt."
        },
        {
          "reference": "Psalm 31:12",
          "text": "I am forgotten like a dead man, out of mind. I am like a broken vessel."
        },
        {
          "reference": "Psalm 105:19-22",
          "text": "until his prediction came true and the word of the LORD proved him right. / The king sent and released him; the ruler of peoples set him free. / He made him master of his household, ruler over all his substance, ..."
        },
        {
          "reference": "Ecclesiastes 9:15-16",
          "text": "Now a poor wise man was found in the city, and he saved the city by his wisdom. Yet no one remembered that poor man. / And I said, “Wisdom is better than strength, but the wisdom of the poor man is despised, and his words are not heeded.”"
        },
        {
          "reference": "Isaiah 49:15",
          "text": "“Can a woman forget her nursing child, or lack compassion for the son of her womb? Even if she could forget, I will not forget you!"
        },
        {
          "reference": "Isaiah 53:3",
          "text": "He was despised and rejected by men, a man of sorrows, acquainted with grief. Like one from whom men hide their faces, He was despised, and we esteemed Him not."
        },
        {
          "reference": "Jeremiah 23:28",
          "text": "Let the prophet who has a dream retell it, but let him who has My word speak it truthfully. For what is straw compared to grain?” declares the LORD."
        },
        {
          "reference": "Daniel 2:48-49",
          "text": "Then the king promoted Daniel and gave him many generous gifts. He made him ruler over the entire province of Babylon and chief administrator over all the wise men of Babylon. / And at Daniel’s request, the king appointed Shadrach, Meshach, and Abednego to manage the province of Babylon, while Daniel remained in the king’s court."
        },
        {
          "reference": "Daniel 5:11-14",
          "text": "There is a man in your kingdom who has the spirit of the holy gods in him. In the days of your father he was found to have insight, intelligence, and wisdom like that of the gods. Your father, King Nebuchadnezzar, appointed him chief of the magicians, enchanters, astrologers, and diviners. Your own father, the king, / did this because Daniel, the one he named Belteshazzar, was found to have an extraordinary spirit, as well as knowledge, understanding, and the ability to interpret dreams, explain riddles, and solve difficult problems. Summon Daniel, therefore, and he will give you the interpretation.” / So Daniel was brought before the king, who asked him, “Are you Daniel, one of the exiles my father the king brought from Judah? ..."
        },
        {
          "reference": "Matthew 26:75",
          "text": "Then Peter remembered the word that Jesus had spoken: “Before the rooster crows, you will deny Me three times.” And he went outside and wept bitterly."
        },
        {
          "reference": "Mark 14:72",
          "text": "And immediately the rooster crowed a second time. Then Peter remembered the word that Jesus had spoken to him: “Before the rooster crows twice, you will deny Me three times.” And he broke down and wept."
        },
        {
          "reference": "Luke 23:42-43",
          "text": "Then he said, “Jesus, remember me when You come into Your kingdom!” / And Jesus said to him, “Truly I tell you, today you will be with Me in Paradise.”"
        },
        {
          "reference": "John 13:38",
          "text": "“Will you lay down your life for Me?” Jesus replied. “Truly, truly, I tell you, before the rooster crows, you will deny Me three times."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Acts 12:11",
          "text": "Then Peter came to himself and said, “Now I know for sure that the Lord has sent His angel and rescued me from Herod’s grasp and from everything the Jewish people were anticipating.”"
        }
      ]
    }
  ]
}