{
  "book": "genesis",
  "chapter": 42,
  "verses": [
    {
      "reference": "Genesis 42:1",
      "book": "Genesis",
      "chapter": 42,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "When Jacob learned that there was grain in Egypt, he said to his sons, “Why do you just keep looking at each other?”"
        },
        {
          "version": "NLT",
          "text": "When Jacob heard that grain was available in Egypt, he said to his sons, “Why are you standing around looking at one another?"
        },
        {
          "version": "ESV",
          "text": "When Jacob learned that there was grain for sale in Egypt, he said to his sons, “Why do you look at one another?”"
        },
        {
          "version": "NKJV",
          "text": "When Jacob saw that there was grain in Egypt, Jacob said to his sons, “Why do you look at one another?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Acts 7:11-12",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit."
        },
        {
          "reference": "Genesis 41:54-57",
          "text": "the seven years of famine began, just as Joseph had said. And although there was famine in every country, there was food throughout the land of Egypt. / When extreme hunger came to all the land of Egypt and the people cried out to Pharaoh for food, he told all the Egyptians, “Go to Joseph and do whatever he tells you.” / When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. ..."
        },
        {
          "reference": "Genesis 43:1-2",
          "text": "Now the famine was still severe in the land. / So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.”"
        },
        {
          "reference": "Genesis 45:5-7",
          "text": "And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. / For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance."
        },
        {
          "reference": "Genesis 47:13-15",
          "text": "There was no food, however, in all that region, because the famine was so severe; the lands of Egypt and Canaan had been exhausted by the famine. / Joseph collected all the money to be found in the land of Egypt and the land of Canaan in exchange for the grain they were buying, and he brought it into Pharaoh’s palace. / When the money from the lands of Egypt and Canaan was gone, all the Egyptians came to Joseph and said, “Give us food. Why should we die before your eyes? For our funds have run out!”"
        },
        {
          "reference": "Nehemiah 5:3",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.”"
        },
        {
          "reference": "Psalm 105:16",
          "text": "He called down famine on the land and cut off all their supplies of food."
        },
        {
          "reference": "Acts 11:28-29",
          "text": "One of them named Agabus stood up and predicted through the Spirit that a great famine would sweep across the whole world. (This happened under Claudius.) / So the disciples, each according to his ability, decided to send relief to the brothers living in Judea."
        },
        {
          "reference": "2 Kings 8:1-2",
          "text": "Now Elisha had said to the woman whose son he had restored to life, “Arise, you and your household; go and live as a foreigner wherever you can. For the LORD has decreed that a seven-year famine will come to the land.” / So the woman had proceeded to do as the man of God had instructed. And she and her household lived as foreigners for seven years in the land of the Philistines."
        },
        {
          "reference": "Ruth 1:1",
          "text": "In the days when the judges ruled, there was a famine in the land. And a certain man from Bethlehem in Judah, with his wife and two sons, went to reside in the land of Moab."
        },
        {
          "reference": "Matthew 6:11",
          "text": "Give us this day our daily bread."
        },
        {
          "reference": "Luke 15:14",
          "text": "After he had spent all he had, a severe famine swept through that country, and he began to be in need."
        },
        {
          "reference": "John 6:35",
          "text": "Jesus answered, “I am the bread of life. Whoever comes to Me will never hunger, and whoever believes in Me will never thirst."
        },
        {
          "reference": "Matthew 25:35",
          "text": "For I was hungry and you gave Me something to eat, I was thirsty and you gave Me something to drink, I was a stranger and you took Me in,"
        },
        {
          "reference": "Luke 4:25",
          "text": "But I tell you truthfully that there were many widows in Israel in the time of Elijah, when the sky was shut for three and a half years and great famine swept over all the land."
        }
      ]
    },
    {
      "reference": "Genesis 42:2",
      "book": "Genesis",
      "chapter": 42,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "He continued, “I have heard that there is grain in Egypt. Go down there and buy some for us, so that we may live and not die.”"
        },
        {
          "version": "NLT",
          "text": "I have heard there is grain in Egypt. Go down there, and buy enough grain to keep us alive. Otherwise we’ll die.”"
        },
        {
          "version": "ESV",
          "text": "And he said, “Behold, I have heard that there is grain for sale in Egypt. Go down and buy grain for us there, that we may live and not die.”"
        },
        {
          "version": "NKJV",
          "text": "And he said, “Indeed I have heard that there is grain in Egypt; go down to that place and buy for us there, that we may live and not die.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:56-57",
          "text": "When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 43:1-2",
          "text": "Now the famine was still severe in the land. / So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.”"
        },
        {
          "reference": "Genesis 45:5-7",
          "text": "And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. / For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance."
        },
        {
          "reference": "Genesis 47:13-15",
          "text": "There was no food, however, in all that region, because the famine was so severe; the lands of Egypt and Canaan had been exhausted by the famine. / Joseph collected all the money to be found in the land of Egypt and the land of Canaan in exchange for the grain they were buying, and he brought it into Pharaoh’s palace. / When the money from the lands of Egypt and Canaan was gone, all the Egyptians came to Joseph and said, “Give us food. Why should we die before your eyes? For our funds have run out!”"
        },
        {
          "reference": "Acts 7:11-12",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit."
        },
        {
          "reference": "Genesis 12:10",
          "text": "Now there was a famine in the land. So Abram went down to Egypt to live there for a while because the famine was severe."
        },
        {
          "reference": "Genesis 26:1",
          "text": "Now there was another famine in the land, subsequent to the one that had occurred in Abraham’s time. And Isaac went to Abimelech king of the Philistines at Gerar."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Psalm 105:16-17",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Acts 11:28-29",
          "text": "One of them named Agabus stood up and predicted through the Spirit that a great famine would sweep across the whole world. (This happened under Claudius.) / So the disciples, each according to his ability, decided to send relief to the brothers living in Judea."
        },
        {
          "reference": "2 Kings 8:1-2",
          "text": "Now Elisha had said to the woman whose son he had restored to life, “Arise, you and your household; go and live as a foreigner wherever you can. For the LORD has decreed that a seven-year famine will come to the land.” / So the woman had proceeded to do as the man of God had instructed. And she and her household lived as foreigners for seven years in the land of the Philistines."
        },
        {
          "reference": "Ruth 1:1",
          "text": "In the days when the judges ruled, there was a famine in the land. And a certain man from Bethlehem in Judah, with his wife and two sons, went to reside in the land of Moab."
        },
        {
          "reference": "Matthew 2:13-15",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.” / So he got up, took the Child and His mother by night, and withdrew to Egypt, / where he stayed until the death of Herod. This fulfilled what the Lord had spoken through the prophet: “Out of Egypt I called My Son.”"
        },
        {
          "reference": "Hebrews 11:20-21",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future. / By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Luke 4:25-26",
          "text": "But I tell you truthfully that there were many widows in Israel in the time of Elijah, when the sky was shut for three and a half years and great famine swept over all the land. / Yet Elijah was not sent to any of them, but to the widow of Zarephath in Sidon."
        }
      ]
    },
    {
      "reference": "Genesis 42:3",
      "book": "Genesis",
      "chapter": 42,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Then ten of Joseph’s brothers went down to buy grain from Egypt."
        },
        {
          "version": "NLT",
          "text": "So Joseph’s ten older brothers went down to Egypt to buy grain."
        },
        {
          "version": "ESV",
          "text": "So ten of Joseph’s brothers went down to buy grain in Egypt."
        },
        {
          "version": "NKJV",
          "text": "So Joseph’s ten brothers went down to buy grain in Egypt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Genesis 43:2-5",
          "text": "So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.” / But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. ..."
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:11-13",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh."
        },
        {
          "reference": "Genesis 41:56-57",
          "text": "When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 44:1-2",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack. / Put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” So the steward did as Joseph had instructed."
        },
        {
          "reference": "Genesis 45:7-8",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt."
        },
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Genesis 47:13-15",
          "text": "There was no food, however, in all that region, because the famine was so severe; the lands of Egypt and Canaan had been exhausted by the famine. / Joseph collected all the money to be found in the land of Egypt and the land of Canaan in exchange for the grain they were buying, and he brought it into Pharaoh’s palace. / When the money from the lands of Egypt and Canaan was gone, all the Egyptians came to Joseph and said, “Give us food. Why should we die before your eyes? For our funds have run out!”"
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 39:1-2",
          "text": "Meanwhile, Joseph had been taken down to Egypt, where an Egyptian named Potiphar, an officer of Pharaoh and captain of the guard, bought him from the Ishmaelites who had taken him there. / And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 47:11-12",
          "text": "So Joseph settled his father and brothers in the land of Egypt and gave them property in the best part of the land, the district of Rameses, as Pharaoh had commanded. / Joseph also provided his father and brothers and all his father’s household with food for their families."
        }
      ]
    },
    {
      "reference": "Genesis 42:4",
      "book": "Genesis",
      "chapter": 42,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "But Jacob did not send Benjamin, Joseph’s brother, with the others, because he was afraid that harm might come to him."
        },
        {
          "version": "NLT",
          "text": "But Jacob wouldn’t let Joseph’s younger brother, Benjamin, go with them, for fear some harm might come to him."
        },
        {
          "version": "ESV",
          "text": "But Jacob did not send Benjamin, Joseph’s brother, with his brothers, for he feared that harm might happen to him."
        },
        {
          "version": "NKJV",
          "text": "But Jacob did not send Joseph’s brother Benjamin with his brothers, for he said, “Lest some calamity befall him.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 44:20",
          "text": "And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 43:14",
          "text": "May God Almighty grant you mercy before the man, that he may release your other brother along with Benjamin. As for me, if I am bereaved, I am bereaved.”"
        },
        {
          "reference": "Genesis 44:29",
          "text": "Now if you also take this one from me and harm comes to him, you will bring my gray hair down to Sheol in sorrow.’"
        },
        {
          "reference": "Genesis 44:31",
          "text": "sees that the boy is not with us, he will die. Then your servants will have brought the gray hair of your servant our father down to Sheol in sorrow."
        },
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Matthew 2:13-14",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.” / So he got up, took the Child and His mother by night, and withdrew to Egypt,"
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        },
        {
          "reference": "Matthew 18:12-14",
          "text": "What do you think? If a man has a hundred sheep and one of them goes astray, will he not leave the ninety-nine on the hills and go out to search for the one that is lost? / And if he finds it, truly I tell you, he rejoices more over that one sheep than over the ninety-nine that did not go astray. / In the same way, your Father in heaven is not willing that any of these little ones should perish."
        },
        {
          "reference": "Luke 15:4-7",
          "text": "“What man among you, if he has a hundred sheep and loses one of them, does not leave the ninety-nine in the pasture and go after the one that is lost, until he finds it? / And when he finds it, he joyfully puts it on his shoulders, / comes home, and calls together his friends and neighbors to tell them, ‘Rejoice with me, for I have found my lost sheep!’ ..."
        },
        {
          "reference": "John 11:3-6",
          "text": "So the sisters sent word to Jesus, “Lord, the one You love is sick.” / When Jesus heard this, He said, “This sickness will not end in death. No, it is for the glory of God, so that the Son of God may be glorified through it.” / Now Jesus loved Martha and her sister and Lazarus. ..."
        }
      ]
    },
    {
      "reference": "Genesis 42:5",
      "book": "Genesis",
      "chapter": 42,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "So Israel’s sons were among those who went to buy grain, for there was famine in the land of Canaan also."
        },
        {
          "version": "NLT",
          "text": "So Jacob’s sons arrived in Egypt along with others to buy food, for the famine was in Canaan as well."
        },
        {
          "version": "ESV",
          "text": "Thus the sons of Israel came to buy among the others who came, for the famine was in the land of Canaan."
        },
        {
          "version": "NKJV",
          "text": "And the sons of Israel went to buy grain among those who journeyed, for the famine was in the land of Canaan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:57",
          "text": "And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 43:1-2",
          "text": "Now the famine was still severe in the land. / So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.”"
        },
        {
          "reference": "Genesis 45:6-7",
          "text": "For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance."
        },
        {
          "reference": "Acts 7:11-12",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit."
        },
        {
          "reference": "Genesis 12:10",
          "text": "Now there was a famine in the land. So Abram went down to Egypt to live there for a while because the famine was severe."
        },
        {
          "reference": "Genesis 26:1",
          "text": "Now there was another famine in the land, subsequent to the one that had occurred in Abraham’s time. And Isaac went to Abimelech king of the Philistines at Gerar."
        },
        {
          "reference": "Genesis 47:13-15",
          "text": "There was no food, however, in all that region, because the famine was so severe; the lands of Egypt and Canaan had been exhausted by the famine. / Joseph collected all the money to be found in the land of Egypt and the land of Canaan in exchange for the grain they were buying, and he brought it into Pharaoh’s palace. / When the money from the lands of Egypt and Canaan was gone, all the Egyptians came to Joseph and said, “Give us food. Why should we die before your eyes? For our funds have run out!”"
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Nehemiah 5:3",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.”"
        },
        {
          "reference": "Psalm 105:16",
          "text": "He called down famine on the land and cut off all their supplies of food."
        },
        {
          "reference": "Isaiah 3:1",
          "text": "For behold, the Lord GOD of Hosts is about to remove from Jerusalem and Judah both supply and support: the whole supply of food and water,"
        },
        {
          "reference": "Ezekiel 4:16-17",
          "text": "Then He told me, “Son of man, I am going to cut off the supply of food in Jerusalem. They will anxiously eat bread rationed by weight, and in despair they will drink water by measure. / So they will lack food and water; they will be appalled at the sight of one another wasting away in their iniquity."
        },
        {
          "reference": "Ezekiel 5:16",
          "text": "When I shower you with the deadly arrows of famine and destruction that I will send to destroy you, I will intensify the famine against you and cut off your supply of food."
        },
        {
          "reference": "Amos 8:11",
          "text": "Behold, the days are coming, declares the Lord GOD, when I will send a famine on the land—not a famine of bread or a thirst for water, but a famine of hearing the words of the LORD."
        },
        {
          "reference": "Matthew 24:7",
          "text": "Nation will rise against nation, and kingdom against kingdom. There will be famines and earthquakes in various places."
        }
      ]
    },
    {
      "reference": "Genesis 42:6",
      "book": "Genesis",
      "chapter": 42,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Joseph was the governor of the land, the person who sold grain to all its people. So when Joseph’s brothers arrived, they bowed down to him with their faces to the ground."
        },
        {
          "version": "NLT",
          "text": "Since Joseph was governor of all Egypt and in charge of selling grain to all the people, it was to him that his brothers came. When they arrived, they bowed before him with their faces to the ground."
        },
        {
          "version": "ESV",
          "text": "Now Joseph was governor over the land. He was the one who sold to all the people of the land. And Joseph’s brothers came and bowed themselves before him with their faces to the ground."
        },
        {
          "version": "NKJV",
          "text": "Now Joseph was governor over the land; and it was he who sold to all the people of the land. And Joseph’s brothers came and bowed down before him with their faces to the earth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:7-10",
          "text": "We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” / “Do you intend to reign over us?” his brothers asked. “Will you actually rule us?” So they hated him even more because of his dream and his statements. / Then Joseph had another dream and told it to his brothers. “Look,” he said, “I had another dream, and this time the sun and moon and eleven stars were bowing down to me.” ..."
        },
        {
          "reference": "Genesis 41:41-44",
          "text": "Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.” / Then Pharaoh removed the signet ring from his finger, put it on Joseph’s finger, clothed him in garments of fine linen, and placed a gold chain around his neck. / He had Joseph ride in his second chariot, with men calling out before him, “Bow the knee!” So he placed him over all the land of Egypt. ..."
        },
        {
          "reference": "Genesis 43:26-28",
          "text": "When Joseph came home, they presented him with the gifts they had brought, and they bowed to the ground before him. / He asked if they were well, and then he asked, “How is your elderly father you told me about? Is he still alive?” / “Your servant our father is well,” they answered. “He is still alive.” And they bowed down to honor him."
        },
        {
          "reference": "Genesis 45:3-8",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. ..."
        },
        {
          "reference": "Genesis 50:18-21",
          "text": "His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. ..."
        },
        {
          "reference": "Acts 7:9-14",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "1 Kings 18:7",
          "text": "Now as Obadiah went on his way, Elijah suddenly met him. When Obadiah recognized him, he fell facedown and said, “Is it you, my lord Elijah?”"
        },
        {
          "reference": "Nehemiah 5:15",
          "text": "The governors before me had heavily burdened the people, taking from them bread and wine plus forty shekels of silver. Their servants also oppressed the people. But I did not do this, because of my fear of God."
        },
        {
          "reference": "Isaiah 60:14",
          "text": "The sons of your oppressors will come and bow down to you; all who reviled you will fall facedown at your feet and call you the City of the LORD, Zion of the Holy One of Israel."
        },
        {
          "reference": "Matthew 27:29",
          "text": "And they twisted together a crown of thorns and set it on His head. They put a staff in His right hand, knelt down before Him, and mocked Him, saying, “Hail, King of the Jews!”"
        },
        {
          "reference": "John 4:9",
          "text": "“You are a Jew,” said the woman. “How can You ask for a drink from me, a Samaritan woman?” (For Jews do not associate with Samaritans.)"
        },
        {
          "reference": "John 18:36",
          "text": "Jesus answered, “My kingdom is not of this world; if it were, My servants would fight to prevent My arrest by the Jews. But now My kingdom is not of this realm.”"
        },
        {
          "reference": "Romans 11:28-29",
          "text": "Regarding the gospel, they are enemies on your account; but regarding election, they are loved on account of the patriarchs. / For God’s gifts and His call are irrevocable."
        },
        {
          "reference": "Philippians 2:10-11",
          "text": "that at the name of Jesus every knee should bow, in heaven and on earth and under the earth, / and every tongue confess that Jesus Christ is Lord, to the glory of God the Father."
        }
      ]
    },
    {
      "reference": "Genesis 42:7",
      "book": "Genesis",
      "chapter": 42,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "As soon as Joseph saw his brothers, he recognized them, but he pretended to be a stranger and spoke harshly to them. “Where do you come from?” he asked. &#8220From the land of Canaan,” they replied, “to buy food.”"
        },
        {
          "version": "NLT",
          "text": "Joseph recognized his brothers instantly, but he pretended to be a stranger and spoke harshly to them. “Where are you from?” he demanded. “From the land of Canaan,” they replied. “We have come to buy food.”"
        },
        {
          "version": "ESV",
          "text": "Joseph saw his brothers and recognized them, but he treated them like strangers and spoke roughly to them. “Where do you come from?” he said. They said, “From the land of Canaan, to buy food.”"
        },
        {
          "version": "NKJV",
          "text": "Joseph saw his brothers and recognized them, but he acted as a stranger to them and spoke roughly to them. Then he said to them, “Where do you come from?” And they said, “From the land of Canaan to buy food.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 42:8",
      "book": "Genesis",
      "chapter": 42,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "Although Joseph recognized his brothers, they did not recognize him."
        },
        {
          "version": "NLT",
          "text": "Although Joseph recognized his brothers, they didn’t recognize him."
        },
        {
          "version": "ESV",
          "text": "And Joseph recognized his brothers, but they did not recognize him."
        },
        {
          "version": "NKJV",
          "text": "So Joseph recognized his brothers, but they did not recognize him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:5-9",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 45:1-4",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:9-13",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Genesis 41:39-44",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.” ..."
        },
        {
          "reference": "Genesis 43:26-28",
          "text": "When Joseph came home, they presented him with the gifts they had brought, and they bowed to the ground before him. / He asked if they were well, and then he asked, “How is your elderly father you told me about? Is he still alive?” / “Your servant our father is well,” they answered. “He is still alive.” And they bowed down to honor him."
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 45:14-15",
          "text": "Then Joseph threw his arms around his brother Benjamin and wept, and Benjamin wept as they embraced. / Joseph kissed each of his brothers as he wept over them. And afterward his brothers talked with him."
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Matthew 25:35-40",
          "text": "For I was hungry and you gave Me something to eat, I was thirsty and you gave Me something to drink, I was a stranger and you took Me in, / I was naked and you clothed Me, I was sick and you looked after Me, I was in prison and you visited Me.’ / Then the righteous will answer Him, ‘Lord, when did we see You hungry and feed You, or thirsty and give You something to drink? ..."
        },
        {
          "reference": "John 1:10-11",
          "text": "He was in the world, and though the world was made through Him, the world did not recognize Him. / He came to His own, and His own did not receive Him."
        },
        {
          "reference": "John 7:5",
          "text": "For even His own brothers did not believe in Him."
        },
        {
          "reference": "Luke 24:16",
          "text": "But their eyes were kept from recognizing Him."
        },
        {
          "reference": "Luke 24:31",
          "text": "Then their eyes were opened and they recognized Jesus—and He disappeared from their sight."
        },
        {
          "reference": "Acts 3:17",
          "text": "And now, brothers, I know that you acted in ignorance, as did your leaders."
        }
      ]
    },
    {
      "reference": "Genesis 42:9",
      "book": "Genesis",
      "chapter": 42,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he remembered his dreams about them and said to them, “You are spies! You have come to see where our land is unprotected.”"
        },
        {
          "version": "NLT",
          "text": "And he remembered the dreams he’d had about them many years before. He said to them, “You are spies! You have come to see how vulnerable our land has become.”"
        },
        {
          "version": "ESV",
          "text": "And Joseph remembered the dreams that he had dreamed of them. And he said to them, “You are spies; you have come to see the nakedness of the land.”"
        },
        {
          "version": "NKJV",
          "text": "Then Joseph remembered the dreams which he had dreamed about them, and said to them, “You are spies! You have come to see the nakedness of the land!”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:5-11",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 37:19-20",
          "text": "“Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!”"
        },
        {
          "reference": "Genesis 41:9-13",
          "text": "Then the chief cupbearer said to Pharaoh, “Today I recall my failures. / Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard. / One night both the chief baker and I had dreams, and each dream had its own meaning. ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Matthew 27:18",
          "text": "For he knew it was out of envy that they had handed Jesus over to him."
        },
        {
          "reference": "John 11:47-53",
          "text": "Then the chief priests and Pharisees convened the Sanhedrin and said, “What are we to do? This man is performing many signs. / If we let Him go on like this, everyone will believe in Him, and then the Romans will come and take away both our place and our nation.” / But one of them, named Caiaphas, who was high priest that year, said to them, “You know nothing at all! ..."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Acts 2:23",
          "text": "He was delivered up by God’s set plan and foreknowledge, and you, by the hands of the lawless, put Him to death by nailing Him to the cross."
        },
        {
          "reference": "Acts 3:17-18",
          "text": "And now, brothers, I know that you acted in ignorance, as did your leaders. / But in this way God has fulfilled what He foretold through all the prophets, saying that His Christ would suffer."
        },
        {
          "reference": "1 Peter 1:20",
          "text": "He was known before the foundation of the world, but was revealed in the last times for your sake."
        },
        {
          "reference": "Genesis 45:4-8",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. / For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. ..."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 39:1",
          "text": "Meanwhile, Joseph had been taken down to Egypt, where an Egyptian named Potiphar, an officer of Pharaoh and captain of the guard, bought him from the Ishmaelites who had taken him there."
        }
      ]
    },
    {
      "reference": "Genesis 42:10",
      "book": "Genesis",
      "chapter": 42,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "“No, my lord,” they answered. “Your servants have come to buy food."
        },
        {
          "version": "NLT",
          "text": "“No, my lord!” they exclaimed. “Your servants have simply come to buy food."
        },
        {
          "version": "ESV",
          "text": "They said to him, “No, my lord, your servants have come to buy food."
        },
        {
          "version": "NKJV",
          "text": "And they said to him, “No, my lord, but your servants have come to buy food."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:5-8",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 37:19-20",
          "text": "“Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!”"
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 45:7-8",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Genesis 41:55-57",
          "text": "When extreme hunger came to all the land of Egypt and the people cried out to Pharaoh for food, he told all the Egyptians, “Go to Joseph and do whatever he tells you.” / When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 47:12",
          "text": "Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Genesis 47:25",
          "text": "“You have saved our lives,” they said. “We have found favor in our lord’s eyes, and we will be Pharaoh’s servants.”"
        },
        {
          "reference": "Matthew 5:44",
          "text": "But I tell you, love your enemies and pray for those who persecute you,"
        }
      ]
    },
    {
      "reference": "Genesis 42:11",
      "book": "Genesis",
      "chapter": 42,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "We are all the sons of one man. Your servants are honest men, not spies.”"
        },
        {
          "version": "NLT",
          "text": "We are all brothers—members of the same family. We are honest men, sir! We are not spies!”"
        },
        {
          "version": "ESV",
          "text": "We are all sons of one man. We are honest men. Your servants have never been spies.”"
        },
        {
          "version": "NKJV",
          "text": "We are all one man’s sons; we are honest men; your servants are not spies.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:13-14",
          "text": "Israel said to him, “Are not your brothers pasturing the flocks at Shechem? Get ready; I am sending you to them.” “I am ready,” Joseph replied. / Then Israel told him, “Go now and see how your brothers and the flocks are faring, and bring word back to me.” So he sent him off from the Valley of Hebron. And when Joseph arrived in Shechem,"
        },
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 44:19-20",
          "text": "My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 45:3-4",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt!"
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Exodus 3:16",
          "text": "Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt."
        },
        {
          "reference": "Numbers 13:27-28",
          "text": "And they gave this account to Moses: “We went into the land to which you sent us, and indeed, it is flowing with milk and honey. Here is some of its fruit! / Nevertheless, the people living in the land are strong, and the cities are large and fortified. We even saw the descendants of Anak there."
        },
        {
          "reference": "Deuteronomy 1:25",
          "text": "They took some of the fruit of the land in their hands, carried it down to us, and brought us word: “It is a good land that the LORD our God is giving us.”"
        },
        {
          "reference": "Joshua 2:1-4",
          "text": "Then Joshua son of Nun secretly sent two spies from Shittim, saying, “Go, inspect the land, especially Jericho.” So they went and entered the house of a prostitute named Rahab and stayed there. / And it was reported to the king of Jericho: “Behold, some men of Israel have come here tonight to spy out the land.” / So the king of Jericho sent to Rahab and said, “Bring out the men who came to you and entered your house, for they have come to spy out the whole land.” ..."
        },
        {
          "reference": "1 Samuel 17:55-58",
          "text": "As Saul had watched David going out to confront the Philistine, he said to Abner the commander of the army, “Abner, whose son is this young man?” “As surely as you live, O king,” Abner replied, “I do not know.” / “Find out whose son this young man is!” said the king. / So when David returned from killing the Philistine, still holding his head in his hand, Abner took him and brought him before Saul. ..."
        },
        {
          "reference": "2 Kings 5:2-4",
          "text": "At this time the Arameans had gone out in bands and had taken a young girl from the land of Israel, and she was serving Naaman’s wife. / She said to her mistress, “If only my master would go to the prophet who is in Samaria, he would cure him of his leprosy.” / And Naaman went and told his master what the girl from the land of Israel had said."
        },
        {
          "reference": "Nehemiah 2:7-8",
          "text": "I also said to him, “If it pleases the king, may letters be given to me for the governors west of the Euphrates, so that they will grant me safe passage until I reach Judah. / And may I have a letter to Asaph, keeper of the king’s forest, so that he will give me timber to make beams for the gates of the citadel to the temple, for the city wall, and for the house I will occupy.” And because the gracious hand of my God was upon me, the king granted my requests."
        },
        {
          "reference": "Isaiah 36:16-17",
          "text": "Do not listen to Hezekiah, for this is what the king of Assyria says: Make peace with me and come out to me. Then every one of you will eat from his own vine and his own fig tree, and drink water from his own cistern, / until I come and take you away to a land like your own—a land of grain and new wine, a land of bread and vineyards."
        },
        {
          "reference": "Jeremiah 40:9-10",
          "text": "Gedaliah son of Ahikam, the son of Shaphan, swore an oath to them and their men, assuring them, “Do not be afraid to serve the Chaldeans. Live in the land and serve the king of Babylon, and it will go well with you. / As for me, I will stay in Mizpah to represent you before the Chaldeans who come to us. As for you, gather wine grapes, summer fruit, and oil, place them in your storage jars, and live in the cities you have taken.”"
        }
      ]
    },
    {
      "reference": "Genesis 42:12",
      "book": "Genesis",
      "chapter": 42,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "“No!” he said to them. “You have come to see where our land is unprotected.”"
        },
        {
          "version": "NLT",
          "text": "“Yes, you are!” Joseph insisted. “You have come to see how vulnerable our land has become.”"
        },
        {
          "version": "ESV",
          "text": "He said to them, “No, it is the nakedness of the land that you have come to see.”"
        },
        {
          "version": "NKJV",
          "text": "But he said to them, “No, but you have come to see the nakedness of the land.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:18-20",
          "text": "Now Joseph’s brothers saw him in the distance, and before he arrived, they plotted to kill him. / “Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!”"
        },
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:15-20",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Exodus 1:10",
          "text": "Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Numbers 13:32-33",
          "text": "So they gave the Israelites a bad report about the land that they had spied out: “The land we explored devours its inhabitants, and all the people we saw there are great in stature. / We even saw the Nephilim there—the descendants of Anak that come from the Nephilim! We seemed like grasshoppers in our own sight, and we must have seemed the same to them!”"
        },
        {
          "reference": "1 Samuel 17:28",
          "text": "Now when David’s oldest brother Eliab heard him speaking to the men, his anger burned against David. “Why have you come down here?” he asked. “And with whom did you leave those few sheep in the wilderness? I know your pride and wickedness of heart—you have come down to see the battle!”"
        },
        {
          "reference": "2 Kings 6:13-14",
          "text": "So the king said, “Go and see where he is, that I may send men to capture him.” On receiving the report, “Elisha is in Dothan,” / the king of Aram sent horses, chariots, and a great army. They went there by night and surrounded the city."
        },
        {
          "reference": "Nehemiah 4:11",
          "text": "And our enemies said, “Before they know or see a thing, we will come into their midst, kill them, and put an end to the work.”"
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Isaiah 29:21",
          "text": "those who indict a man with a word, who ensnare the mediator at the gate, and who with false charges deprive the innocent of justice."
        },
        {
          "reference": "Jeremiah 18:18",
          "text": "Then some said, “Come, let us make plans against Jeremiah, for the law will never be lost to the priest, nor counsel to the wise, nor an oracle to the prophet. Come, let us denounce him and pay no heed to any of his words.”"
        },
        {
          "reference": "Matthew 21:38",
          "text": "But when the tenants saw the son, they said to one another, ‘This is the heir. Come, let us kill him and take his inheritance.’"
        },
        {
          "reference": "Matthew 26:59-61",
          "text": "Now the chief priests and the whole Sanhedrin were seeking false testimony against Jesus in order to put Him to death. / But they did not find any, though many false witnesses came forward. Finally two came forward / and declared, “This man said, ‘I am able to destroy the temple of God and rebuild it in three days.’”"
        },
        {
          "reference": "Mark 12:7",
          "text": "But the tenants said to one another, ‘This is the heir. Come, let us kill him, and the inheritance will be ours.’"
        }
      ]
    },
    {
      "reference": "Genesis 42:13",
      "book": "Genesis",
      "chapter": 42,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "But they replied, “Your servants were twelve brothers, the sons of one man, who lives in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "version": "NLT",
          "text": "“Sir,” they said, “there are actually twelve of us. We, your servants, are all brothers, sons of a man living in the land of Canaan. Our youngest brother is back there with our father right now, and one of our brothers is no longer with us.”"
        },
        {
          "version": "ESV",
          "text": "And they said, “We, your servants, are twelve brothers, the sons of one man in the land of Canaan, and behold, the youngest is this day with our father, and one is no more.”"
        },
        {
          "version": "NKJV",
          "text": "And they said, “Your servants are twelve brothers, the sons of one man in the land of Canaan; and in fact, the youngest is with our father today, and one is no more.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:5-11",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 37:19-20",
          "text": "“Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!”"
        },
        {
          "reference": "Genesis 37:26-28",
          "text": "Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. / So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 44:19-20",
          "text": "My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 45:3-4",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt!"
        },
        {
          "reference": "Genesis 45:7-8",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Acts 7:18-19",
          "text": "Then another king, who knew nothing of Joseph, arose over Egypt. / He exploited our people and oppressed our fathers, forcing them to abandon their infants so they would die."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        }
      ]
    },
    {
      "reference": "Genesis 42:14",
      "book": "Genesis",
      "chapter": 42,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph said to them, “It is just as I told you: You are spies!"
        },
        {
          "version": "NLT",
          "text": "But Joseph insisted, “As I said, you are spies!"
        },
        {
          "version": "ESV",
          "text": "But Joseph said to them, “It is as I said to you. You are spies."
        },
        {
          "version": "NKJV",
          "text": "But Joseph said to them, “It is as I spoke to you, saying, ‘You are spies!’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:5-11",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 37:19-20",
          "text": "“Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!”"
        },
        {
          "reference": "Genesis 37:26-28",
          "text": "Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. / So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 44:4-6",
          "text": "They had not gone far from the city when Joseph told his steward, “Pursue the men at once, and when you overtake them, ask, ‘Why have you repaid good with evil? / Is this not the cup my master drinks from and uses for divination? What you have done is wicked!’” / When the steward overtook them, he relayed these words to them."
        },
        {
          "reference": "Genesis 44:14-17",
          "text": "When Judah and his brothers arrived at Joseph’s house, he was still there, and they fell to the ground before him. / “What is this deed you have done?” Joseph declared. “Do you not know that a man like me can surely divine the truth?” / “What can we say to my lord?” Judah replied. “How can we plead? How can we justify ourselves? God has exposed the iniquity of your servants. We are now my lord’s slaves—both we and the one who was found with the cup.” ..."
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 45:7-8",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt."
        },
        {
          "reference": "Genesis 50:19-21",
          "text": "But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. / Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 1:10",
          "text": "Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "1 Samuel 17:28",
          "text": "Now when David’s oldest brother Eliab heard him speaking to the men, his anger burned against David. “Why have you come down here?” he asked. “And with whom did you leave those few sheep in the wilderness? I know your pride and wickedness of heart—you have come down to see the battle!”"
        },
        {
          "reference": "2 Kings 9:11",
          "text": "When Jehu went out to the servants of his master, they asked, “Is everything all right? Why did this madman come to you?” “You know his kind and their babble,” he replied."
        },
        {
          "reference": "Matthew 10:16-18",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves. / But beware of men, for they will hand you over to their councils and flog you in their synagogues. / On My account you will be brought before governors and kings as witnesses to them and to the Gentiles."
        },
        {
          "reference": "Matthew 26:59-61",
          "text": "Now the chief priests and the whole Sanhedrin were seeking false testimony against Jesus in order to put Him to death. / But they did not find any, though many false witnesses came forward. Finally two came forward / and declared, “This man said, ‘I am able to destroy the temple of God and rebuild it in three days.’”"
        },
        {
          "reference": "Mark 14:55-59",
          "text": "Now the chief priests and the whole Sanhedrin were seeking testimony against Jesus to put Him to death, but they did not find any. / For many bore false witness against Jesus, but their testimony was inconsistent. / Then some men stood up and testified falsely against Him: ..."
        },
        {
          "reference": "Luke 22:31-34",
          "text": "Simon, Simon, Satan has asked to sift all of you like wheat. / But I have prayed for you, Simon, that your faith will not fail. And when you have turned back, strengthen your brothers.” / “Lord,” said Peter, “I am ready to go with You even to prison and to death.” ..."
        }
      ]
    },
    {
      "reference": "Genesis 42:15",
      "book": "Genesis",
      "chapter": 42,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "And this is how you will be tested: As surely as Pharaoh lives, you will not leave this place unless your youngest brother comes here."
        },
        {
          "version": "NLT",
          "text": "This is how I will test your story. I swear by the life of Pharaoh that you will never leave Egypt unless your youngest brother comes here!"
        },
        {
          "version": "ESV",
          "text": "By this you shall be tested: by the life of Pharaoh, you shall not go from this place unless your youngest brother comes here."
        },
        {
          "version": "NKJV",
          "text": "In this manner you shall be tested: By the life of Pharaoh, you shall not leave this place unless your youngest brother comes here."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 44:17",
          "text": "But Joseph replied, “Far be it from me to do this. The man who was found with the cup will be my slave. The rest of you may return to your father in peace.”"
        },
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 44:9-10",
          "text": "If any of your servants is found to have it, he must die, and the rest will become slaves of my lord.” / “As you say,” replied the steward. “But only the one who is found with the cup will be my slave, and the rest of you shall be free of blame.”"
        },
        {
          "reference": "Genesis 44:23",
          "text": "But you said to your servants, ‘Unless your younger brother comes down with you, you will not see my face again.’"
        },
        {
          "reference": "Genesis 44:31-34",
          "text": "sees that the boy is not with us, he will die. Then your servants will have brought the gray hair of your servant our father down to Sheol in sorrow. / Indeed, your servant guaranteed the boy’s safety to my father, saying, ‘If I do not return him to you, I will bear the guilt before you, my father, all my life.’ / Now please let your servant stay here as my lord’s slave in place of the boy. Let him return with his brothers. ..."
        },
        {
          "reference": "Genesis 45:1-3",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 20:16",
          "text": "You shall not bear false witness against your neighbor."
        },
        {
          "reference": "Numbers 32:23",
          "text": "But if you do not do this, you will certainly sin against the LORD—and be assured that your sin will find you out."
        },
        {
          "reference": "Deuteronomy 19:15",
          "text": "A lone witness is not sufficient to establish any wrongdoing or sin against a man, regardless of what offense he may have committed. A matter must be established by the testimony of two or three witnesses."
        },
        {
          "reference": "1 Kings 3:16-28",
          "text": "At that time two prostitutes came to the king and stood before him. / One woman said, “Please, my lord, this woman and I live in the same house, and I gave birth while she was in the house. / On the third day after I gave birth, this woman also had a baby. We were alone, with no one in the house but the two of us. ..."
        },
        {
          "reference": "2 Kings 5:25-27",
          "text": "When Gehazi went in and stood before his master, Elisha asked him, “Gehazi, where have you been?” “Your servant did not go anywhere,” he replied. / But Elisha questioned him, “Did not my spirit go with you when the man got down from his chariot to meet you? Is this the time to accept money and clothing, olive groves and vineyards, sheep and oxen, menservants and maidservants? / Therefore, the leprosy of Naaman will cling to you and your descendants forever!” And as Gehazi left his presence, he was leprous—as white as snow."
        },
        {
          "reference": "Proverbs 12:19",
          "text": "Truthful lips endure forever, but a lying tongue lasts only a moment."
        },
        {
          "reference": "Isaiah 11:3-4",
          "text": "And He will delight in the fear of the LORD. He will not judge by what His eyes see, and He will not decide by what His ears hear, / but with righteousness He will judge the poor, and with equity He will decide for the lowly of the earth. He will strike the earth with the rod of His mouth and slay the wicked with the breath of His lips."
        }
      ]
    },
    {
      "reference": "Genesis 42:16",
      "book": "Genesis",
      "chapter": 42,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "Send one of your number to get your brother; the rest of you will be kept in prison, so that your words may be tested to see if you are telling the truth. If you are not, then as surely as Pharaoh lives, you are spies!”"
        },
        {
          "version": "NLT",
          "text": "One of you must go and get your brother. I’ll keep the rest of you here in prison. Then we’ll find out whether or not your story is true. By the life of Pharaoh, if it turns out that you don’t have a younger brother, then I’ll know you are spies.”"
        },
        {
          "version": "ESV",
          "text": "Send one of you, and let him bring your brother, while you remain confined, that your words may be tested, whether there is truth in you. Or else, by the life of Pharaoh, surely you are spies.”"
        },
        {
          "version": "NKJV",
          "text": "Send one of you, and let him bring your brother; and you shall be kept in prison, that your words may be tested to see whether there is any truth in you; or else, by the life of Pharaoh, surely you are spies!”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 44:1-17",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack. / Put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” So the steward did as Joseph had instructed. / At daybreak, the men were sent on their way with their donkeys. ..."
        },
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 37:5-11",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 45:1-5",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 12:37-38",
          "text": "The Israelites journeyed from Rameses to Succoth with about 600,000 men on foot, besides women and children. / And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Numbers 13:1-3",
          "text": "And the LORD said to Moses, / “Send out for yourself men to spy out the land of Canaan, which I am giving to the Israelites. From each of their fathers’ tribes send one man who is a leader among them.” / So at the command of the LORD, Moses sent them out from the Wilderness of Paran. All the men were leaders of the Israelites,"
        },
        {
          "reference": "Deuteronomy 19:15",
          "text": "A lone witness is not sufficient to establish any wrongdoing or sin against a man, regardless of what offense he may have committed. A matter must be established by the testimony of two or three witnesses."
        },
        {
          "reference": "1 Kings 3:16-28",
          "text": "At that time two prostitutes came to the king and stood before him. / One woman said, “Please, my lord, this woman and I live in the same house, and I gave birth while she was in the house. / On the third day after I gave birth, this woman also had a baby. We were alone, with no one in the house but the two of us. ..."
        },
        {
          "reference": "2 Kings 7:12",
          "text": "So the king got up in the night and said to his servants, “Let me tell you what the Arameans have done to us. They know we are starving, so they have left the camp to hide in the field, thinking, ‘When they come out of the city, we will take them alive and enter the city.’”"
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Isaiah 11:11-16",
          "text": "On that day the Lord will extend His hand a second time to recover the remnant of His people from Assyria, from Egypt, from Pathros, from Cush, from Elam, from Shinar, from Hamath, and from the islands of the sea. / He will raise a banner for the nations and gather the exiles of Israel; He will collect the scattered of Judah from the four corners of the earth. / Then the jealousy of Ephraim will depart, and the adversaries of Judah will be cut off. Ephraim will no longer envy Judah, nor will Judah harass Ephraim. ..."
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        },
        {
          "reference": "Matthew 18:16",
          "text": "But if he will not listen, take one or two others along, so that ‘every matter may be established by the testimony of two or three witnesses.’"
        }
      ]
    },
    {
      "reference": "Genesis 42:17",
      "book": "Genesis",
      "chapter": 42,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "And he put them all in custody for three days."
        },
        {
          "version": "NLT",
          "text": "So Joseph put them all in prison for three days."
        },
        {
          "version": "ESV",
          "text": "And he put them all together in custody for three days."
        },
        {
          "version": "NKJV",
          "text": "So he put them all together in prison three days."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 39:20",
          "text": "So Joseph’s master took him and had him thrown into the prison where the king’s prisoners were confined. While Joseph was there in the prison,"
        },
        {
          "reference": "Genesis 40:3",
          "text": "and imprisoned them in the house of the captain of the guard, the same prison where Joseph was confined."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Acts 7:13",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh."
        },
        {
          "reference": "Acts 7:14",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Acts 7:18-19",
          "text": "Then another king, who knew nothing of Joseph, arose over Egypt. / He exploited our people and oppressed our fathers, forcing them to abandon their infants so they would die."
        },
        {
          "reference": "Acts 7:23-25",
          "text": "When Moses was forty years old, he decided to visit his brothers, the children of Israel. / And when he saw one of them being mistreated, Moses went to his defense and avenged him by striking down the Egyptian who was oppressing him. / He assumed his brothers would understand that God was using him to deliver them, but they did not."
        },
        {
          "reference": "Acts 7:27-28",
          "text": "But the man who was abusing his neighbor pushed Moses aside and said, ‘Who made you ruler and judge over us? / Do you want to kill me as you killed the Egyptian yesterday?’"
        },
        {
          "reference": "Acts 7:35",
          "text": "This Moses, whom they had rejected with the words, ‘Who made you ruler and judge?’ is the one whom God sent to be their ruler and redeemer through the angel who appeared to him in the bush."
        },
        {
          "reference": "Acts 7:37-38",
          "text": "This is the same Moses who told the Israelites, ‘God will raise up for you a prophet like me from among your brothers.’ / He was in the assembly in the wilderness with the angel who spoke to him on Mount Sinai, and with our fathers. And he received living words to pass on to us."
        },
        {
          "reference": "Acts 7:44-45",
          "text": "Our fathers had the tabernacle of the Testimony with them in the wilderness. It was constructed exactly as God had directed Moses, according to the pattern he had seen. / And our fathers who received it brought it in with Joshua when they dispossessed the nations God drove out before them. It remained until the time of David,"
        },
        {
          "reference": "Acts 7:52",
          "text": "Which of the prophets did your fathers fail to persecute? They even killed those who foretold the coming of the Righteous One. And now you are His betrayers and murderers—"
        },
        {
          "reference": "Acts 7:54",
          "text": "On hearing this, the members of the Sanhedrin were enraged, and they gnashed their teeth at him."
        },
        {
          "reference": "Acts 7:59",
          "text": "While they were stoning him, Stephen appealed, “Lord Jesus, receive my spirit.”"
        },
        {
          "reference": "Acts 7:60",
          "text": "Falling on his knees, he cried out in a loud voice, “Lord, do not hold this sin against them.” And when he had said this, he fell asleep."
        }
      ]
    },
    {
      "reference": "Genesis 42:18",
      "book": "Genesis",
      "chapter": 42,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "On the third day, Joseph said to them, &#8220Do this and you will live, for I fear God:"
        },
        {
          "version": "NLT",
          "text": "On the third day Joseph said to them, “I am a God-fearing man. If you do as I say, you will live."
        },
        {
          "version": "ESV",
          "text": "On the third day Joseph said to them, “Do this and you will live, for I fear God:"
        },
        {
          "version": "NKJV",
          "text": "Then Joseph said to them the third day, “Do this and live, for I fear God:"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 42:19",
      "book": "Genesis",
      "chapter": 42,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "If you are honest men, let one of your brothers stay here in prison, while the rest of you go and take grain back for your starving households."
        },
        {
          "version": "NLT",
          "text": "If you really are honest men, choose one of your brothers to remain in prison. The rest of you may go home with grain for your starving families."
        },
        {
          "version": "ESV",
          "text": "if you are honest men, let one of your brothers remain confined where you are in custody, and let the rest go and carry grain for the famine of your households,"
        },
        {
          "version": "NKJV",
          "text": "If you are honest men, let one of your brothers be confined to your prison house; but you, go and carry grain for the famine of your houses."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 44:33-34",
          "text": "Now please let your servant stay here as my lord’s slave in place of the boy. Let him return with his brothers. / For how can I go back to my father without the boy? I could not bear to see the misery that would overwhelm him.”"
        },
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 45:1-5",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Exodus 12:40-41",
          "text": "Now the duration of the Israelites’ stay in Egypt was 430 years. / At the end of the 430 years, to the very day, all the LORD’s divisions went out of the land of Egypt."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Matthew 5:7",
          "text": "Blessed are the merciful, for they will be shown mercy."
        },
        {
          "reference": "Matthew 6:14-15",
          "text": "For if you forgive men their trespasses, your heavenly Father will also forgive you. / But if you do not forgive men their trespasses, neither will your Father forgive yours."
        },
        {
          "reference": "Luke 6:36",
          "text": "Be merciful, just as your Father is merciful."
        },
        {
          "reference": "Luke 23:34",
          "text": "Then Jesus said, “Father, forgive them, for they do not know what they are doing.” And they divided up His garments by casting lots."
        },
        {
          "reference": "1 Corinthians 13:4-7",
          "text": "Love is patient, love is kind. It does not envy, it does not boast, it is not proud. / It is not rude, it is not self-seeking, it is not easily angered, it keeps no account of wrongs. / Love takes no pleasure in evil, but rejoices in the truth. ..."
        }
      ]
    },
    {
      "reference": "Genesis 42:20",
      "book": "Genesis",
      "chapter": 42,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "But you must bring your youngest brother to me, so that your words may be verified and that you may not die.” This they proceeded to do."
        },
        {
          "version": "NLT",
          "text": "But you must bring your youngest brother back to me. This will prove that you are telling the truth, and you will not die.” To this they agreed."
        },
        {
          "version": "ESV",
          "text": "and bring your youngest brother to me. So your words will be verified, and you shall not die.” And they did so."
        },
        {
          "version": "NKJV",
          "text": "And bring your youngest brother to me; so your words will be verified, and you shall not die.” And they did so."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 44:23",
          "text": "But you said to your servants, ‘Unless your younger brother comes down with you, you will not see my face again.’"
        },
        {
          "reference": "Genesis 37:21-22",
          "text": "When Reuben heard this, he tried to rescue Joseph from their hands. “Let us not take his life,” he said. / “Do not shed his blood. Throw him into this pit in the wilderness, but do not lay a hand on him.” Reuben said this so that he could rescue Joseph from their hands and return him to his father."
        },
        {
          "reference": "Genesis 37:26-28",
          "text": "Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. / So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 4:21",
          "text": "The LORD instructed Moses, “When you go back to Egypt, see that you perform before Pharaoh all the wonders that I have put within your power. But I will harden his heart so that he will not let the people go."
        },
        {
          "reference": "Exodus 10:1-2",
          "text": "Then the LORD said to Moses, “Go to Pharaoh, for I have hardened his heart and the hearts of his officials, that I may perform these miraculous signs of Mine among them, / and that you may tell your children and grandchildren how severely I dealt with the Egyptians when I performed miraculous signs among them, so that all of you may know that I am the LORD.”"
        },
        {
          "reference": "Deuteronomy 8:2",
          "text": "Remember that these forty years the LORD your God led you all the way in the wilderness, so that He might humble you and test you in order to know what was in your heart, whether or not you would keep His commandments."
        },
        {
          "reference": "1 Samuel 12:17-19",
          "text": "Is it not the wheat harvest today? I will call on the LORD to send thunder and rain, so that you will know and see what a great evil you have committed in the sight of the LORD by asking for a king.” / So Samuel called to the LORD, and on that day the LORD sent thunder and rain. As a result, all the people greatly feared the LORD and Samuel. / They pleaded with Samuel, “Pray to the LORD your God for your servants so that we will not die! For we have added to all our sins the evil of asking for a king.”"
        },
        {
          "reference": "2 Kings 6:21-23",
          "text": "And when the king of Israel saw them, he asked Elisha, “My father, shall I kill them? Shall I kill them?” / “Do not kill them,” he replied. “Would you kill those you have captured with your own sword or bow? Set food and water before them, that they may eat and drink and then return to their master.” / So the king prepared a great feast for them, and after they had finished eating and drinking, he sent them away, and they returned to their master. And the Aramean raiders did not come into the land of Israel again."
        },
        {
          "reference": "Psalm 105:16-19",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Isaiah 55:8-9",
          "text": "“For My thoughts are not your thoughts, neither are your ways My ways,” declares the LORD. / “For as the heavens are higher than the earth, so My ways are higher than your ways and My thoughts than your thoughts."
        },
        {
          "reference": "Matthew 5:44",
          "text": "But I tell you, love your enemies and pray for those who persecute you,"
        }
      ]
    },
    {
      "reference": "Genesis 42:21",
      "book": "Genesis",
      "chapter": 42,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "They said to one another, “Surely we are being punished because of our brother. We saw how distressed he was when he pleaded with us for his life, but we would not listen; that’s why this distress has come on us.”"
        },
        {
          "version": "NLT",
          "text": "Speaking among themselves, they said, “Clearly we are being punished because of what we did to Joseph long ago. We saw his anguish when he pleaded for his life, but we wouldn’t listen. That’s why we’re in this trouble.”"
        },
        {
          "version": "ESV",
          "text": "Then they said to one another, “In truth we are guilty concerning our brother, in that we saw the distress of his soul, when he begged us and we did not listen. That is why this distress has come upon us.”"
        },
        {
          "version": "NKJV",
          "text": "Then they said to one another, “We are truly guilty concerning our brother, for we saw the anguish of his soul when he pleaded with us, and we would not hear; therefore this distress has come upon us.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:23-28",
          "text": "So when Joseph came to his brothers, they stripped him of his robe—the robe of many colors he was wearing— / and they took him and threw him into the pit. Now the pit was empty, with no water in it. / And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. ..."
        },
        {
          "reference": "Genesis 37:18-21",
          "text": "Now Joseph’s brothers saw him in the distance, and before he arrived, they plotted to kill him. / “Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!” ..."
        },
        {
          "reference": "Genesis 37:31-33",
          "text": "Then they took Joseph’s robe, slaughtered a young goat, and dipped the robe in its blood. / They sent the robe of many colors to their father and said, “We found this. Examine it to see whether it is your son’s robe or not.” / His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!”"
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Matthew 27:3-4",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.”"
        },
        {
          "reference": "Luke 23:34",
          "text": "Then Jesus said, “Father, forgive them, for they do not know what they are doing.” And they divided up His garments by casting lots."
        },
        {
          "reference": "Romans 12:19",
          "text": "Do not avenge yourselves, beloved, but leave room for God’s wrath. For it is written: “Vengeance is Mine; I will repay, says the Lord.”"
        },
        {
          "reference": "Hebrews 10:30",
          "text": "For we know Him who said, “Vengeance is Mine; I will repay,” and again, “The Lord will judge His people.”"
        },
        {
          "reference": "1 John 3:12",
          "text": "Do not be like Cain, who belonged to the evil one and murdered his brother. And why did Cain slay him? Because his own deeds were evil, while those of his brother were righteous."
        },
        {
          "reference": "Psalm 105:17-19",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right."
        },
        {
          "reference": "Proverbs 28:13",
          "text": "He who conceals his sins will not prosper, but whoever confesses and renounces them will find mercy."
        },
        {
          "reference": "Hosea 5:15",
          "text": "Then I will return to My place until they admit their guilt and seek My face; in their affliction they will earnestly seek Me.”"
        },
        {
          "reference": "Zechariah 12:10",
          "text": "Then I will pour out on the house of David and on the people of Jerusalem a spirit of grace and prayer, and they will look on Me, the One they have pierced. They will mourn for Him as one mourns for an only child, and grieve bitterly for Him as one grieves for a firstborn son."
        }
      ]
    },
    {
      "reference": "Genesis 42:22",
      "book": "Genesis",
      "chapter": 42,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "Reuben replied, &#8220Didn’t I tell you not to sin against the boy? But you wouldn’t listen! Now we must give an accounting for his blood.”"
        },
        {
          "version": "NLT",
          "text": "“Didn’t I tell you not to sin against the boy?” Reuben asked. “But you wouldn’t listen. And now we have to answer for his blood!”"
        },
        {
          "version": "ESV",
          "text": "And Reuben answered them, “Did I not tell you not to sin against the boy? But you did not listen. So now there comes a reckoning for his blood.”"
        },
        {
          "version": "NKJV",
          "text": "And Reuben answered them, saying, “Did I not speak to you, saying, ‘Do not sin against the boy’; and you would not listen? Therefore behold, his blood is now required of us.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 42:23",
      "book": "Genesis",
      "chapter": 42,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "They did not realize that Joseph could understand them, since he was using an interpreter."
        },
        {
          "version": "NLT",
          "text": "Of course, they didn’t know that Joseph understood them, for he had been speaking to them through an interpreter."
        },
        {
          "version": "ESV",
          "text": "They did not know that Joseph understood them, for there was an interpreter between them."
        },
        {
          "version": "NKJV",
          "text": "But they did not know that Joseph understood them, for he spoke to them through an interpreter."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:1-5",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. ..."
        },
        {
          "reference": "Genesis 50:19-21",
          "text": "But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. / Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Genesis 37:5-11",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 41:39-44",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.” ..."
        },
        {
          "reference": "Genesis 50:15-18",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Acts 7:13",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh."
        },
        {
          "reference": "Genesis 37:18-28",
          "text": "Now Joseph’s brothers saw him in the distance, and before he arrived, they plotted to kill him. / “Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!” ..."
        },
        {
          "reference": "Genesis 45:14-15",
          "text": "Then Joseph threw his arms around his brother Benjamin and wept, and Benjamin wept as they embraced. / Joseph kissed each of his brothers as he wept over them. And afterward his brothers talked with him."
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Matthew 5:44",
          "text": "But I tell you, love your enemies and pray for those who persecute you,"
        },
        {
          "reference": "Genesis 41:51-52",
          "text": "Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 45:7-8",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt."
        },
        {
          "reference": "Genesis 39:2-4",
          "text": "And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master. / When his master saw that the LORD was with him and made him prosper in all he did, / Joseph found favor in his sight and became his personal attendant. Potiphar put him in charge of his household and entrusted him with everything he owned."
        }
      ]
    },
    {
      "reference": "Genesis 42:24",
      "book": "Genesis",
      "chapter": 42,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "He turned away from them and began to weep, but then came back and spoke to them again. He had Simeon taken from them and bound before their eyes."
        },
        {
          "version": "NLT",
          "text": "Now he turned away from them and began to weep. When he regained his composure, he spoke to them again. Then he chose Simeon from among them and had him tied up right before their eyes."
        },
        {
          "version": "ESV",
          "text": "Then he turned away from them and wept. And he returned to them and spoke to them. And he took Simeon from them and bound him before their eyes."
        },
        {
          "version": "NKJV",
          "text": "And he turned himself away from them and wept. Then he returned to them again, and talked with them. And he took Simeon from them and bound him before their eyes."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:30",
          "text": "Joseph hurried out because he was moved to tears for his brother, and he went to a private room to weep."
        },
        {
          "reference": "Genesis 45:1-2",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it."
        },
        {
          "reference": "Genesis 45:14-15",
          "text": "Then Joseph threw his arms around his brother Benjamin and wept, and Benjamin wept as they embraced. / Joseph kissed each of his brothers as he wept over them. And afterward his brothers talked with him."
        },
        {
          "reference": "Genesis 50:17",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept."
        },
        {
          "reference": "Exodus 2:11-12",
          "text": "One day, after Moses had grown up, he went out to his own people and observed their hard labor. He saw an Egyptian beating a Hebrew, one of his own people. / After looking this way and that and seeing no one, he struck down the Egyptian and hid his body in the sand."
        },
        {
          "reference": "1 Kings 3:26",
          "text": "Then the woman whose son was alive spoke to the king because she yearned with compassion for her son. “Please, my lord,” she said, “give her the living baby. Do not kill him!” But the other woman said, “He will be neither mine nor yours. Cut him in two!”"
        },
        {
          "reference": "2 Samuel 13:39",
          "text": "And King David longed to go to Absalom, for he had been consoled over Amnon’s death."
        },
        {
          "reference": "2 Samuel 14:1",
          "text": "Now Joab son of Zeruiah perceived that the king’s heart longed for Absalom."
        },
        {
          "reference": "Psalm 56:8",
          "text": "You have taken account of my wanderings. Put my tears in Your bottle—are they not in Your book?"
        },
        {
          "reference": "Psalm 126:5-6",
          "text": "Those who sow in tears will reap with shouts of joy. / He who goes out weeping, bearing a trail of seed, will surely return with shouts of joy, carrying sheaves of grain."
        },
        {
          "reference": "Isaiah 63:9",
          "text": "In all their distress, He too was afflicted, and the Angel of His Presence saved them. In His love and compassion He redeemed them; He lifted them up and carried them all the days of old."
        },
        {
          "reference": "Jeremiah 31:20",
          "text": "Is not Ephraim a precious son to Me, a delightful child? Though I often speak against him, I still remember him. Therefore My heart yearns for him; I have great compassion for him,” declares the LORD."
        },
        {
          "reference": "Luke 19:41",
          "text": "As Jesus approached Jerusalem and saw the city, He wept over it"
        },
        {
          "reference": "John 11:33-35",
          "text": "When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled. / “Where have you put him?” He asked. “Come and see, Lord,” they answered. / Jesus wept."
        },
        {
          "reference": "Romans 12:15",
          "text": "Rejoice with those who rejoice; weep with those who weep."
        }
      ]
    },
    {
      "reference": "Genesis 42:25",
      "book": "Genesis",
      "chapter": 42,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph gave orders to fill their bags with grain, to put each man’s silver back in his sack, and to give them provisions for their journey. After this was done for them,"
        },
        {
          "version": "NLT",
          "text": "Joseph then ordered his servants to fill the men’s sacks with grain, but he also gave secret instructions to return each brother’s payment at the top of his sack. He also gave them supplies for their journey home."
        },
        {
          "version": "ESV",
          "text": "And Joseph gave orders to fill their bags with grain, and to replace every man’s money in his sack, and to give them provisions for the journey. This was done for them."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph gave a command to fill their sacks with grain, to restore every man’s money to his sack, and to give them provisions for the journey. Thus he did for them."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:21-23",
          "text": "So the sons of Israel did as they were told. Joseph gave them wagons as Pharaoh had instructed, and he also gave them provisions for their journey. / He gave new garments to each of them, but to Benjamin he gave three hundred shekels of silver and five sets of clothes. / And he sent to his father the following: ten donkeys loaded with the best of Egypt, and ten female donkeys loaded with grain and bread and provisions for his father’s journey."
        },
        {
          "reference": "Genesis 43:11-12",
          "text": "Then their father Israel said to them, “If it must be so, then do this: Put some of the best products of the land in your packs and carry them down as a gift for the man—a little balm and a little honey, spices and myrrh, pistachios and almonds. / Take double the silver with you so that you may return the silver that was put back into the mouths of your sacks. Perhaps it was a mistake."
        },
        {
          "reference": "Genesis 44:1-2",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack. / Put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” So the steward did as Joseph had instructed."
        },
        {
          "reference": "Genesis 50:21",
          "text": "Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 16:4",
          "text": "Then the LORD said to Moses, “Behold, I will rain down bread from heaven for you. Each day the people are to go out and gather enough for that day. In this way I will test whether or not they will follow My instructions."
        },
        {
          "reference": "Matthew 5:44",
          "text": "But I tell you, love your enemies and pray for those who persecute you,"
        },
        {
          "reference": "Romans 12:20",
          "text": "On the contrary, “If your enemy is hungry, feed him; if he is thirsty, give him a drink. For in so doing, you will heap burning coals on his head.”"
        },
        {
          "reference": "Proverbs 25:21-22",
          "text": "If your enemy is hungry, give him food to eat, and if he is thirsty, give him water to drink. / For in so doing, you will heap burning coals on his head, and the LORD will reward you."
        },
        {
          "reference": "Luke 6:27-28",
          "text": "But to those of you who will listen, I say: Love your enemies, do good to those who hate you, / bless those who curse you, pray for those who mistreat you."
        },
        {
          "reference": "1 Peter 3:9",
          "text": "Do not repay evil with evil or insult with insult, but with blessing, because to this you were called so that you may inherit a blessing."
        },
        {
          "reference": "2 Kings 6:22-23",
          "text": "“Do not kill them,” he replied. “Would you kill those you have captured with your own sword or bow? Set food and water before them, that they may eat and drink and then return to their master.” / So the king prepared a great feast for them, and after they had finished eating and drinking, he sent them away, and they returned to their master. And the Aramean raiders did not come into the land of Israel again."
        },
        {
          "reference": "Deuteronomy 15:7-8",
          "text": "If there is a poor man among your brothers within any of the gates in the land that the LORD your God is giving you, then you are not to harden your heart or shut your hand from your poor brother. / Instead, you are to open your hand to him and freely loan him whatever he needs."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "1 John 3:17",
          "text": "If anyone with earthly possessions sees his brother in need, but withholds his compassion from him, how can the love of God abide in him?"
        },
        {
          "reference": "Philippians 4:19",
          "text": "And my God will supply all your needs according to His glorious riches in Christ Jesus."
        }
      ]
    },
    {
      "reference": "Genesis 42:26",
      "book": "Genesis",
      "chapter": 42,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "they loaded their grain on their donkeys and left."
        },
        {
          "version": "NLT",
          "text": "So the brothers loaded their donkeys with the grain and headed for home."
        },
        {
          "version": "ESV",
          "text": "Then they loaded their donkeys with their grain and departed."
        },
        {
          "version": "NKJV",
          "text": "So they loaded their donkeys with the grain and departed from there."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Genesis 45:21-23",
          "text": "So the sons of Israel did as they were told. Joseph gave them wagons as Pharaoh had instructed, and he also gave them provisions for their journey. / He gave new garments to each of them, but to Benjamin he gave three hundred shekels of silver and five sets of clothes. / And he sent to his father the following: ten donkeys loaded with the best of Egypt, and ten female donkeys loaded with grain and bread and provisions for his father’s journey."
        },
        {
          "reference": "Genesis 43:15",
          "text": "So the men took these gifts, along with double the amount of silver, and Benjamin as well. Then they hurried down to Egypt and stood before Joseph."
        },
        {
          "reference": "Genesis 44:1-3",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack. / Put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” So the steward did as Joseph had instructed. / At daybreak, the men were sent on their way with their donkeys."
        },
        {
          "reference": "Genesis 50:21",
          "text": "Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 12:34",
          "text": "So the people took their dough before it was leavened, carrying it on their shoulders in kneading bowls wrapped in clothing."
        },
        {
          "reference": "Exodus 16:4",
          "text": "Then the LORD said to Moses, “Behold, I will rain down bread from heaven for you. Each day the people are to go out and gather enough for that day. In this way I will test whether or not they will follow My instructions."
        },
        {
          "reference": "Deuteronomy 2:6",
          "text": "You are to pay them in silver for the food you eat and the water you drink.’”"
        },
        {
          "reference": "Deuteronomy 2:28",
          "text": "You can sell us food to eat and water to drink in exchange for silver. Only let us pass through on foot,"
        },
        {
          "reference": "1 Kings 10:2",
          "text": "She arrived in Jerusalem with a very large caravan—with camels bearing spices, gold in great abundance, and precious stones. And she came to Solomon and spoke to him all that was on her mind."
        },
        {
          "reference": "Nehemiah 5:3",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.”"
        },
        {
          "reference": "Isaiah 55:10",
          "text": "For just as rain and snow fall from heaven and do not return without watering the earth, making it bud and sprout, and providing seed to sow and food to eat,"
        },
        {
          "reference": "Matthew 25:1-4",
          "text": "“At that time the kingdom of heaven will be like ten virgins who took their lamps and went out to meet the bridegroom. / Five of them were foolish, and five were wise. / The foolish ones took their lamps but did not take along any extra oil. ..."
        },
        {
          "reference": "Matthew 25:9",
          "text": "‘No,’ said the wise ones, ‘or there may not be enough for both us and you. Instead, go to those who sell oil and buy some for yourselves.’"
        },
        {
          "reference": "Luke 12:24",
          "text": "Consider the ravens: They do not sow or reap, they have no storehouse or barn; yet God feeds them. How much more valuable you are than the birds!"
        }
      ]
    },
    {
      "reference": "Genesis 42:27",
      "book": "Genesis",
      "chapter": 42,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "At the place where they stopped for the night one of them opened his sack to get feed for his donkey, and he saw his silver in the mouth of his sack."
        },
        {
          "version": "NLT",
          "text": "But when they stopped for the night and one of them opened his sack to get grain for his donkey, he found his money in the top of his sack."
        },
        {
          "version": "ESV",
          "text": "And as one of them opened his sack to give his donkey fodder at the lodging place, he saw his money in the mouth of his sack."
        },
        {
          "version": "NKJV",
          "text": "But as one of them opened his sack to give his donkey feed at the encampment, he saw his money; and there it was, in the mouth of his sack."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:21",
          "text": "But when we came to the place we lodged for the night, we opened our sacks and, behold, each of us found his silver in the mouth of his sack! It was the full amount of our silver, and we have brought it back with us."
        },
        {
          "reference": "Genesis 44:1-2",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack. / Put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” So the steward did as Joseph had instructed."
        },
        {
          "reference": "Genesis 37:25-28",
          "text": "And as they sat down to eat a meal, they looked up and saw a caravan of Ishmaelites coming from Gilead. Their camels were carrying spices, balm, and myrrh on their way down to Egypt. / Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. ..."
        },
        {
          "reference": "Genesis 45:3",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 4:24-26",
          "text": "Now at a lodging place along the way, the LORD met Moses and was about to kill him. / But Zipporah took a flint knife, cut off her son’s foreskin, and touched it to Moses’ feet. “Surely you are a bridegroom of blood to me,” she said. / So the LORD let him alone. (When she said, “bridegroom of blood,” she was referring to the circumcision.)"
        },
        {
          "reference": "Exodus 16:15",
          "text": "When the Israelites saw it, they asked one another, “What is it?” For they did not know what it was. So Moses told them, “It is the bread that the LORD has given you to eat."
        },
        {
          "reference": "Exodus 32:1",
          "text": "Now when the people saw that Moses was delayed in coming down from the mountain, they gathered around Aaron and said, “Come, make us gods who will go before us. As for this Moses who brought us up out of the land of Egypt, we do not know what has happened to him!”"
        },
        {
          "reference": "Numbers 22:21-23",
          "text": "So in the morning Balaam got up, saddled his donkey, and went with the princes of Moab. / Then God’s anger was kindled because Balaam was going along, and the angel of the LORD stood in the road to oppose him. Balaam was riding his donkey, and his two servants were with him. / When the donkey saw the angel of the LORD standing in the road with a drawn sword in his hand, she turned off the path and went into a field. So Balaam beat her to return her to the path."
        },
        {
          "reference": "Deuteronomy 8:2",
          "text": "Remember that these forty years the LORD your God led you all the way in the wilderness, so that He might humble you and test you in order to know what was in your heart, whether or not you would keep His commandments."
        },
        {
          "reference": "Joshua 9:4-5",
          "text": "acted deceptively and set out as envoys, carrying on their donkeys worn-out sacks and old wineskins, cracked and mended. / They put worn, patched sandals on their feet and threadbare clothing on their bodies, and their whole supply of bread was dry and moldy."
        },
        {
          "reference": "1 Samuel 9:7-8",
          "text": "“If we do go,” Saul replied, “what can we give the man? For the bread in our packs is gone, and there is no gift to take to the man of God. What do we have?” / The servant answered him again. “Look,” he said, “I have here in my hand a quarter shekel of silver. I will give it to the man of God, and he will tell us our way.”"
        },
        {
          "reference": "2 Kings 7:8",
          "text": "When the lepers reached the edge of the camp, they went into a tent to eat and drink. Then they carried off the silver, gold, and clothing, and went and hid them. On returning, they entered another tent, carried off some items from there, and hid them."
        },
        {
          "reference": "Nehemiah 5:15",
          "text": "The governors before me had heavily burdened the people, taking from them bread and wine plus forty shekels of silver. Their servants also oppressed the people. But I did not do this, because of my fear of God."
        },
        {
          "reference": "Job 12:22",
          "text": "He reveals the deep things of darkness and brings deep shadows into light."
        }
      ]
    },
    {
      "reference": "Genesis 42:28",
      "book": "Genesis",
      "chapter": 42,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "“My silver has been returned,” he said to his brothers. “Here it is in my sack.” Their hearts sank and they turned to each other trembling and said, “What is this that God has done to us?”"
        },
        {
          "version": "NLT",
          "text": "“Look!” he exclaimed to his brothers. “My money has been returned; it’s here in my sack!” Then their hearts sank. Trembling, they said to each other, “What has God done to us?”"
        },
        {
          "version": "ESV",
          "text": "He said to his brothers, “My money has been put back; here it is in the mouth of my sack!” At this their hearts failed them, and they turned trembling to one another, saying, “What is this that God has done to us?”"
        },
        {
          "version": "NKJV",
          "text": "So he said to his brothers, “My money has been restored, and there it is, in my sack!” Then their hearts failed them and they were afraid, saying to one another, “What is this that God has done to us?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:23",
          "text": "“It is fine,” said the steward. “Do not be afraid. Your God, the God of your father, gave you the treasure that was in your sacks. I received your silver.” Then he brought Simeon out to them."
        },
        {
          "reference": "Genesis 44:1-2",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack. / Put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” So the steward did as Joseph had instructed."
        },
        {
          "reference": "Genesis 45:3",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 45:26",
          "text": "“Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt."
        },
        {
          "reference": "Exodus 16:15",
          "text": "When the Israelites saw it, they asked one another, “What is it?” For they did not know what it was. So Moses told them, “It is the bread that the LORD has given you to eat."
        },
        {
          "reference": "Exodus 16:19-20",
          "text": "Then Moses said to them, “No one may keep any of it until morning.” / But they did not listen to Moses; some people left part of it until morning, and it became infested with maggots and began to smell. So Moses was angry with them."
        },
        {
          "reference": "Numbers 14:1-4",
          "text": "Then the whole congregation lifted up their voices and cried out, and that night the people wept. / All the Israelites grumbled against Moses and Aaron, and the whole congregation said to them, “If only we had died in the land of Egypt, or if only we had died in this wilderness! / Why is the LORD bringing us into this land to fall by the sword? Our wives and children will become plunder. Would it not be better for us to go back to Egypt?” ..."
        },
        {
          "reference": "Deuteronomy 8:2",
          "text": "Remember that these forty years the LORD your God led you all the way in the wilderness, so that He might humble you and test you in order to know what was in your heart, whether or not you would keep His commandments."
        },
        {
          "reference": "Deuteronomy 8:16",
          "text": "He fed you in the wilderness with manna that your fathers had not known, in order to humble you and test you, so that in the end He might cause you to prosper."
        },
        {
          "reference": "1 Samuel 9:20",
          "text": "As for the donkeys you lost three days ago, do not worry about them, for they have been found. And upon whom is all the desire of Israel, if not upon you and all your father’s house?”"
        },
        {
          "reference": "2 Kings 7:9-10",
          "text": "Finally, they said to one another, “We are not doing what is right. Today is a day of good news. If we are silent and wait until morning light, our sin will overtake us. Now, therefore, let us go and tell the king’s household.” / So they went and called out to the gatekeepers of the city, saying, “We went to the Aramean camp and no one was there—not a trace—only tethered horses and donkeys, and the tents were intact.”"
        },
        {
          "reference": "Psalm 105:16-17",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Isaiah 55:8-9",
          "text": "“For My thoughts are not your thoughts, neither are your ways My ways,” declares the LORD. / “For as the heavens are higher than the earth, so My ways are higher than your ways and My thoughts than your thoughts."
        }
      ]
    },
    {
      "reference": "Genesis 42:29",
      "book": "Genesis",
      "chapter": 42,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "When they came to their father Jacob in the land of Canaan, they told him all that had happened to them. They said,"
        },
        {
          "version": "NLT",
          "text": "When the brothers came to their father, Jacob, in the land of Canaan, they told him everything that had happened to them."
        },
        {
          "version": "ESV",
          "text": "When they came to Jacob their father in the land of Canaan, they told him all that had happened to them, saying,"
        },
        {
          "version": "NKJV",
          "text": "Then they went to Jacob their father in the land of Canaan and told him all that had happened to them, saying:"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:5-11",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 45:3-8",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:9-14",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Genesis 41:56-57",
          "text": "When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 43:1-2",
          "text": "Now the famine was still severe in the land. / So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.”"
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 45:25-28",
          "text": "So the brothers went up out of Egypt and came to their father Jacob in the land of Canaan. / “Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them. / However, when they relayed all that Joseph had told them, and when he saw the wagons that Joseph had sent to carry him back, the spirit of their father Jacob was revived. ..."
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 47:12",
          "text": "Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Acts 7:11-13",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh."
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        }
      ]
    },
    {
      "reference": "Genesis 42:30",
      "book": "Genesis",
      "chapter": 42,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "“The man who is lord over the land spoke harshly to us and treated us as though we were spying on the land."
        },
        {
          "version": "NLT",
          "text": "“The man who is governor of the land spoke very harshly to us,” they told him. “He accused us of being spies scouting the land."
        },
        {
          "version": "ESV",
          "text": "“The man, the lord of the land, spoke roughly to us and took us to be spies of the land."
        },
        {
          "version": "NKJV",
          "text": "“The man who is lord of the land spoke roughly to us, and took us for spies of the country."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 44:18-20",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Acts 7:18-19",
          "text": "Then another king, who knew nothing of Joseph, arose over Egypt. / He exploited our people and oppressed our fathers, forcing them to abandon their infants so they would die."
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Hebrews 11:21-22",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff. / By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "1 Samuel 16:1-2",
          "text": "Now the LORD said to Samuel, “How long are you going to mourn for Saul, since I have rejected him as king over Israel? Fill your horn with oil and go. I am sending you to Jesse of Bethlehem, for I have selected from his sons a king for Myself.” / “How can I go?” Samuel asked. “Saul will hear of it and kill me!” The LORD answered, “Take a heifer with you and say, ‘I have come to sacrifice to the LORD.’"
        },
        {
          "reference": "2 Kings 8:7-15",
          "text": "Then Elisha came to Damascus while Ben-hadad king of Aram was sick, and the king was told, “The man of God has come here.” / So the king said to Hazael, “Take a gift in your hand, go to meet the man of God, and inquire of the LORD through him, ‘Will I recover from this illness?’” / So Hazael went to meet Elisha, taking with him a gift of forty camel loads of every good thing from Damascus. And he went in and stood before him and said, “Your son Ben-hadad king of Aram has sent me to ask, ‘Will I recover from this illness?’” ..."
        },
        {
          "reference": "Matthew 10:16-18",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves. / But beware of men, for they will hand you over to their councils and flog you in their synagogues. / On My account you will be brought before governors and kings as witnesses to them and to the Gentiles."
        },
        {
          "reference": "Matthew 25:35-40",
          "text": "For I was hungry and you gave Me something to eat, I was thirsty and you gave Me something to drink, I was a stranger and you took Me in, / I was naked and you clothed Me, I was sick and you looked after Me, I was in prison and you visited Me.’ / Then the righteous will answer Him, ‘Lord, when did we see You hungry and feed You, or thirsty and give You something to drink? ..."
        }
      ]
    },
    {
      "reference": "Genesis 42:31",
      "book": "Genesis",
      "chapter": 42,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "But we said to him, ‘We are honest men; we are not spies."
        },
        {
          "version": "NLT",
          "text": "But we said, ‘We are honest men, not spies."
        },
        {
          "version": "ESV",
          "text": "But we said to him, ‘We are honest men; we have never been spies."
        },
        {
          "version": "NKJV",
          "text": "But we said to him, ‘We are honest men; we are not spies."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:5-11",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 44:19-20",
          "text": "My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 43:7",
          "text": "They replied, “The man questioned us in detail about ourselves and our family: ‘Is your father still alive? Do you have another brother?’ And we answered him accordingly. How could we possibly know that he would say, ‘Bring your brother here’?”"
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Exodus 1:10",
          "text": "Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 20:16",
          "text": "You shall not bear false witness against your neighbor."
        },
        {
          "reference": "Numbers 32:23",
          "text": "But if you do not do this, you will certainly sin against the LORD—and be assured that your sin will find you out."
        },
        {
          "reference": "Deuteronomy 19:16-19",
          "text": "If a false witness testifies against someone, accusing him of a crime, / both parties to the dispute must stand in the presence of the LORD, before the priests and judges who are in office at that time. / The judges shall investigate thoroughly, and if the witness is proven to be a liar who has falsely accused his brother, ..."
        },
        {
          "reference": "1 Samuel 24:9",
          "text": "and said to Saul, “Why do you listen to the words of men who say, ‘Look, David intends to harm you’?"
        },
        {
          "reference": "2 Kings 5:25-27",
          "text": "When Gehazi went in and stood before his master, Elisha asked him, “Gehazi, where have you been?” “Your servant did not go anywhere,” he replied. / But Elisha questioned him, “Did not my spirit go with you when the man got down from his chariot to meet you? Is this the time to accept money and clothing, olive groves and vineyards, sheep and oxen, menservants and maidservants? / Therefore, the leprosy of Naaman will cling to you and your descendants forever!” And as Gehazi left his presence, he was leprous—as white as snow."
        },
        {
          "reference": "Psalm 120:2-3",
          "text": "Deliver my soul, O LORD, from lying lips and a deceitful tongue. / What will He do to you, and what will be added to you, O deceitful tongue?"
        },
        {
          "reference": "Proverbs 12:19",
          "text": "Truthful lips endure forever, but a lying tongue lasts only a moment."
        },
        {
          "reference": "Proverbs 19:5",
          "text": "A false witness will not go unpunished, and one who utters lies will not escape."
        },
        {
          "reference": "Isaiah 29:21",
          "text": "those who indict a man with a word, who ensnare the mediator at the gate, and who with false charges deprive the innocent of justice."
        }
      ]
    },
    {
      "reference": "Genesis 42:32",
      "book": "Genesis",
      "chapter": 42,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "We were twelve brothers, sons of one father. One is no more, and the youngest is now with our father in Canaan.’"
        },
        {
          "version": "NLT",
          "text": "We are twelve brothers, sons of one father. One brother is no longer with us, and the youngest is at home with our father in the land of Canaan.’"
        },
        {
          "version": "ESV",
          "text": "We are twelve brothers, sons of our father. One is no more, and the youngest is this day with our father in the land of Canaan.’"
        },
        {
          "version": "NKJV",
          "text": "We are twelve brothers, sons of our father; one is no more, and the youngest is with our father this day in the land of Canaan.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:9-11",
          "text": "Then Joseph had another dream and told it to his brothers. “Look,” he said, “I had another dream, and this time the sun and moon and eleven stars were bowing down to me.” / He told his father and brothers, but his father rebuked him and said, “What is this dream that you have had? Will your mother and brothers and I actually come and bow down to the ground before you?” / And his brothers were jealous of him, but his father kept in mind what he had said."
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 44:19-20",
          "text": "My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 45:1-4",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. ..."
        },
        {
          "reference": "Genesis 37:23-24",
          "text": "So when Joseph came to his brothers, they stripped him of his robe—the robe of many colors he was wearing— / and they took him and threw him into the pit. Now the pit was empty, with no water in it."
        },
        {
          "reference": "Genesis 44:30-34",
          "text": "So if the boy is not with us when I return to your servant, and if my father, whose life is wrapped up in the boy’s life, / sees that the boy is not with us, he will die. Then your servants will have brought the gray hair of your servant our father down to Sheol in sorrow. / Indeed, your servant guaranteed the boy’s safety to my father, saying, ‘If I do not return him to you, I will bear the guilt before you, my father, all my life.’ ..."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 45:14-15",
          "text": "Then Joseph threw his arms around his brother Benjamin and wept, and Benjamin wept as they embraced. / Joseph kissed each of his brothers as he wept over them. And afterward his brothers talked with him."
        },
        {
          "reference": "Genesis 37:31-33",
          "text": "Then they took Joseph’s robe, slaughtered a young goat, and dipped the robe in its blood. / They sent the robe of many colors to their father and said, “We found this. Examine it to see whether it is your son’s robe or not.” / His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!”"
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Matthew 10:21",
          "text": "Brother will betray brother to death, and a father his child; children will rise against their parents and have them put to death."
        },
        {
          "reference": "Luke 15:11-32",
          "text": "Then Jesus said, “There was a man who had two sons. / The younger son said to him, ‘Father, give me my share of the estate.’ So he divided his property between them. / After a few days, the younger son got everything together and journeyed to a distant country, where he squandered his wealth in wild living. ..."
        }
      ]
    },
    {
      "reference": "Genesis 42:33",
      "book": "Genesis",
      "chapter": 42,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "“Then the man who is lord over the land said to us, ‘This is how I will know whether you are honest men: Leave one of your brothers here with me, and take food for your starving households and go."
        },
        {
          "version": "NLT",
          "text": "“Then the man who is governor of the land told us, ‘This is how I will find out if you are honest men. Leave one of your brothers here with me, and take grain for your starving families and go on home."
        },
        {
          "version": "ESV",
          "text": "Then the man, the lord of the land, said to us, ‘By this I shall know that you are honest men: leave one of your brothers with me, and take grain for the famine of your households, and go your way."
        },
        {
          "version": "NKJV",
          "text": "Then the man, the lord of the country, said to us, ‘By this I will know that you are honest men: Leave one of your brothers here with me, take food for the famine of your households, and be gone."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 44:23",
          "text": "But you said to your servants, ‘Unless your younger brother comes down with you, you will not see my face again.’"
        },
        {
          "reference": "Genesis 45:19-20",
          "text": "You are also directed to tell them: ‘Take wagons from the land of Egypt for your young children and your wives, and bring your father and come back. / But pay no regard to your belongings, for the best of all the land of Egypt is yours.’”"
        },
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Exodus 3:16-17",
          "text": "Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt. / And I have promised to bring you up out of your affliction in Egypt, into the land of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites—a land flowing with milk and honey.’"
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Numbers 14:30-31",
          "text": "Surely none of you will enter the land in which I swore to settle you, except Caleb son of Jephunneh and Joshua son of Nun. / But I will bring your children, whom you said would become plunder, into the land you have rejected—and they will enjoy it."
        },
        {
          "reference": "Deuteronomy 31:23",
          "text": "Then the LORD commissioned Joshua son of Nun and said, “Be strong and courageous, for you will bring the Israelites into the land that I swore to give them, and I will be with you.”"
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Acts 7:9-16",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Acts 7:18-19",
          "text": "Then another king, who knew nothing of Joseph, arose over Egypt. / He exploited our people and oppressed our fathers, forcing them to abandon their infants so they would die."
        },
        {
          "reference": "Acts 7:34",
          "text": "I have indeed seen the oppression of My people in Egypt. I have heard their groaning and have come down to deliver them. Now come, I will send you back to Egypt.’"
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        }
      ]
    },
    {
      "reference": "Genesis 42:34",
      "book": "Genesis",
      "chapter": 42,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "But bring your youngest brother to me so I will know that you are not spies but honest men. Then I will give your brother back to you, and you can trade in the land.’”"
        },
        {
          "version": "NLT",
          "text": "But you must bring your youngest brother back to me. Then I will know you are honest men and not spies. Then I will give you back your brother, and you may trade freely in the land.’”"
        },
        {
          "version": "ESV",
          "text": "Bring your youngest brother to me. Then I shall know that you are not spies but honest men, and I will deliver your brother to you, and you shall trade in the land.’”"
        },
        {
          "version": "NKJV",
          "text": "And bring your youngest brother to me; so I shall know that you are not spies, but that you are honest men. I will grant your brother to you, and you may trade in the land.’ ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 44:23",
          "text": "But you said to your servants, ‘Unless your younger brother comes down with you, you will not see my face again.’"
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 47:12",
          "text": "Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Genesis 50:20-21",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. / Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 1:6-7",
          "text": "Now Joseph and all his brothers and all that generation died, / but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Exodus 3:16-17",
          "text": "Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt. / And I have promised to bring you up out of your affliction in Egypt, into the land of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites—a land flowing with milk and honey.’"
        },
        {
          "reference": "Exodus 4:29-31",
          "text": "Then Moses and Aaron went and assembled all the elders of the Israelites, / and Aaron relayed everything the LORD had said to Moses. And Moses performed the signs before the people, / and they believed. And when they heard that the LORD had attended to the Israelites and had seen their affliction, they bowed down and worshiped."
        },
        {
          "reference": "Exodus 6:6-8",
          "text": "Therefore tell the Israelites: ‘I am the LORD, and I will bring you out from under the yoke of the Egyptians and deliver you from their bondage. I will redeem you with an outstretched arm and with mighty acts of judgment. / I will take you as My own people, and I will be your God. Then you will know that I am the LORD your God, who brought you out from under the yoke of the Egyptians. / And I will bring you into the land that I swore to give to Abraham, Isaac, and Jacob. I will give it to you as a possession. I am the LORD!’”"
        },
        {
          "reference": "Acts 7:9-14",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Acts 7:18-19",
          "text": "Then another king, who knew nothing of Joseph, arose over Egypt. / He exploited our people and oppressed our fathers, forcing them to abandon their infants so they would die."
        },
        {
          "reference": "Acts 7:34",
          "text": "I have indeed seen the oppression of My people in Egypt. I have heard their groaning and have come down to deliver them. Now come, I will send you back to Egypt.’"
        },
        {
          "reference": "Acts 7:35-36",
          "text": "This Moses, whom they had rejected with the words, ‘Who made you ruler and judge?’ is the one whom God sent to be their ruler and redeemer through the angel who appeared to him in the bush. / He led them out and performed wonders and signs in the land of Egypt, at the Red Sea, and for forty years in the wilderness."
        }
      ]
    },
    {
      "reference": "Genesis 42:35",
      "book": "Genesis",
      "chapter": 42,
      "verse": 35,
      "translations": [
        {
          "version": "NIV",
          "text": "As they were emptying their sacks, there in each man’s sack was his pouch of silver! When they and their father saw the money pouches, they were frightened."
        },
        {
          "version": "NLT",
          "text": "As they emptied out their sacks, there in each man’s sack was the bag of money he had paid for the grain! The brothers and their father were terrified when they saw the bags of money."
        },
        {
          "version": "ESV",
          "text": "As they emptied their sacks, behold, every man’s bundle of money was in his sack. And when they and their father saw their bundles of money, they were afraid."
        },
        {
          "version": "NKJV",
          "text": "Then it happened as they emptied their sacks, that surprisingly each man’s bundle of money was in his sack; and when they and their father saw the bundles of money, they were afraid."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:12-15",
          "text": "Take double the silver with you so that you may return the silver that was put back into the mouths of your sacks. Perhaps it was a mistake. / Take your brother as well, and return to the man at once. / May God Almighty grant you mercy before the man, that he may release your other brother along with Benjamin. As for me, if I am bereaved, I am bereaved.” ..."
        },
        {
          "reference": "Genesis 44:1-2",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack. / Put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” So the steward did as Joseph had instructed."
        },
        {
          "reference": "Genesis 45:21-23",
          "text": "So the sons of Israel did as they were told. Joseph gave them wagons as Pharaoh had instructed, and he also gave them provisions for their journey. / He gave new garments to each of them, but to Benjamin he gave three hundred shekels of silver and five sets of clothes. / And he sent to his father the following: ten donkeys loaded with the best of Egypt, and ten female donkeys loaded with grain and bread and provisions for his father’s journey."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 41:56-57",
          "text": "When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 43:21-22",
          "text": "But when we came to the place we lodged for the night, we opened our sacks and, behold, each of us found his silver in the mouth of his sack! It was the full amount of our silver, and we have brought it back with us. / We have brought additional silver with us to buy food. We do not know who put our silver in our sacks.”"
        },
        {
          "reference": "Genesis 44:8",
          "text": "We even brought back to you from the land of Canaan the silver we found in the mouths of our sacks. Why would we steal silver or gold from your master’s house?"
        },
        {
          "reference": "Genesis 45:25-28",
          "text": "So the brothers went up out of Egypt and came to their father Jacob in the land of Canaan. / “Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them. / However, when they relayed all that Joseph had told them, and when he saw the wagons that Joseph had sent to carry him back, the spirit of their father Jacob was revived. ..."
        },
        {
          "reference": "Exodus 16:15",
          "text": "When the Israelites saw it, they asked one another, “What is it?” For they did not know what it was. So Moses told them, “It is the bread that the LORD has given you to eat."
        },
        {
          "reference": "Exodus 16:31-32",
          "text": "Now the house of Israel called the bread manna. It was white like coriander seed and tasted like wafers made with honey. / Moses said, “This is what the LORD has commanded: ‘Keep an omer of manna for the generations to come, so that they may see the bread I fed you in the wilderness when I brought you out of the land of Egypt.’”"
        },
        {
          "reference": "2 Kings 7:8-9",
          "text": "When the lepers reached the edge of the camp, they went into a tent to eat and drink. Then they carried off the silver, gold, and clothing, and went and hid them. On returning, they entered another tent, carried off some items from there, and hid them. / Finally, they said to one another, “We are not doing what is right. Today is a day of good news. If we are silent and wait until morning light, our sin will overtake us. Now, therefore, let us go and tell the king’s household.”"
        },
        {
          "reference": "Matthew 6:19-21",
          "text": "Do not store up for yourselves treasures on earth, where moth and rust destroy, and where thieves break in and steal. / But store up for yourselves treasures in heaven, where moth and rust do not destroy, and where thieves do not break in and steal. / For where your treasure is, there your heart will be also."
        },
        {
          "reference": "Matthew 10:9-10",
          "text": "Do not carry any gold or silver or copper in your belts. / Take no bag for the road, or second tunic, or sandals, or staff; for the worker is worthy of his provisions."
        },
        {
          "reference": "Luke 12:33-34",
          "text": "Sell your possessions and give to the poor. Provide yourselves with purses that will not wear out, an inexhaustible treasure in heaven, where no thief approaches and no moth destroys. / For where your treasure is, there your heart will be also."
        },
        {
          "reference": "Luke 24:41-43",
          "text": "While they were still in disbelief because of their joy and amazement, He asked them, “Do you have anything here to eat?” / So they gave Him a piece of broiled fish, / and He took it and ate it in front of them."
        }
      ]
    },
    {
      "reference": "Genesis 42:36",
      "book": "Genesis",
      "chapter": 42,
      "verse": 36,
      "translations": [
        {
          "version": "NIV",
          "text": "Their father Jacob said to them, “You have deprived me of my children. Joseph is no more and Simeon is no more, and now you want to take Benjamin. Everything is against me!”"
        },
        {
          "version": "NLT",
          "text": "Jacob exclaimed, “You are robbing me of my children! Joseph is gone! Simeon is gone! And now you want to take Benjamin, too. Everything is going against me!”"
        },
        {
          "version": "ESV",
          "text": "And Jacob their father said to them, “You have bereaved me of my children: Joseph is no more, and Simeon is no more, and now you would take Benjamin. All this has come against me.”"
        },
        {
          "version": "NKJV",
          "text": "And Jacob their father said to them, “You have bereaved me: Joseph is no more, Simeon is no more, and you want to take Benjamin. All these things are against me.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 44:29",
          "text": "Now if you also take this one from me and harm comes to him, you will bring my gray hair down to Sheol in sorrow.’"
        },
        {
          "reference": "Genesis 43:14",
          "text": "May God Almighty grant you mercy before the man, that he may release your other brother along with Benjamin. As for me, if I am bereaved, I am bereaved.”"
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 37:20",
          "text": "“Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!”"
        },
        {
          "reference": "Genesis 45:26-28",
          "text": "“Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them. / However, when they relayed all that Joseph had told them, and when he saw the wagons that Joseph had sent to carry him back, the spirit of their father Jacob was revived. / “Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 44:31",
          "text": "sees that the boy is not with us, he will die. Then your servants will have brought the gray hair of your servant our father down to Sheol in sorrow."
        },
        {
          "reference": "Genesis 43:6",
          "text": "“Why did you bring this trouble upon me?” Israel asked. “Why did you tell the man you had another brother?”"
        },
        {
          "reference": "Genesis 37:32",
          "text": "They sent the robe of many colors to their father and said, “We found this. Examine it to see whether it is your son’s robe or not.”"
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "2 Kings 4:28",
          "text": "Then she said, “Did I ask you for a son, my lord? Didn’t I say, ‘Do not deceive me?’”"
        },
        {
          "reference": "Job 19:21",
          "text": "Have pity on me, my friends, have pity, for the hand of God has struck me."
        },
        {
          "reference": "Job 16:20",
          "text": "My friends are my scoffers as my eyes pour out tears to God."
        },
        {
          "reference": "Psalm 77:2",
          "text": "In the day of trouble I sought the Lord; through the night my outstretched hands did not grow weary; my soul refused to be comforted."
        },
        {
          "reference": "Psalm 88:18",
          "text": "You have removed my beloved and my friend; darkness is my closest companion."
        }
      ]
    },
    {
      "reference": "Genesis 42:37",
      "book": "Genesis",
      "chapter": 42,
      "verse": 37,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Reuben said to his father, “You may put both of my sons to death if I do not bring him back to you. Entrust him to my care, and I will bring him back.”"
        },
        {
          "version": "NLT",
          "text": "Then Reuben said to his father, “You may kill my two sons if I don’t bring Benjamin back to you. I’ll be responsible for him, and I promise to bring him back.”"
        },
        {
          "version": "ESV",
          "text": "Then Reuben said to his father, “Kill my two sons if I do not bring him back to you. Put him in my hands, and I will bring him back to you.”"
        },
        {
          "version": "NKJV",
          "text": "Then Reuben spoke to his father, saying, “Kill my two sons if I do not bring him back to you; put him in my hands, and I will bring him back to you.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:9",
          "text": "I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 44:32-34",
          "text": "Indeed, your servant guaranteed the boy’s safety to my father, saying, ‘If I do not return him to you, I will bear the guilt before you, my father, all my life.’ / Now please let your servant stay here as my lord’s slave in place of the boy. Let him return with his brothers. / For how can I go back to my father without the boy? I could not bear to see the misery that would overwhelm him.”"
        },
        {
          "reference": "Genesis 37:21-22",
          "text": "When Reuben heard this, he tried to rescue Joseph from their hands. “Let us not take his life,” he said. / “Do not shed his blood. Throw him into this pit in the wilderness, but do not lay a hand on him.” Reuben said this so that he could rescue Joseph from their hands and return him to his father."
        },
        {
          "reference": "Genesis 37:26-27",
          "text": "Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed."
        },
        {
          "reference": "Genesis 44:16",
          "text": "“What can we say to my lord?” Judah replied. “How can we plead? How can we justify ourselves? God has exposed the iniquity of your servants. We are now my lord’s slaves—both we and the one who was found with the cup.”"
        },
        {
          "reference": "Genesis 45:5-8",
          "text": "And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. / For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 32:32",
          "text": "Yet now, if You would only forgive their sin.... But if not, please blot me out of the book that You have written.”"
        },
        {
          "reference": "1 Samuel 18:1-4",
          "text": "After David had finished speaking with Saul, the souls of Jonathan and David were knit together, and Jonathan loved him as himself. / And from that day Saul kept David with him and did not let him return to his father’s house. / Then Jonathan made a covenant with David because he loved him as himself. ..."
        },
        {
          "reference": "1 Samuel 20:8",
          "text": "Therefore show kindness to your servant, for you have brought me into a covenant with you before the LORD. If there is iniquity in me, then kill me yourself; why should you bring me to your father?”"
        },
        {
          "reference": "1 Samuel 25:24",
          "text": "She fell at his feet and said, “My lord, may the blame be on me alone, but please let your servant speak to you; hear the words of your servant."
        },
        {
          "reference": "2 Samuel 14:9",
          "text": "But the woman of Tekoa said to the king, “My lord the king, may any blame be on me and on my father’s house, and may the king and his throne be guiltless.”"
        },
        {
          "reference": "2 Samuel 18:33",
          "text": "The king was shaken and went up to the chamber over the gate and wept. And as he walked, he cried out, “O my son Absalom! My son, my son Absalom! If only I had died instead of you, O Absalom, my son, my son!”"
        },
        {
          "reference": "1 Kings 3:26",
          "text": "Then the woman whose son was alive spoke to the king because she yearned with compassion for her son. “Please, my lord,” she said, “give her the living baby. Do not kill him!” But the other woman said, “He will be neither mine nor yours. Cut him in two!”"
        },
        {
          "reference": "Job 1:18-19",
          "text": "While he was still speaking, another messenger came and reported: “Your sons and daughters were eating and drinking wine in their oldest brother’s house, / when suddenly a mighty wind swept in from the desert and struck the four corners of the house. It collapsed on the young people and they are dead, and I alone have escaped to tell you!”"
        }
      ]
    },
    {
      "reference": "Genesis 42:38",
      "book": "Genesis",
      "chapter": 42,
      "verse": 38,
      "translations": [
        {
          "version": "NIV",
          "text": "But Jacob said, “My son will not go down there with you; his brother is dead and he is the only one left. If harm comes to him on the journey you are taking, you will bring my gray head down to the grave in sorrow.”"
        },
        {
          "version": "NLT",
          "text": "But Jacob replied, “My son will not go down with you. His brother Joseph is dead, and he is all I have left. If anything should happen to him on your journey, you would send this grieving, white-haired man to his grave.”"
        },
        {
          "version": "ESV",
          "text": "But he said, “My son shall not go down with you, for his brother is dead, and he is the only one left. If harm should happen to him on the journey that you are to make, you would bring down my gray hairs with sorrow to Sheol.”"
        },
        {
          "version": "NKJV",
          "text": "But he said, “My son shall not go down with you, for his brother is dead, and he is left alone. If any calamity should befall him along the way in which you go, then you would bring down my gray hair with sorrow to the grave.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 44:29-31",
          "text": "Now if you also take this one from me and harm comes to him, you will bring my gray hair down to Sheol in sorrow.’ / So if the boy is not with us when I return to your servant, and if my father, whose life is wrapped up in the boy’s life, / sees that the boy is not with us, he will die. Then your servants will have brought the gray hair of your servant our father down to Sheol in sorrow."
        },
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 44:20",
          "text": "And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 43:14",
          "text": "May God Almighty grant you mercy before the man, that he may release your other brother along with Benjamin. As for me, if I am bereaved, I am bereaved.”"
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 37:31-32",
          "text": "Then they took Joseph’s robe, slaughtered a young goat, and dipped the robe in its blood. / They sent the robe of many colors to their father and said, “We found this. Examine it to see whether it is your son’s robe or not.”"
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:30",
          "text": "Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "1 Samuel 18:1-3",
          "text": "After David had finished speaking with Saul, the souls of Jonathan and David were knit together, and Jonathan loved him as himself. / And from that day Saul kept David with him and did not let him return to his father’s house. / Then Jonathan made a covenant with David because he loved him as himself."
        },
        {
          "reference": "2 Samuel 18:33",
          "text": "The king was shaken and went up to the chamber over the gate and wept. And as he walked, he cried out, “O my son Absalom! My son, my son Absalom! If only I had died instead of you, O Absalom, my son, my son!”"
        },
        {
          "reference": "1 Kings 3:26",
          "text": "Then the woman whose son was alive spoke to the king because she yearned with compassion for her son. “Please, my lord,” she said, “give her the living baby. Do not kill him!” But the other woman said, “He will be neither mine nor yours. Cut him in two!”"
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        }
      ]
    }
  ]
}