{
  "book": "genesis",
  "chapter": 44,
  "verses": [
    {
      "reference": "Genesis 44:1",
      "book": "Genesis",
      "chapter": 44,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Joseph gave these instructions to the steward of his house: &#8220Fill the men’s sacks with as much food as they can carry, and put each man’s silver in the mouth of his sack."
        },
        {
          "version": "NLT",
          "text": "When his brothers were ready to leave, Joseph gave these instructions to his palace manager: “Fill each of their sacks with as much grain as they can carry, and put each man’s money back into his sack."
        },
        {
          "version": "ESV",
          "text": "Then he commanded the steward of his house, “Fill the men’s sacks with food, as much as they can carry, and put each man’s money in the mouth of his sack,"
        },
        {
          "version": "NKJV",
          "text": "And he commanded the steward of his house, saying, “Fill the men’s sacks with food, as much as they can carry, and put each man’s money in the mouth of his sack."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 44:2",
      "book": "Genesis",
      "chapter": 44,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "Then put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” And he did as Joseph said."
        },
        {
          "version": "NLT",
          "text": "Then put my personal silver cup at the top of the youngest brother’s sack, along with the money for his grain.” So the manager did as Joseph instructed him."
        },
        {
          "version": "ESV",
          "text": "and put my cup, the silver cup, in the mouth of the sack of the youngest, with his money for the grain.” And he did as Joseph told him."
        },
        {
          "version": "NKJV",
          "text": "Also put my cup, the silver cup, in the mouth of the sack of the youngest, and his grain money.” So he did according to the word that Joseph had spoken."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:25",
          "text": "Then Joseph gave orders to fill their bags with grain, to return each man’s silver to his sack, and to give them provisions for their journey. This order was carried out,"
        },
        {
          "reference": "Genesis 43:12",
          "text": "Take double the silver with you so that you may return the silver that was put back into the mouths of your sacks. Perhaps it was a mistake."
        },
        {
          "reference": "Genesis 43:21-22",
          "text": "But when we came to the place we lodged for the night, we opened our sacks and, behold, each of us found his silver in the mouth of his sack! It was the full amount of our silver, and we have brought it back with us. / We have brought additional silver with us to buy food. We do not know who put our silver in our sacks.”"
        },
        {
          "reference": "Genesis 42:27-28",
          "text": "At the place where they lodged for the night, one of them opened his sack to get feed for his donkey, and he saw his silver in the mouth of the sack. / “My silver has been returned!” he said to his brothers. “It is here in my sack.” Their hearts sank, and trembling, they turned to one another and said, “What is this that God has done to us?”"
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 45:1-3",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "1 Kings 3:16-28",
          "text": "At that time two prostitutes came to the king and stood before him. / One woman said, “Please, my lord, this woman and I live in the same house, and I gave birth while she was in the house. / On the third day after I gave birth, this woman also had a baby. We were alone, with no one in the house but the two of us. ..."
        },
        {
          "reference": "2 Kings 5:20-27",
          "text": "Gehazi, the servant of Elisha the man of God, said, “Look, my master has spared this Aramean, Naaman, by not accepting what he brought. As surely as the LORD lives, I will run after him and get something from him.” / So Gehazi pursued Naaman. And when Naaman saw him running toward him, he got down from the chariot to meet him and asked, “Is everything all right?” / “Everything is all right,” Gehazi replied. “My master has sent me to say, ‘Look, two young men from the sons of the prophets have just now come to me from the hill country of Ephraim. Please give them a talent of silver and two sets of clothing.’” ..."
        },
        {
          "reference": "Job 12:16",
          "text": "True wisdom and power belong to Him. The deceived and the deceiver are His."
        },
        {
          "reference": "Proverbs 21:30",
          "text": "There is no wisdom, no understanding, no counsel that can prevail against the LORD."
        },
        {
          "reference": "Isaiah 55:8-9",
          "text": "“For My thoughts are not your thoughts, neither are your ways My ways,” declares the LORD. / “For as the heavens are higher than the earth, so My ways are higher than your ways and My thoughts than your thoughts."
        },
        {
          "reference": "Jeremiah 17:9",
          "text": "The heart is deceitful above all things and beyond cure. Who can understand it?"
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        }
      ]
    },
    {
      "reference": "Genesis 44:3",
      "book": "Genesis",
      "chapter": 44,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "As morning dawned, the men were sent on their way with their donkeys."
        },
        {
          "version": "NLT",
          "text": "The brothers were up at dawn and were sent on their journey with their loaded donkeys."
        },
        {
          "version": "ESV",
          "text": "As soon as the morning was light, the men were sent away with their donkeys."
        },
        {
          "version": "NKJV",
          "text": "As soon as the morning dawned, the men were sent away, they and their donkeys."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:25",
          "text": "Then Joseph gave orders to fill their bags with grain, to return each man’s silver to his sack, and to give them provisions for their journey. This order was carried out,"
        },
        {
          "reference": "Genesis 43:16",
          "text": "When Joseph saw Benjamin with his brothers, he said to the steward of his house, “Take these men to my house. Slaughter an animal and prepare it, for they shall dine with me at noon.”"
        },
        {
          "reference": "Genesis 43:24",
          "text": "And the steward took the men into Joseph’s house, gave them water to wash their feet, and provided food for their donkeys."
        },
        {
          "reference": "Genesis 45:1-2",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it."
        },
        {
          "reference": "Genesis 42:27-28",
          "text": "At the place where they lodged for the night, one of them opened his sack to get feed for his donkey, and he saw his silver in the mouth of the sack. / “My silver has been returned!” he said to his brothers. “It is here in my sack.” Their hearts sank, and trembling, they turned to one another and said, “What is this that God has done to us?”"
        },
        {
          "reference": "Genesis 43:2",
          "text": "So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.”"
        },
        {
          "reference": "Genesis 45:14-15",
          "text": "Then Joseph threw his arms around his brother Benjamin and wept, and Benjamin wept as they embraced. / Joseph kissed each of his brothers as he wept over them. And afterward his brothers talked with him."
        },
        {
          "reference": "Genesis 50:17-18",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "1 Kings 3:16-28",
          "text": "At that time two prostitutes came to the king and stood before him. / One woman said, “Please, my lord, this woman and I live in the same house, and I gave birth while she was in the house. / On the third day after I gave birth, this woman also had a baby. We were alone, with no one in the house but the two of us. ..."
        },
        {
          "reference": "2 Kings 5:23",
          "text": "But Naaman insisted, “Please, take two talents.” And he urged Gehazi to accept them. Then he tied up two talents of silver in two bags along with two sets of clothing and gave them to two of his servants, who carried them ahead of Gehazi."
        },
        {
          "reference": "Matthew 5:39-42",
          "text": "But I tell you not to resist an evil person. If someone slaps you on your right cheek, turn to him the other also; / if someone wants to sue you and take your tunic, let him have your cloak as well; / and if someone forces you to go one mile, go with him two miles. ..."
        },
        {
          "reference": "Matthew 6:19-21",
          "text": "Do not store up for yourselves treasures on earth, where moth and rust destroy, and where thieves break in and steal. / But store up for yourselves treasures in heaven, where moth and rust do not destroy, and where thieves do not break in and steal. / For where your treasure is, there your heart will be also."
        },
        {
          "reference": "Matthew 25:14-30",
          "text": "For it is just like a man going on a journey, who called his servants and entrusted them with his possessions. / To one he gave five talents, to another two talents, and to another one talent—each according to his own ability. And he went on his journey. / The servant who had received the five talents went at once and put them to work and gained five more. ..."
        },
        {
          "reference": "Luke 6:30-38",
          "text": "Give to everyone who asks you, and if anyone takes what is yours, do not demand it back. / Do to others as you would have them do to you. / If you love those who love you, what credit is that to you? Even sinners love those who love them. ..."
        }
      ]
    },
    {
      "reference": "Genesis 44:4",
      "book": "Genesis",
      "chapter": 44,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "They had not gone far from the city when Joseph said to his steward, “Go after those men at once, and when you catch up with them, say to them, ‘Why have you repaid good with evil?"
        },
        {
          "version": "NLT",
          "text": "But when they had gone only a short distance and were barely out of the city, Joseph said to his palace manager, “Chase after them and stop them. When you catch up with them, ask them, ‘Why have you repaid my kindness with such evil?"
        },
        {
          "version": "ESV",
          "text": "They had gone only a short distance from the city. Now Joseph said to his steward, “Up, follow after the men, and when you overtake them, say to them, ‘Why have you repaid evil for good?"
        },
        {
          "version": "NKJV",
          "text": "When they had gone out of the city, and were not yet far off, Joseph said to his steward, “Get up, follow the men; and when you overtake them, say to them, ‘Why have you repaid evil for good?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:25-28",
          "text": "Then Joseph gave orders to fill their bags with grain, to return each man’s silver to his sack, and to give them provisions for their journey. This order was carried out, / and they loaded the grain on their donkeys and departed. / At the place where they lodged for the night, one of them opened his sack to get feed for his donkey, and he saw his silver in the mouth of the sack. ..."
        },
        {
          "reference": "Genesis 43:18",
          "text": "But the brothers were frightened that they had been taken to Joseph’s house. “We have been brought here because of the silver that was returned in our bags the first time,” they said. “They intend to overpower us and take us as slaves, along with our donkeys.”"
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 42:35",
          "text": "As they began emptying their sacks, there in each man’s sack was his bag of silver! And when they and their father saw the bags of silver, they were dismayed."
        },
        {
          "reference": "Genesis 45:3",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 12:33-36",
          "text": "And in order to send them out of the land quickly, the Egyptians urged the people on. “For otherwise,” they said, “we are all going to die!” / So the people took their dough before it was leavened, carrying it on their shoulders in kneading bowls wrapped in clothing. / Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. ..."
        },
        {
          "reference": "1 Samuel 17:28",
          "text": "Now when David’s oldest brother Eliab heard him speaking to the men, his anger burned against David. “Why have you come down here?” he asked. “And with whom did you leave those few sheep in the wilderness? I know your pride and wickedness of heart—you have come down to see the battle!”"
        },
        {
          "reference": "2 Kings 5:26",
          "text": "But Elisha questioned him, “Did not my spirit go with you when the man got down from his chariot to meet you? Is this the time to accept money and clothing, olive groves and vineyards, sheep and oxen, menservants and maidservants?"
        },
        {
          "reference": "Psalm 105:17-22",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right. ..."
        },
        {
          "reference": "Proverbs 21:30",
          "text": "There is no wisdom, no understanding, no counsel that can prevail against the LORD."
        },
        {
          "reference": "Isaiah 46:10",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’"
        },
        {
          "reference": "Jeremiah 29:11",
          "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, to give you a future and a hope."
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        }
      ]
    },
    {
      "reference": "Genesis 44:5",
      "book": "Genesis",
      "chapter": 44,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "Isn’t this the cup my master drinks from and also uses for divination? This is a wicked thing you have done.’”"
        },
        {
          "version": "NLT",
          "text": "Why have you stolen my master’s silver cup, which he uses to predict the future? What a wicked thing you have done!’”"
        },
        {
          "version": "ESV",
          "text": "Is it not from this that my lord drinks, and by this that he practices divination? You have done evil in doing this.’”"
        },
        {
          "version": "NKJV",
          "text": "Is not this the one from which my lord drinks, and with which he indeed practices divination? You have done evil in so doing.’ ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:15-16",
          "text": "And this is how you will be tested: As surely as Pharaoh lives, you shall not leave this place unless your youngest brother comes here. / Send one of your number to get your brother; the rest of you will be confined so that the truth of your words may be tested. If they are untrue, then as surely as Pharaoh lives, you are spies!”"
        },
        {
          "reference": "Genesis 43:18",
          "text": "But the brothers were frightened that they had been taken to Joseph’s house. “We have been brought here because of the silver that was returned in our bags the first time,” they said. “They intend to overpower us and take us as slaves, along with our donkeys.”"
        },
        {
          "reference": "Exodus 4:2-4",
          "text": "And the LORD asked him, “What is that in your hand?” “A staff,” he replied. / “Throw it on the ground,” said the LORD. So Moses threw it on the ground, and it became a snake, and he ran from it. / “Stretch out your hand and grab it by the tail,” the LORD said to Moses, who reached out his hand and caught the snake, and it turned back into a staff in his hand."
        },
        {
          "reference": "Exodus 7:10-12",
          "text": "So Moses and Aaron went to Pharaoh and did just as the LORD had commanded. Aaron threw his staff down before Pharaoh and his officials, and it became a serpent. / But Pharaoh called the wise men and sorcerers and magicians of Egypt, and they also did the same things by their magic arts. / Each one threw down his staff, and it became a serpent. But Aaron’s staff swallowed up the other staffs."
        },
        {
          "reference": "Exodus 8:19",
          "text": "“This is the finger of God,” the magicians said to Pharaoh. But Pharaoh’s heart was hardened, and he would not listen to them, just as the LORD had said."
        },
        {
          "reference": "Exodus 14:16",
          "text": "And as for you, lift up your staff and stretch out your hand over the sea and divide it, so that the Israelites can go through the sea on dry ground."
        },
        {
          "reference": "Numbers 22:31-35",
          "text": "Then the LORD opened Balaam’s eyes, and he saw the angel of the LORD standing in the road with a drawn sword in his hand. And Balaam bowed low and fell facedown. / The angel of the LORD asked him, “Why have you beaten your donkey these three times? Behold, I have come out to oppose you, because your way is perverse before me. / The donkey saw me and turned away from me these three times. If she had not turned away, then by now I would surely have killed you and let her live.” ..."
        },
        {
          "reference": "1 Kings 13:4-6",
          "text": "Now when King Jeroboam, who was at the altar in Bethel, heard the word that the man of God had cried out against it, he stretched out his hand and said, “Seize him!” But the hand he stretched out toward him withered, so that he could not pull it back. / And the altar was split apart, and the ashes poured out, according to the sign that the man of God had given by the word of the LORD. / Then the king responded to the man of God, “Intercede with the LORD your God and pray for me that my hand may be restored.” So the man of God interceded with the LORD, and the king’s hand was restored to him as it was before."
        },
        {
          "reference": "2 Kings 6:17-20",
          "text": "Then Elisha prayed, “O LORD, please open his eyes that he may see.” And the LORD opened the eyes of the young man, and he saw that the hills were full of horses and chariots of fire all around Elisha. / As the Arameans came down against him, Elisha prayed to the LORD, “Please strike these people with blindness.” So He struck them with blindness, according to the word of Elisha. / And Elisha told them, “This is not the way, and this is not the city. Follow me, and I will take you to the man you are seeking.” And he led them to Samaria. ..."
        },
        {
          "reference": "Daniel 2:27-28",
          "text": "Daniel answered the king, “No wise man, enchanter, medium, or magician can explain to the king the mystery of which he inquires. / But there is a God in heaven who reveals mysteries, and He has made known to King Nebuchadnezzar what will happen in the latter days. Your dream and the visions that came into your mind as you lay on your bed were these:"
        },
        {
          "reference": "Daniel 4:9",
          "text": "“O Belteshazzar, chief of the magicians, I know that the spirit of the holy gods is in you and that no mystery baffles you. So explain to me the visions I saw in my dream, and their interpretation."
        },
        {
          "reference": "Matthew 2:1-2",
          "text": "After Jesus was born in Bethlehem in Judea, during the time of King Herod, Magi from the east arrived in Jerusalem, / asking, “Where is the One who has been born King of the Jews? We saw His star in the east and have come to worship Him.”"
        },
        {
          "reference": "Matthew 12:24",
          "text": "But when the Pharisees heard this, they said, “Only by Beelzebul, the prince of demons, does this man drive out demons.”"
        },
        {
          "reference": "Matthew 26:48-50",
          "text": "Now the betrayer had arranged a signal with them: “The One I kiss is the man; arrest Him.” / Going directly to Jesus, he said, “Greetings, Rabbi!” and kissed Him. / “Friend,” Jesus replied, “do what you came for.” Then the men stepped forward, seized Jesus, and arrested Him."
        },
        {
          "reference": "Mark 6:49-50",
          "text": "but when they saw Him walking on the sea, they cried out, thinking He was a ghost— / for they all saw Him and were terrified. But Jesus spoke up at once: “Take courage! It is I. Do not be afraid.”"
        }
      ]
    },
    {
      "reference": "Genesis 44:6",
      "book": "Genesis",
      "chapter": 44,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "When he caught up with them, he repeated these words to them."
        },
        {
          "version": "NLT",
          "text": "When the palace manager caught up with the men, he spoke to them as he had been instructed."
        },
        {
          "version": "ESV",
          "text": "When he overtook them, he spoke to them these words."
        },
        {
          "version": "NKJV",
          "text": "So he overtook them, and he spoke to them these same words."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:9",
          "text": "Joseph remembered his dreams about them and said, “You are spies! You have come to see if our land is vulnerable.”"
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 43:18",
          "text": "But the brothers were frightened that they had been taken to Joseph’s house. “We have been brought here because of the silver that was returned in our bags the first time,” they said. “They intend to overpower us and take us as slaves, along with our donkeys.”"
        },
        {
          "reference": "Genesis 45:3",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:10",
          "text": "Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 21:16",
          "text": "Whoever kidnaps another man must be put to death, whether he sells him or the man is found in his possession."
        },
        {
          "reference": "Deuteronomy 24:7",
          "text": "If a man is caught kidnapping one of his Israelite brothers, whether he treats him as a slave or sells him, the kidnapper must die. So you must purge the evil from among you."
        },
        {
          "reference": "1 Samuel 12:3",
          "text": "Here I am. Bear witness against me before the LORD and before His anointed: Whose ox or donkey have I taken? Whom have I cheated or oppressed? From whose hand have I accepted a bribe and closed my eyes? Tell me, and I will restore it to you.”"
        },
        {
          "reference": "2 Samuel 12:7-9",
          "text": "Then Nathan said to David, “You are that man! This is what the LORD, the God of Israel, says: ‘I anointed you king over Israel, and I delivered you from the hand of Saul. / I gave your master’s house to you and your master’s wives into your arms. I gave you the house of Israel and Judah, and if that was not enough, I would have given you even more. / Why then have you despised the command of the LORD by doing evil in His sight? You put Uriah the Hittite to the sword and took his wife as your own. You have slain him with the sword of the Ammonites."
        },
        {
          "reference": "1 Kings 21:19",
          "text": "Tell him that this is what the LORD says: ‘Have you not murdered a man and seized his land?’ Then tell him that this is also what the LORD says: ‘In the place where the dogs licked up the blood of Naboth, there also the dogs will lick up your blood—yes, yours!’”"
        },
        {
          "reference": "2 Kings 5:26",
          "text": "But Elisha questioned him, “Did not my spirit go with you when the man got down from his chariot to meet you? Is this the time to accept money and clothing, olive groves and vineyards, sheep and oxen, menservants and maidservants?"
        },
        {
          "reference": "Job 34:22",
          "text": "There is no darkness or deep shadow where the workers of iniquity can hide."
        },
        {
          "reference": "Psalm 50:18",
          "text": "When you see a thief, you befriend him, and throw in your lot with adulterers."
        },
        {
          "reference": "Proverbs 6:30-31",
          "text": "Men do not despise the thief if he steals to satisfy his hunger. / Yet if caught, he must pay sevenfold; he must give up all the wealth of his house."
        }
      ]
    },
    {
      "reference": "Genesis 44:7",
      "book": "Genesis",
      "chapter": 44,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "But they said to him, “Why does my lord say such things? Far be it from your servants to do anything like that!"
        },
        {
          "version": "NLT",
          "text": "“What are you talking about?” the brothers responded. “We are your servants and would never do such a thing!"
        },
        {
          "version": "ESV",
          "text": "They said to him, “Why does my lord speak such words as these? Far be it from your servants to do such a thing!"
        },
        {
          "version": "NKJV",
          "text": "And they said to him, “Why does my lord say these words? Far be it from us that your servants should do such a thing."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:18-22",
          "text": "and on the third day he said to them, “I fear God. So do this and you will live: / If you are honest, leave one of your brothers in custody while the rest of you go and take back grain to relieve the hunger of your households. / Then bring your youngest brother to me so that your words can be verified, that you may not die.” And to this they consented. ..."
        },
        {
          "reference": "Genesis 43:18-22",
          "text": "But the brothers were frightened that they had been taken to Joseph’s house. “We have been brought here because of the silver that was returned in our bags the first time,” they said. “They intend to overpower us and take us as slaves, along with our donkeys.” / So they approached Joseph’s steward and spoke to him at the entrance to the house. / “Please, sir,” they said, “we really did come down here the first time to buy food. ..."
        },
        {
          "reference": "Exodus 20:16",
          "text": "You shall not bear false witness against your neighbor."
        },
        {
          "reference": "Exodus 23:7",
          "text": "Stay far away from a false accusation. Do not kill the innocent or the just, for I will not acquit the guilty."
        },
        {
          "reference": "Deuteronomy 19:16-19",
          "text": "If a false witness testifies against someone, accusing him of a crime, / both parties to the dispute must stand in the presence of the LORD, before the priests and judges who are in office at that time. / The judges shall investigate thoroughly, and if the witness is proven to be a liar who has falsely accused his brother, ..."
        },
        {
          "reference": "1 Samuel 24:9-11",
          "text": "and said to Saul, “Why do you listen to the words of men who say, ‘Look, David intends to harm you’? / Behold, this day you have seen with your own eyes that the LORD delivered you into my hand in the cave. I was told to kill you, but I spared you and said, ‘I will not lift my hand against my lord, since he is the LORD’s anointed.’ / See, my father, look at the corner of your robe in my hand. For I cut it off, but I did not kill you. Know and see that there is no evil or rebellion in my hands. I have not sinned against you, even though you are hunting me down to take my life."
        },
        {
          "reference": "2 Samuel 16:17-19",
          "text": "“Is this the loyalty you show your friend?” Absalom replied. “Why did you not go with your friend?” / “Not at all,” Hushai answered. “For the one chosen by the LORD, by this people, and by all the men of Israel—his I will be, and with him I will remain. / Furthermore, whom should I serve if not his son? As I served in your father’s presence, so also I will serve in yours.”"
        },
        {
          "reference": "1 Kings 8:31-32",
          "text": "When a man sins against his neighbor and is required to take an oath, and he comes to take an oath before Your altar in this temple, / then may You hear from heaven and act. May You judge Your servants, condemning the wicked man by bringing down on his own head what he has done, and justifying the righteous man by rewarding him according to his righteousness."
        },
        {
          "reference": "Job 22:5-6",
          "text": "Is not your wickedness great? Are not your iniquities endless? / For you needlessly demanded security from your brothers and deprived the naked of their clothing."
        },
        {
          "reference": "Psalm 7:3-5",
          "text": "O LORD my God, if I have done this, if injustice is on my hands, / if I have rewarded my ally with evil, if I have plundered my foe without cause, / then may my enemy pursue me and overtake me; may he trample me to the ground and leave my honor in the dust. Selah"
        },
        {
          "reference": "Psalm 26:6-7",
          "text": "I wash my hands in innocence that I may go about Your altar, O LORD, / to raise my voice in thanksgiving and declare all Your wonderful works."
        },
        {
          "reference": "Proverbs 17:15",
          "text": "Acquitting the guilty and condemning the righteous—both are detestable to the LORD."
        },
        {
          "reference": "Isaiah 53:9",
          "text": "He was assigned a grave with the wicked, and with a rich man in His death, although He had done no violence, nor was any deceit in His mouth."
        },
        {
          "reference": "Jeremiah 2:35",
          "text": "you say, ‘I am innocent. Surely His anger will turn from me.’ Behold, I will judge you, because you say, ‘I have not sinned.’"
        },
        {
          "reference": "Matthew 5:11-12",
          "text": "Blessed are you when people insult you, persecute you, and falsely say all kinds of evil against you because of Me. / Rejoice and be glad, because great is your reward in heaven, for in the same way they persecuted the prophets before you."
        }
      ]
    },
    {
      "reference": "Genesis 44:8",
      "book": "Genesis",
      "chapter": 44,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "We even brought back to you from the land of Canaan the silver we found inside the mouths of our sacks. So why would we steal silver or gold from your master’s house?"
        },
        {
          "version": "NLT",
          "text": "Didn’t we return the money we found in our sacks? We brought it back all the way from the land of Canaan. Why would we steal silver or gold from your master’s house?"
        },
        {
          "version": "ESV",
          "text": "Behold, the money that we found in the mouths of our sacks we brought back to you from the land of Canaan. How then could we steal silver or gold from your lord’s house?"
        },
        {
          "version": "NKJV",
          "text": "Look, we brought back to you from the land of Canaan the money which we found in the mouth of our sacks. How then could we steal silver or gold from your lord’s house?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:25-28",
          "text": "Then Joseph gave orders to fill their bags with grain, to return each man’s silver to his sack, and to give them provisions for their journey. This order was carried out, / and they loaded the grain on their donkeys and departed. / At the place where they lodged for the night, one of them opened his sack to get feed for his donkey, and he saw his silver in the mouth of the sack. ..."
        },
        {
          "reference": "Genesis 31:32",
          "text": "If you find your gods with anyone here, he shall not live! In the presence of our relatives, see for yourself if anything is yours, and take it back.” For Jacob did not know that Rachel had stolen the idols."
        },
        {
          "reference": "Genesis 43:12",
          "text": "Take double the silver with you so that you may return the silver that was put back into the mouths of your sacks. Perhaps it was a mistake."
        },
        {
          "reference": "Exodus 20:15",
          "text": "You shall not steal."
        },
        {
          "reference": "Leviticus 19:11",
          "text": "You must not steal. You must not lie or deceive one another."
        },
        {
          "reference": "Deuteronomy 5:19",
          "text": "You shall not steal."
        },
        {
          "reference": "Joshua 7:11-12",
          "text": "Israel has sinned; they have transgressed My covenant that I commanded them, and they have taken some of what was devoted to destruction. Indeed, they have stolen and lied, and they have put these things with their own possessions. / This is why the Israelites cannot stand against their enemies. They will turn their backs and run from their enemies, because they themselves have been set apart for destruction. I will no longer be with you unless you remove from among you whatever is devoted to destruction."
        },
        {
          "reference": "1 Samuel 12:3-5",
          "text": "Here I am. Bear witness against me before the LORD and before His anointed: Whose ox or donkey have I taken? Whom have I cheated or oppressed? From whose hand have I accepted a bribe and closed my eyes? Tell me, and I will restore it to you.” / “You have not cheated us or oppressed us,” they replied, “nor have you taken anything from the hand of man.” / Samuel said to them, “The LORD is a witness against you, and His anointed is a witness today, that you have not found anything in my hand.” “He is a witness,” they replied."
        },
        {
          "reference": "2 Kings 12:15",
          "text": "No accounting was required from the men who received the money to pay the workmen, because they acted with integrity."
        },
        {
          "reference": "2 Kings 22:7",
          "text": "But they need not account for the money put into their hands, since they work with integrity.”"
        },
        {
          "reference": "Job 31:5-6",
          "text": "If I have walked in falsehood or my foot has rushed to deceit, / let God weigh me with honest scales, that He may know my integrity."
        },
        {
          "reference": "Psalm 15:1-5",
          "text": "A Psalm of David. O LORD, who may abide in Your tent? Who may dwell on Your holy mountain? / He who walks with integrity and practices righteousness, who speaks the truth from his heart, / who has no slander on his tongue, who does no harm to his neighbor, who casts no scorn on his friend, ..."
        },
        {
          "reference": "Proverbs 20:7",
          "text": "The righteous man walks with integrity; blessed are his children after him."
        },
        {
          "reference": "Isaiah 33:15-16",
          "text": "He who walks righteously and speaks with sincerity, who refuses gain from extortion, whose hand never takes a bribe, who stops his ears against murderous plots and shuts his eyes tightly against evil— / he will dwell on the heights; the mountain fortress will be his refuge; his food will be provided and his water assured."
        },
        {
          "reference": "Jeremiah 2:35",
          "text": "you say, ‘I am innocent. Surely His anger will turn from me.’ Behold, I will judge you, because you say, ‘I have not sinned.’"
        }
      ]
    },
    {
      "reference": "Genesis 44:9",
      "book": "Genesis",
      "chapter": 44,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "If any of your servants is found to have it, he will die; and the rest of us will become my lord’s slaves.”"
        },
        {
          "version": "NLT",
          "text": "If you find his cup with any one of us, let that man die. And all the rest of us, my lord, will be your slaves.”"
        },
        {
          "version": "ESV",
          "text": "Whichever of your servants is found with it shall die, and we also will be my lord’s servants.”"
        },
        {
          "version": "NKJV",
          "text": "With whomever of your servants it is found, let him die, and we also will be my lord’s slaves.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:32",
          "text": "If you find your gods with anyone here, he shall not live! In the presence of our relatives, see for yourself if anything is yours, and take it back.” For Jacob did not know that Rachel had stolen the idols."
        },
        {
          "reference": "Genesis 43:18",
          "text": "But the brothers were frightened that they had been taken to Joseph’s house. “We have been brought here because of the silver that was returned in our bags the first time,” they said. “They intend to overpower us and take us as slaves, along with our donkeys.”"
        },
        {
          "reference": "Exodus 22:10-12",
          "text": "If a man gives a donkey, an ox, a sheep, or any other animal to be cared for by his neighbor, but it dies or is injured or stolen while no one is watching, / an oath before the LORD shall be made between the parties to determine whether or not the man has taken his neighbor’s property. The owner must accept the oath and require no restitution. / But if the animal was actually stolen from the neighbor, he must make restitution to the owner."
        },
        {
          "reference": "Joshua 7:14-15",
          "text": "In the morning you must present yourselves tribe by tribe. The tribe that the LORD selects shall come forward clan by clan, and the clan that the LORD selects shall come forward family by family, and the family that the LORD selects shall come forward man by man. / The one who is caught with the things devoted to destruction must be burned, along with all that belongs to him, because he has transgressed the covenant of the LORD and committed an outrage in Israel.’”"
        },
        {
          "reference": "1 Samuel 14:39",
          "text": "As surely as the LORD who saves Israel lives, even if it is my son Jonathan, he must die!” But not one of the troops said a word."
        },
        {
          "reference": "1 Samuel 14:24-28",
          "text": "Now the men of Israel were in distress that day, for Saul had placed the troops under an oath, saying, “Cursed is the man who eats any food before evening, before I have taken vengeance on my enemies.” So none of the troops tasted any food. / Then all the troops entered the forest, and there was honey on the ground. / And when they entered the forest and saw the flowing honey, not one of them put his hand to his mouth, because they feared the oath. ..."
        },
        {
          "reference": "2 Kings 5:20-27",
          "text": "Gehazi, the servant of Elisha the man of God, said, “Look, my master has spared this Aramean, Naaman, by not accepting what he brought. As surely as the LORD lives, I will run after him and get something from him.” / So Gehazi pursued Naaman. And when Naaman saw him running toward him, he got down from the chariot to meet him and asked, “Is everything all right?” / “Everything is all right,” Gehazi replied. “My master has sent me to say, ‘Look, two young men from the sons of the prophets have just now come to me from the hill country of Ephraim. Please give them a talent of silver and two sets of clothing.’” ..."
        },
        {
          "reference": "Job 31:5-8",
          "text": "If I have walked in falsehood or my foot has rushed to deceit, / let God weigh me with honest scales, that He may know my integrity. / If my steps have turned from the path, if my heart has followed my eyes, or if impurity has stuck to my hands, ..."
        },
        {
          "reference": "Proverbs 6:30-31",
          "text": "Men do not despise the thief if he steals to satisfy his hunger. / Yet if caught, he must pay sevenfold; he must give up all the wealth of his house."
        },
        {
          "reference": "Jeremiah 2:26",
          "text": "As the thief is ashamed when he is caught, so the house of Israel is disgraced. They, their kings, their officials, their priests, and their prophets"
        },
        {
          "reference": "Matthew 26:25",
          "text": "Then Judas, who would betray Him, said, “Surely not I, Rabbi?” Jesus answered, “You have said it yourself.”"
        },
        {
          "reference": "Matthew 27:3-5",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.” / So Judas threw the silver into the temple and left. Then he went away and hanged himself."
        },
        {
          "reference": "Mark 14:19",
          "text": "They began to be grieved and to ask Him one after another, “Surely not I?”"
        },
        {
          "reference": "Luke 22:23",
          "text": "Then they began to question among themselves which of them was going to do this."
        },
        {
          "reference": "John 13:22",
          "text": "The disciples looked at one another, perplexed as to which of them He meant."
        }
      ]
    },
    {
      "reference": "Genesis 44:10",
      "book": "Genesis",
      "chapter": 44,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "“Very well, then,” he said, “let it be as you say. Whoever is found to have it will become my slave; the rest of you will be free from blame.”"
        },
        {
          "version": "NLT",
          "text": "“That’s fair,” the man replied. “But only the one who stole the cup will be my slave. The rest of you may go free.”"
        },
        {
          "version": "ESV",
          "text": "He said, “Let it be as you say: he who is found with it shall be my servant, and the rest of you shall be innocent.”"
        },
        {
          "version": "NKJV",
          "text": "And he said, “Now also let it be according to your words; he with whom it is found shall be my slave, and you shall be blameless.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 31:32",
          "text": "If you find your gods with anyone here, he shall not live! In the presence of our relatives, see for yourself if anything is yours, and take it back.” For Jacob did not know that Rachel had stolen the idols."
        },
        {
          "reference": "Genesis 42:16",
          "text": "Send one of your number to get your brother; the rest of you will be confined so that the truth of your words may be tested. If they are untrue, then as surely as Pharaoh lives, you are spies!”"
        },
        {
          "reference": "Genesis 43:9",
          "text": "I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 44:17",
          "text": "But Joseph replied, “Far be it from me to do this. The man who was found with the cup will be my slave. The rest of you may return to your father in peace.”"
        },
        {
          "reference": "Exodus 22:3",
          "text": "But if it happens after sunrise, there is guilt for his bloodshed. A thief must make full restitution; if he has nothing, he himself shall be sold for his theft."
        },
        {
          "reference": "1 Samuel 14:39",
          "text": "As surely as the LORD who saves Israel lives, even if it is my son Jonathan, he must die!” But not one of the troops said a word."
        },
        {
          "reference": "1 Samuel 14:45",
          "text": "But the people said to Saul, “Must Jonathan die—he who accomplished such a great deliverance for Israel? Never! As surely as the LORD lives, not a hair of his head will fall to the ground, for with God’s help he has accomplished this today.” So the people rescued Jonathan, and he did not die."
        },
        {
          "reference": "2 Samuel 12:5-6",
          "text": "David burned with anger against the man and said to Nathan: “As surely as the LORD lives, the man who did this deserves to die! / Because he has done this thing and has shown no pity, he must pay for the lamb four times over.”"
        },
        {
          "reference": "1 Kings 20:39-40",
          "text": "As the king passed by, he cried out to the king: “Your servant had marched out into the middle of the battle, when suddenly a man came over with a captive and told me, ‘Guard this man! If he goes missing for any reason, your life will be exchanged for his life, or you will weigh out a talent of silver.’ / But while your servant was busy here and there, the man disappeared.” And the king of Israel said to him, “So shall your judgment be; you have pronounced it on yourself.”"
        },
        {
          "reference": "Job 31:5-8",
          "text": "If I have walked in falsehood or my foot has rushed to deceit, / let God weigh me with honest scales, that He may know my integrity. / If my steps have turned from the path, if my heart has followed my eyes, or if impurity has stuck to my hands, ..."
        },
        {
          "reference": "Proverbs 17:15",
          "text": "Acquitting the guilty and condemning the righteous—both are detestable to the LORD."
        },
        {
          "reference": "Proverbs 18:5",
          "text": "Showing partiality to the wicked is not good, nor is depriving the innocent of justice."
        },
        {
          "reference": "Isaiah 5:23",
          "text": "who acquit the guilty for a bribe and deprive the innocent of justice."
        },
        {
          "reference": "Jeremiah 26:15",
          "text": "But know for certain that if you put me to death, you will bring innocent blood upon yourselves, upon this city, and upon its residents; for truly the LORD has sent me to speak all these words in your hearing.”"
        },
        {
          "reference": "Matthew 7:2",
          "text": "For with the same judgment you pronounce, you will be judged, and with the measure you use, it will be measured to you."
        }
      ]
    },
    {
      "reference": "Genesis 44:11",
      "book": "Genesis",
      "chapter": 44,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Each of them quickly lowered his sack to the ground and opened it."
        },
        {
          "version": "NLT",
          "text": "They all quickly took their sacks from the backs of their donkeys and opened them."
        },
        {
          "version": "ESV",
          "text": "Then each man quickly lowered his sack to the ground, and each man opened his sack."
        },
        {
          "version": "NKJV",
          "text": "Then each man speedily let down his sack to the ground, and each opened his sack."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:25",
          "text": "Then Joseph gave orders to fill their bags with grain, to return each man’s silver to his sack, and to give them provisions for their journey. This order was carried out,"
        },
        {
          "reference": "Genesis 43:12",
          "text": "Take double the silver with you so that you may return the silver that was put back into the mouths of your sacks. Perhaps it was a mistake."
        },
        {
          "reference": "Genesis 43:18",
          "text": "But the brothers were frightened that they had been taken to Joseph’s house. “We have been brought here because of the silver that was returned in our bags the first time,” they said. “They intend to overpower us and take us as slaves, along with our donkeys.”"
        },
        {
          "reference": "Genesis 43:23",
          "text": "“It is fine,” said the steward. “Do not be afraid. Your God, the God of your father, gave you the treasure that was in your sacks. I received your silver.” Then he brought Simeon out to them."
        },
        {
          "reference": "Genesis 45:1-3",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Joshua 7:16-21",
          "text": "So Joshua arose early the next morning and had Israel come forward tribe by tribe, and the tribe of Judah was selected. / He had the clans of Judah come forward, and the clan of the Zerahites was selected. He had the clan of the Zerahites come forward, and the family of Zabdi was selected. / And he had the family of Zabdi come forward man by man, and Achan son of Carmi, the son of Zabdi, the son of Zerah, of the tribe of Judah, was selected. ..."
        },
        {
          "reference": "1 Samuel 9:20",
          "text": "As for the donkeys you lost three days ago, do not worry about them, for they have been found. And upon whom is all the desire of Israel, if not upon you and all your father’s house?”"
        },
        {
          "reference": "2 Kings 5:23",
          "text": "But Naaman insisted, “Please, take two talents.” And he urged Gehazi to accept them. Then he tied up two talents of silver in two bags along with two sets of clothing and gave them to two of his servants, who carried them ahead of Gehazi."
        },
        {
          "reference": "Nehemiah 5:10-12",
          "text": "I, as well as my brothers and my servants, have been lending the people money and grain. Please, let us stop this usury. / Please restore to them immediately their fields, vineyards, olive groves, and houses, along with the percentage of the money, grain, new wine, and oil that you have been assessing them.” / “We will restore it,” they replied, “and will require nothing more from them. We will do as you say.” So I summoned the priests and required of the nobles and officials an oath that they would do what they had promised."
        },
        {
          "reference": "Job 31:39",
          "text": "if I have devoured its produce without payment or broken the spirit of its tenants,"
        },
        {
          "reference": "Proverbs 20:14",
          "text": "“Worthless, worthless!” says the buyer, but on the way out, he gloats."
        },
        {
          "reference": "Isaiah 55:1-2",
          "text": "“Come, all you who are thirsty, come to the waters; and you without money, come, buy, and eat! Come, buy wine and milk without money and without cost! / Why spend money on that which is not bread, and your labor on that which does not satisfy? Listen carefully to Me, and eat what is good, and your soul will delight in the richest of foods."
        },
        {
          "reference": "Jeremiah 32:10-12",
          "text": "I signed and sealed the deed, called in witnesses, and weighed out the silver on the scales. / Then I took the deed of purchase—the sealed copy with its terms and conditions, as well as the open copy— / and I gave this deed to Baruch son of Neriah, the son of Mahseiah, in the sight of my cousin Hanamel and the witnesses who were signing the purchase agreement and all the Jews sitting in the courtyard of the guard."
        },
        {
          "reference": "Matthew 26:15",
          "text": "and asked, “What are you willing to give me if I hand Him over to you?” And they set out for him thirty pieces of silver."
        }
      ]
    },
    {
      "reference": "Genesis 44:12",
      "book": "Genesis",
      "chapter": 44,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the steward proceeded to search, beginning with the oldest and ending with the youngest. And the cup was found in Benjamin’s sack."
        },
        {
          "version": "NLT",
          "text": "The palace manager searched the brothers’ sacks, from the oldest to the youngest. And the cup was found in Benjamin’s sack!"
        },
        {
          "version": "ESV",
          "text": "And he searched, beginning with the eldest and ending with the youngest. And the cup was found in Benjamin’s sack."
        },
        {
          "version": "NKJV",
          "text": "So he searched. He began with the oldest and left off with the youngest; and the cup was found in Benjamin’s sack."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:25-28",
          "text": "Then Joseph gave orders to fill their bags with grain, to return each man’s silver to his sack, and to give them provisions for their journey. This order was carried out, / and they loaded the grain on their donkeys and departed. / At the place where they lodged for the night, one of them opened his sack to get feed for his donkey, and he saw his silver in the mouth of the sack. ..."
        },
        {
          "reference": "Genesis 43:18-23",
          "text": "But the brothers were frightened that they had been taken to Joseph’s house. “We have been brought here because of the silver that was returned in our bags the first time,” they said. “They intend to overpower us and take us as slaves, along with our donkeys.” / So they approached Joseph’s steward and spoke to him at the entrance to the house. / “Please, sir,” they said, “we really did come down here the first time to buy food. ..."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "1 Samuel 9:20",
          "text": "As for the donkeys you lost three days ago, do not worry about them, for they have been found. And upon whom is all the desire of Israel, if not upon you and all your father’s house?”"
        },
        {
          "reference": "1 Kings 3:16-28",
          "text": "At that time two prostitutes came to the king and stood before him. / One woman said, “Please, my lord, this woman and I live in the same house, and I gave birth while she was in the house. / On the third day after I gave birth, this woman also had a baby. We were alone, with no one in the house but the two of us. ..."
        },
        {
          "reference": "2 Kings 5:26-27",
          "text": "But Elisha questioned him, “Did not my spirit go with you when the man got down from his chariot to meet you? Is this the time to accept money and clothing, olive groves and vineyards, sheep and oxen, menservants and maidservants? / Therefore, the leprosy of Naaman will cling to you and your descendants forever!” And as Gehazi left his presence, he was leprous—as white as snow."
        },
        {
          "reference": "Job 12:16",
          "text": "True wisdom and power belong to Him. The deceived and the deceiver are His."
        },
        {
          "reference": "Psalm 105:17-22",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right. ..."
        },
        {
          "reference": "Proverbs 21:30",
          "text": "There is no wisdom, no understanding, no counsel that can prevail against the LORD."
        },
        {
          "reference": "Isaiah 46:10",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’"
        },
        {
          "reference": "Jeremiah 29:11",
          "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, to give you a future and a hope."
        }
      ]
    },
    {
      "reference": "Genesis 44:13",
      "book": "Genesis",
      "chapter": 44,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "At this, they tore their clothes. Then they all loaded their donkeys and returned to the city."
        },
        {
          "version": "NLT",
          "text": "When the brothers saw this, they tore their clothing in despair. Then they loaded their donkeys again and returned to the city."
        },
        {
          "version": "ESV",
          "text": "Then they tore their clothes, and every man loaded his donkey, and they returned to the city."
        },
        {
          "version": "NKJV",
          "text": "Then they tore their clothes, and each man loaded his donkey and returned to the city."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:29-34",
          "text": "When Reuben returned to the pit and saw that Joseph was not there, he tore his clothes, / returned to his brothers, and said, “The boy is gone! What am I going to do?” / Then they took Joseph’s robe, slaughtered a young goat, and dipped the robe in its blood. ..."
        },
        {
          "reference": "Genesis 42:35-38",
          "text": "As they began emptying their sacks, there in each man’s sack was his bag of silver! And when they and their father saw the bags of silver, they were dismayed. / Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!” / Then Reuben said to his father, “You may kill my two sons if I fail to bring him back to you. Put him in my care, and I will return him.” ..."
        },
        {
          "reference": "2 Samuel 1:11-12",
          "text": "Then David took hold of his own clothes and tore them, and all the men who were with him did the same. / They mourned and wept and fasted until evening for Saul and his son Jonathan, and for the people of the LORD and the house of Israel, because they had fallen by the sword."
        },
        {
          "reference": "Joshua 7:6",
          "text": "Then Joshua tore his clothes and fell facedown before the ark of the LORD until evening, as did the elders of Israel; and they all sprinkled dust on their heads."
        },
        {
          "reference": "2 Kings 18:37",
          "text": "Then Hilkiah’s son Eliakim the palace administrator, Shebna the scribe, and Asaph’s son Joah the recorder came to Hezekiah with their clothes torn, and they relayed to him the words of the Rabshakeh."
        },
        {
          "reference": "Job 1:20",
          "text": "Then Job stood up, tore his robe, and shaved his head. He fell to the ground and worshiped,"
        },
        {
          "reference": "Jeremiah 36:24",
          "text": "Yet in hearing all these words, the king and his servants did not become frightened or tear their garments."
        },
        {
          "reference": "2 Samuel 13:31",
          "text": "Then the king stood up, tore his clothes, and lay down on the ground. And all his servants stood by with their clothes torn."
        },
        {
          "reference": "Numbers 14:6",
          "text": "Joshua son of Nun and Caleb son of Jephunneh, who were among those who had spied out the land, tore their clothes"
        },
        {
          "reference": "1 Kings 21:27",
          "text": "When Ahab heard these words, he tore his clothes, put on sackcloth, and fasted. He lay down in sackcloth and walked around meekly."
        },
        {
          "reference": "Matthew 26:65",
          "text": "At this, the high priest tore his clothes and declared, “He has blasphemed! Why do we need any more witnesses? Look, now you have heard the blasphemy."
        },
        {
          "reference": "Acts 14:14",
          "text": "But when the apostles Barnabas and Paul found out about this, they tore their clothes and rushed into the crowd, shouting,"
        },
        {
          "reference": "Mark 14:63",
          "text": "At this, the high priest tore his clothes and declared, “Why do we need any more witnesses?"
        },
        {
          "reference": "Luke 19:41",
          "text": "As Jesus approached Jerusalem and saw the city, He wept over it"
        },
        {
          "reference": "John 11:33-35",
          "text": "When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled. / “Where have you put him?” He asked. “Come and see, Lord,” they answered. / Jesus wept."
        }
      ]
    },
    {
      "reference": "Genesis 44:14",
      "book": "Genesis",
      "chapter": 44,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph was still in the house when Judah and his brothers came in, and they threw themselves to the ground before him."
        },
        {
          "version": "NLT",
          "text": "Joseph was still in his palace when Judah and his brothers arrived, and they fell to the ground before him."
        },
        {
          "version": "ESV",
          "text": "When Judah and his brothers came to Joseph’s house, he was still there. They fell before him to the ground."
        },
        {
          "version": "NKJV",
          "text": "So Judah and his brothers came to Joseph’s house, and he was still there; and they fell before him on the ground."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:26-28",
          "text": "Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. / So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        },
        {
          "reference": "Genesis 43:26-28",
          "text": "When Joseph came home, they presented him with the gifts they had brought, and they bowed to the ground before him. / He asked if they were well, and then he asked, “How is your elderly father you told me about? Is he still alive?” / “Your servant our father is well,” they answered. “He is still alive.” And they bowed down to honor him."
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:18-21",
          "text": "His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. ..."
        },
        {
          "reference": "Exodus 32:31-32",
          "text": "So Moses returned to the LORD and said, “Oh, what a great sin these people have committed! They have made gods of gold for themselves. / Yet now, if You would only forgive their sin.... But if not, please blot me out of the book that You have written.”"
        },
        {
          "reference": "1 Samuel 26:18-19",
          "text": "And he continued, “Why is my lord pursuing his servant? What have I done? What evil is in my hand? / Now please, may my lord the king hear the words of his servant: If the LORD has stirred you up against me, then may He accept an offering. But if men have done it, may they be cursed in the presence of the LORD! For today they have driven me away from sharing in the inheritance of the LORD, saying, ‘Go, serve other gods.’"
        },
        {
          "reference": "2 Samuel 14:33",
          "text": "So Joab went and told the king, and David summoned Absalom, who came to him and bowed facedown before him. Then the king kissed Absalom."
        },
        {
          "reference": "2 Kings 5:15",
          "text": "Then Naaman and all his attendants went back to the man of God, stood before him, and declared, “Now I know for sure that there is no God in all the earth except in Israel. So please accept a gift from your servant.”"
        },
        {
          "reference": "Job 1:20-21",
          "text": "Then Job stood up, tore his robe, and shaved his head. He fell to the ground and worshiped, / saying: “Naked I came from my mother’s womb, and naked I will return. The LORD gave, and the LORD has taken away. Blessed be the name of the LORD.”"
        },
        {
          "reference": "Isaiah 45:14",
          "text": "This is what the LORD says: “The products of Egypt and the merchandise of Cush, along with the Sabeans, men of stature, will come over to you and will be yours; they will trudge behind you; they will come over in chains and bow down to you. They will confess to you: ‘God is indeed with you, and there is no other; there is no other God.’”"
        },
        {
          "reference": "Jeremiah 26:14-15",
          "text": "As for me, here I am in your hands; do to me what you think is good and right. / But know for certain that if you put me to death, you will bring innocent blood upon yourselves, upon this city, and upon its residents; for truly the LORD has sent me to speak all these words in your hearing.”"
        },
        {
          "reference": "Matthew 18:26-27",
          "text": "Then the servant fell on his knees before him. ‘Have patience with me,’ he begged, ‘and I will pay back everything.’ / His master had compassion on him, forgave his debt, and released him."
        },
        {
          "reference": "Matthew 27:3-4",
          "text": "When Judas, who had betrayed Him, saw that Jesus was condemned, he was filled with remorse and returned the thirty pieces of silver to the chief priests and elders. / “I have sinned by betraying innocent blood,” he said. “What is that to us?” they replied. “You bear the responsibility.”"
        },
        {
          "reference": "Luke 15:18-19",
          "text": "I will get up and go back to my father and say to him, “Father, I have sinned against heaven and against you. / I am no longer worthy to be called your son. Make me like one of your hired servants.”’"
        }
      ]
    },
    {
      "reference": "Genesis 44:15",
      "book": "Genesis",
      "chapter": 44,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph said to them, “What is this you have done? Don’t you know that a man like me can find things out by divination?”"
        },
        {
          "version": "NLT",
          "text": "“What have you done?” Joseph demanded. “Don’t you know that a man like me can predict the future?”"
        },
        {
          "version": "ESV",
          "text": "Joseph said to them, “What deed is this that you have done? Do you not know that a man like me can indeed practice divination?”"
        },
        {
          "version": "NKJV",
          "text": "And Joseph said to them, “What deed is this you have done? Did you not know that such a man as I can certainly practice divination?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:18-20",
          "text": "and on the third day he said to them, “I fear God. So do this and you will live: / If you are honest, leave one of your brothers in custody while the rest of you go and take back grain to relieve the hunger of your households. / Then bring your youngest brother to me so that your words can be verified, that you may not die.” And to this they consented."
        },
        {
          "reference": "Genesis 43:9-10",
          "text": "I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life. / If we had not delayed, we could have come and gone twice by now.”"
        },
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:19-20",
          "text": "But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 21:16",
          "text": "Whoever kidnaps another man must be put to death, whether he sells him or the man is found in his possession."
        },
        {
          "reference": "1 Samuel 12:3",
          "text": "Here I am. Bear witness against me before the LORD and before His anointed: Whose ox or donkey have I taken? Whom have I cheated or oppressed? From whose hand have I accepted a bribe and closed my eyes? Tell me, and I will restore it to you.”"
        },
        {
          "reference": "2 Samuel 12:7-9",
          "text": "Then Nathan said to David, “You are that man! This is what the LORD, the God of Israel, says: ‘I anointed you king over Israel, and I delivered you from the hand of Saul. / I gave your master’s house to you and your master’s wives into your arms. I gave you the house of Israel and Judah, and if that was not enough, I would have given you even more. / Why then have you despised the command of the LORD by doing evil in His sight? You put Uriah the Hittite to the sword and took his wife as your own. You have slain him with the sword of the Ammonites."
        },
        {
          "reference": "1 Kings 3:16-28",
          "text": "At that time two prostitutes came to the king and stood before him. / One woman said, “Please, my lord, this woman and I live in the same house, and I gave birth while she was in the house. / On the third day after I gave birth, this woman also had a baby. We were alone, with no one in the house but the two of us. ..."
        },
        {
          "reference": "2 Kings 5:25-27",
          "text": "When Gehazi went in and stood before his master, Elisha asked him, “Gehazi, where have you been?” “Your servant did not go anywhere,” he replied. / But Elisha questioned him, “Did not my spirit go with you when the man got down from his chariot to meet you? Is this the time to accept money and clothing, olive groves and vineyards, sheep and oxen, menservants and maidservants? / Therefore, the leprosy of Naaman will cling to you and your descendants forever!” And as Gehazi left his presence, he was leprous—as white as snow."
        },
        {
          "reference": "Job 34:22",
          "text": "There is no darkness or deep shadow where the workers of iniquity can hide."
        },
        {
          "reference": "Psalm 44:21",
          "text": "would not God have discovered, since He knows the secrets of the heart?"
        },
        {
          "reference": "Proverbs 20:27",
          "text": "The spirit of a man is the lamp of the LORD, searching out his inmost being."
        },
        {
          "reference": "Isaiah 29:15",
          "text": "Woe to those who dig deep to hide their plans from the LORD. In darkness they do their works and say, “Who sees us, and who will know?”"
        },
        {
          "reference": "Jeremiah 17:10",
          "text": "I, the LORD, search the heart; I examine the mind to reward a man according to his way, by what his deeds deserve."
        }
      ]
    },
    {
      "reference": "Genesis 44:16",
      "book": "Genesis",
      "chapter": 44,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "“What can we say to my lord?” Judah replied. “What can we say? How can we prove our innocence? God has uncovered your servants’ guilt. We are now my lord’s slaves—we ourselves and the one who was found to have the cup.”"
        },
        {
          "version": "NLT",
          "text": "Judah answered, “Oh, my lord, what can we say to you? How can we explain this? How can we prove our innocence? God is punishing us for our sins. My lord, we have all returned to be your slaves—all of us, not just our brother who had your cup in his sack.”"
        },
        {
          "version": "ESV",
          "text": "And Judah said, “What shall we say to my lord? What shall we speak? Or how can we clear ourselves? God has found out the guilt of your servants; behold, we are my lord’s servants, both we and he also in whose hand the cup has been found.”"
        },
        {
          "version": "NKJV",
          "text": "Then Judah said, “What shall we say to my lord? What shall we speak? Or how shall we clear ourselves? God has found out the iniquity of your servants; here we are, my lord’s slaves, both we and he also with whom the cup was found.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:18-28",
          "text": "Now Joseph’s brothers saw him in the distance, and before he arrived, they plotted to kill him. / “Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!” ..."
        },
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 43:9",
          "text": "I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 50:15-18",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Exodus 10:16-17",
          "text": "Pharaoh quickly summoned Moses and Aaron and said, “I have sinned against the LORD your God and against you. / Now please forgive my sin once more and appeal to the LORD your God, that He may remove this death from me.”"
        },
        {
          "reference": "1 Samuel 12:19",
          "text": "They pleaded with Samuel, “Pray to the LORD your God for your servants so that we will not die! For we have added to all our sins the evil of asking for a king.”"
        },
        {
          "reference": "2 Samuel 24:10",
          "text": "After David had numbered the troops, his conscience was stricken and he said to the LORD, “I have sinned greatly in what I have done. Now, O LORD, I beg You to take away the iniquity of Your servant, for I have acted very foolishly.”"
        },
        {
          "reference": "1 Kings 8:46-50",
          "text": "When they sin against You—for there is no one who does not sin—and You become angry with them and deliver them to an enemy who takes them as captives to his own land, whether far or near, / and when they come to their senses in the land to which they were taken, and they repent and plead with You in the land of their captors, saying, ‘We have sinned and done wrong; we have acted wickedly,’ / and when they return to You with all their heart and soul in the land of the enemies who took them captive, and when they pray to You in the direction of the land that You gave to their fathers, the city You have chosen, and the house I have built for Your Name, ..."
        },
        {
          "reference": "Job 9:20",
          "text": "Even if I were righteous, my mouth would condemn me; if I were blameless, it would declare me guilty."
        },
        {
          "reference": "Job 40:4-5",
          "text": "“Behold, I am insignificant. How can I reply to You? I place my hand over my mouth. / I have spoken once, but I have no answer—twice, but I have nothing to add.”"
        },
        {
          "reference": "Psalm 51:3-4",
          "text": "For I know my transgressions, and my sin is always before me. / Against You, You only, have I sinned and done what is evil in Your sight, so that You may be proved right when You speak and blameless when You judge."
        },
        {
          "reference": "Isaiah 6:5",
          "text": "Then I said: “Woe is me, for I am ruined, because I am a man of unclean lips dwelling among a people of unclean lips; for my eyes have seen the King, the LORD of Hosts.”"
        },
        {
          "reference": "Jeremiah 3:25",
          "text": "Let us lie down in our shame; let our disgrace cover us. We have sinned against the LORD our God, both we and our fathers; from our youth even to this day we have not obeyed the voice of the LORD our God.”"
        },
        {
          "reference": "Daniel 9:5-8",
          "text": "we have sinned and done wrong. We have acted wickedly and rebelled. We have turned away from Your commandments and ordinances. / We have not listened to Your servants the prophets, who spoke in Your name to our kings, leaders, fathers, and all the people of the land. / To You, O Lord, belongs righteousness, but this day we are covered with shame—the men of Judah, the people of Jerusalem, and all Israel near and far, in all the countries to which You have driven us because of our unfaithfulness to You. ..."
        }
      ]
    },
    {
      "reference": "Genesis 44:17",
      "book": "Genesis",
      "chapter": 44,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "But Joseph said, &#8220Far be it from me to do such a thing! Only the man who was found to have the cup will become my slave. The rest of you, go back to your father in peace.”"
        },
        {
          "version": "NLT",
          "text": "“No,” Joseph said. “I would never do such a thing! Only the man who stole the cup will be my slave. The rest of you may go back to your father in peace.”"
        },
        {
          "version": "ESV",
          "text": "But he said, “Far be it from me that I should do so! Only the man in whose hand the cup was found shall be my servant. But as for you, go up in peace to your father.”"
        },
        {
          "version": "NKJV",
          "text": "But he said, “Far be it from me that I should do so; the man in whose hand the cup was found, he shall be my slave. And as for you, go up in peace to your father.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 44:18",
      "book": "Genesis",
      "chapter": 44,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Judah went up to him and said: “Pardon your servant, my lord, let me speak a word to my lord. Do not be angry with your servant, though you are equal to Pharaoh himself."
        },
        {
          "version": "NLT",
          "text": "Then Judah stepped forward and said, “Please, my lord, let your servant say just one word to you. Please, do not be angry with me, even though you are as powerful as Pharaoh himself."
        },
        {
          "version": "ESV",
          "text": "Then Judah went up to him and said, “Oh, my lord, please let your servant speak a word in my lord’s ears, and let not your anger burn against your servant, for you are like Pharaoh himself."
        },
        {
          "version": "NKJV",
          "text": "Then Judah came near to him and said: “O my lord, please let your servant speak a word in my lord’s hearing, and do not let your anger burn against your servant; for you are even like Pharaoh."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 18:23-33",
          "text": "Abraham stepped forward and said, “Will You really sweep away the righteous with the wicked? / What if there are fifty righteous ones in the city? Will You really sweep it away and not spare the place for the sake of the fifty righteous ones who are there? / Far be it from You to do such a thing—to kill the righteous with the wicked, so that the righteous and the wicked are treated alike. Far be it from You! Will not the Judge of all the earth do what is right?” ..."
        },
        {
          "reference": "Exodus 32:11-14",
          "text": "But Moses sought the favor of the LORD his God, saying, “O LORD, why does Your anger burn against Your people, whom You brought out of the land of Egypt with great power and a mighty hand? / Why should the Egyptians declare, ‘He brought them out with evil intent, to kill them in the mountains and wipe them from the face of the earth’? Turn from Your fierce anger and relent from doing harm to Your people. / Remember Your servants Abraham, Isaac, and Israel, to whom You swore by Your very self when You declared, ‘I will make your descendants as numerous as the stars in the sky, and I will give your descendants all this land that I have promised, and it shall be their inheritance forever.’” ..."
        },
        {
          "reference": "1 Samuel 25:24-31",
          "text": "She fell at his feet and said, “My lord, may the blame be on me alone, but please let your servant speak to you; hear the words of your servant. / My lord should pay no attention to this scoundrel Nabal, for he lives up to his name: His name means Fool, and folly accompanies him. I, your servant, did not see my lord’s young men whom you sent. / Now, my lord, as surely as the LORD lives and you yourself live, since the LORD has held you back from bloodshed and from avenging yourself with your own hand, may your enemies and those who seek harm for my lord be like Nabal. ..."
        },
        {
          "reference": "2 Samuel 14:12-20",
          "text": "Then the woman said, “Please, may your servant speak a word to my lord the king?” “Speak,” he replied. / The woman asked, “Why have you devised a thing like this against the people of God? When the king says this, does he not convict himself, since he has not brought back his own banished son? / For we will surely die and be like water poured out on the ground, which cannot be recovered. Yet God does not take away a life, but He devises ways that the banished one may not be cast out from Him. ..."
        },
        {
          "reference": "Esther 8:3-6",
          "text": "And once again, Esther addressed the king. She fell at his feet weeping and begged him to revoke the evil scheme of Haman the Agagite, which he had devised against the Jews. / The king extended the gold scepter toward Esther, and she arose and stood before the king. / “If it pleases the king,” she said, “and if I have found favor in his sight, and the matter seems proper to the king, and I am pleasing in his sight, may an order be written to revoke the letters that the scheming Haman son of Hammedatha, the Agagite, wrote to destroy the Jews in all the king’s provinces. ..."
        },
        {
          "reference": "Job 9:15",
          "text": "For even if I were right, I could not answer. I could only beg my Judge for mercy."
        },
        {
          "reference": "Isaiah 1:18",
          "text": "“Come now, let us reason together,” says the LORD. “Though your sins are like scarlet, they will be as white as snow; though they are as red as crimson, they will become like wool."
        },
        {
          "reference": "Jeremiah 38:9",
          "text": "“My lord the king, these men have acted wickedly in all that they have done to Jeremiah the prophet. They have dropped him into the cistern, where he will starve to death, for there is no more bread in the city.”"
        },
        {
          "reference": "Daniel 9:3-19",
          "text": "So I turned my attention to the Lord God to seek Him by prayer and petition, with fasting, sackcloth, and ashes. / And I prayed to the LORD my God and confessed, “O, Lord, the great and awesome God, who keeps His covenant of loving devotion to those who love Him and keep His commandments, / we have sinned and done wrong. We have acted wickedly and rebelled. We have turned away from Your commandments and ordinances. ..."
        },
        {
          "reference": "Matthew 15:22-28",
          "text": "And a Canaanite woman from that region came to Him, crying out, “Lord, Son of David, have mercy on me! My daughter is miserably possessed by a demon.” / But Jesus did not answer a word. So His disciples came and urged Him, “Send her away, for she keeps crying out after us.” / He answered, “I was sent only to the lost sheep of the house of Israel.” ..."
        },
        {
          "reference": "Matthew 18:26",
          "text": "Then the servant fell on his knees before him. ‘Have patience with me,’ he begged, ‘and I will pay back everything.’"
        },
        {
          "reference": "Luke 7:3-6",
          "text": "When the centurion heard about Jesus, he sent some Jewish elders to ask Him to come and heal his servant. / They came to Jesus and pleaded with Him earnestly, “This man is worthy to have You grant this, / for he loves our nation and has built our synagogue.” ..."
        },
        {
          "reference": "Luke 18:1-8",
          "text": "Then Jesus told them a parable about their need to pray at all times and not lose heart: / “In a certain town there was a judge who neither feared God nor respected men. / And there was a widow in that town who kept appealing to him, ‘Give me justice against my adversary.’ ..."
        },
        {
          "reference": "John 4:47-50",
          "text": "When he heard that Jesus had come from Judea to Galilee, he went and begged Him to come down and heal his son, who was about to die. / Jesus said to him, “Unless you people see signs and wonders, you will never believe.” / “Sir,” the official said, “come down before my child dies.” ..."
        },
        {
          "reference": "Acts 7:2-53",
          "text": "And Stephen declared: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Haran, / and told him, ‘Leave your country and your kindred and go to the land I will show you.’ / So Abraham left the land of the Chaldeans and settled in Haran. After his father died, God brought him out of that place and into this land where you are now living. ..."
        }
      ]
    },
    {
      "reference": "Genesis 44:19",
      "book": "Genesis",
      "chapter": 44,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "My lord asked his servants, &#8216Do you have a father or a brother?’"
        },
        {
          "version": "NLT",
          "text": "“My lord, previously you asked us, your servants, ‘Do you have a father or a brother?’"
        },
        {
          "version": "ESV",
          "text": "My lord asked his servants, saying, ‘Have you a father, or a brother?’"
        },
        {
          "version": "NKJV",
          "text": "My lord asked his servants, saying, ‘Have you a father or a brother?’"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 44:20",
      "book": "Genesis",
      "chapter": 44,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "And we answered, ‘We have an aged father, and there is a young son born to him in his old age. His brother is dead, and he is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "version": "NLT",
          "text": "And we responded, ‘Yes, my lord, we have a father who is an old man, and his youngest son is a child of his old age. His full brother is dead, and he alone is left of his mother’s children, and his father loves him very much.’"
        },
        {
          "version": "ESV",
          "text": "And we said to my lord, ‘We have a father, an old man, and a young brother, the child of his old age. His brother is dead, and he alone is left of his mother’s children, and his father loves him.’"
        },
        {
          "version": "NKJV",
          "text": "And we said to my lord, ‘We have a father, an old man, and a child of his old age, who is young; his brother is dead, and he alone is left of his mother’s children, and his father loves him.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 42:38",
          "text": "But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 46:19",
          "text": "The sons of Jacob’s wife Rachel: Joseph and Benjamin."
        },
        {
          "reference": "Genesis 48:16",
          "text": "the angel who has redeemed me from all harm—may He bless these boys. And may they be called by my name and the names of my fathers Abraham and Isaac, and may they grow into a multitude upon the earth.”"
        },
        {
          "reference": "Genesis 49:26",
          "text": "The blessings of your father have surpassed the blessings of the ancient mountains and the bounty of the everlasting hills. May they rest on the head of Joseph, on the brow of the prince of his brothers."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Psalm 127:3-5",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward. / Like arrows in the hand of a warrior, so are children born in one’s youth. / Blessed is the man whose quiver is full of them. He will not be put to shame when he confronts the enemies at the gate."
        },
        {
          "reference": "Matthew 1:2",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Matthew 2:13-15",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.” / So he got up, took the Child and His mother by night, and withdrew to Egypt, / where he stayed until the death of Herod. This fulfilled what the Lord had spoken through the prophet: “Out of Egypt I called My Son.”"
        },
        {
          "reference": "Matthew 3:17",
          "text": "And a voice from heaven said, “This is My beloved Son, in whom I am well pleased!”"
        },
        {
          "reference": "Matthew 12:18",
          "text": "“Here is My Servant, whom I have chosen, My beloved, in whom My soul delights. I will put My Spirit on Him, and He will proclaim justice to the nations."
        },
        {
          "reference": "Luke 2:48-49",
          "text": "When His parents saw Him, they were astonished. “Child, why have You done this to us?” His mother asked. “Your father and I have been anxiously searching for You.” / “Why were you looking for Me?” He asked. “Did you not know that I had to be in My Father’s house?”"
        }
      ]
    },
    {
      "reference": "Genesis 44:21",
      "book": "Genesis",
      "chapter": 44,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "“Then you said to your servants, &#8216Bring him down to me so I can see him for myself.’"
        },
        {
          "version": "NLT",
          "text": "“And you said to us, ‘Bring him here so I can see him with my own eyes.’"
        },
        {
          "version": "ESV",
          "text": "Then you said to your servants, ‘Bring him down to me, that I may set my eyes on him.’"
        },
        {
          "version": "NKJV",
          "text": "Then you said to your servants, ‘Bring him down to me, that I may set my eyes on him.’"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 44:22",
      "book": "Genesis",
      "chapter": 44,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "And we said to my lord, ‘The boy cannot leave his father; if he leaves him, his father will die.’"
        },
        {
          "version": "NLT",
          "text": "But we said to you, ‘My lord, the boy cannot leave his father, for his father would die.’"
        },
        {
          "version": "ESV",
          "text": "We said to my lord, ‘The boy cannot leave his father, for if he should leave his father, his father would die.’"
        },
        {
          "version": "NKJV",
          "text": "And we said to my lord, ‘The lad cannot leave his father, for if he should leave his father, his father would die.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:38",
          "text": "But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:4",
          "text": "But Jacob did not send Joseph’s brother Benjamin with his brothers, for he said, “I am afraid that harm might befall him.”"
        },
        {
          "reference": "Genesis 44:30-31",
          "text": "So if the boy is not with us when I return to your servant, and if my father, whose life is wrapped up in the boy’s life, / sees that the boy is not with us, he will die. Then your servants will have brought the gray hair of your servant our father down to Sheol in sorrow."
        },
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 37:23-24",
          "text": "So when Joseph came to his brothers, they stripped him of his robe—the robe of many colors he was wearing— / and they took him and threw him into the pit. Now the pit was empty, with no water in it."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Exodus 20:12",
          "text": "Honor your father and mother, so that your days may be long in the land that the LORD your God is giving you."
        },
        {
          "reference": "Deuteronomy 6:7",
          "text": "And you shall teach them diligently to your children and speak of them when you sit at home and when you walk along the road, when you lie down and when you get up."
        },
        {
          "reference": "1 Samuel 18:1-3",
          "text": "After David had finished speaking with Saul, the souls of Jonathan and David were knit together, and Jonathan loved him as himself. / And from that day Saul kept David with him and did not let him return to his father’s house. / Then Jonathan made a covenant with David because he loved him as himself."
        },
        {
          "reference": "1 Kings 3:26",
          "text": "Then the woman whose son was alive spoke to the king because she yearned with compassion for her son. “Please, my lord,” she said, “give her the living baby. Do not kill him!” But the other woman said, “He will be neither mine nor yours. Cut him in two!”"
        }
      ]
    },
    {
      "reference": "Genesis 44:23",
      "book": "Genesis",
      "chapter": 44,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "But you told your servants, ‘Unless your youngest brother comes down with you, you will not see my face again.’"
        },
        {
          "version": "NLT",
          "text": "But you told us, ‘Unless your youngest brother comes with you, you will never see my face again.’"
        },
        {
          "version": "ESV",
          "text": "Then you said to your servants, ‘Unless your youngest brother comes down with you, you shall not see my face again.’"
        },
        {
          "version": "NKJV",
          "text": "But you said to your servants, ‘Unless your youngest brother comes down with you, you shall see my face no more.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:38",
          "text": "But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 42:15-16",
          "text": "And this is how you will be tested: As surely as Pharaoh lives, you shall not leave this place unless your youngest brother comes here. / Send one of your number to get your brother; the rest of you will be confined so that the truth of your words may be tested. If they are untrue, then as surely as Pharaoh lives, you are spies!”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 42:20",
          "text": "Then bring your youngest brother to me so that your words can be verified, that you may not die.” And to this they consented."
        },
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Matthew 10:37",
          "text": "Anyone who loves his father or mother more than Me is not worthy of Me; anyone who loves his son or daughter more than Me is not worthy of Me;"
        },
        {
          "reference": "Luke 15:20-24",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him. / The son declared, ‘Father, I have sinned against heaven and against you. I am no longer worthy to be called your son.’ / But the father said to his servants, ‘Quick! Bring the best robe and put it on him. Put a ring on his finger and sandals on his feet. ..."
        },
        {
          "reference": "John 11:50-52",
          "text": "You do not realize that it is better for you that one man die for the people than that the whole nation perish.” / Caiaphas did not say this on his own. Instead, as high priest that year, he was prophesying that Jesus would die for the nation, / and not only for the nation, but also for the scattered children of God, to gather them together into one."
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        }
      ]
    },
    {
      "reference": "Genesis 44:24",
      "book": "Genesis",
      "chapter": 44,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "When we went back to your servant my father, we told him what my lord had said."
        },
        {
          "version": "NLT",
          "text": "“So we returned to your servant, our father, and told him what you had said."
        },
        {
          "version": "ESV",
          "text": "“When we went back to your servant my father, we told him the words of my lord."
        },
        {
          "version": "NKJV",
          "text": "“So it was, when we went up to your servant my father, that we told him the words of my lord."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:38",
          "text": "But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 42:36",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!”"
        },
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Exodus 20:12",
          "text": "Honor your father and mother, so that your days may be long in the land that the LORD your God is giving you."
        },
        {
          "reference": "Deuteronomy 5:16",
          "text": "Honor your father and your mother, as the LORD your God has commanded you, so that your days may be long and that it may go well with you in the land that the LORD your God is giving you."
        },
        {
          "reference": "1 Samuel 22:3-4",
          "text": "From there David went to Mizpeh of Moab, where he said to the king of Moab, “Please let my father and mother stay with you until I learn what God will do for me.” / So he left them in the care of the king of Moab, and they stayed with him the whole time David was in the stronghold."
        },
        {
          "reference": "2 Samuel 14:13-14",
          "text": "The woman asked, “Why have you devised a thing like this against the people of God? When the king says this, does he not convict himself, since he has not brought back his own banished son? / For we will surely die and be like water poured out on the ground, which cannot be recovered. Yet God does not take away a life, but He devises ways that the banished one may not be cast out from Him."
        },
        {
          "reference": "1 Kings 2:19",
          "text": "So Bathsheba went to King Solomon to speak to him for Adonijah. The king stood up to greet her, bowed to her, and sat down on his throne. Then the king had a throne brought for his mother, who sat down at his right hand."
        },
        {
          "reference": "Matthew 15:4-6",
          "text": "For God said, ‘Honor your father and mother’ and ‘Anyone who curses his father or mother must be put to death.’ / But you say that if anyone says to his father or mother, ‘Whatever you would have received from me is a gift devoted to God,’ / he need not honor his father or mother with it. Thus you nullify the word of God for the sake of your tradition."
        },
        {
          "reference": "Matthew 19:19",
          "text": "honor your father and mother, and love your neighbor as yourself.’”"
        }
      ]
    },
    {
      "reference": "Genesis 44:25",
      "book": "Genesis",
      "chapter": 44,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "“Then our father said, ‘Go back and buy a little more food.’"
        },
        {
          "version": "NLT",
          "text": "Later, when he said, ‘Go back again and buy us more food,’"
        },
        {
          "version": "ESV",
          "text": "And when our father said, ‘Go again, buy us a little food,’"
        },
        {
          "version": "NKJV",
          "text": "And our father said, ‘Go back and buy us a little food.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:1-2",
          "text": "When Jacob learned that there was grain in Egypt, he said to his sons, “Why are you staring at one another?” / “Look,” he added, “I have heard that there is grain in Egypt. Go down there and buy some for us, so that we may live and not die.”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 42:36-38",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!” / Then Reuben said to his father, “You may kill my two sons if I fail to bring him back to you. Put him in my care, and I will return him.” / But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 46:28-30",
          "text": "Now Jacob had sent Judah ahead of him to Joseph to get directions to Goshen. When Jacob’s family arrived in the land of Goshen, / Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:9-14",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Matthew 2:13-15",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.” / So he got up, took the Child and His mother by night, and withdrew to Egypt, / where he stayed until the death of Herod. This fulfilled what the Lord had spoken through the prophet: “Out of Egypt I called My Son.”"
        },
        {
          "reference": "Luke 24:25-27",
          "text": "Then Jesus said to them, “O foolish ones, and slow of heart to believe all that the prophets have spoken! / Was it not necessary for the Christ to suffer these things and then to enter His glory?” / And beginning with Moses and all the Prophets, He explained to them what was written in all the Scriptures about Himself."
        },
        {
          "reference": "John 4:5-6",
          "text": "So He came to a town of Samaria called Sychar, near the plot of ground that Jacob had given to his son Joseph. / Since Jacob’s well was there, Jesus, weary from His journey, sat down by the well. It was about the sixth hour."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Acts 3:25-26",
          "text": "And you are sons of the prophets and of the covenant God made with your fathers when He said to Abraham, ‘Through your offspring all the families of the earth will be blessed.’ / When God raised up His Servant, He sent Him first to you to bless you by turning each of you from your wicked ways.”"
        }
      ]
    },
    {
      "reference": "Genesis 44:26",
      "book": "Genesis",
      "chapter": 44,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "But we said, ‘We cannot go down. Only if our youngest brother is with us will we go. We cannot see the man’s face unless our youngest brother is with us.’"
        },
        {
          "version": "NLT",
          "text": "we replied, ‘We can’t go unless you let our youngest brother go with us. We’ll never get to see the man’s face unless our youngest brother is with us.’"
        },
        {
          "version": "ESV",
          "text": "we said, ‘We cannot go down. If our youngest brother goes with us, then we will go down. For we cannot see the man’s face unless our youngest brother is with us.’"
        },
        {
          "version": "NKJV",
          "text": "But we said, ‘We cannot go down; if our youngest brother is with us, then we will go down; for we may not see the man’s face unless our youngest brother is with us.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:38",
          "text": "But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:3-5",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ / If you will send our brother with us, we will go down and buy food for you. / But if you will not send him, we will not go; for the man told us, ‘You will not see my face again unless your brother is with you.’”"
        },
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:4",
          "text": "But Jacob did not send Joseph’s brother Benjamin with his brothers, for he said, “I am afraid that harm might befall him.”"
        },
        {
          "reference": "Genesis 43:14",
          "text": "May God Almighty grant you mercy before the man, that he may release your other brother along with Benjamin. As for me, if I am bereaved, I am bereaved.”"
        },
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Exodus 20:12",
          "text": "Honor your father and mother, so that your days may be long in the land that the LORD your God is giving you."
        },
        {
          "reference": "Deuteronomy 6:7",
          "text": "And you shall teach them diligently to your children and speak of them when you sit at home and when you walk along the road, when you lie down and when you get up."
        },
        {
          "reference": "1 Samuel 1:22",
          "text": "but Hannah did not go. “After the boy is weaned,” she said to her husband, “I will take him to appear before the LORD and to stay there permanently.”"
        },
        {
          "reference": "1 Kings 2:19",
          "text": "So Bathsheba went to King Solomon to speak to him for Adonijah. The king stood up to greet her, bowed to her, and sat down on his throne. Then the king had a throne brought for his mother, who sat down at his right hand."
        },
        {
          "reference": "Psalm 127:3-5",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward. / Like arrows in the hand of a warrior, so are children born in one’s youth. / Blessed is the man whose quiver is full of them. He will not be put to shame when he confronts the enemies at the gate."
        },
        {
          "reference": "Proverbs 17:6",
          "text": "Grandchildren are the crown of the aged, and the glory of a son is his father."
        },
        {
          "reference": "Isaiah 49:15",
          "text": "“Can a woman forget her nursing child, or lack compassion for the son of her womb? Even if she could forget, I will not forget you!"
        }
      ]
    },
    {
      "reference": "Genesis 44:27",
      "book": "Genesis",
      "chapter": 44,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "“Your servant my father said to us, ‘You know that my wife bore me two sons."
        },
        {
          "version": "NLT",
          "text": "“Then my father said to us, ‘As you know, my wife had two sons,"
        },
        {
          "version": "ESV",
          "text": "Then your servant my father said to us, ‘You know that my wife bore me two sons."
        },
        {
          "version": "NKJV",
          "text": "Then your servant my father said to us, ‘You know that my wife bore me two sons;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:3",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors."
        },
        {
          "reference": "Genesis 42:38",
          "text": "But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:4",
          "text": "But Jacob did not send Joseph’s brother Benjamin with his brothers, for he said, “I am afraid that harm might befall him.”"
        },
        {
          "reference": "Genesis 37:23-24",
          "text": "So when Joseph came to his brothers, they stripped him of his robe—the robe of many colors he was wearing— / and they took him and threw him into the pit. Now the pit was empty, with no water in it."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 37:31-32",
          "text": "Then they took Joseph’s robe, slaughtered a young goat, and dipped the robe in its blood. / They sent the robe of many colors to their father and said, “We found this. Examine it to see whether it is your son’s robe or not.”"
        },
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 48:16",
          "text": "the angel who has redeemed me from all harm—may He bless these boys. And may they be called by my name and the names of my fathers Abraham and Isaac, and may they grow into a multitude upon the earth.”"
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Matthew 2:13-15",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.” / So he got up, took the Child and His mother by night, and withdrew to Egypt, / where he stayed until the death of Herod. This fulfilled what the Lord had spoken through the prophet: “Out of Egypt I called My Son.”"
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Luke 2:34-35",
          "text": "Then Simeon blessed them and said to His mother Mary: “Behold, this Child is appointed to cause the rise and fall of many in Israel, and to be a sign that will be spoken against, / so that the thoughts of many hearts will be revealed—and a sword will pierce your soul as well.”"
        }
      ]
    },
    {
      "reference": "Genesis 44:28",
      "book": "Genesis",
      "chapter": 44,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "One of them went away from me, and I said, “He has surely been torn to pieces.” And I have not seen him since."
        },
        {
          "version": "NLT",
          "text": "and one of them went away and never returned. Doubtless he was torn to pieces by some wild animal. I have never seen him since."
        },
        {
          "version": "ESV",
          "text": "One left me, and I said, “Surely he has been torn to pieces,” and I have never seen him since."
        },
        {
          "version": "NKJV",
          "text": "and the one went out from me, and I said, “Surely he is torn to pieces”; and I have not seen him since."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:36",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!”"
        },
        {
          "reference": "Genesis 37:20-22",
          "text": "“Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!” / When Reuben heard this, he tried to rescue Joseph from their hands. “Let us not take his life,” he said. / “Do not shed his blood. Throw him into this pit in the wilderness, but do not lay a hand on him.” Reuben said this so that he could rescue Joseph from their hands and return him to his father."
        },
        {
          "reference": "Genesis 37:29-30",
          "text": "When Reuben returned to the pit and saw that Joseph was not there, he tore his clothes, / returned to his brothers, and said, “The boy is gone! What am I going to do?”"
        },
        {
          "reference": "Genesis 37:31-32",
          "text": "Then they took Joseph’s robe, slaughtered a young goat, and dipped the robe in its blood. / They sent the robe of many colors to their father and said, “We found this. Examine it to see whether it is your son’s robe or not.”"
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 42:38",
          "text": "But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:14",
          "text": "May God Almighty grant you mercy before the man, that he may release your other brother along with Benjamin. As for me, if I am bereaved, I am bereaved.”"
        },
        {
          "reference": "Genesis 45:26-28",
          "text": "“Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them. / However, when they relayed all that Joseph had told them, and when he saw the wagons that Joseph had sent to carry him back, the spirit of their father Jacob was revived. / “Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:30",
          "text": "Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 37:23-24",
          "text": "So when Joseph came to his brothers, they stripped him of his robe—the robe of many colors he was wearing— / and they took him and threw him into the pit. Now the pit was empty, with no water in it."
        },
        {
          "reference": "Genesis 37:18-19",
          "text": "Now Joseph’s brothers saw him in the distance, and before he arrived, they plotted to kill him. / “Here comes that dreamer!” they said to one another."
        },
        {
          "reference": "Genesis 50:15-17",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept."
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Luke 15:24",
          "text": "For this son of mine was dead and is alive again! He was lost and is found!’ So they began to celebrate."
        }
      ]
    },
    {
      "reference": "Genesis 44:29",
      "book": "Genesis",
      "chapter": 44,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "If you take this one from me too and harm comes to him, you will bring my gray head down to the grave in misery.’"
        },
        {
          "version": "NLT",
          "text": "Now if you take his brother away from me, and any harm comes to him, you will send this grieving, white-haired man to his grave.’"
        },
        {
          "version": "ESV",
          "text": "If you take this one also from me, and harm happens to him, you will bring down my gray hairs in evil to Sheol.’"
        },
        {
          "version": "NKJV",
          "text": "But if you take this one also from me, and calamity befalls him, you shall bring down my gray hair with sorrow to the grave.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:36",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!”"
        },
        {
          "reference": "Genesis 43:14",
          "text": "May God Almighty grant you mercy before the man, that he may release your other brother along with Benjamin. As for me, if I am bereaved, I am bereaved.”"
        },
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 37:23-24",
          "text": "So when Joseph came to his brothers, they stripped him of his robe—the robe of many colors he was wearing— / and they took him and threw him into the pit. Now the pit was empty, with no water in it."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 42:38",
          "text": "But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:30",
          "text": "Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Luke 15:30",
          "text": "But when this son of yours returns from squandering your wealth with prostitutes, you kill the fattened calf for him!’"
        },
        {
          "reference": "John 11:32-35",
          "text": "When Mary came to Jesus and saw Him, she fell at His feet and said, “Lord, if You had been here, my brother would not have died.” / When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled. / “Where have you put him?” He asked. “Come and see, Lord,” they answered. ..."
        },
        {
          "reference": "John 16:20-22",
          "text": "Truly, truly, I tell you, you will weep and wail while the world rejoices. You will grieve, but your grief will turn to joy. / A woman has pain in childbirth because her time has come; but when she brings forth her child, she forgets her anguish because of her joy that a child has been born into the world. / So also you have sorrow now, but I will see you again and your hearts will rejoice, and no one will take away your joy."
        }
      ]
    },
    {
      "reference": "Genesis 44:30",
      "book": "Genesis",
      "chapter": 44,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "“So now, if the boy is not with us when I go back to your servant my father, and if my father, whose life is closely bound up with the boy’s life,"
        },
        {
          "version": "NLT",
          "text": "“And now, my lord, I cannot go back to my father without the boy. Our father’s life is bound up in the boy’s life."
        },
        {
          "version": "ESV",
          "text": "“Now therefore, as soon as I come to your servant my father, and the boy is not with us, then, as his life is bound up in the boy’s life,"
        },
        {
          "version": "NKJV",
          "text": "“Now therefore, when I come to your servant my father, and the lad is not with us, since his life is bound up in the lad’s life,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:36-38",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!” / Then Reuben said to his father, “You may kill my two sons if I fail to bring him back to you. Put him in my care, and I will return him.” / But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 37:23-24",
          "text": "So when Joseph came to his brothers, they stripped him of his robe—the robe of many colors he was wearing— / and they took him and threw him into the pit. Now the pit was empty, with no water in it."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 42:32",
          "text": "We are twelve brothers, sons of one father. One is no more, and the youngest is now with our father in the land of Canaan.’"
        },
        {
          "reference": "Genesis 43:14",
          "text": "May God Almighty grant you mercy before the man, that he may release your other brother along with Benjamin. As for me, if I am bereaved, I am bereaved.”"
        },
        {
          "reference": "Genesis 44:20",
          "text": "And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 44:31-34",
          "text": "sees that the boy is not with us, he will die. Then your servants will have brought the gray hair of your servant our father down to Sheol in sorrow. / Indeed, your servant guaranteed the boy’s safety to my father, saying, ‘If I do not return him to you, I will bear the guilt before you, my father, all my life.’ / Now please let your servant stay here as my lord’s slave in place of the boy. Let him return with his brothers. ..."
        },
        {
          "reference": "1 Samuel 18:1-3",
          "text": "After David had finished speaking with Saul, the souls of Jonathan and David were knit together, and Jonathan loved him as himself. / And from that day Saul kept David with him and did not let him return to his father’s house. / Then Jonathan made a covenant with David because he loved him as himself."
        }
      ]
    },
    {
      "reference": "Genesis 44:31",
      "book": "Genesis",
      "chapter": 44,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "sees that the boy isn’t there, he will die. Your servants will bring the gray head of our father down to the grave in sorrow."
        },
        {
          "version": "NLT",
          "text": "If he sees that the boy is not with us, our father will die. We, your servants, will indeed be responsible for sending that grieving, white-haired man to his grave."
        },
        {
          "version": "ESV",
          "text": "as soon as he sees that the boy is not with us, he will die, and your servants will bring down the gray hairs of your servant our father with sorrow to Sheol."
        },
        {
          "version": "NKJV",
          "text": "it will happen, when he sees that the lad is not with us, that he will die. So your servants will bring down the gray hair of your servant our father with sorrow to the grave."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:36-38",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!” / Then Reuben said to his father, “You may kill my two sons if I fail to bring him back to you. Put him in my care, and I will return him.” / But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "1 Samuel 18:1-3",
          "text": "After David had finished speaking with Saul, the souls of Jonathan and David were knit together, and Jonathan loved him as himself. / And from that day Saul kept David with him and did not let him return to his father’s house. / Then Jonathan made a covenant with David because he loved him as himself."
        },
        {
          "reference": "1 Samuel 20:41-42",
          "text": "When the young man had gone, David got up from the south side of the stone, fell facedown, and bowed three times. Then he and Jonathan kissed each other and wept together—though David wept more. / And Jonathan said to David, “Go in peace, for the two of us have sworn in the name of the LORD, saying, ‘May the LORD be a witness between you and me, and between your descendants and mine forever.’” Then David got up and departed, and Jonathan went back into the city."
        },
        {
          "reference": "2 Samuel 18:33",
          "text": "The king was shaken and went up to the chamber over the gate and wept. And as he walked, he cried out, “O my son Absalom! My son, my son Absalom! If only I had died instead of you, O Absalom, my son, my son!”"
        },
        {
          "reference": "1 Kings 3:26",
          "text": "Then the woman whose son was alive spoke to the king because she yearned with compassion for her son. “Please, my lord,” she said, “give her the living baby. Do not kill him!” But the other woman said, “He will be neither mine nor yours. Cut him in two!”"
        },
        {
          "reference": "Psalm 119:28",
          "text": "My soul melts with sorrow; strengthen me according to Your word."
        },
        {
          "reference": "Isaiah 49:15",
          "text": "“Can a woman forget her nursing child, or lack compassion for the son of her womb? Even if she could forget, I will not forget you!"
        },
        {
          "reference": "Jeremiah 31:20",
          "text": "Is not Ephraim a precious son to Me, a delightful child? Though I often speak against him, I still remember him. Therefore My heart yearns for him; I have great compassion for him,” declares the LORD."
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Matthew 26:75",
          "text": "Then Peter remembered the word that Jesus had spoken: “Before the rooster crows, you will deny Me three times.” And he went outside and wept bitterly."
        },
        {
          "reference": "Luke 2:48-50",
          "text": "When His parents saw Him, they were astonished. “Child, why have You done this to us?” His mother asked. “Your father and I have been anxiously searching for You.” / “Why were you looking for Me?” He asked. “Did you not know that I had to be in My Father’s house?” / But they did not understand the statement He was making to them."
        }
      ]
    },
    {
      "reference": "Genesis 44:32",
      "book": "Genesis",
      "chapter": 44,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "Your servant guaranteed the boy’s safety to my father. I said, ‘If I do not bring him back to you, I will bear the blame before you, my father, all my life!’"
        },
        {
          "version": "NLT",
          "text": "My lord, I guaranteed to my father that I would take care of the boy. I told him, ‘If I don’t bring him back to you, I will bear the blame forever.’"
        },
        {
          "version": "ESV",
          "text": "For your servant became a pledge of safety for the boy to my father, saying, ‘If I do not bring him back to you, then I shall bear the blame before my father all my life.’"
        },
        {
          "version": "NKJV",
          "text": "For your servant became surety for the lad to my father, saying, ‘If I do not bring him back to you, then I shall bear the blame before my father forever.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:9",
          "text": "I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 42:37",
          "text": "Then Reuben said to his father, “You may kill my two sons if I fail to bring him back to you. Put him in my care, and I will return him.”"
        },
        {
          "reference": "1 Samuel 18:1",
          "text": "After David had finished speaking with Saul, the souls of Jonathan and David were knit together, and Jonathan loved him as himself."
        },
        {
          "reference": "1 Samuel 20:17",
          "text": "And Jonathan had David reaffirm his vow out of love for him, for Jonathan loved David as he loved himself."
        },
        {
          "reference": "1 Samuel 25:24",
          "text": "She fell at his feet and said, “My lord, may the blame be on me alone, but please let your servant speak to you; hear the words of your servant."
        },
        {
          "reference": "2 Samuel 14:9",
          "text": "But the woman of Tekoa said to the king, “My lord the king, may any blame be on me and on my father’s house, and may the king and his throne be guiltless.”"
        },
        {
          "reference": "2 Samuel 18:33",
          "text": "The king was shaken and went up to the chamber over the gate and wept. And as he walked, he cried out, “O my son Absalom! My son, my son Absalom! If only I had died instead of you, O Absalom, my son, my son!”"
        },
        {
          "reference": "1 Kings 1:21",
          "text": "Otherwise, when my lord the king rests with his fathers, I and my son Solomon will be counted as criminals.”"
        },
        {
          "reference": "1 Chronicles 21:17",
          "text": "And David said to God, “Was it not I who gave the order to count the people? I am the one who has sinned and acted wickedly. But these sheep, what have they done? O LORD my God, please let Your hand fall upon me and my father’s house, but do not let this plague remain upon Your people.”"
        },
        {
          "reference": "Job 17:3",
          "text": "Give me, I pray, the pledge You demand. Who else will be my guarantor?"
        },
        {
          "reference": "Proverbs 6:1-5",
          "text": "My son, if you have put up security for your neighbor, if you have struck hands in pledge with a stranger, / if you have been trapped by the words of your lips, ensnared by the words of your mouth, / then do this, my son, to free yourself, for you have fallen into your neighbor’s hands: Go, humble yourself, and press your plea with your neighbor. ..."
        },
        {
          "reference": "Isaiah 38:14",
          "text": "I chirp like a swallow or crane; I moan like a dove. My eyes grow weak as I look upward. O Lord, I am oppressed; be my security.”"
        },
        {
          "reference": "Matthew 20:28",
          "text": "just as the Son of Man did not come to be served, but to serve, and to give His life as a ransom for many.”"
        },
        {
          "reference": "John 10:11",
          "text": "I am the good shepherd. The good shepherd lays down His life for the sheep."
        },
        {
          "reference": "John 15:13",
          "text": "Greater love has no one than this, that he lay down his life for his friends."
        }
      ]
    },
    {
      "reference": "Genesis 44:33",
      "book": "Genesis",
      "chapter": 44,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "“Now then, please let your servant remain here as my lord’s slave in place of the boy, and let the boy return with his brothers."
        },
        {
          "version": "NLT",
          "text": "“So please, my lord, let me stay here as a slave instead of the boy, and let the boy return with his brothers."
        },
        {
          "version": "ESV",
          "text": "Now therefore, please let your servant remain instead of the boy as a servant to my lord, and let the boy go back with his brothers."
        },
        {
          "version": "NKJV",
          "text": "Now therefore, please let your servant remain instead of the lad as a slave to my lord, and let the lad go up with his brothers."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 43:9",
          "text": "I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 42:37",
          "text": "Then Reuben said to his father, “You may kill my two sons if I fail to bring him back to you. Put him in my care, and I will return him.”"
        },
        {
          "reference": "John 15:13",
          "text": "Greater love has no one than this, that he lay down his life for his friends."
        },
        {
          "reference": "1 Samuel 18:1-3",
          "text": "After David had finished speaking with Saul, the souls of Jonathan and David were knit together, and Jonathan loved him as himself. / And from that day Saul kept David with him and did not let him return to his father’s house. / Then Jonathan made a covenant with David because he loved him as himself."
        },
        {
          "reference": "1 John 3:16",
          "text": "By this we know what love is: Jesus laid down His life for us, and we ought to lay down our lives for our brothers."
        },
        {
          "reference": "Romans 5:7-8",
          "text": "Very rarely will anyone die for a righteous man, though for a good man someone might possibly dare to die. / But God proves His love for us in this: While we were still sinners, Christ died for us."
        },
        {
          "reference": "Exodus 32:32",
          "text": "Yet now, if You would only forgive their sin.... But if not, please blot me out of the book that You have written.”"
        },
        {
          "reference": "Philemon 1:18-19",
          "text": "But if he has wronged you in any way or owes you anything, charge it to my account. / I, Paul, write this with my own hand. I will repay it—not to mention that you owe me your very self."
        },
        {
          "reference": "2 Corinthians 5:21",
          "text": "God made Him who knew no sin to be sin on our behalf, so that in Him we might become the righteousness of God."
        },
        {
          "reference": "Isaiah 53:4-5",
          "text": "Surely He took up our infirmities and carried our sorrows; yet we considered Him stricken, struck down by God, and afflicted. / But He was pierced for our transgressions, He was crushed for our iniquities; the punishment that brought us peace was upon Him, and by His stripes we are healed."
        },
        {
          "reference": "Matthew 20:28",
          "text": "just as the Son of Man did not come to be served, but to serve, and to give His life as a ransom for many.”"
        },
        {
          "reference": "Hebrews 7:22",
          "text": "Because of this oath, Jesus has become the guarantee of a better covenant."
        },
        {
          "reference": "1 Peter 2:24",
          "text": "He Himself bore our sins in His body on the tree, so that we might die to sin and live to righteousness. “By His stripes you are healed.”"
        },
        {
          "reference": "Luke 22:42",
          "text": "“Father, if You are willing, take this cup from Me. Yet not My will, but Yours be done.”"
        },
        {
          "reference": "Philippians 2:7-8",
          "text": "but emptied Himself, taking the form of a servant, being made in human likeness. / And being found in appearance as a man, He humbled Himself and became obedient to death—even death on a cross."
        }
      ]
    },
    {
      "reference": "Genesis 44:34",
      "book": "Genesis",
      "chapter": 44,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "How can I go back to my father if the boy is not with me? No! Do not let me see the misery that would come on my father.”"
        },
        {
          "version": "NLT",
          "text": "For how can I return to my father if the boy is not with me? I couldn’t bear to see the anguish this would cause my father!”"
        },
        {
          "version": "ESV",
          "text": "For how can I go back to my father if the boy is not with me? I fear to see the evil that would find my father.”"
        },
        {
          "version": "NKJV",
          "text": "For how shall I go up to my father if the lad is not with me, lest perhaps I see the evil that would come upon my father?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:36-38",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!” / Then Reuben said to his father, “You may kill my two sons if I fail to bring him back to you. Put him in my care, and I will return him.” / But Jacob replied, “My son will not go down there with you, for his brother is dead, and he alone is left. If any harm comes to him on your journey, you will bring my gray hair down to Sheol in sorrow.”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "1 Samuel 18:1-3",
          "text": "After David had finished speaking with Saul, the souls of Jonathan and David were knit together, and Jonathan loved him as himself. / And from that day Saul kept David with him and did not let him return to his father’s house. / Then Jonathan made a covenant with David because he loved him as himself."
        },
        {
          "reference": "1 Samuel 20:41-42",
          "text": "When the young man had gone, David got up from the south side of the stone, fell facedown, and bowed three times. Then he and Jonathan kissed each other and wept together—though David wept more. / And Jonathan said to David, “Go in peace, for the two of us have sworn in the name of the LORD, saying, ‘May the LORD be a witness between you and me, and between your descendants and mine forever.’” Then David got up and departed, and Jonathan went back into the city."
        },
        {
          "reference": "2 Samuel 1:26",
          "text": "I grieve for you, Jonathan, my brother. You were delightful to me; your love to me was extraordinary, surpassing the love of women."
        },
        {
          "reference": "2 Samuel 18:33",
          "text": "The king was shaken and went up to the chamber over the gate and wept. And as he walked, he cried out, “O my son Absalom! My son, my son Absalom! If only I had died instead of you, O Absalom, my son, my son!”"
        },
        {
          "reference": "1 Kings 3:26",
          "text": "Then the woman whose son was alive spoke to the king because she yearned with compassion for her son. “Please, my lord,” she said, “give her the living baby. Do not kill him!” But the other woman said, “He will be neither mine nor yours. Cut him in two!”"
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Matthew 5:4",
          "text": "Blessed are those who mourn, for they will be comforted."
        },
        {
          "reference": "Matthew 18:12-14",
          "text": "What do you think? If a man has a hundred sheep and one of them goes astray, will he not leave the ninety-nine on the hills and go out to search for the one that is lost? / And if he finds it, truly I tell you, he rejoices more over that one sheep than over the ninety-nine that did not go astray. / In the same way, your Father in heaven is not willing that any of these little ones should perish."
        },
        {
          "reference": "Luke 15:20-24",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him. / The son declared, ‘Father, I have sinned against heaven and against you. I am no longer worthy to be called your son.’ / But the father said to his servants, ‘Quick! Bring the best robe and put it on him. Put a ring on his finger and sandals on his feet. ..."
        },
        {
          "reference": "John 11:33-36",
          "text": "When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled. / “Where have you put him?” He asked. “Come and see, Lord,” they answered. / Jesus wept. ..."
        }
      ]
    }
  ]
}