{
  "book": "genesis",
  "chapter": 45,
  "verses": [
    {
      "reference": "Genesis 45:1",
      "book": "Genesis",
      "chapter": 45,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Have everyone leave my presence!” So there was no one with Joseph when he made himself known to his brothers."
        },
        {
          "version": "NLT",
          "text": "Joseph could stand it no longer. There were many people in the room, and he said to his attendants, “Out, all of you!” So he was alone with his brothers when he told them who he was."
        },
        {
          "version": "ESV",
          "text": "Then Joseph could not control himself before all those who stood by him. He cried, “Make everyone go out from me.” So no one stayed with him when Joseph made himself known to his brothers."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph could not restrain himself before all those who stood by him, and he cried out, “Make everyone go out from me!” So no one stood with him while Joseph made himself known to his brothers."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Genesis 42:7-8",
          "text": "And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him."
        },
        {
          "reference": "Genesis 43:30-31",
          "text": "Joseph hurried out because he was moved to tears for his brother, and he went to a private room to weep. / Then he washed his face and came back out. Regaining his composure, he said, “Serve the meal.”"
        },
        {
          "reference": "Genesis 37:5-8",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Genesis 50:17-21",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? ..."
        },
        {
          "reference": "Exodus 4:27-31",
          "text": "Meanwhile, the LORD had said to Aaron, “Go and meet Moses in the wilderness.” So he went and met Moses at the mountain of God and kissed him. / And Moses told Aaron everything the LORD had sent him to say, and all the signs He had commanded him to perform. / Then Moses and Aaron went and assembled all the elders of the Israelites, ..."
        },
        {
          "reference": "1 Samuel 20:41",
          "text": "When the young man had gone, David got up from the south side of the stone, fell facedown, and bowed three times. Then he and Jonathan kissed each other and wept together—though David wept more."
        },
        {
          "reference": "2 Samuel 14:33",
          "text": "So Joab went and told the king, and David summoned Absalom, who came to him and bowed facedown before him. Then the king kissed Absalom."
        },
        {
          "reference": "Acts 7:13",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Romans 12:19-21",
          "text": "Do not avenge yourselves, beloved, but leave room for God’s wrath. For it is written: “Vengeance is Mine; I will repay, says the Lord.” / On the contrary, “If your enemy is hungry, feed him; if he is thirsty, give him a drink. For in so doing, you will heap burning coals on his head.” / Do not be overcome by evil, but overcome evil with good."
        },
        {
          "reference": "1 Corinthians 13:4-7",
          "text": "Love is patient, love is kind. It does not envy, it does not boast, it is not proud. / It is not rude, it is not self-seeking, it is not easily angered, it keeps no account of wrongs. / Love takes no pleasure in evil, but rejoices in the truth. ..."
        }
      ]
    },
    {
      "reference": "Genesis 45:2",
      "book": "Genesis",
      "chapter": 45,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "And he wept so loudly that the Egyptians heard him, and Pharaoh’s household heard about it."
        },
        {
          "version": "NLT",
          "text": "Then he broke down and wept. He wept so loudly the Egyptians could hear him, and word of it quickly carried to Pharaoh’s palace."
        },
        {
          "version": "ESV",
          "text": "And he wept aloud, so that the Egyptians heard it, and the household of Pharaoh heard it."
        },
        {
          "version": "NKJV",
          "text": "And he wept aloud, and the Egyptians and the house of Pharaoh heard it."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:24",
          "text": "And he turned away from them and wept. When he turned back and spoke to them, he took Simeon from them and had him bound before their eyes."
        },
        {
          "reference": "Genesis 43:30",
          "text": "Joseph hurried out because he was moved to tears for his brother, and he went to a private room to weep."
        },
        {
          "reference": "Genesis 50:17",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept."
        },
        {
          "reference": "Exodus 2:6",
          "text": "When she opened it, she saw the child, and behold, the little boy was crying. So she had compassion on him and said, “This is one of the Hebrew children.”"
        },
        {
          "reference": "1 Kings 3:26",
          "text": "Then the woman whose son was alive spoke to the king because she yearned with compassion for her son. “Please, my lord,” she said, “give her the living baby. Do not kill him!” But the other woman said, “He will be neither mine nor yours. Cut him in two!”"
        },
        {
          "reference": "2 Samuel 13:36",
          "text": "And as he finished speaking, the sons of the king came in, wailing loudly. Then the king and all his servants also wept very bitterly."
        },
        {
          "reference": "2 Kings 20:3",
          "text": "“Please, O LORD, remember how I have walked before You faithfully and with wholehearted devotion; I have done what is good in Your sight.” And Hezekiah wept bitterly."
        },
        {
          "reference": "Nehemiah 1:4",
          "text": "When I heard these words, I sat down and wept. I mourned for days, fasting and praying before the God of heaven."
        },
        {
          "reference": "Esther 8:3",
          "text": "And once again, Esther addressed the king. She fell at his feet weeping and begged him to revoke the evil scheme of Haman the Agagite, which he had devised against the Jews."
        },
        {
          "reference": "Job 2:12",
          "text": "When they lifted up their eyes from afar, they could barely recognize Job. They began to weep aloud, and each man tore his robe and threw dust in the air over his head."
        },
        {
          "reference": "Psalm 6:6",
          "text": "I am weary from groaning; all night I flood my bed with weeping and drench my couch with tears."
        },
        {
          "reference": "Psalm 30:5",
          "text": "For His anger is fleeting, but His favor lasts a lifetime. Weeping may stay the night, but joy comes in the morning."
        },
        {
          "reference": "Psalm 126:5",
          "text": "Those who sow in tears will reap with shouts of joy."
        },
        {
          "reference": "Isaiah 22:4",
          "text": "Therefore I said, “Turn away from me, let me weep bitterly! Do not try to console me over the destruction of the daughter of my people.”"
        },
        {
          "reference": "Jeremiah 31:9",
          "text": "They will come with weeping, and by their supplication I will lead them; I will make them walk beside streams of waters, on a level path where they will not stumble. For I am Israel’s Father, and Ephraim is My firstborn.”"
        }
      ]
    },
    {
      "reference": "Genesis 45:3",
      "book": "Genesis",
      "chapter": 45,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still living?” But his brothers were not able to answer him, because they were terrified at his presence."
        },
        {
          "version": "NLT",
          "text": "“I am Joseph!” he said to his brothers. “Is my father still alive?” But his brothers were speechless! They were stunned to realize that Joseph was standing there in front of them."
        },
        {
          "version": "ESV",
          "text": "And Joseph said to his brothers, “I am Joseph! Is my father still alive?” But his brothers could not answer him, for they were dismayed at his presence."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph said to his brothers, “I am Joseph; does my father still live?” But his brothers could not answer him, for they were dismayed in his presence."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:13",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh."
        },
        {
          "reference": "Genesis 37:5-8",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 42:7-8",
          "text": "And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him."
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Genesis 42:21-23",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!” / They did not realize that Joseph understood them, since there was an interpreter between them."
        },
        {
          "reference": "Genesis 43:30-31",
          "text": "Joseph hurried out because he was moved to tears for his brother, and he went to a private room to weep. / Then he washed his face and came back out. Regaining his composure, he said, “Serve the meal.”"
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 37:18-20",
          "text": "Now Joseph’s brothers saw him in the distance, and before he arrived, they plotted to kill him. / “Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!”"
        },
        {
          "reference": "Genesis 39:1-2",
          "text": "Meanwhile, Joseph had been taken down to Egypt, where an Egyptian named Potiphar, an officer of Pharaoh and captain of the guard, bought him from the Ishmaelites who had taken him there. / And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master."
        },
        {
          "reference": "Genesis 41:14-16",
          "text": "So Pharaoh sent for Joseph, who was quickly brought out of the dungeon. After he had shaved and changed his clothes, he went in before Pharaoh. / Pharaoh said to Joseph, “I had a dream, and no one can interpret it. But I have heard it said of you that when you hear a dream you can interpret it.” / “I myself cannot do it,” Joseph replied, “but God will give Pharaoh a sound answer.”"
        }
      ]
    },
    {
      "reference": "Genesis 45:4",
      "book": "Genesis",
      "chapter": 45,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Joseph said to his brothers, &#8220Come close to me.” When they had done so, he said, “I am your brother Joseph, the one you sold into Egypt!"
        },
        {
          "version": "NLT",
          "text": "“Please, come closer,” he said to them. So they came closer. And he said again, “I am Joseph, your brother, whom you sold into slavery in Egypt."
        },
        {
          "version": "ESV",
          "text": "So Joseph said to his brothers, “Come near to me, please.” And they came near. And he said, “I am your brother, Joseph, whom you sold into Egypt."
        },
        {
          "version": "NKJV",
          "text": "And Joseph said to his brothers, “Please come near to me.” So they came near. Then he said: “I am Joseph your brother, whom you sold into Egypt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 44:18",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself."
        },
        {
          "reference": "Acts 7:13",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh."
        },
        {
          "reference": "Genesis 37:4",
          "text": "When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 37:8",
          "text": "“Do you intend to reign over us?” his brothers asked. “Will you actually rule us?” So they hated him even more because of his dream and his statements."
        },
        {
          "reference": "Genesis 37:18-20",
          "text": "Now Joseph’s brothers saw him in the distance, and before he arrived, they plotted to kill him. / “Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!”"
        },
        {
          "reference": "Genesis 45:8",
          "text": "Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt."
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 41:9-13",
          "text": "Then the chief cupbearer said to Pharaoh, “Today I recall my failures. / Pharaoh was once angry with his servants, and he put me and the chief baker in the custody of the captain of the guard. / One night both the chief baker and I had dreams, and each dream had its own meaning. ..."
        },
        {
          "reference": "Genesis 42:7-8",
          "text": "And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him."
        },
        {
          "reference": "Genesis 43:27-30",
          "text": "He asked if they were well, and then he asked, “How is your elderly father you told me about? Is he still alive?” / “Your servant our father is well,” they answered. “He is still alive.” And they bowed down to honor him. / When Joseph looked up and saw his brother Benjamin, his own mother’s son, he asked, “Is this your youngest brother, the one you told me about?” Then he declared, “May God be gracious to you, my son.” ..."
        },
        {
          "reference": "Genesis 46:29",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely."
        }
      ]
    },
    {
      "reference": "Genesis 45:5",
      "book": "Genesis",
      "chapter": 45,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "And now, do not be distressed and do not be angry with yourselves for selling me here, because it was to save lives that God sent me ahead of you."
        },
        {
          "version": "NLT",
          "text": "But don’t be upset, and don’t be angry with yourselves for selling me to this place. It was God who sent me here ahead of you to preserve your lives."
        },
        {
          "version": "ESV",
          "text": "And now do not be distressed or angry with yourselves because you sold me here, for God sent me before you to preserve life."
        },
        {
          "version": "NKJV",
          "text": "But now, do not therefore be grieved or angry with yourselves because you sold me here; for God sent me before you to preserve life."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Psalm 105:16-17",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Isaiah 46:10",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’"
        },
        {
          "reference": "1 Peter 1:6-7",
          "text": "In this you greatly rejoice, though now for a little while you may have had to suffer grief in various trials / so that the proven character of your faith—more precious than gold, which perishes even though refined by fire—may result in praise, glory, and honor at the revelation of Jesus Christ."
        },
        {
          "reference": "Romans 5:3-5",
          "text": "Not only that, but we also rejoice in our sufferings, because we know that suffering produces perseverance; / perseverance, character; and character, hope. / And hope does not disappoint us, because God has poured out His love into our hearts through the Holy Spirit, whom He has given us."
        },
        {
          "reference": "2 Corinthians 4:17",
          "text": "For our light and momentary affliction is producing for us an eternal weight of glory that is far beyond comparison."
        },
        {
          "reference": "James 1:2-4",
          "text": "Consider it pure joy, my brothers, when you encounter trials of many kinds, / because you know that the testing of your faith develops perseverance. / Allow perseverance to finish its work, so that you may be mature and complete, not lacking anything."
        },
        {
          "reference": "Hebrews 12:10-11",
          "text": "Our fathers disciplined us for a short time as they thought best, but God disciplines us for our good, so that we may share in His holiness. / No discipline seems enjoyable at the time, but painful. Later on, however, it yields a harvest of righteousness and peace to those who have been trained by it."
        },
        {
          "reference": "Ephesians 1:11",
          "text": "In Him we were also chosen as God’s own, having been predestined according to the plan of Him who works out everything by the counsel of His will,"
        },
        {
          "reference": "Proverbs 16:9",
          "text": "A man’s heart plans his course, but the LORD determines his steps."
        },
        {
          "reference": "Jeremiah 29:11",
          "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, to give you a future and a hope."
        },
        {
          "reference": "Isaiah 55:8-9",
          "text": "“For My thoughts are not your thoughts, neither are your ways My ways,” declares the LORD. / “For as the heavens are higher than the earth, so My ways are higher than your ways and My thoughts than your thoughts."
        },
        {
          "reference": "Job 42:2",
          "text": "“I know that You can do all things and that no plan of Yours can be thwarted."
        }
      ]
    },
    {
      "reference": "Genesis 45:6",
      "book": "Genesis",
      "chapter": 45,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "For two years now there has been famine in the land, and for the next five years there will be no plowing and reaping."
        },
        {
          "version": "NLT",
          "text": "This famine that has ravaged the land for two years will last five more years, and there will be neither plowing nor harvesting."
        },
        {
          "version": "ESV",
          "text": "For the famine has been in the land these two years, and there are yet five years in which there will be neither plowing nor harvest."
        },
        {
          "version": "NKJV",
          "text": "For these two years the famine has been in the land, and there are still five years in which there will be neither plowing nor harvesting."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:30-31",
          "text": "but seven years of famine will follow them. Then all the abundance in the land of Egypt will be forgotten, and the famine will devastate the land. / The abundance in the land will not be remembered, since the famine that follows it will be so severe."
        },
        {
          "reference": "Genesis 47:13",
          "text": "There was no food, however, in all that region, because the famine was so severe; the lands of Egypt and Canaan had been exhausted by the famine."
        },
        {
          "reference": "Genesis 41:54",
          "text": "the seven years of famine began, just as Joseph had said. And although there was famine in every country, there was food throughout the land of Egypt."
        },
        {
          "reference": "Genesis 42:5",
          "text": "So the sons of Israel were among those who came to buy grain, since the famine had also spread to the land of Canaan."
        },
        {
          "reference": "Genesis 47:4",
          "text": "Then they said to Pharaoh, “We have come to live in the land for a time, because there is no pasture for the flocks of your servants, since the famine in the land of Canaan has been severe. So now, please allow your servants to settle in the land of Goshen.”"
        },
        {
          "reference": "Genesis 41:56",
          "text": "When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt."
        },
        {
          "reference": "Genesis 41:48",
          "text": "During those seven years, Joseph collected all the excess food in the land of Egypt and stored it in the cities. In every city he laid up the food from the fields around it."
        },
        {
          "reference": "Genesis 47:20",
          "text": "So Joseph acquired for Pharaoh all the land in Egypt; the Egyptians, one and all, sold their fields because the famine was so severe upon them. The land became Pharaoh’s,"
        },
        {
          "reference": "Genesis 47:15",
          "text": "When the money from the lands of Egypt and Canaan was gone, all the Egyptians came to Joseph and said, “Give us food. Why should we die before your eyes? For our funds have run out!”"
        },
        {
          "reference": "Genesis 41:36",
          "text": "This food will be a reserve for the land during the seven years of famine to come upon the land of Egypt. Then the country will not perish in the famine.”"
        },
        {
          "reference": "Acts 7:11",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food."
        },
        {
          "reference": "Psalm 105:16",
          "text": "He called down famine on the land and cut off all their supplies of food."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 9:3",
          "text": "then the hand of the LORD will bring a severe plague on your livestock in the field—on your horses, donkeys, camels, herds, and flocks."
        },
        {
          "reference": "1 Kings 17:1",
          "text": "Now Elijah the Tishbite, who was among the settlers of Gilead, said to Ahab, “As surely as the LORD, the God of Israel, lives, before whom I stand, there will be neither dew nor rain in these years except at my word!”"
        }
      ]
    },
    {
      "reference": "Genesis 45:7",
      "book": "Genesis",
      "chapter": 45,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "But God sent me ahead of you to preserve for you a remnant on earth and to save your lives by a great deliverance."
        },
        {
          "version": "NLT",
          "text": "God has sent me ahead of you to keep you and your families alive and to preserve many survivors."
        },
        {
          "version": "ESV",
          "text": "And God sent me before you to preserve for you a remnant on earth, and to keep alive for you many survivors."
        },
        {
          "version": "NKJV",
          "text": "And God sent me before you to preserve a posterity for you in the earth, and to save your lives by a great deliverance."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Psalm 105:17-22",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Isaiah 46:10",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’"
        },
        {
          "reference": "Jeremiah 29:11",
          "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, to give you a future and a hope."
        },
        {
          "reference": "Ephesians 1:11",
          "text": "In Him we were also chosen as God’s own, having been predestined according to the plan of Him who works out everything by the counsel of His will,"
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "1 Peter 1:20",
          "text": "He was known before the foundation of the world, but was revealed in the last times for your sake."
        },
        {
          "reference": "Isaiah 14:24",
          "text": "The LORD of Hosts has sworn: “Surely, as I have planned, so will it be; as I have purposed, so will it stand."
        },
        {
          "reference": "Proverbs 16:9",
          "text": "A man’s heart plans his course, but the LORD determines his steps."
        },
        {
          "reference": "Genesis 37:5-11",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Acts 2:23",
          "text": "He was delivered up by God’s set plan and foreknowledge, and you, by the hands of the lawless, put Him to death by nailing Him to the cross."
        },
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        },
        {
          "reference": "2 Timothy 1:9",
          "text": "He has saved us and called us to a holy calling, not because of our works, but by His own purpose and by the grace He granted us in Christ Jesus before time began."
        }
      ]
    },
    {
      "reference": "Genesis 45:8",
      "book": "Genesis",
      "chapter": 45,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "“So then, it was not you who sent me here, but God. He made me father to Pharaoh, lord of his entire household and ruler of all Egypt."
        },
        {
          "version": "NLT",
          "text": "So it was God who sent me here, not you! And he is the one who made me an adviser to Pharaoh—the manager of his entire palace and the governor of all Egypt."
        },
        {
          "version": "ESV",
          "text": "So it was not you who sent me here, but God. He has made me a father to Pharaoh, and lord of all his house and ruler over all the land of Egypt."
        },
        {
          "version": "NKJV",
          "text": "So now it was not you who sent me here, but God; and He has made me a father to Pharaoh, and lord of all his house, and a ruler throughout all the land of Egypt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Isaiah 46:10",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’"
        },
        {
          "reference": "Proverbs 16:9",
          "text": "A man’s heart plans his course, but the LORD determines his steps."
        },
        {
          "reference": "Ephesians 1:11",
          "text": "In Him we were also chosen as God’s own, having been predestined according to the plan of Him who works out everything by the counsel of His will,"
        },
        {
          "reference": "Jeremiah 29:11",
          "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, to give you a future and a hope."
        },
        {
          "reference": "1 Peter 5:6-7",
          "text": "Humble yourselves, therefore, under God’s mighty hand, so that in due time He may exalt you. / Cast all your anxiety on Him, because He cares for you."
        },
        {
          "reference": "Isaiah 55:8-9",
          "text": "“For My thoughts are not your thoughts, neither are your ways My ways,” declares the LORD. / “For as the heavens are higher than the earth, so My ways are higher than your ways and My thoughts than your thoughts."
        },
        {
          "reference": "1 Samuel 2:7-8",
          "text": "The LORD sends poverty and wealth; He humbles and He exalts. / He raises the poor from the dust and lifts the needy from the ash heap. He seats them among princes and bestows on them a throne of honor. For the foundations of the earth are the LORD’s, and upon them He has set the world."
        },
        {
          "reference": "Daniel 2:21",
          "text": "He changes the times and seasons; He removes kings and establishes them. He gives wisdom to the wise and knowledge to the discerning."
        },
        {
          "reference": "Job 12:9-10",
          "text": "Which of all these does not know that the hand of the LORD has done this? / The life of every living thing is in His hand, as well as the breath of all mankind."
        },
        {
          "reference": "John 19:11",
          "text": "Jesus answered, “You would have no authority over Me if it were not given to you from above. Therefore the one who handed Me over to you is guilty of greater sin.”"
        },
        {
          "reference": "Philippians 2:13",
          "text": "For it is God who works in you to will and to act on behalf of His good purpose."
        }
      ]
    },
    {
      "reference": "Genesis 45:9",
      "book": "Genesis",
      "chapter": 45,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "Now hurry back to my father and say to him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me; don’t delay."
        },
        {
          "version": "NLT",
          "text": "“Now hurry back to my father and tell him, ‘This is what your son Joseph says: God has made me master over all the land of Egypt. So come down to me immediately!"
        },
        {
          "version": "ESV",
          "text": "Hurry and go up to my father and say to him, ‘Thus says your son Joseph, God has made me lord of all Egypt. Come down to me; do not tarry."
        },
        {
          "version": "NKJV",
          "text": "“Hurry and go up to my father, and say to him, ‘Thus says your son Joseph: “God has made me lord of all Egypt; come down to me, do not tarry."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 46:3-4",
          "text": "“I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. / I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Genesis 50:20-21",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. / Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Genesis 47:11-12",
          "text": "So Joseph settled his father and brothers in the land of Egypt and gave them property in the best part of the land, the district of Rameses, as Pharaoh had commanded. / Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Genesis 42:1-2",
          "text": "When Jacob learned that there was grain in Egypt, he said to his sons, “Why are you staring at one another?” / “Look,” he added, “I have heard that there is grain in Egypt. Go down there and buy some for us, so that we may live and not die.”"
        },
        {
          "reference": "Genesis 43:8-9",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children. / I will guarantee his safety. You may hold me personally responsible. If I do not bring him back and set him before you, then may I bear the guilt before you all my life."
        },
        {
          "reference": "Genesis 44:33-34",
          "text": "Now please let your servant stay here as my lord’s slave in place of the boy. Let him return with his brothers. / For how can I go back to my father without the boy? I could not bear to see the misery that would overwhelm him.”"
        },
        {
          "reference": "Exodus 3:7-10",
          "text": "The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings. / I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites. / And now the cry of the Israelites has reached Me, and I have seen how severely the Egyptians are oppressing them. ..."
        },
        {
          "reference": "Exodus 12:40-41",
          "text": "Now the duration of the Israelites’ stay in Egypt was 430 years. / At the end of the 430 years, to the very day, all the LORD’s divisions went out of the land of Egypt."
        },
        {
          "reference": "Psalm 105:17-23",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right. ..."
        },
        {
          "reference": "Isaiah 46:10-11",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’ / I summon a bird of prey from the east, a man for My purpose from a far-off land. Truly I have spoken, and truly I will bring it to pass. I have planned it, and I will surely do it."
        }
      ]
    },
    {
      "reference": "Genesis 45:10",
      "book": "Genesis",
      "chapter": 45,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "You shall live in the region of Goshen and be near me—you, your children and grandchildren, your flocks and herds, and all you have."
        },
        {
          "version": "NLT",
          "text": "You can live in the region of Goshen, where you can be near me with all your children and grandchildren, your flocks and herds, and everything you own."
        },
        {
          "version": "ESV",
          "text": "You shall dwell in the land of Goshen, and you shall be near me, you and your children and your children’s children, and your flocks, your herds, and all that you have."
        },
        {
          "version": "NKJV",
          "text": "You shall dwell in the land of Goshen, and you shall be near to me, you and your children, your children’s children, your flocks and your herds, and all that you have."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 8:22",
          "text": "But on that day I will give special treatment to the land of Goshen, where My people live; no swarms of flies will be found there. In this way you will know that I, the LORD, am in the land."
        },
        {
          "reference": "Exodus 9:26",
          "text": "The only place where it did not hail was in the land of Goshen, where the Israelites lived."
        },
        {
          "reference": "Genesis 47:6",
          "text": "the land of Egypt is before you; settle your father and brothers in the best part of the land. They may dwell in the land of Goshen. And if you know of any talented men among them, put them in charge of my own livestock.”"
        },
        {
          "reference": "Genesis 46:28-34",
          "text": "Now Jacob had sent Judah ahead of him to Joseph to get directions to Goshen. When Jacob’s family arrived in the land of Goshen, / Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!” ..."
        },
        {
          "reference": "Genesis 50:8",
          "text": "along with all of Joseph’s household, and his brothers, and his father’s household. Only their children and flocks and herds were left in Goshen."
        },
        {
          "reference": "Exodus 10:23",
          "text": "No one could see anyone else, and for three days no one left his place. Yet all the Israelites had light in their dwellings."
        },
        {
          "reference": "Exodus 12:31-32",
          "text": "Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested. / Take your flocks and herds as well, just as you have said, and depart! And bless me also.”"
        },
        {
          "reference": "Exodus 33:16",
          "text": "For how then can it be known that Your people and I have found favor in Your sight, unless You go with us? How else will we be distinguished from all the other people on the face of the earth?”"
        },
        {
          "reference": "Deuteronomy 11:12",
          "text": "It is a land for which the LORD your God cares; the eyes of the LORD your God are always on it, from the beginning to the end of the year."
        },
        {
          "reference": "Psalm 105:23",
          "text": "Then Israel entered Egypt; Jacob dwelt in the land of Ham."
        },
        {
          "reference": "Isaiah 19:24-25",
          "text": "In that day Israel will join a three-party alliance with Egypt and Assyria—a blessing upon the earth. / The LORD of Hosts will bless them, saying, “Blessed be Egypt My people, Assyria My handiwork, and Israel My inheritance.”"
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Hebrews 11:9",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Acts 7:11-13",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        }
      ]
    },
    {
      "reference": "Genesis 45:11",
      "book": "Genesis",
      "chapter": 45,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "I will provide for you there, because five years of famine are still to come. Otherwise you and your household and all who belong to you will become destitute.’"
        },
        {
          "version": "NLT",
          "text": "I will take care of you there, for there are still five years of famine ahead of us. Otherwise you, your household, and all your animals will starve.’”"
        },
        {
          "version": "ESV",
          "text": "There I will provide for you, for there are yet five years of famine to come, so that you and your household, and all that you have, do not come to poverty.’"
        },
        {
          "version": "NKJV",
          "text": "There I will provide for you, lest you and your household, and all that you have, come to poverty; for there are still five years of famine.” ’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 47:12",
          "text": "Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Genesis 50:21",
          "text": "Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 1:6-7",
          "text": "Now Joseph and all his brothers and all that generation died, / but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Acts 7:11-14",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. ..."
        },
        {
          "reference": "Psalm 37:19",
          "text": "In the time of evil they will not be ashamed, and in the days of famine they will be satisfied."
        },
        {
          "reference": "Psalm 33:18-19",
          "text": "Surely the eyes of the LORD are on those who fear Him, on those whose hope is in His loving devotion / to deliver them from death and keep them alive in famine."
        },
        {
          "reference": "Psalm 105:16-17",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Isaiah 46:4",
          "text": "Even to your old age, I will be the same, and I will bear you up when you turn gray. I have made you, and I will carry you; I will sustain you and deliver you."
        },
        {
          "reference": "Isaiah 65:13",
          "text": "Therefore this is what the Lord GOD says: “My servants will eat, but you will go hungry; My servants will drink, but you will go thirsty; My servants will rejoice, but you will be put to shame."
        },
        {
          "reference": "Matthew 6:31-33",
          "text": "Therefore do not worry, saying, ‘What shall we eat?’ or ‘What shall we drink?’ or ‘What shall we wear?’ / For the Gentiles strive after all these things, and your heavenly Father knows that you need them. / But seek first the kingdom of God and His righteousness, and all these things will be added unto you."
        },
        {
          "reference": "Luke 12:24",
          "text": "Consider the ravens: They do not sow or reap, they have no storehouse or barn; yet God feeds them. How much more valuable you are than the birds!"
        },
        {
          "reference": "John 6:35",
          "text": "Jesus answered, “I am the bread of life. Whoever comes to Me will never hunger, and whoever believes in Me will never thirst."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Romans 8:35-39",
          "text": "Who shall separate us from the love of Christ? Shall trouble or distress or persecution or famine or nakedness or danger or sword? / As it is written: “For Your sake we face death all day long; we are considered as sheep to be slaughtered.” / No, in all these things we are more than conquerors through Him who loved us. ..."
        }
      ]
    },
    {
      "reference": "Genesis 45:12",
      "book": "Genesis",
      "chapter": 45,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "“You can see for yourselves, and so can my brother Benjamin, that it is really I who am speaking to you."
        },
        {
          "version": "NLT",
          "text": "Then Joseph added, “Look! You can see for yourselves, and so can my brother Benjamin, that I really am Joseph!"
        },
        {
          "version": "ESV",
          "text": "And now your eyes see, and the eyes of my brother Benjamin see, that it is my mouth that speaks to you."
        },
        {
          "version": "NKJV",
          "text": "“And behold, your eyes and the eyes of my brother Benjamin see that it is my mouth that speaks to you."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:8",
          "text": "Although Joseph recognized his brothers, they did not recognize him."
        },
        {
          "reference": "Genesis 37:5-8",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Acts 7:13",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Genesis 43:3",
          "text": "But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 50:17-21",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 37:9-11",
          "text": "Then Joseph had another dream and told it to his brothers. “Look,” he said, “I had another dream, and this time the sun and moon and eleven stars were bowing down to me.” / He told his father and brothers, but his father rebuked him and said, “What is this dream that you have had? Will your mother and brothers and I actually come and bow down to the ground before you?” / And his brothers were jealous of him, but his father kept in mind what he had said."
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 47:11-12",
          "text": "So Joseph settled his father and brothers in the land of Egypt and gave them property in the best part of the land, the district of Rameses, as Pharaoh had commanded. / Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Genesis 39:2-4",
          "text": "And the LORD was with Joseph, and he became a successful man, serving in the household of his Egyptian master. / When his master saw that the LORD was with him and made him prosper in all he did, / Joseph found favor in his sight and became his personal attendant. Potiphar put him in charge of his household and entrusted him with everything he owned."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        }
      ]
    },
    {
      "reference": "Genesis 45:13",
      "book": "Genesis",
      "chapter": 45,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "Tell my father about all the honor accorded me in Egypt and about everything you have seen. And bring my father down here quickly.”"
        },
        {
          "version": "NLT",
          "text": "Go tell my father of my honored position here in Egypt. Describe for him everything you have seen, and then bring my father here quickly.”"
        },
        {
          "version": "ESV",
          "text": "You must tell my father of all my honor in Egypt, and of all that you have seen. Hurry and bring my father down here.”"
        },
        {
          "version": "NKJV",
          "text": "So you shall tell my father of all my glory in Egypt, and of all that you have seen; and you shall hurry and bring my father down here.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:5-11",
          "text": "Then Joseph had a dream, and when he told it to his brothers, they hated him even more. / He said to them, “Listen to this dream I had: / We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” ..."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        },
        {
          "reference": "Genesis 43:26-28",
          "text": "When Joseph came home, they presented him with the gifts they had brought, and they bowed to the ground before him. / He asked if they were well, and then he asked, “How is your elderly father you told me about? Is he still alive?” / “Your servant our father is well,” they answered. “He is still alive.” And they bowed down to honor him."
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Exodus 4:29-31",
          "text": "Then Moses and Aaron went and assembled all the elders of the Israelites, / and Aaron relayed everything the LORD had said to Moses. And Moses performed the signs before the people, / and they believed. And when they heard that the LORD had attended to the Israelites and had seen their affliction, they bowed down and worshiped."
        },
        {
          "reference": "Exodus 18:8-9",
          "text": "Then Moses recounted to his father-in-law all that the LORD had done to Pharaoh and the Egyptians for Israel’s sake, all the hardships they had encountered along the way, and how the LORD had delivered them. / And Jethro rejoiced over all the good things the LORD had done for Israel, whom He had rescued from the hand of the Egyptians."
        },
        {
          "reference": "1 Samuel 17:55-58",
          "text": "As Saul had watched David going out to confront the Philistine, he said to Abner the commander of the army, “Abner, whose son is this young man?” “As surely as you live, O king,” Abner replied, “I do not know.” / “Find out whose son this young man is!” said the king. / So when David returned from killing the Philistine, still holding his head in his hand, Abner took him and brought him before Saul. ..."
        },
        {
          "reference": "1 Kings 10:6-9",
          "text": "She said to the king, “The report I heard in my own country about your words and wisdom is true. / But I did not believe these things until I came and saw with my own eyes. Indeed, not even half was told to me. Your wisdom and prosperity have far exceeded the report I heard. / How blessed are your men! How blessed are these servants of yours who stand continually before you and hear your wisdom! ..."
        },
        {
          "reference": "2 Kings 5:3-4",
          "text": "She said to her mistress, “If only my master would go to the prophet who is in Samaria, he would cure him of his leprosy.” / And Naaman went and told his master what the girl from the land of Israel had said."
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Isaiah 19:20-22",
          "text": "It will be a sign and a witness to the LORD of Hosts in the land of Egypt. When they cry out to the LORD because of their oppressors, He will send them a savior and defender to rescue them. / The LORD will make Himself known to Egypt, and on that day Egypt will acknowledge the LORD. They will worship with sacrifices and offerings; they will make vows to the LORD and fulfill them. / And the LORD will strike Egypt with a plague; He will strike them but heal them. They will turn to the LORD, and He will hear their prayers and heal them."
        },
        {
          "reference": "Acts 7:9-14",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        }
      ]
    },
    {
      "reference": "Genesis 45:14",
      "book": "Genesis",
      "chapter": 45,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he threw his arms around his brother Benjamin and wept, and Benjamin embraced him, weeping."
        },
        {
          "version": "NLT",
          "text": "Weeping with joy, he embraced Benjamin, and Benjamin did the same."
        },
        {
          "version": "ESV",
          "text": "Then he fell upon his brother Benjamin’s neck and wept, and Benjamin wept upon his neck."
        },
        {
          "version": "NKJV",
          "text": "Then he fell on his brother Benjamin’s neck and wept, and Benjamin wept on his neck."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 33:4",
          "text": "Esau, however, ran to him and embraced him, threw his arms around his neck, and kissed him. And they both wept."
        },
        {
          "reference": "Genesis 46:29",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely."
        },
        {
          "reference": "Genesis 50:1",
          "text": "Then Joseph fell upon his father’s face, wept over him, and kissed him."
        },
        {
          "reference": "Exodus 4:27",
          "text": "Meanwhile, the LORD had said to Aaron, “Go and meet Moses in the wilderness.” So he went and met Moses at the mountain of God and kissed him."
        },
        {
          "reference": "1 Samuel 20:41",
          "text": "When the young man had gone, David got up from the south side of the stone, fell facedown, and bowed three times. Then he and Jonathan kissed each other and wept together—though David wept more."
        },
        {
          "reference": "2 Samuel 14:33",
          "text": "So Joab went and told the king, and David summoned Absalom, who came to him and bowed facedown before him. Then the king kissed Absalom."
        },
        {
          "reference": "2 Samuel 19:39",
          "text": "So all the people crossed the Jordan, and then the king crossed over. The king kissed Barzillai and blessed him, and Barzillai returned home."
        },
        {
          "reference": "Ruth 1:9",
          "text": "May the LORD enable each of you to find rest in the home of your new husband.” And she kissed them as they wept aloud"
        },
        {
          "reference": "1 Kings 19:20",
          "text": "So Elisha left the oxen, ran after Elijah, and said, “Please let me kiss my father and mother goodbye, and then I will follow you.” “Go on back,” Elijah replied, “for what have I done to you?”"
        },
        {
          "reference": "Acts 20:37",
          "text": "They all wept openly as they embraced Paul and kissed him."
        },
        {
          "reference": "Luke 15:20",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him."
        },
        {
          "reference": "John 11:35",
          "text": "Jesus wept."
        },
        {
          "reference": "John 13:23-25",
          "text": "One of His disciples, the one whom Jesus loved, was reclining at His side. / So Simon Peter motioned to him to ask Jesus which one He was talking about. / Leaning back against Jesus, he asked, “Lord, who is it?”"
        },
        {
          "reference": "John 21:7",
          "text": "Then the disciple whom Jesus loved said to Peter, “It is the Lord!” As soon as Simon Peter heard that it was the Lord, he put on his outer garment (for he had removed it) and jumped into the sea."
        },
        {
          "reference": "Romans 12:15",
          "text": "Rejoice with those who rejoice; weep with those who weep."
        }
      ]
    },
    {
      "reference": "Genesis 45:15",
      "book": "Genesis",
      "chapter": 45,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "And he kissed all his brothers and wept over them. Afterward his brothers talked with him."
        },
        {
          "version": "NLT",
          "text": "Then Joseph kissed each of his brothers and wept over them, and after that they began talking freely with him."
        },
        {
          "version": "ESV",
          "text": "And he kissed all his brothers and wept upon them. After that his brothers talked with him."
        },
        {
          "version": "NKJV",
          "text": "Moreover he kissed all his brothers and wept over them, and after that his brothers talked with him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 50:17-21",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? ..."
        },
        {
          "reference": "Genesis 33:4",
          "text": "Esau, however, ran to him and embraced him, threw his arms around his neck, and kissed him. And they both wept."
        },
        {
          "reference": "Luke 15:20-24",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him. / The son declared, ‘Father, I have sinned against heaven and against you. I am no longer worthy to be called your son.’ / But the father said to his servants, ‘Quick! Bring the best robe and put it on him. Put a ring on his finger and sandals on his feet. ..."
        },
        {
          "reference": "Matthew 5:23-24",
          "text": "So if you are offering your gift at the altar and there remember that your brother has something against you, / leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        },
        {
          "reference": "Ephesians 4:32",
          "text": "Be kind and tenderhearted to one another, forgiving each other just as in Christ God forgave you."
        },
        {
          "reference": "Colossians 3:13",
          "text": "Bear with one another and forgive any complaint you may have against someone else. Forgive as the Lord forgave you."
        },
        {
          "reference": "2 Corinthians 2:7-8",
          "text": "So instead, you ought to forgive and comfort him, so that he will not be overwhelmed by excessive sorrow. / Therefore I urge you to reaffirm your love for him."
        },
        {
          "reference": "1 John 4:20-21",
          "text": "If anyone says, “I love God,” but hates his brother, he is a liar. For anyone who does not love his brother, whom he has seen, cannot love God, whom he has not seen. / And we have this commandment from Him: Whoever loves God must love his brother as well."
        },
        {
          "reference": "Romans 12:10",
          "text": "Be devoted to one another in brotherly love. Outdo yourselves in honoring one another."
        },
        {
          "reference": "Proverbs 10:12",
          "text": "Hatred stirs up dissension, but love covers all transgressions."
        },
        {
          "reference": "Proverbs 17:9",
          "text": "Whoever conceals an offense promotes love, but he who brings it up separates friends."
        },
        {
          "reference": "1 Peter 3:8-9",
          "text": "Finally, all of you, be like-minded and sympathetic, love as brothers, be tenderhearted and humble. / Do not repay evil with evil or insult with insult, but with blessing, because to this you were called so that you may inherit a blessing."
        },
        {
          "reference": "Matthew 18:21-22",
          "text": "Then Peter came to Jesus and asked, “Lord, how many times shall I forgive my brother who sins against me? Up to seven times?” / Jesus answered, “I tell you, not just seven times, but seventy-seven times!"
        },
        {
          "reference": "Luke 6:36-37",
          "text": "Be merciful, just as your Father is merciful. / Do not judge, and you will not be judged. Do not condemn, and you will not be condemned. Forgive, and you will be forgiven."
        },
        {
          "reference": "1 Thessalonians 5:15",
          "text": "Make sure that no one repays evil for evil. Always pursue what is good for one another and for all people."
        }
      ]
    },
    {
      "reference": "Genesis 45:16",
      "book": "Genesis",
      "chapter": 45,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "When the news reached Pharaoh’s palace that Joseph’s brothers had come, Pharaoh and all his officials were pleased."
        },
        {
          "version": "NLT",
          "text": "The news soon reached Pharaoh’s palace: “Joseph’s brothers have arrived!” Pharaoh and his officials were all delighted to hear this."
        },
        {
          "version": "ESV",
          "text": "When the report was heard in Pharaoh’s house, “Joseph’s brothers have come,” it pleased Pharaoh and his servants."
        },
        {
          "version": "NKJV",
          "text": "Now the report of it was heard in Pharaoh’s house, saying, “Joseph’s brothers have come.” So it pleased Pharaoh and his servants well."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Genesis 41:37-40",
          "text": "This proposal pleased Pharaoh and all his officials. / So Pharaoh asked them, “Can we find anyone like this man, in whom the Spirit of God abides?” / Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. ..."
        },
        {
          "reference": "Genesis 47:5-6",
          "text": "Pharaoh said to Joseph, “Now that your father and brothers have come to you, / the land of Egypt is before you; settle your father and brothers in the best part of the land. They may dwell in the land of Goshen. And if you know of any talented men among them, put them in charge of my own livestock.”"
        },
        {
          "reference": "Exodus 12:31-32",
          "text": "Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested. / Take your flocks and herds as well, just as you have said, and depart! And bless me also.”"
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 50:18-21",
          "text": "His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. ..."
        },
        {
          "reference": "Exodus 1:6-7",
          "text": "Now Joseph and all his brothers and all that generation died, / but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Acts 7:11-12",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit."
        },
        {
          "reference": "Genesis 46:31-34",
          "text": "Joseph said to his brothers and to his father’s household, “I will go up and inform Pharaoh: ‘My brothers and my father’s household from the land of Canaan have come to me. / The men are shepherds; they raise livestock, and they have brought their flocks and herds and all that they own.’ / When Pharaoh summons you and asks, ‘What is your occupation?’ ..."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Exodus 3:7-10",
          "text": "The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings. / I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites. / And now the cry of the Israelites has reached Me, and I have seen how severely the Egyptians are oppressing them. ..."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        }
      ]
    },
    {
      "reference": "Genesis 45:17",
      "book": "Genesis",
      "chapter": 45,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Pharaoh said to Joseph, “Tell your brothers, &#8216Do this: Load your animals and return to the land of Canaan,"
        },
        {
          "version": "NLT",
          "text": "Pharaoh said to Joseph, “Tell your brothers, ‘This is what you must do: Load your pack animals, and hurry back to the land of Canaan."
        },
        {
          "version": "ESV",
          "text": "And Pharaoh said to Joseph, “Say to your brothers, ‘Do this: load your beasts and go back to the land of Canaan,"
        },
        {
          "version": "NKJV",
          "text": "And Pharaoh said to Joseph, “Say to your brothers, ‘Do this: Load your animals and depart; go to the land of Canaan."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 45:18",
      "book": "Genesis",
      "chapter": 45,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "and bring your father and your families back to me. I will give you the best of the land of Egypt and you can enjoy the fat of the land.’"
        },
        {
          "version": "NLT",
          "text": "Then get your father and all of your families, and return here to me. I will give you the very best land in Egypt, and you will eat from the best that the land produces.’”"
        },
        {
          "version": "ESV",
          "text": "and take your father and your households, and come to me, and I will give you the best of the land of Egypt, and you shall eat the fat of the land.’"
        },
        {
          "version": "NKJV",
          "text": "Bring your father and your households and come to me; I will give you the best of the land of Egypt, and you will eat the fat of the land."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:8",
          "text": "I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites."
        },
        {
          "reference": "Exodus 16:3",
          "text": "“If only we had died by the LORD’s hand in the land of Egypt!” they said. “There we sat by pots of meat and ate our fill of bread, but you have brought us into this desert to starve this whole assembly to death!”"
        },
        {
          "reference": "Numbers 11:5",
          "text": "We remember the fish we ate freely in Egypt, along with the cucumbers, melons, leeks, onions, and garlic."
        },
        {
          "reference": "Deuteronomy 8:7-9",
          "text": "For the LORD your God is bringing you into a good land, a land of brooks and fountains and springs that flow through the valleys and hills; / a land of wheat, barley, vines, fig trees, and pomegranates; a land of olive oil and honey; / a land where you will eat food without scarcity, where you will lack nothing; a land whose rocks are iron and whose hills are ready to be mined for copper."
        },
        {
          "reference": "Deuteronomy 11:10-12",
          "text": "For the land that you are entering to possess is not like the land of Egypt, from which you have come, where you sowed your seed and irrigated on foot, like a vegetable garden. / But the land that you are crossing the Jordan to possess is a land of mountains and valleys that drinks in the rain from heaven. / It is a land for which the LORD your God cares; the eyes of the LORD your God are always on it, from the beginning to the end of the year."
        },
        {
          "reference": "Psalm 105:23-24",
          "text": "Then Israel entered Egypt; Jacob dwelt in the land of Ham. / And the LORD made His people very fruitful, more numerous than their foes,"
        },
        {
          "reference": "Isaiah 19:6-7",
          "text": "The canals will stink; the streams of Egypt will trickle and dry up; the reeds and rushes will wither. / The bulrushes by the Nile, by the mouth of the river, and all the fields sown along the Nile, will wither, blow away, and be no more."
        },
        {
          "reference": "Isaiah 30:23",
          "text": "Then He will send rain for the seed that you have sown in the ground, and the food that comes from your land will be rich and plentiful. On that day your cattle will graze in open pastures."
        },
        {
          "reference": "Jeremiah 2:7",
          "text": "I brought you into a fertile land to eat its fruit and bounty, but you came and defiled My land and made My inheritance detestable."
        },
        {
          "reference": "Ezekiel 20:6",
          "text": "On that day I swore to bring them out of the land of Egypt into a land that I had searched out for them, a land flowing with milk and honey, the glory of all lands."
        },
        {
          "reference": "Acts 7:11-14",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. ..."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        }
      ]
    },
    {
      "reference": "Genesis 45:19",
      "book": "Genesis",
      "chapter": 45,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "“You are also directed to tell them, &#8216Do this: Take some carts from Egypt for your children and your wives, and get your father and come."
        },
        {
          "version": "NLT",
          "text": "Then Pharaoh said to Joseph, “Tell your brothers, ‘Take wagons from the land of Egypt to carry your little children and your wives, and bring your father here."
        },
        {
          "version": "ESV",
          "text": "And you, Joseph, are commanded to say, ‘Do this: take wagons from the land of Egypt for your little ones and for your wives, and bring your father, and come."
        },
        {
          "version": "NKJV",
          "text": "Now you are commanded—do this: Take carts out of the land of Egypt for your little ones and your wives; bring your father and come."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 45:20",
      "book": "Genesis",
      "chapter": 45,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "Never mind about your belongings, because the best of all Egypt will be yours.’”"
        },
        {
          "version": "NLT",
          "text": "Don’t worry about your personal belongings, for the best of all the land of Egypt is yours.’”"
        },
        {
          "version": "ESV",
          "text": "Have no concern for your goods, for the best of all the land of Egypt is yours.’”"
        },
        {
          "version": "NKJV",
          "text": "Also do not be concerned about your goods, for the best of all the land of Egypt is yours.’ ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 11:2-3",
          "text": "Now announce to the people that men and women alike should ask their neighbors for articles of silver and gold.” / And the LORD gave the people favor in the sight of the Egyptians. Moreover, Moses himself was highly regarded in Egypt by Pharaoh’s officials and by the people."
        },
        {
          "reference": "Exodus 16:32-34",
          "text": "Moses said, “This is what the LORD has commanded: ‘Keep an omer of manna for the generations to come, so that they may see the bread I fed you in the wilderness when I brought you out of the land of Egypt.’” / So Moses told Aaron, “Take a jar and fill it with an omer of manna. Then place it before the LORD to be preserved for the generations to come.” / And Aaron placed it in front of the Testimony, to be preserved just as the LORD had commanded Moses."
        },
        {
          "reference": "Exodus 25:2-7",
          "text": "“Tell the Israelites to bring Me an offering. You are to receive My offering from every man whose heart compels him. / This is the offering you are to accept from them: gold, silver, and bronze; / blue, purple, and scarlet yarn; fine linen and goat hair; ..."
        },
        {
          "reference": "Deuteronomy 6:10-11",
          "text": "And when the LORD your God brings you into the land He swore to your fathers, to Abraham, Isaac, and Jacob, that He would give you—a land with great and splendid cities that you did not build, / with houses full of every good thing with which you did not fill them, with wells that you did not dig, and with vineyards and olive groves that you did not plant—and when you eat and are satisfied,"
        },
        {
          "reference": "Deuteronomy 8:7-10",
          "text": "For the LORD your God is bringing you into a good land, a land of brooks and fountains and springs that flow through the valleys and hills; / a land of wheat, barley, vines, fig trees, and pomegranates; a land of olive oil and honey; / a land where you will eat food without scarcity, where you will lack nothing; a land whose rocks are iron and whose hills are ready to be mined for copper. ..."
        },
        {
          "reference": "1 Kings 10:21",
          "text": "All King Solomon’s drinking cups were gold, and all the utensils of the House of the Forest of Lebanon were pure gold. There was no silver, because it was accounted as nothing in the days of Solomon."
        },
        {
          "reference": "2 Chronicles 9:20",
          "text": "All King Solomon’s drinking cups were gold, and all the utensils of the House of the Forest of Lebanon were pure gold. There was no silver, because it was accounted as nothing in the days of Solomon."
        },
        {
          "reference": "Psalm 105:37",
          "text": "He brought Israel out with silver and gold, and none among His tribes stumbled."
        },
        {
          "reference": "Isaiah 60:5-7",
          "text": "Then you will look and be radiant, and your heart will tremble and swell with joy, because the riches of the sea will be brought to you, and the wealth of the nations will come to you. / Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD. / All the flocks of Kedar will be gathered to you; the rams of Nebaioth will serve you and go up on My altar with acceptance; I will adorn My glorious house."
        },
        {
          "reference": "Isaiah 61:6",
          "text": "But you will be called the priests of the LORD; they will speak of you as ministers of our God; you will feed on the wealth of nations, and you will boast in their riches."
        },
        {
          "reference": "Jeremiah 31:12-14",
          "text": "They will come and shout for joy on the heights of Zion; they will be radiant over the bounty of the LORD—the grain, new wine, and oil, and the young of the flocks and herds. Their life will be like a well-watered garden, and never again will they languish. / Then the maidens will rejoice with dancing, young men and old as well. I will turn their mourning into joy, and give them comfort and joy for their sorrow. / I will fill the souls of the priests abundantly, and will fill My people with My goodness,” declares the LORD."
        },
        {
          "reference": "Matthew 6:19-21",
          "text": "Do not store up for yourselves treasures on earth, where moth and rust destroy, and where thieves break in and steal. / But store up for yourselves treasures in heaven, where moth and rust do not destroy, and where thieves do not break in and steal. / For where your treasure is, there your heart will be also."
        },
        {
          "reference": "Matthew 6:31-33",
          "text": "Therefore do not worry, saying, ‘What shall we eat?’ or ‘What shall we drink?’ or ‘What shall we wear?’ / For the Gentiles strive after all these things, and your heavenly Father knows that you need them. / But seek first the kingdom of God and His righteousness, and all these things will be added unto you."
        }
      ]
    },
    {
      "reference": "Genesis 45:21",
      "book": "Genesis",
      "chapter": 45,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "So the sons of Israel did this. Joseph gave them carts, as Pharaoh had commanded, and he also gave them provisions for their journey."
        },
        {
          "version": "NLT",
          "text": "So the sons of Jacob did as they were told. Joseph provided them with wagons, as Pharaoh had commanded, and he gave them supplies for the journey."
        },
        {
          "version": "ESV",
          "text": "The sons of Israel did so: and Joseph gave them wagons, according to the command of Pharaoh, and gave them provisions for the journey."
        },
        {
          "version": "NKJV",
          "text": "Then the sons of Israel did so; and Joseph gave them carts, according to the command of Pharaoh, and he gave them provisions for the journey."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:42",
          "text": "Then Pharaoh removed the signet ring from his finger, put it on Joseph’s finger, clothed him in garments of fine linen, and placed a gold chain around his neck."
        },
        {
          "reference": "Genesis 42:25",
          "text": "Then Joseph gave orders to fill their bags with grain, to return each man’s silver to his sack, and to give them provisions for their journey. This order was carried out,"
        },
        {
          "reference": "Genesis 43:11",
          "text": "Then their father Israel said to them, “If it must be so, then do this: Put some of the best products of the land in your packs and carry them down as a gift for the man—a little balm and a little honey, spices and myrrh, pistachios and almonds."
        },
        {
          "reference": "Genesis 50:21",
          "text": "Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Exodus 3:21-22",
          "text": "And I will grant this people such favor in the sight of the Egyptians that when you leave, you will not go away empty-handed. / Every woman shall ask her neighbor and any woman staying in her house for silver and gold jewelry and clothing, and you will put them on your sons and daughters. So you will plunder the Egyptians.”"
        },
        {
          "reference": "Exodus 11:2-3",
          "text": "Now announce to the people that men and women alike should ask their neighbors for articles of silver and gold.” / And the LORD gave the people favor in the sight of the Egyptians. Moreover, Moses himself was highly regarded in Egypt by Pharaoh’s officials and by the people."
        },
        {
          "reference": "Exodus 12:36",
          "text": "And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "1 Kings 10:2",
          "text": "She arrived in Jerusalem with a very large caravan—with camels bearing spices, gold in great abundance, and precious stones. And she came to Solomon and spoke to him all that was on her mind."
        },
        {
          "reference": "2 Chronicles 9:1",
          "text": "Now when the queen of Sheba heard about the fame of Solomon, she came to test him with difficult questions. She arrived in Jerusalem with a very large caravan—with camels bearing spices, gold in abundance, and precious stones. And she came to Solomon and spoke with him about all that was on her mind."
        },
        {
          "reference": "Nehemiah 2:8",
          "text": "And may I have a letter to Asaph, keeper of the king’s forest, so that he will give me timber to make beams for the gates of the citadel to the temple, for the city wall, and for the house I will occupy.” And because the gracious hand of my God was upon me, the king granted my requests."
        },
        {
          "reference": "Psalm 105:37",
          "text": "He brought Israel out with silver and gold, and none among His tribes stumbled."
        },
        {
          "reference": "Isaiah 60:5-6",
          "text": "Then you will look and be radiant, and your heart will tremble and swell with joy, because the riches of the sea will be brought to you, and the wealth of the nations will come to you. / Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD."
        },
        {
          "reference": "Matthew 2:11",
          "text": "On coming to the house, they saw the Child with His mother Mary, and they fell down and worshiped Him. Then they opened their treasures and presented Him with gifts of gold and frankincense and myrrh."
        },
        {
          "reference": "Matthew 6:33",
          "text": "But seek first the kingdom of God and His righteousness, and all these things will be added unto you."
        }
      ]
    },
    {
      "reference": "Genesis 45:22",
      "book": "Genesis",
      "chapter": 45,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "To each of them he gave new clothing, but to Benjamin he gave three hundred shekels of silver and five sets of clothes."
        },
        {
          "version": "NLT",
          "text": "And he gave each of them new clothes—but to Benjamin he gave five changes of clothes and 300 pieces of silver."
        },
        {
          "version": "ESV",
          "text": "To each and all of them he gave a change of clothes, but to Benjamin he gave three hundred shekels of silver and five changes of clothes."
        },
        {
          "version": "NKJV",
          "text": "He gave to all of them, to each man, changes of garments; but to Benjamin he gave three hundred pieces of silver and five changes of garments."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:3",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors."
        },
        {
          "reference": "Genesis 41:42",
          "text": "Then Pharaoh removed the signet ring from his finger, put it on Joseph’s finger, clothed him in garments of fine linen, and placed a gold chain around his neck."
        },
        {
          "reference": "Genesis 43:34",
          "text": "When the portions were served to them from Joseph’s table, Benjamin’s portion was five times larger than any of the others. So they feasted and drank freely with Joseph."
        },
        {
          "reference": "Genesis 44:1",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack."
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "1 Kings 10:22",
          "text": "For the king had the ships of Tarshish at sea with Hiram’s fleet, and once every three years the ships of Tarshish would arrive bearing gold, silver, ivory, apes, and peacocks."
        },
        {
          "reference": "2 Chronicles 9:21",
          "text": "For the king had the ships of Tarshish that went with Hiram’s servants, and once every three years the ships of Tarshish would arrive bearing gold, silver, ivory, apes, and peacocks."
        },
        {
          "reference": "Esther 2:18",
          "text": "Then the king held a great banquet, Esther’s banquet, for all his officials and servants. He proclaimed a tax holiday in the provinces and gave gifts worthy of the king’s bounty."
        },
        {
          "reference": "Job 42:11",
          "text": "All his brothers and sisters and prior acquaintances came and dined with him in his house. They consoled him and comforted him over all the adversity that the LORD had brought upon him. And each one gave him a piece of silver and a gold ring."
        },
        {
          "reference": "Psalm 105:21-22",
          "text": "He made him master of his household, ruler over all his substance, / to instruct his princes as he pleased and teach his elders wisdom."
        },
        {
          "reference": "Isaiah 61:10",
          "text": "I will rejoice greatly in the LORD, my soul will exult in my God; for He has clothed me with garments of salvation and wrapped me in a robe of righteousness, as a bridegroom wears a priestly headdress, as a bride adorns herself with her jewels."
        },
        {
          "reference": "Daniel 5:29",
          "text": "Then Belshazzar gave the command, and they clothed Daniel in purple, placed a gold chain around his neck, and proclaimed him the third highest ruler in the kingdom."
        },
        {
          "reference": "Matthew 6:19-21",
          "text": "Do not store up for yourselves treasures on earth, where moth and rust destroy, and where thieves break in and steal. / But store up for yourselves treasures in heaven, where moth and rust do not destroy, and where thieves do not break in and steal. / For where your treasure is, there your heart will be also."
        },
        {
          "reference": "Matthew 10:10",
          "text": "Take no bag for the road, or second tunic, or sandals, or staff; for the worker is worthy of his provisions."
        },
        {
          "reference": "Luke 15:22",
          "text": "But the father said to his servants, ‘Quick! Bring the best robe and put it on him. Put a ring on his finger and sandals on his feet."
        }
      ]
    },
    {
      "reference": "Genesis 45:23",
      "book": "Genesis",
      "chapter": 45,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "And this is what he sent to his father: ten donkeys loaded with the best things of Egypt, and ten female donkeys loaded with grain and bread and other provisions for his journey."
        },
        {
          "version": "NLT",
          "text": "He also sent his father ten male donkeys loaded with the finest products of Egypt, and ten female donkeys loaded with grain and bread and other supplies he would need on his journey."
        },
        {
          "version": "ESV",
          "text": "To his father he sent as follows: ten donkeys loaded with the good things of Egypt, and ten female donkeys loaded with grain, bread, and provision for his father on the journey."
        },
        {
          "version": "NKJV",
          "text": "And he sent to his father these things: ten donkeys loaded with the good things of Egypt, and ten female donkeys loaded with grain, bread, and food for his father for the journey."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 42:25",
          "text": "Then Joseph gave orders to fill their bags with grain, to return each man’s silver to his sack, and to give them provisions for their journey. This order was carried out,"
        },
        {
          "reference": "Genesis 43:11-14",
          "text": "Then their father Israel said to them, “If it must be so, then do this: Put some of the best products of the land in your packs and carry them down as a gift for the man—a little balm and a little honey, spices and myrrh, pistachios and almonds. / Take double the silver with you so that you may return the silver that was put back into the mouths of your sacks. Perhaps it was a mistake. / Take your brother as well, and return to the man at once. ..."
        },
        {
          "reference": "Genesis 44:1-2",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack. / Put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” So the steward did as Joseph had instructed."
        },
        {
          "reference": "Genesis 50:21",
          "text": "Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "1 Kings 10:2",
          "text": "She arrived in Jerusalem with a very large caravan—with camels bearing spices, gold in great abundance, and precious stones. And she came to Solomon and spoke to him all that was on her mind."
        },
        {
          "reference": "2 Kings 5:5",
          "text": "“Go now,” said the king of Aram, “and I will send you with a letter to the king of Israel.” So Naaman departed, taking with him ten talents of silver, six thousand shekels of gold, and ten sets of clothing."
        },
        {
          "reference": "2 Chronicles 9:1",
          "text": "Now when the queen of Sheba heard about the fame of Solomon, she came to test him with difficult questions. She arrived in Jerusalem with a very large caravan—with camels bearing spices, gold in abundance, and precious stones. And she came to Solomon and spoke with him about all that was on her mind."
        },
        {
          "reference": "Nehemiah 2:7-9",
          "text": "I also said to him, “If it pleases the king, may letters be given to me for the governors west of the Euphrates, so that they will grant me safe passage until I reach Judah. / And may I have a letter to Asaph, keeper of the king’s forest, so that he will give me timber to make beams for the gates of the citadel to the temple, for the city wall, and for the house I will occupy.” And because the gracious hand of my God was upon me, the king granted my requests. / Then I went to the governors west of the Euphrates and gave them the king’s letters. The king had also sent army officers and cavalry with me."
        },
        {
          "reference": "Esther 8:15",
          "text": "Mordecai went out from the presence of the king in royal garments of blue and white, with a large gold crown and a purple robe of fine linen. And the city of Susa shouted and rejoiced."
        },
        {
          "reference": "Job 42:10-12",
          "text": "After Job had prayed for his friends, the LORD restored his prosperity and doubled his former possessions. / All his brothers and sisters and prior acquaintances came and dined with him in his house. They consoled him and comforted him over all the adversity that the LORD had brought upon him. And each one gave him a piece of silver and a gold ring. / So the LORD blessed Job’s latter days more than his first. He owned 14,000 sheep, 6,000 camels, 1,000 yoke of oxen, and 1,000 female donkeys."
        },
        {
          "reference": "Psalm 105:21-22",
          "text": "He made him master of his household, ruler over all his substance, / to instruct his princes as he pleased and teach his elders wisdom."
        },
        {
          "reference": "Proverbs 21:14",
          "text": "A gift in secret soothes anger, and a covert bribe pacifies great wrath."
        },
        {
          "reference": "Isaiah 60:5-6",
          "text": "Then you will look and be radiant, and your heart will tremble and swell with joy, because the riches of the sea will be brought to you, and the wealth of the nations will come to you. / Caravans of camels will cover your land, young camels of Midian and Ephah, and all from Sheba will come, bearing gold and frankincense and proclaiming the praises of the LORD."
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        }
      ]
    },
    {
      "reference": "Genesis 45:24",
      "book": "Genesis",
      "chapter": 45,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he sent his brothers away, and as they were leaving he said to them, &#8220Don’t quarrel on the way!”"
        },
        {
          "version": "NLT",
          "text": "So Joseph sent his brothers off, and as they left, he called after them, “Don’t quarrel about all this along the way!”"
        },
        {
          "version": "ESV",
          "text": "Then he sent his brothers away, and as they departed, he said to them, “Do not quarrel on the way.”"
        },
        {
          "version": "NKJV",
          "text": "So he sent his brothers away, and they departed; and he said to them, “See that you do not become troubled along the way.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 45:25",
      "book": "Genesis",
      "chapter": 45,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "So they went up out of Egypt and came to their father Jacob in the land of Canaan."
        },
        {
          "version": "NLT",
          "text": "And they left Egypt and returned to their father, Jacob, in the land of Canaan."
        },
        {
          "version": "ESV",
          "text": "So they went up out of Egypt and came to the land of Canaan to their father Jacob."
        },
        {
          "version": "NKJV",
          "text": "Then they went up out of Egypt, and came to the land of Canaan to Jacob their father."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Genesis 37:1-36",
          "text": "Now Jacob lived in the land where his father had resided, the land of Canaan. / This is the account of Jacob. When Joseph was seventeen years old, he was tending the flock with his brothers, the sons of his father’s wives Bilhah and Zilpah, and he brought their father a bad report about them. / Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. ..."
        },
        {
          "reference": "Genesis 42:1-5",
          "text": "When Jacob learned that there was grain in Egypt, he said to his sons, “Why are you staring at one another?” / “Look,” he added, “I have heard that there is grain in Egypt. Go down there and buy some for us, so that we may live and not die.” / So ten of Joseph’s brothers went down to buy grain from Egypt. ..."
        },
        {
          "reference": "Genesis 43:1-14",
          "text": "Now the famine was still severe in the land. / So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.” / But Judah replied, “The man solemnly warned us, ‘You will not see my face again unless your brother is with you.’ ..."
        },
        {
          "reference": "Genesis 44:1-34",
          "text": "Then Joseph instructed his steward: “Fill the men’s sacks with as much food as they can carry, and put each one’s silver in the mouth of his sack. / Put my cup, the silver one, in the mouth of the youngest one’s sack, along with the silver for his grain.” So the steward did as Joseph had instructed. / At daybreak, the men were sent on their way with their donkeys. ..."
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Exodus 1:1-7",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:9-14",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Psalm 105:16-23",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Genesis 28:10-15",
          "text": "Meanwhile Jacob left Beersheba and set out for Haran. / On reaching a certain place, he spent the night there because the sun had set. And taking one of the stones from that place, he put it under his head and lay down to sleep. / And Jacob had a dream about a ladder that rested on the earth with its top reaching up to heaven, and God’s angels were going up and down the ladder. ..."
        }
      ]
    },
    {
      "reference": "Genesis 45:26",
      "book": "Genesis",
      "chapter": 45,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "They told him, “Joseph is still alive! In fact, he is ruler of all Egypt.” Jacob was stunned; he did not believe them."
        },
        {
          "version": "NLT",
          "text": "“Joseph is still alive!” they told him. “And he is governor of all the land of Egypt!” Jacob was stunned at the news—he couldn’t believe it."
        },
        {
          "version": "ESV",
          "text": "And they told him, “Joseph is still alive, and he is ruler over all the land of Egypt.” And his heart became numb, for he did not believe them."
        },
        {
          "version": "NKJV",
          "text": "And they told him, saying, “Joseph is still alive, and he is governor over all the land of Egypt.” And Jacob’s heart stood still, because he did not believe them."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:36",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!”"
        },
        {
          "reference": "Genesis 44:28",
          "text": "When one of them was gone, I said: “Surely he has been torn to pieces.” And I have not seen him since."
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 4:14",
          "text": "Then the anger of the LORD burned against Moses, and He said, “Is not Aaron the Levite your brother? I know that he can speak well, and he is now on his way to meet you. When he sees you, he will be glad in his heart."
        },
        {
          "reference": "Exodus 18:9",
          "text": "And Jethro rejoiced over all the good things the LORD had done for Israel, whom He had rescued from the hand of the Egyptians."
        },
        {
          "reference": "1 Kings 10:7",
          "text": "But I did not believe these things until I came and saw with my own eyes. Indeed, not even half was told to me. Your wisdom and prosperity have far exceeded the report I heard."
        },
        {
          "reference": "2 Kings 11:14",
          "text": "And she looked out and saw the king standing by the pillar, according to the custom. The officers and trumpeters were beside the king, and all the people of the land were rejoicing and blowing trumpets. Then Athaliah tore her clothes and screamed, “Treason! Treason!”"
        },
        {
          "reference": "Psalm 126:1-3",
          "text": "A song of ascents. When the LORD restored the captives of Zion, we were like dreamers. / Then our mouths were filled with laughter, our tongues with shouts of joy. Then it was said among the nations, “The LORD has done great things for them.” / The LORD has done great things for us; we are filled with joy."
        },
        {
          "reference": "Isaiah 29:14",
          "text": "Therefore I will again confound these people with wonder upon wonder. The wisdom of the wise will vanish, and the intelligence of the intelligent will be hidden.”"
        },
        {
          "reference": "Isaiah 52:8",
          "text": "Listen! Your watchmen lift up their voices, together they shout for joy. For every eye will see when the LORD returns to Zion."
        },
        {
          "reference": "Jeremiah 31:15-17",
          "text": "This is what the LORD says: “A voice is heard in Ramah, mourning and great weeping, Rachel weeping for her children and refusing to be comforted, because they are no more.” / This is what the LORD says: “Keep your voice from weeping and your eyes from tears, for the reward for your work will come, declares the LORD. Then your children will return from the land of the enemy. / So there is hope for your future, declares the LORD, and your children will return to their own land."
        },
        {
          "reference": "Matthew 28:8",
          "text": "So they hurried away from the tomb in fear and great joy, and ran to tell His disciples."
        },
        {
          "reference": "Luke 24:11",
          "text": "But their words seemed like nonsense to them, and they did not believe the women."
        }
      ]
    },
    {
      "reference": "Genesis 45:27",
      "book": "Genesis",
      "chapter": 45,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "But when they told him everything Joseph had said to them, and when he saw the carts Joseph had sent to carry him back, the spirit of their father Jacob revived."
        },
        {
          "version": "NLT",
          "text": "But when they repeated to Jacob everything Joseph had told them, and when he saw the wagons Joseph had sent to carry him, their father’s spirits revived."
        },
        {
          "version": "ESV",
          "text": "But when they told him all the words of Joseph, which he had said to them, and when he saw the wagons that Joseph had sent to carry him, the spirit of their father Jacob revived."
        },
        {
          "version": "NKJV",
          "text": "But when they told him all the words which Joseph had said to them, and when he saw the carts which Joseph had sent to carry him, the spirit of Jacob their father revived."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 42:36",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!”"
        },
        {
          "reference": "Genesis 44:28",
          "text": "When one of them was gone, I said: “Surely he has been torn to pieces.” And I have not seen him since."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 4:29-31",
          "text": "Then Moses and Aaron went and assembled all the elders of the Israelites, / and Aaron relayed everything the LORD had said to Moses. And Moses performed the signs before the people, / and they believed. And when they heard that the LORD had attended to the Israelites and had seen their affliction, they bowed down and worshiped."
        },
        {
          "reference": "1 Kings 10:5",
          "text": "the food at his table, the seating of his servants, the service and attire of his attendants, his cupbearers, and the burnt offerings he presented at the house of the LORD, it took her breath away."
        },
        {
          "reference": "2 Kings 2:11",
          "text": "As they were walking along and talking together, suddenly a chariot of fire with horses of fire appeared and separated the two of them, and Elijah went up into heaven in a whirlwind."
        },
        {
          "reference": "Psalm 126:1-3",
          "text": "A song of ascents. When the LORD restored the captives of Zion, we were like dreamers. / Then our mouths were filled with laughter, our tongues with shouts of joy. Then it was said among the nations, “The LORD has done great things for them.” / The LORD has done great things for us; we are filled with joy."
        },
        {
          "reference": "Isaiah 40:31",
          "text": "But those who wait upon the LORD will renew their strength; they will mount up with wings like eagles; they will run and not grow weary, they will walk and not faint."
        },
        {
          "reference": "Isaiah 61:1-3",
          "text": "The Spirit of the Lord GOD is on Me, because the LORD has anointed Me to preach good news to the poor. He has sent Me to bind up the brokenhearted, to proclaim liberty to the captives and freedom to the prisoners, / to proclaim the year of the LORD’s favor and the day of our God’s vengeance, to comfort all who mourn, / to console the mourners in Zion—to give them a crown of beauty for ashes, the oil of joy for mourning, and a garment of praise for a spirit of despair. So they will be called oaks of righteousness, the planting of the LORD, that He may be glorified."
        },
        {
          "reference": "Jeremiah 31:13",
          "text": "Then the maidens will rejoice with dancing, young men and old as well. I will turn their mourning into joy, and give them comfort and joy for their sorrow."
        },
        {
          "reference": "Ezekiel 37:14",
          "text": "I will put My Spirit in you and you will live, and I will settle you in your own land. Then you will know that I, the LORD, have spoken, and I will do it, declares the LORD.’”"
        },
        {
          "reference": "Matthew 28:8",
          "text": "So they hurried away from the tomb in fear and great joy, and ran to tell His disciples."
        },
        {
          "reference": "Luke 24:41",
          "text": "While they were still in disbelief because of their joy and amazement, He asked them, “Do you have anything here to eat?”"
        }
      ]
    },
    {
      "reference": "Genesis 45:28",
      "book": "Genesis",
      "chapter": 45,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "And Israel said, “I’m convinced! My son Joseph is still alive. I will go and see him before I die.”"
        },
        {
          "version": "NLT",
          "text": "Then Jacob exclaimed, “It must be true! My son Joseph is alive! I must go and see him before I die.”"
        },
        {
          "version": "ESV",
          "text": "And Israel said, “It is enough; Joseph my son is still alive. I will go and see him before I die.”"
        },
        {
          "version": "NKJV",
          "text": "Then Israel said, “ It is enough. Joseph my son is still alive. I will go and see him before I die.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 42:36",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!”"
        },
        {
          "reference": "Genesis 43:14",
          "text": "May God Almighty grant you mercy before the man, that he may release your other brother along with Benjamin. As for me, if I am bereaved, I am bereaved.”"
        },
        {
          "reference": "Genesis 44:28",
          "text": "When one of them was gone, I said: “Surely he has been torn to pieces.” And I have not seen him since."
        },
        {
          "reference": "Genesis 46:2-4",
          "text": "And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. / I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 4:27-31",
          "text": "Meanwhile, the LORD had said to Aaron, “Go and meet Moses in the wilderness.” So he went and met Moses at the mountain of God and kissed him. / And Moses told Aaron everything the LORD had sent him to say, and all the signs He had commanded him to perform. / Then Moses and Aaron went and assembled all the elders of the Israelites, ..."
        },
        {
          "reference": "1 Kings 17:23",
          "text": "Then Elijah took the child, brought him down from the upper room into the house, and gave him to his mother. “Look, your son is alive,” Elijah declared."
        },
        {
          "reference": "2 Kings 4:36-37",
          "text": "Elisha summoned Gehazi and said, “Call the Shunammite woman.” So he called her and she came. Then Elisha said, “Pick up your son.” / She came in, fell at his feet, and bowed to the ground. Then she picked up her son and went out."
        },
        {
          "reference": "Psalm 126:1-3",
          "text": "A song of ascents. When the LORD restored the captives of Zion, we were like dreamers. / Then our mouths were filled with laughter, our tongues with shouts of joy. Then it was said among the nations, “The LORD has done great things for them.” / The LORD has done great things for us; we are filled with joy."
        },
        {
          "reference": "Isaiah 49:20-21",
          "text": "Yet the children of your bereavement will say in your hearing, ‘This place is too small for us; make room for us to live here.’ / Then you will say in your heart, ‘Who has begotten these for me? I was bereaved and barren; I was exiled and rejected. So who has reared them? Look, I was left all alone, so where did they come from?’”"
        },
        {
          "reference": "Jeremiah 31:15-17",
          "text": "This is what the LORD says: “A voice is heard in Ramah, mourning and great weeping, Rachel weeping for her children and refusing to be comforted, because they are no more.” / This is what the LORD says: “Keep your voice from weeping and your eyes from tears, for the reward for your work will come, declares the LORD. Then your children will return from the land of the enemy. / So there is hope for your future, declares the LORD, and your children will return to their own land."
        },
        {
          "reference": "Luke 15:24",
          "text": "For this son of mine was dead and is alive again! He was lost and is found!’ So they began to celebrate."
        },
        {
          "reference": "Luke 24:34",
          "text": "and saying, “The Lord has indeed risen and has appeared to Simon!”"
        }
      ]
    }
  ]
}