{
  "book": "genesis",
  "chapter": 46,
  "verses": [
    {
      "reference": "Genesis 46:1",
      "book": "Genesis",
      "chapter": 46,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "So Israel set out with all that was his, and when he reached Beersheba, he offered sacrifices to the God of his father Isaac."
        },
        {
          "version": "NLT",
          "text": "So Jacob set out for Egypt with all his possessions. And when he came to Beersheba, he offered sacrifices to the God of his father, Isaac."
        },
        {
          "version": "ESV",
          "text": "So Israel took his journey with all that he had and came to Beersheba, and offered sacrifices to the God of his father Isaac."
        },
        {
          "version": "NKJV",
          "text": "So Israel took his journey with all that he had, and came to Beersheba, and offered sacrifices to the God of his father Isaac."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 28:10-15",
          "text": "Meanwhile Jacob left Beersheba and set out for Haran. / On reaching a certain place, he spent the night there because the sun had set. And taking one of the stones from that place, he put it under his head and lay down to sleep. / And Jacob had a dream about a ladder that rested on the earth with its top reaching up to heaven, and God’s angels were going up and down the ladder. ..."
        },
        {
          "reference": "Genesis 35:1",
          "text": "Then God said to Jacob, “Arise, go up to Bethel, and settle there. Build an altar there to the God who appeared to you when you fled from your brother Esau.”"
        },
        {
          "reference": "Genesis 15:13-16",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions. / You, however, will go to your fathers in peace and be buried at a ripe old age. ..."
        },
        {
          "reference": "Genesis 26:2-5",
          "text": "The LORD appeared to Isaac and said, “Do not go down to Egypt. Settle in the land where I tell you. / Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed, ..."
        },
        {
          "reference": "Genesis 31:3",
          "text": "Then the LORD said to Jacob, “Go back to the land of your fathers and to your kindred, and I will be with you.”"
        },
        {
          "reference": "Genesis 32:1-2",
          "text": "Jacob also went on his way, and the angels of God met him. / When Jacob saw them, he said, “This is the camp of God.” So he named that place Mahanaim."
        },
        {
          "reference": "Genesis 45:9",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay."
        },
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Exodus 6:2-8",
          "text": "God also told Moses, “I am the LORD. / I appeared to Abraham, to Isaac, and to Jacob as God Almighty, but by My name the LORD I did not make Myself known to them. / I also established My covenant with them to give them the land of Canaan, the land where they lived as foreigners. ..."
        },
        {
          "reference": "Exodus 12:41",
          "text": "At the end of the 430 years, to the very day, all the LORD’s divisions went out of the land of Egypt."
        },
        {
          "reference": "Acts 7:2-4",
          "text": "And Stephen declared: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Haran, / and told him, ‘Leave your country and your kindred and go to the land I will show you.’ / So Abraham left the land of the Chaldeans and settled in Haran. After his father died, God brought him out of that place and into this land where you are now living."
        },
        {
          "reference": "Hebrews 11:8-9",
          "text": "By faith Abraham, when called to go to a place he would later receive as his inheritance, obeyed and went, without knowing where he was going. / By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Hebrews 11:13-16",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth. / Now those who say such things show that they are seeking a country of their own. / If they had been thinking of the country they had left, they would have had opportunity to return. ..."
        },
        {
          "reference": "Acts 7:15",
          "text": "So Jacob went down to Egypt, where he and our fathers died."
        }
      ]
    },
    {
      "reference": "Genesis 46:2",
      "book": "Genesis",
      "chapter": 46,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "And God spoke to Israel in a vision at night and said, “Jacob! Jacob!” “Here I am,” he replied."
        },
        {
          "version": "NLT",
          "text": "During the night God spoke to him in a vision. “Jacob! Jacob!” he called. “Here I am,” Jacob replied."
        },
        {
          "version": "ESV",
          "text": "And God spoke to Israel in visions of the night and said, “Jacob, Jacob.” And he said, “Here I am.”"
        },
        {
          "version": "NKJV",
          "text": "Then God spoke to Israel in the visions of the night, and said, “Jacob, Jacob!” And he said, “Here I am.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 15:1",
          "text": "After these events, the word of the LORD came to Abram in a vision: “Do not be afraid, Abram. I am your shield, your very great reward.”"
        },
        {
          "reference": "Genesis 28:12-13",
          "text": "And Jacob had a dream about a ladder that rested on the earth with its top reaching up to heaven, and God’s angels were going up and down the ladder. / And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie."
        },
        {
          "reference": "Genesis 31:11",
          "text": "In that dream the angel of God said to me, ‘Jacob!’ And I replied, ‘Here I am.’"
        },
        {
          "reference": "Genesis 22:11",
          "text": "Just then the angel of the LORD called out to him from heaven, “Abraham, Abraham!” “Here I am,” he replied."
        },
        {
          "reference": "Exodus 3:4",
          "text": "When the LORD saw that he had gone over to look, God called out to him from within the bush, “Moses, Moses!” “Here I am,” he answered."
        },
        {
          "reference": "1 Samuel 3:4",
          "text": "Then the LORD called to Samuel, and he answered, “Here I am.”"
        },
        {
          "reference": "Job 33:14-16",
          "text": "For God speaks in one way and in another, yet no one notices. / In a dream, in a vision in the night, when deep sleep falls upon men as they slumber on their beds, / He opens their ears and terrifies them with warnings"
        },
        {
          "reference": "Isaiah 6:8",
          "text": "Then I heard the voice of the Lord saying: “Whom shall I send? Who will go for Us?” And I said: “Here am I. Send me!”"
        },
        {
          "reference": "Daniel 10:9",
          "text": "I heard the sound of his words, and as I listened, I fell into a deep sleep, with my face to the ground."
        },
        {
          "reference": "Acts 9:4",
          "text": "He fell to the ground and heard a voice say to him, “Saul, Saul, why do you persecute Me?”"
        },
        {
          "reference": "Acts 10:13",
          "text": "Then a voice said to him: “Get up, Peter, kill and eat!”"
        },
        {
          "reference": "Acts 22:7",
          "text": "I fell to the ground and heard a voice say to me, ‘Saul, Saul, why do you persecute Me?’"
        },
        {
          "reference": "Matthew 1:20",
          "text": "But after he had pondered these things, an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to embrace Mary as your wife, for the One conceived in her is from the Holy Spirit."
        },
        {
          "reference": "Matthew 2:13",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.”"
        },
        {
          "reference": "Matthew 2:19",
          "text": "After Herod died, an angel of the Lord appeared in a dream to Joseph in Egypt."
        }
      ]
    },
    {
      "reference": "Genesis 46:3",
      "book": "Genesis",
      "chapter": 46,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "“I am God, the God of your father,” he said. &#8220Do not be afraid to go down to Egypt, for I will make you into a great nation there."
        },
        {
          "version": "NLT",
          "text": "“I am God, the God of your father,” the voice said. “Do not be afraid to go down to Egypt, for there I will make your family into a great nation."
        },
        {
          "version": "ESV",
          "text": "Then he said, “I am God, the God of your father. Do not be afraid to go down to Egypt, for there I will make you into a great nation."
        },
        {
          "version": "NKJV",
          "text": "So He said, “I am God, the God of your father; do not fear to go down to Egypt, for I will make of you a great nation there."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Genesis 15:1",
          "text": "After these events, the word of the LORD came to Abram in a vision: “Do not be afraid, Abram. I am your shield, your very great reward.”"
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 26:24",
          "text": "and that night the LORD appeared to him and said, “I am the God of your father Abraham. Do not be afraid, for I am with you. I will bless you and multiply your descendants for the sake of My servant Abraham.”"
        },
        {
          "reference": "Genesis 12:2",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing."
        },
        {
          "reference": "Genesis 35:11",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Isaiah 43:5",
          "text": "Do not be afraid, for I am with you; I will bring your offspring from the east and gather you from the west."
        },
        {
          "reference": "Exodus 1:7",
          "text": "but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Exodus 6:6-8",
          "text": "Therefore tell the Israelites: ‘I am the LORD, and I will bring you out from under the yoke of the Egyptians and deliver you from their bondage. I will redeem you with an outstretched arm and with mighty acts of judgment. / I will take you as My own people, and I will be your God. Then you will know that I am the LORD your God, who brought you out from under the yoke of the Egyptians. / And I will bring you into the land that I swore to give to Abraham, Isaac, and Jacob. I will give it to you as a possession. I am the LORD!’”"
        },
        {
          "reference": "Deuteronomy 31:6",
          "text": "Be strong and courageous; do not be afraid or terrified of them, for it is the LORD your God who goes with you; He will never leave you nor forsake you.”"
        },
        {
          "reference": "Joshua 1:9",
          "text": "Have I not commanded you to be strong and courageous? Do not be afraid; do not be discouraged, for the LORD your God is with you wherever you go.”"
        },
        {
          "reference": "Psalm 105:23-24",
          "text": "Then Israel entered Egypt; Jacob dwelt in the land of Ham. / And the LORD made His people very fruitful, more numerous than their foes,"
        },
        {
          "reference": "Acts 7:9-15",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Hebrews 11:9-10",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise. / For he was looking forward to the city with foundations, whose architect and builder is God."
        }
      ]
    },
    {
      "reference": "Genesis 46:4",
      "book": "Genesis",
      "chapter": 46,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "I will go down to Egypt with you, and I will surely bring you back again. And Joseph’s own hand will close your eyes.”"
        },
        {
          "version": "NLT",
          "text": "I will go with you down to Egypt, and I will bring you back again. You will die in Egypt, but Joseph will be with you to close your eyes.”"
        },
        {
          "version": "ESV",
          "text": "I myself will go down with you to Egypt, and I will also bring you up again, and Joseph’s hand shall close your eyes.”"
        },
        {
          "version": "NKJV",
          "text": "I will go down with you to Egypt, and I will also surely bring you up again; and Joseph will put his hand on your eyes.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 50:1-14",
          "text": "Then Joseph fell upon his father’s face, wept over him, and kissed him. / And Joseph directed the physicians in his service to embalm his father Israel. So they embalmed him, / taking the forty days required to complete the embalming. And the Egyptians mourned for him seventy days. ..."
        },
        {
          "reference": "Exodus 3:12",
          "text": "“I will surely be with you,” God said, “and this will be the sign to you that I have sent you: When you have brought the people out of Egypt, all of you will worship God on this mountain.”"
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Deuteronomy 31:6",
          "text": "Be strong and courageous; do not be afraid or terrified of them, for it is the LORD your God who goes with you; He will never leave you nor forsake you.”"
        },
        {
          "reference": "Joshua 1:5",
          "text": "No one shall stand against you all the days of your life. As I was with Moses, so will I be with you; I will never leave you nor forsake you."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Isaiah 43:2",
          "text": "When you pass through the waters, I will be with you; and when you go through the rivers, they will not overwhelm you. When you walk through the fire, you will not be scorched; the flames will not set you ablaze."
        },
        {
          "reference": "Jeremiah 30:10",
          "text": "As for you, O Jacob My servant, do not be afraid, declares the LORD, and do not be dismayed, O Israel. For I will surely save you out of a distant place, your descendants from the land of their captivity! Jacob will return to quiet and ease, with no one to make him afraid."
        },
        {
          "reference": "Jeremiah 46:27",
          "text": "But you, O Jacob My servant, do not be afraid, and do not be dismayed, O Israel. For I will surely save you out of a distant place, your descendants from the land of their captivity! Jacob will return to quiet and ease, with no one to make him afraid."
        },
        {
          "reference": "Matthew 28:20",
          "text": "and teaching them to obey all that I have commanded you. And surely I am with you always, even to the end of the age.”"
        },
        {
          "reference": "John 14:18",
          "text": "I will not leave you as orphans; I will come to you."
        },
        {
          "reference": "John 14:27",
          "text": "Peace I leave with you; My peace I give to you. I do not give to you as the world gives. Do not let your hearts be troubled; do not be afraid."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        }
      ]
    },
    {
      "reference": "Genesis 46:5",
      "book": "Genesis",
      "chapter": 46,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob left Beersheba, and Israel’s sons took their father Jacob and their children and their wives in the carts that Pharaoh had sent to transport him."
        },
        {
          "version": "NLT",
          "text": "So Jacob left Beersheba, and his sons took him to Egypt. They carried him and their little ones and their wives in the wagons Pharaoh had provided for them."
        },
        {
          "version": "ESV",
          "text": "Then Jacob set out from Beersheba. The sons of Israel carried Jacob their father, their little ones, and their wives, in the wagons that Pharaoh had sent to carry him."
        },
        {
          "version": "NKJV",
          "text": "Then Jacob arose from Beersheba; and the sons of Israel carried their father Jacob, their little ones, and their wives, in the carts which Pharaoh had sent to carry him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Genesis 45:19-21",
          "text": "You are also directed to tell them: ‘Take wagons from the land of Egypt for your young children and your wives, and bring your father and come back. / But pay no regard to your belongings, for the best of all the land of Egypt is yours.’” / So the sons of Israel did as they were told. Joseph gave them wagons as Pharaoh had instructed, and he also gave them provisions for their journey."
        },
        {
          "reference": "Genesis 47:1-4",
          "text": "So Joseph went and told Pharaoh: “My father and my brothers, with their flocks and herds and all they own, have come from the land of Canaan and are now in Goshen.” / And he chose five of his brothers and presented them before Pharaoh. / “What is your occupation?” Pharaoh asked Joseph’s brothers. “Your servants are shepherds,” they replied, “both we and our fathers.” ..."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Genesis 50:7-9",
          "text": "Then Joseph went to bury his father, and all the servants of Pharaoh accompanied him—the elders of Pharaoh’s household and all the elders of the land of Egypt— / along with all of Joseph’s household, and his brothers, and his father’s household. Only their children and flocks and herds were left in Goshen. / Chariots and horsemen alike went up with him, and it was an exceedingly large procession."
        },
        {
          "reference": "Exodus 12:37-38",
          "text": "The Israelites journeyed from Rameses to Succoth with about 600,000 men on foot, besides women and children. / And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 31:17-18",
          "text": "Then Jacob got up and put his children and his wives on camels, / and he drove all his livestock before him, along with all the possessions he had acquired in Paddan-aram, to go to his father Isaac in the land in Canaan."
        },
        {
          "reference": "Genesis 35:9-12",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him. / And God said to him, “Though your name is Jacob, you will no longer be called Jacob. Instead, your name will be Israel.” So God named him Israel. / And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. ..."
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 37:1",
          "text": "Now Jacob lived in the land where his father had resided, the land of Canaan."
        },
        {
          "reference": "Genesis 42:1-3",
          "text": "When Jacob learned that there was grain in Egypt, he said to his sons, “Why are you staring at one another?” / “Look,” he added, “I have heard that there is grain in Egypt. Go down there and buy some for us, so that we may live and not die.” / So ten of Joseph’s brothers went down to buy grain from Egypt."
        },
        {
          "reference": "Genesis 43:1-2",
          "text": "Now the famine was still severe in the land. / So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.”"
        }
      ]
    },
    {
      "reference": "Genesis 46:6",
      "book": "Genesis",
      "chapter": 46,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "So Jacob and all his offspring went to Egypt, taking with them their livestock and the possessions they had acquired in Canaan."
        },
        {
          "version": "NLT",
          "text": "They also took all their livestock and all the personal belongings they had acquired in the land of Canaan. So Jacob and his entire family went to Egypt—"
        },
        {
          "version": "ESV",
          "text": "They also took their livestock and their goods, which they had gained in the land of Canaan, and came into Egypt, Jacob and all his offspring with him,"
        },
        {
          "version": "NKJV",
          "text": "So they took their livestock and their goods, which they had acquired in the land of Canaan, and went to Egypt, Jacob and all his descendants with him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Genesis 45:17-20",
          "text": "Pharaoh said to Joseph, “Tell your brothers, ‘Do as follows: Load your animals and return to the land of Canaan. / Then bring your father and your families and return to me. I will give you the best of the land of Egypt, and you shall eat from the fat of the land.’ / You are also directed to tell them: ‘Take wagons from the land of Egypt for your young children and your wives, and bring your father and come back. ..."
        },
        {
          "reference": "Genesis 47:11-12",
          "text": "So Joseph settled his father and brothers in the land of Egypt and gave them property in the best part of the land, the district of Rameses, as Pharaoh had commanded. / Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Exodus 12:40-41",
          "text": "Now the duration of the Israelites’ stay in Egypt was 430 years. / At the end of the 430 years, to the very day, all the LORD’s divisions went out of the land of Egypt."
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Hebrews 11:9-10",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise. / For he was looking forward to the city with foundations, whose architect and builder is God."
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Exodus 3:6-8",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God. / The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings. / I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites."
        },
        {
          "reference": "Acts 7:6-7",
          "text": "God told him that his descendants would be foreigners in a strange land, and that they would be enslaved and mistreated four hundred years. / ‘But I will punish the nation that enslaves them,’ God said, ‘and afterward they will come forth and worship Me in this place.’"
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 26:3-4",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham. / I will make your descendants as numerous as the stars in the sky, and I will give them all these lands, and through your offspring all nations of the earth will be blessed,"
        }
      ]
    },
    {
      "reference": "Genesis 46:7",
      "book": "Genesis",
      "chapter": 46,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob brought with him to Egypt his sons and grandsons and his daughters and granddaughters—all his offspring."
        },
        {
          "version": "NLT",
          "text": "sons and grandsons, daughters and granddaughters—all his descendants."
        },
        {
          "version": "ESV",
          "text": "his sons, and his sons’ sons with him, his daughters, and his sons’ daughters. All his offspring he brought with him into Egypt."
        },
        {
          "version": "NKJV",
          "text": "His sons and his sons’ sons, his daughters and his sons’ daughters, and all his descendants he brought with him to Egypt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 47:11-12",
          "text": "So Joseph settled his father and brothers in the land of Egypt and gave them property in the best part of the land, the district of Rameses, as Pharaoh had commanded. / Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Genesis 50:22-23",
          "text": "Now Joseph and his father’s household remained in Egypt, and Joseph lived to the age of 110. / He saw Ephraim’s sons to the third generation, and indeed the sons of Machir son of Manasseh were brought up on Joseph’s knees."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 35:11-12",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. / The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Genesis 41:54-57",
          "text": "the seven years of famine began, just as Joseph had said. And although there was famine in every country, there was food throughout the land of Egypt. / When extreme hunger came to all the land of Egypt and the people cried out to Pharaoh for food, he told all the Egyptians, “Go to Joseph and do whatever he tells you.” / When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. ..."
        },
        {
          "reference": "Genesis 42:1-3",
          "text": "When Jacob learned that there was grain in Egypt, he said to his sons, “Why are you staring at one another?” / “Look,” he added, “I have heard that there is grain in Egypt. Go down there and buy some for us, so that we may live and not die.” / So ten of Joseph’s brothers went down to buy grain from Egypt."
        },
        {
          "reference": "Genesis 43:1-2",
          "text": "Now the famine was still severe in the land. / So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.”"
        },
        {
          "reference": "Genesis 45:17-20",
          "text": "Pharaoh said to Joseph, “Tell your brothers, ‘Do as follows: Load your animals and return to the land of Canaan. / Then bring your father and your families and return to me. I will give you the best of the land of Egypt, and you shall eat from the fat of the land.’ / You are also directed to tell them: ‘Take wagons from the land of Egypt for your young children and your wives, and bring your father and come back. ..."
        },
        {
          "reference": "Genesis 48:21",
          "text": "Then Israel said to Joseph, “Look, I am about to die, but God will be with you and bring you back to the land of your fathers."
        },
        {
          "reference": "Exodus 6:14-25",
          "text": "These were the heads of their fathers’ houses: The sons of Reuben, the firstborn of Israel, were Hanoch and Pallu, Hezron and Carmi. These were the clans of Reuben. / The sons of Simeon were Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul, the son of a Canaanite woman. These were the clans of Simeon. / These were the names of the sons of Levi according to their records: Gershon, Kohath, and Merari. Levi lived 137 years. ..."
        },
        {
          "reference": "Exodus 12:37-38",
          "text": "The Israelites journeyed from Rameses to Succoth with about 600,000 men on foot, besides women and children. / And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        }
      ]
    },
    {
      "reference": "Genesis 46:8",
      "book": "Genesis",
      "chapter": 46,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "These are the names of the sons of Israel (Jacob and his descendants) who went to Egypt: Reuben the firstborn of Jacob."
        },
        {
          "version": "NLT",
          "text": "These are the names of the descendants of Israel—the sons of Jacob—who went to Egypt: Reuben was Jacob’s oldest son."
        },
        {
          "version": "ESV",
          "text": "Now these are the names of the descendants of Israel, who came into Egypt, Jacob and his sons. Reuben, Jacob’s firstborn,"
        },
        {
          "version": "NKJV",
          "text": "Now these were the names of the children of Israel, Jacob and his sons, who went to Egypt: Reuben was Jacob’s firstborn."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Numbers 26:5-51",
          "text": "Reuben was the firstborn of Israel. These were the descendants of Reuben: The Hanochite clan from Hanoch, the Palluite clan from Pallu, / the Hezronite clan from Hezron, and the Carmite clan from Carmi. / These were the clans of Reuben, and their registration numbered 43,730. ..."
        },
        {
          "reference": "1 Chronicles 2:1-2",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, / Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."
        },
        {
          "reference": "Deuteronomy 10:22",
          "text": "Your fathers went down to Egypt, seventy in all, and now the LORD your God has made you as numerous as the stars in the sky."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Genesis 35:23-26",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. / The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. ..."
        },
        {
          "reference": "Genesis 29:31-35",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren. / And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.” / Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon. ..."
        },
        {
          "reference": "Genesis 30:1-24",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?” / Then she said, “Here is my maidservant Bilhah. Sleep with her, that she may bear children for me, so that through her I too can build a family.” ..."
        },
        {
          "reference": "Genesis 35:16-18",
          "text": "Later, they set out from Bethel, and while they were still some distance from Ephrath, Rachel began to give birth, and her labor was difficult. / During her severe labor, the midwife said to her, “Do not be afraid, for you are having another son.” / And with her last breath—for she was dying—she named him Ben-oni. But his father called him Benjamin."
        },
        {
          "reference": "Genesis 41:50-52",
          "text": "Before the years of famine arrived, two sons were born to Joseph by Asenath daughter of Potiphera, priest of On. / Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 43:8",
          "text": "And Judah said to his father Israel, “Send the boy with me, and we will go at once, so that we may live and not die—neither we, nor you, nor our children."
        },
        {
          "reference": "Genesis 45:7",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance."
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 47:27",
          "text": "Now the Israelites settled in the land of Egypt, in the region of Goshen. They acquired property there and became fruitful and increased greatly in number."
        }
      ]
    },
    {
      "reference": "Genesis 46:9",
      "book": "Genesis",
      "chapter": 46,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Reuben: Hanok, Pallu, Hezron and Karmi."
        },
        {
          "version": "NLT",
          "text": "The sons of Reuben were Hanoch, Pallu, Hezron, and Carmi."
        },
        {
          "version": "ESV",
          "text": "and the sons of Reuben: Hanoch, Pallu, Hezron, and Carmi."
        },
        {
          "version": "NKJV",
          "text": "The sons of Reuben were Hanoch, Pallu, Hezron, and Carmi."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 6:14-16",
          "text": "These were the heads of their fathers’ houses: The sons of Reuben, the firstborn of Israel, were Hanoch and Pallu, Hezron and Carmi. These were the clans of Reuben. / The sons of Simeon were Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul, the son of a Canaanite woman. These were the clans of Simeon. / These were the names of the sons of Levi according to their records: Gershon, Kohath, and Merari. Levi lived 137 years."
        },
        {
          "reference": "Numbers 26:5-7",
          "text": "Reuben was the firstborn of Israel. These were the descendants of Reuben: The Hanochite clan from Hanoch, the Palluite clan from Pallu, / the Hezronite clan from Hezron, and the Carmite clan from Carmi. / These were the clans of Reuben, and their registration numbered 43,730."
        },
        {
          "reference": "1 Chronicles 5:1-3",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph. / The sons of Reuben, the firstborn of Israel: Hanoch, Pallu, Hezron, and Carmi."
        },
        {
          "reference": "Genesis 29:32",
          "text": "And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.”"
        },
        {
          "reference": "Genesis 35:23",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun."
        },
        {
          "reference": "Genesis 49:3-4",
          "text": "Reuben, you are my firstborn, my might, and the beginning of my strength, excelling in honor, excelling in power. / Uncontrolled as the waters, you will no longer excel, because you went up to your father’s bed, onto my couch, and defiled it."
        },
        {
          "reference": "Deuteronomy 33:6",
          "text": "Let Reuben live and not die, nor his men be few.”"
        },
        {
          "reference": "1 Chronicles 2:1-2",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, / Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."
        },
        {
          "reference": "Genesis 37:21-22",
          "text": "When Reuben heard this, he tried to rescue Joseph from their hands. “Let us not take his life,” he said. / “Do not shed his blood. Throw him into this pit in the wilderness, but do not lay a hand on him.” Reuben said this so that he could rescue Joseph from their hands and return him to his father."
        },
        {
          "reference": "Genesis 42:22",
          "text": "And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 44:18",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself."
        },
        {
          "reference": "Matthew 1:2",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Luke 3:33-34",
          "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah, / the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor,"
        },
        {
          "reference": "Hebrews 7:14",
          "text": "For it is clear that our Lord descended from Judah, a tribe as to which Moses said nothing about priests."
        },
        {
          "reference": "Revelation 7:5",
          "text": "From the tribe of Judah 12,000 were sealed, from the tribe of Reuben 12,000, from the tribe of Gad 12,000,"
        }
      ]
    },
    {
      "reference": "Genesis 46:10",
      "book": "Genesis",
      "chapter": 46,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Simeon: Jemuel, Jamin, Ohad, Jakin, Zohar and Shaul the son of a Canaanite woman."
        },
        {
          "version": "NLT",
          "text": "The sons of Simeon were Jemuel, Jamin, Ohad, Jakin, Zohar, and Shaul. (Shaul’s mother was a Canaanite woman.)"
        },
        {
          "version": "ESV",
          "text": "The sons of Simeon: Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul, the son of a Canaanite woman."
        },
        {
          "version": "NKJV",
          "text": "The sons of Simeon were Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul, the son of a Canaanite woman."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 6:15",
          "text": "The sons of Simeon were Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul, the son of a Canaanite woman. These were the clans of Simeon."
        },
        {
          "reference": "Numbers 26:12-13",
          "text": "These were the descendants of Simeon by their clans: The Nemuelite clan from Nemuel, the Jaminite clan from Jamin, the Jachinite clan from Jachin, / the Zerahite clan from Zerah, and the Shaulite clan from Shaul."
        },
        {
          "reference": "1 Chronicles 4:24",
          "text": "The descendants of Simeon: Nemuel, Jamin, Jarib, Zerah, and Shaul."
        },
        {
          "reference": "Genesis 29:33",
          "text": "Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon."
        },
        {
          "reference": "Genesis 35:23",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun."
        },
        {
          "reference": "Genesis 49:5-7",
          "text": "Simeon and Levi are brothers; their swords are weapons of violence. / May I never enter their council; may I never join their assembly. For they kill men in their anger, and hamstring oxen on a whim. / Cursed be their anger, for it is strong, and their wrath, for it is cruel! I will disperse them in Jacob and scatter them in Israel."
        },
        {
          "reference": "Deuteronomy 33:8-11",
          "text": "Concerning Levi he said: “Give Your Thummim to Levi and Your Urim to Your godly one, whom You tested at Massah and contested at the waters of Meribah. / He said of his father and mother, ‘I do not consider them.’ He disregarded his brothers and did not know his own sons, for he kept Your word and maintained Your covenant. / He will teach Your ordinances to Jacob and Your law to Israel; he will set incense before You and whole burnt offerings on Your altar. ..."
        },
        {
          "reference": "Leviticus 10:1-2",
          "text": "Now Aaron’s sons Nadab and Abihu took their censers, put fire in them and added incense, and offered unauthorized fire before the LORD, contrary to His command. / So fire came out from the presence of the LORD and consumed them, and they died in the presence of the LORD."
        },
        {
          "reference": "1 Chronicles 6:1-2",
          "text": "The sons of Levi: Gershon, Kohath, and Merari. / The sons of Kohath: Amram, Izhar, Hebron, and Uzziel."
        },
        {
          "reference": "1 Chronicles 6:16-17",
          "text": "The sons of Levi: Gershom, Kohath, and Merari. / These are the names of the sons of Gershom: Libni and Shimei."
        },
        {
          "reference": "1 Chronicles 6:19",
          "text": "The sons of Merari: Mahli and Mushi. These are the clans of the Levites listed according to their fathers:"
        },
        {
          "reference": "1 Chronicles 6:28",
          "text": "The sons of Samuel: Joel his firstborn and Abijah his second son."
        },
        {
          "reference": "1 Chronicles 6:33",
          "text": "These are the men who served, together with their sons. From the Kohathites: Heman the singer, the son of Joel, the son of Samuel,"
        },
        {
          "reference": "1 Chronicles 6:44-47",
          "text": "On the left were their kinsmen, the sons of Merari: Ethan the son of Kishi, the son of Abdi, the son of Malluch, / the son of Hashabiah, the son of Amaziah, the son of Hilkiah, / the son of Amzi, the son of Bani, the son of Shemer, ..."
        },
        {
          "reference": "1 Chronicles 6:48-49",
          "text": "Their fellow Levites were assigned to every kind of service of the tabernacle, the house of God. / But Aaron and his sons did all the work of the Most Holy Place. They presented the offerings on the altar of burnt offering and on the altar of incense to make atonement for Israel, according to all that Moses the servant of God had commanded."
        }
      ]
    },
    {
      "reference": "Genesis 46:11",
      "book": "Genesis",
      "chapter": 46,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Levi: Gershon, Kohath and Merari."
        },
        {
          "version": "NLT",
          "text": "The sons of Levi were Gershon, Kohath, and Merari."
        },
        {
          "version": "ESV",
          "text": "The sons of Levi: Gershon, Kohath, and Merari."
        },
        {
          "version": "NKJV",
          "text": "The sons of Levi were Gershon, Kohath, and Merari."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 6:16-20",
          "text": "These were the names of the sons of Levi according to their records: Gershon, Kohath, and Merari. Levi lived 137 years. / The sons of Gershon were Libni and Shimei, by their clans. / The sons of Kohath were Amram, Izhar, Hebron, and Uzziel. Kohath lived 133 years. ..."
        },
        {
          "reference": "Numbers 3:17-20",
          "text": "These were the sons of Levi by name: Gershon, Kohath, and Merari. / These were the names of the sons of Gershon by their clans: Libni and Shimei. / The sons of Kohath by their clans were Amram, Izhar, Hebron, and Uzziel. ..."
        },
        {
          "reference": "1 Chronicles 6:1-3",
          "text": "The sons of Levi: Gershon, Kohath, and Merari. / The sons of Kohath: Amram, Izhar, Hebron, and Uzziel. / The children of Amram: Aaron, Moses, and Miriam. The sons of Aaron: Nadab, Abihu, Eleazar, and Ithamar."
        },
        {
          "reference": "1 Chronicles 23:6-13",
          "text": "Then David divided the Levites into divisions according to the sons of Levi: Gershom, Kohath, and Merari. / The Gershonites: Ladan and Shimei. / The sons of Ladan: Jehiel the first, Zetham, and Joel—three in all. ..."
        },
        {
          "reference": "Exodus 2:1-2",
          "text": "Now a man of the house of Levi married a Levite woman, / and she conceived and gave birth to a son. When she saw that he was a beautiful child, she hid him for three months."
        },
        {
          "reference": "Numbers 26:57-59",
          "text": "Now these were the Levites numbered by their clans: The Gershonite clan from Gershon, the Kohathite clan from Kohath, and the Merarite clan from Merari. / These were the families of the Levites: The Libnite clan, the Hebronite clan, the Mahlite clan, the Mushite clan, and the Korahite clan. Now Kohath was the father of Amram, / and Amram’s wife was named Jochebed. She was also a daughter of Levi, born to Levi in Egypt. To Amram she bore Aaron, Moses, and their sister Miriam."
        },
        {
          "reference": "1 Chronicles 6:16-19",
          "text": "The sons of Levi: Gershom, Kohath, and Merari. / These are the names of the sons of Gershom: Libni and Shimei. / The sons of Kohath: Amram, Izhar, Hebron, and Uzziel. ..."
        },
        {
          "reference": "1 Chronicles 23:12-13",
          "text": "The sons of Kohath: Amram, Izhar, Hebron, and Uzziel—four in all. / The sons of Amram: Aaron and Moses. Aaron and his descendants were set apart forever to consecrate the most holy things, to burn incense before the LORD, to minister before Him, and to pronounce blessings in His name forever."
        },
        {
          "reference": "Exodus 32:26-29",
          "text": "So Moses stood at the entrance to the camp and said, “Whoever is for the LORD, come to me.” And all the Levites gathered around him. / He told them, “This is what the LORD, the God of Israel, says: ‘Each of you men is to fasten his sword to his side, go back and forth through the camp from gate to gate, and slay his brother, his friend, and his neighbor.’” / The Levites did as Moses commanded, and that day about three thousand of the people fell dead. ..."
        },
        {
          "reference": "Deuteronomy 33:8-11",
          "text": "Concerning Levi he said: “Give Your Thummim to Levi and Your Urim to Your godly one, whom You tested at Massah and contested at the waters of Meribah. / He said of his father and mother, ‘I do not consider them.’ He disregarded his brothers and did not know his own sons, for he kept Your word and maintained Your covenant. / He will teach Your ordinances to Jacob and Your law to Israel; he will set incense before You and whole burnt offerings on Your altar. ..."
        },
        {
          "reference": "Hebrews 7:5",
          "text": "Now the law commands the sons of Levi who become priests to collect a tenth from the people—that is, from their brothers—though they too are descended from Abraham."
        },
        {
          "reference": "Hebrews 7:11",
          "text": "Now if perfection could have been attained through the Levitical priesthood (for on this basis the people received the law), why was there still need for another priest to appear—one in the order of Melchizedek and not in the order of Aaron?"
        },
        {
          "reference": "Hebrews 7:14",
          "text": "For it is clear that our Lord descended from Judah, a tribe as to which Moses said nothing about priests."
        },
        {
          "reference": "Hebrews 7:27",
          "text": "Unlike the other high priests, He does not need to offer daily sacrifices, first for His own sins and then for the sins of the people; He sacrificed for sin once for all when He offered up Himself."
        },
        {
          "reference": "Hebrews 8:4",
          "text": "Now if He were on earth, He would not be a priest, since there are already priests who offer gifts according to the law."
        }
      ]
    },
    {
      "reference": "Genesis 46:12",
      "book": "Genesis",
      "chapter": 46,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Judah: Er, Onan, Shelah, Perez and Zerah (but Er and Onan had died in the land of Canaan). The sons of Perez: Hezron and Hamul."
        },
        {
          "version": "NLT",
          "text": "The sons of Judah were Er, Onan, Shelah, Perez, and Zerah (though Er and Onan had died in the land of Canaan). The sons of Perez were Hezron and Hamul."
        },
        {
          "version": "ESV",
          "text": "The sons of Judah: Er, Onan, Shelah, Perez, and Zerah (but Er and Onan died in the land of Canaan); and the sons of Perez were Hezron and Hamul."
        },
        {
          "version": "NKJV",
          "text": "The sons of Judah were Er, Onan, Shelah, Perez, and Zerah (but Er and Onan died in the land of Canaan). The sons of Perez were Hezron and Hamul."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Ruth 4:18-22",
          "text": "Now these are the generations of Perez: Perez was the father of Hezron, / Hezron was the father of Ram, Ram was the father of Amminadab, / Amminadab was the father of Nahshon, Nahshon was the father of Salmon, ..."
        },
        {
          "reference": "1 Chronicles 2:3-15",
          "text": "The sons of Judah: Er, Onan, and Shelah. These three were born to him by Bath-shua the Canaanite. Er, Judah’s firstborn, was wicked in the sight of the LORD. So the LORD put him to death. / Tamar, Judah’s daughter-in-law, bore to him Perez and Zerah. Judah had five sons in all. / The sons of Perez: Hezron and Hamul. ..."
        },
        {
          "reference": "Matthew 1:2-3",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers. / Judah was the father of Perez and Zerah by Tamar, Perez the father of Hezron, and Hezron the father of Ram."
        },
        {
          "reference": "Numbers 26:19-22",
          "text": "The sons of Judah were Er and Onan, but they died in the land of Canaan. / These were the descendants of Judah by their clans: The Shelanite clan from Shelah, the Perezite clan from Perez, and the Zerahite clan from Zerah. / And these were the descendants of Perez: the Hezronite clan from Hezron and the Hamulite clan from Hamul. ..."
        },
        {
          "reference": "1 Chronicles 4:21-23",
          "text": "The sons of Shelah son of Judah: Er the father of Lecah, Laadah the father of Mareshah and the clans of the linen workers at Beth-ashbea, / Jokim, the men of Cozeba, and Joash and Saraph, who ruled in Moab and Jashubi-lehem. (These names are from ancient records.) / These were the potters who lived at Netaim and Gederah. They lived there in the service of the king."
        },
        {
          "reference": "Luke 3:33",
          "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah,"
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Genesis 38:6-30",
          "text": "Now Judah acquired a wife for Er, his firstborn, and her name was Tamar. / But Er, Judah’s firstborn, was wicked in the sight of the LORD; so the LORD put him to death. / Then Judah said to Onan, “Sleep with your brother’s wife. Perform your duty as her brother-in-law and raise up offspring for your brother.” ..."
        },
        {
          "reference": "Deuteronomy 25:5-10",
          "text": "When brothers dwell together and one of them dies without a son, the widow must not marry outside the family. Her husband’s brother is to take her as his wife and fulfill the duty of a brother-in-law for her. / The first son she bears will carry on the name of the dead brother, so that his name will not be blotted out from Israel. / But if the man does not want to marry his brother’s widow, she is to go to the elders at the city gate and say, “My husband’s brother refuses to preserve his brother’s name in Israel. He is not willing to perform the duty of a brother-in-law for me.” ..."
        },
        {
          "reference": "1 Samuel 17:12",
          "text": "Now David was the son of a man named Jesse, an Ephrathite from Bethlehem of Judah who had eight sons. And in the days of Saul, Jesse was old and well along in years."
        },
        {
          "reference": "1 Chronicles 9:4",
          "text": "Uthai son of Ammihud, the son of Omri, the son of Imri, the son of Bani, a descendant of Perez son of Judah."
        },
        {
          "reference": "1 Chronicles 27:18",
          "text": "over Judah was Elihu, one of David’s brothers; over Issachar was Omri son of Michael;"
        },
        {
          "reference": "1 Chronicles 2:9-10",
          "text": "The sons who were born to Hezron: Jerahmeel, Ram, and Caleb. / Ram was the father of Amminadab, and Amminadab was the father of Nahshon, a leader of the descendants of Judah."
        },
        {
          "reference": "1 Chronicles 2:18-20",
          "text": "Caleb son of Hezron had children by his wife Azubah and by Jerioth. These were the sons of Azubah: Jesher, Shobab, and Ardon. / When Azubah died, Caleb married Ephrath, who bore to him Hur. / Hur was the father of Uri, and Uri was the father of Bezalel."
        },
        {
          "reference": "1 Chronicles 2:50-55",
          "text": "These were the descendants of Caleb. The sons of Hur the firstborn of Ephrathah: Shobal the father of Kiriath-jearim, / Salma the father of Bethlehem, and Hareph the father of Beth-gader. / These were the descendants of Shobal the father of Kiriath-jearim: Haroeh, half the Manahathites, ..."
        }
      ]
    },
    {
      "reference": "Genesis 46:13",
      "book": "Genesis",
      "chapter": 46,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Issachar: Tola, Puah, Jashub and Shimron."
        },
        {
          "version": "NLT",
          "text": "The sons of Issachar were Tola, Puah, Jashub, and Shimron."
        },
        {
          "version": "ESV",
          "text": "The sons of Issachar: Tola, Puvah, Yob, and Shimron."
        },
        {
          "version": "NKJV",
          "text": "The sons of Issachar were Tola, Puvah, Job, and Shimron."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Numbers 26:23-24",
          "text": "These were the descendants of Issachar by their clans: The Tolaite clan from Tola, the Punite clan from Puvah, / the Jashubite clan from Jashub, and the Shimronite clan from Shimron."
        },
        {
          "reference": "1 Chronicles 7:1",
          "text": "The sons of Issachar: Tola, Puah, Jashub, and Shimron—four in all."
        },
        {
          "reference": "1 Chronicles 7:14-15",
          "text": "The descendants of Manasseh: Asriel through his Aramean concubine. She also gave birth to Machir the father of Gilead. / Machir took a wife from among the Huppites and Shuppites. The name of his sister was Maacah. Another descendant was named Zelophehad, who had only daughters."
        },
        {
          "reference": "1 Chronicles 7:20-23",
          "text": "The descendants of Ephraim: Shuthelah, Bered his son, Tahath his son, Eleadah his son, Tahath his son, / Zabad his son, and Shuthelah his son. Ezer and Elead were killed by the natives of Gath, because they went down to steal their livestock. / Their father Ephraim mourned for many days, and his relatives came to comfort him. ..."
        },
        {
          "reference": "1 Chronicles 7:30-31",
          "text": "The children of Asher: Imnah, Ishvah, Ishvi, Beriah, and their sister Serah. / The sons of Beriah: Heber, as well as Malchiel, who was the father of Birzaith."
        },
        {
          "reference": "1 Chronicles 7:35-36",
          "text": "The sons of his brother Helem: Zophah, Imna, Shelesh, and Amal. / The sons of Zophah: Suah, Harnepher, Shual, Beri, Imrah,"
        },
        {
          "reference": "1 Chronicles 7:40",
          "text": "All these were the descendants of Asher—heads of their families, choice and mighty men of valor, and chiefs among the leaders. The number of men fit for battle, recorded in their genealogies, was 26,000."
        },
        {
          "reference": "1 Chronicles 8:1-2",
          "text": "Benjamin was the father of Bela his firstborn, Ashbel the second, Aharah the third, / Nohah the fourth, and Rapha the fifth."
        },
        {
          "reference": "1 Chronicles 8:6-7",
          "text": "These were the descendants of Ehud who were the heads of the families living in Geba and were exiled to Manahath: / Naaman, Ahijah, and Gera, who carried them into exile and who was the father of Uzza and Ahihud."
        },
        {
          "reference": "1 Chronicles 8:13-14",
          "text": "and Beriah and Shema (who were the heads of families living in Aijalon and who drove out the inhabitants of Gath). / Ahio, Shashak, Jeremoth,"
        },
        {
          "reference": "1 Chronicles 8:28-29",
          "text": "All these were heads of families, the chiefs according to their genealogies, and they lived in Jerusalem. / Jeiel the father of Gibeon lived in Gibeon. His wife’s name was Maacah,"
        },
        {
          "reference": "1 Chronicles 8:32-33",
          "text": "and Mikloth, who was the father of Shimeah. They too lived alongside their relatives in Jerusalem. / Ner was the father of Kish, Kish was the father of Saul, and Saul was the father of Jonathan, Malchishua, Abinadab, and Esh-baal."
        },
        {
          "reference": "1 Chronicles 8:38-39",
          "text": "Azel had six sons, and these were their names: Azrikam, Bocheru, Ishmael, Sheariah, Obadiah, and Hanan. All these were the sons of Azel. / The sons of his brother Eshek: Ulam was his firstborn, Jeush second, and Eliphelet third."
        },
        {
          "reference": "1 Chronicles 8:40",
          "text": "The sons of Ulam were mighty men of valor, archers, and they had many sons and grandsons—150 in all. All these were the descendants of Benjamin."
        },
        {
          "reference": "1 Chronicles 9:1-2",
          "text": "So all Israel was recorded in the genealogies written in the Book of the Kings of Israel. But Judah was exiled to Babylon because of their unfaithfulness. / Now the first to resettle their own property in their cities were Israelites, priests, Levites, and temple servants."
        }
      ]
    },
    {
      "reference": "Genesis 46:14",
      "book": "Genesis",
      "chapter": 46,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Zebulun: Sered, Elon and Jahleel."
        },
        {
          "version": "NLT",
          "text": "The sons of Zebulun were Sered, Elon, and Jahleel."
        },
        {
          "version": "ESV",
          "text": "The sons of Zebulun: Sered, Elon, and Jahleel."
        },
        {
          "version": "NKJV",
          "text": "The sons of Zebulun were Sered, Elon, and Jahleel."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Numbers 26:23-24",
          "text": "These were the descendants of Issachar by their clans: The Tolaite clan from Tola, the Punite clan from Puvah, / the Jashubite clan from Jashub, and the Shimronite clan from Shimron."
        },
        {
          "reference": "1 Chronicles 7:30-31",
          "text": "The children of Asher: Imnah, Ishvah, Ishvi, Beriah, and their sister Serah. / The sons of Beriah: Heber, as well as Malchiel, who was the father of Birzaith."
        },
        {
          "reference": "Genesis 30:9-13",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife. / And Leah’s servant Zilpah bore Jacob a son. / Then Leah said, “How fortunate!” So she named him Gad. ..."
        },
        {
          "reference": "Genesis 35:26",
          "text": "And the sons of Leah’s maidservant Zilpah were Gad and Asher. These are the sons of Jacob, who were born to him in Paddan-aram."
        },
        {
          "reference": "Genesis 49:13",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon."
        },
        {
          "reference": "Deuteronomy 33:18-19",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents. / They will call the peoples to a mountain; there they will offer sacrifices of righteousness. For they will feast on the abundance of the seas and the hidden treasures of the sand.”"
        },
        {
          "reference": "Joshua 19:10-16",
          "text": "The third lot came up for the clans of the tribe of Zebulun: The border of their inheritance stretched as far as Sarid. / It went up westward to Maralah, reached Dabbesheth, and met the brook east of Jokneam. / From Sarid it turned eastward along the border of Chisloth-tabor and went on to Daberath and up to Japhia. ..."
        },
        {
          "reference": "Judges 5:17",
          "text": "Gilead remained beyond the Jordan. Dan, why did you linger by the ships? Asher stayed at the coast and remained in his harbors."
        },
        {
          "reference": "1 Kings 4:15",
          "text": "Ahimaaz in Naphtali (he had married Basemath, a daughter of Solomon);"
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-15",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles—"
        },
        {
          "reference": "Mark 3:18",
          "text": "Andrew, Philip, Bartholomew, Matthew, Thomas, James son of Alphaeus, Thaddaeus, Simon the Zealot,"
        },
        {
          "reference": "Luke 6:15",
          "text": "Matthew and Thomas; James son of Alphaeus and Simon called the Zealot;"
        },
        {
          "reference": "John 1:44-45",
          "text": "Now Philip was from Bethsaida, the same town as Andrew and Peter. / Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.”"
        },
        {
          "reference": "John 6:71",
          "text": "He was speaking about Judas, the son of Simon Iscariot. For although Judas was one of the Twelve, he was later to betray Jesus."
        }
      ]
    },
    {
      "reference": "Genesis 46:15",
      "book": "Genesis",
      "chapter": 46,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the sons Leah bore to Jacob in Paddan Aram, besides his daughter Dinah. These sons and daughters of his were thirty-three in all."
        },
        {
          "version": "NLT",
          "text": "These were the sons of Leah and Jacob who were born in Paddan-aram, in addition to their daughter, Dinah. The number of Jacob’s descendants (male and female) through Leah was thirty-three."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Leah, whom she bore to Jacob in Paddan-aram, together with his daughter Dinah; altogether his sons and his daughters numbered thirty-three."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Leah, whom she bore to Jacob in Padan Aram, with his daughter Dinah. All the persons, his sons and his daughters, were thirty-three."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:32-35",
          "text": "And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.” / Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon. / Once again Leah conceived and gave birth to a son, and she said, “Now at last my husband will become attached to me, because I have borne him three sons.” So he was named Levi. ..."
        },
        {
          "reference": "Genesis 30:17-24",
          "text": "And God listened to Leah, and she conceived and bore a fifth son to Jacob. / Then Leah said, “God has rewarded me for giving my maidservant to my husband.” So she named him Issachar. / Again Leah conceived and bore a sixth son to Jacob. ..."
        },
        {
          "reference": "Genesis 35:23-26",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. / The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. ..."
        },
        {
          "reference": "Genesis 41:50-52",
          "text": "Before the years of famine arrived, two sons were born to Joseph by Asenath daughter of Potiphera, priest of On. / Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 48:5-6",
          "text": "And now your two sons born to you in Egypt before I came to you here shall be reckoned as mine; Ephraim and Manasseh shall be mine, just as Reuben and Simeon are mine. / Any children born to you after them shall be yours, and they shall be called by the names of their brothers in the territory they inherit."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Numbers 26:19-22",
          "text": "The sons of Judah were Er and Onan, but they died in the land of Canaan. / These were the descendants of Judah by their clans: The Shelanite clan from Shelah, the Perezite clan from Perez, and the Zerahite clan from Zerah. / And these were the descendants of Perez: the Hezronite clan from Hezron and the Hamulite clan from Hamul. ..."
        },
        {
          "reference": "Numbers 26:28-34",
          "text": "The descendants of Joseph included the clans of Manasseh and Ephraim. / These were the descendants of Manasseh: The Machirite clan from Machir, the father of Gilead, and the Gileadite clan from Gilead. / These were the descendants of Gilead: the Iezerite clan from Iezer, the Helekite clan from Helek, ..."
        },
        {
          "reference": "Deuteronomy 10:22",
          "text": "Your fathers went down to Egypt, seventy in all, and now the LORD your God has made you as numerous as the stars in the sky."
        },
        {
          "reference": "1 Chronicles 2:1-2",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, / Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Acts 7:14",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Matthew 1:2-3",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers. / Judah was the father of Perez and Zerah by Tamar, Perez the father of Hezron, and Hezron the father of Ram."
        },
        {
          "reference": "Luke 3:33-34",
          "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah, / the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor,"
        },
        {
          "reference": "Romans 9:4-5",
          "text": "the people of Israel. Theirs is the adoption as sons; theirs the divine glory and the covenants; theirs the giving of the law, the temple worship, and the promises. / Theirs are the patriarchs, and from them proceeds the human descent of Christ, who is God over all, forever worthy of praise! Amen."
        }
      ]
    },
    {
      "reference": "Genesis 46:16",
      "book": "Genesis",
      "chapter": 46,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Gad: Zephon, Haggi, Shuni, Ezbon, Eri, Arodi and Areli."
        },
        {
          "version": "NLT",
          "text": "The sons of Gad were Zephon, Haggi, Shuni, Ezbon, Eri, Arodi, and Areli."
        },
        {
          "version": "ESV",
          "text": "The sons of Gad: Ziphion, Haggi, Shuni, Ezbon, Eri, Arodi, and Areli."
        },
        {
          "version": "NKJV",
          "text": "The sons of Gad were Ziphion, Haggi, Shuni, Ezbon, Eri, Arodi, and Areli."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Numbers 26:15-18",
          "text": "These were the descendants of Gad by their clans: The Zephonite clan from Zephon, the Haggite clan from Haggi, the Shunite clan from Shuni, / the Oznite clan from Ozni, the Erite clan from Eri, / the Arodite clan from Arod, and the Arelite clan from Areli. ..."
        },
        {
          "reference": "1 Chronicles 7:12",
          "text": "The Shuppites and Huppites were descendants of Ir, and the Hushites were descendants of Aher."
        },
        {
          "reference": "1 Chronicles 7:14-15",
          "text": "The descendants of Manasseh: Asriel through his Aramean concubine. She also gave birth to Machir the father of Gilead. / Machir took a wife from among the Huppites and Shuppites. The name of his sister was Maacah. Another descendant was named Zelophehad, who had only daughters."
        },
        {
          "reference": "Genesis 49:13",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon."
        },
        {
          "reference": "Deuteronomy 33:18-19",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents. / They will call the peoples to a mountain; there they will offer sacrifices of righteousness. For they will feast on the abundance of the seas and the hidden treasures of the sand.”"
        },
        {
          "reference": "Joshua 19:10-16",
          "text": "The third lot came up for the clans of the tribe of Zebulun: The border of their inheritance stretched as far as Sarid. / It went up westward to Maralah, reached Dabbesheth, and met the brook east of Jokneam. / From Sarid it turned eastward along the border of Chisloth-tabor and went on to Daberath and up to Japhia. ..."
        },
        {
          "reference": "Judges 5:17",
          "text": "Gilead remained beyond the Jordan. Dan, why did you linger by the ships? Asher stayed at the coast and remained in his harbors."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-15",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles—"
        },
        {
          "reference": "Ezekiel 48:1-2",
          "text": "“Now these are the names of the tribes: At the northern frontier, Dan will have one portion bordering the road of Hethlon to Lebo-hamath and running on to Hazar-enan on the border of Damascus with Hamath to the north, and extending from the east side to the west side. / Asher will have one portion bordering the territory of Dan from east to west."
        },
        {
          "reference": "Revelation 7:5",
          "text": "From the tribe of Judah 12,000 were sealed, from the tribe of Reuben 12,000, from the tribe of Gad 12,000,"
        },
        {
          "reference": "Genesis 30:9-11",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife. / And Leah’s servant Zilpah bore Jacob a son. / Then Leah said, “How fortunate!” So she named him Gad."
        },
        {
          "reference": "Genesis 35:26",
          "text": "And the sons of Leah’s maidservant Zilpah were Gad and Asher. These are the sons of Jacob, who were born to him in Paddan-aram."
        },
        {
          "reference": "Genesis 37:2",
          "text": "This is the account of Jacob. When Joseph was seventeen years old, he was tending the flock with his brothers, the sons of his father’s wives Bilhah and Zilpah, and he brought their father a bad report about them."
        },
        {
          "reference": "Genesis 42:24",
          "text": "And he turned away from them and wept. When he turned back and spoke to them, he took Simeon from them and had him bound before their eyes."
        }
      ]
    },
    {
      "reference": "Genesis 46:17",
      "book": "Genesis",
      "chapter": 46,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Asher: Imnah, Ishvah, Ishvi and Beriah. Their sister was Serah. The sons of Beriah: Heber and Malkiel."
        },
        {
          "version": "NLT",
          "text": "The sons of Asher were Imnah, Ishvah, Ishvi, and Beriah. Their sister was Serah. Beriah’s sons were Heber and Malkiel."
        },
        {
          "version": "ESV",
          "text": "The sons of Asher: Imnah, Ishvah, Ishvi, Beriah, with Serah their sister. And the sons of Beriah: Heber and Malchiel."
        },
        {
          "version": "NKJV",
          "text": "The sons of Asher were Jimnah, Ishuah, Isui, Beriah, and Serah, their sister. And the sons of Beriah were Heber and Malchiel."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Numbers 26:46",
          "text": "And the name of Asher’s daughter was Serah."
        },
        {
          "reference": "1 Chronicles 7:30-31",
          "text": "The children of Asher: Imnah, Ishvah, Ishvi, Beriah, and their sister Serah. / The sons of Beriah: Heber, as well as Malchiel, who was the father of Birzaith."
        },
        {
          "reference": "Genesis 30:5-13",
          "text": "and Bilhah conceived and bore him a son. / Then Rachel said, “God has vindicated me; He has heard my plea and given me a son.” So she named him Dan. / And Rachel’s servant Bilhah conceived again and bore Jacob a second son. ..."
        },
        {
          "reference": "Genesis 35:25-26",
          "text": "The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. / And the sons of Leah’s maidservant Zilpah were Gad and Asher. These are the sons of Jacob, who were born to him in Paddan-aram."
        },
        {
          "reference": "Genesis 49:21",
          "text": "Naphtali is a doe set free that bears beautiful fawns."
        },
        {
          "reference": "Deuteronomy 33:23",
          "text": "Concerning Naphtali he said: “Naphtali is abounding with favor, full of the blessing of the LORD; he shall take possession of the sea and the south.”"
        },
        {
          "reference": "Joshua 19:32-39",
          "text": "The sixth lot came out for the clans of the tribe of Naphtali: / Their border started at Heleph and the great tree of Zaanannim, passing Adami-nekeb and Jabneel as far as Lakkum and ending at the Jordan. / Then the border turned westward to Aznoth-tabor and ran from there to Hukkok, touching Zebulun on the south side, Asher on the west, and Judah at the Jordan on the east. ..."
        },
        {
          "reference": "Judges 4:6",
          "text": "She summoned Barak son of Abinoam from Kedesh in Naphtali and said to him, “Surely the LORD, the God of Israel, is commanding you: ‘Go and march to Mount Tabor, taking with you ten thousand men of Naphtali and Zebulun."
        },
        {
          "reference": "Judges 5:18",
          "text": "Zebulun was a people who risked their lives; Naphtali, too, on the heights of the battlefield."
        },
        {
          "reference": "1 Kings 7:14",
          "text": "He was the son of a widow from the tribe of Naphtali, and his father was a man of Tyre, a craftsman in bronze. Huram had great skill, understanding, and knowledge for every kind of bronze work. So he came to King Solomon and carried out all his work."
        },
        {
          "reference": "2 Kings 15:29",
          "text": "In the days of Pekah king of Israel, Tiglath-pileser king of Assyria came and captured Ijon, Abel-beth-maacah, Janoah, Kedesh, Hazor, Gilead, and Galilee, including all the land of Naphtali, and he took the people as captives to Assyria."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-15",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles—"
        },
        {
          "reference": "Luke 2:36",
          "text": "There was also a prophetess named Anna, the daughter of Phanuel, of the tribe of Asher, who was well along in years. She had been married for seven years,"
        },
        {
          "reference": "John 1:45-46",
          "text": "Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.” / “Can anything good come from Nazareth?” Nathanael asked. “Come and see,” said Philip."
        }
      ]
    },
    {
      "reference": "Genesis 46:18",
      "book": "Genesis",
      "chapter": 46,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the children born to Jacob by Zilpah, whom Laban had given to his daughter Leah—sixteen in all."
        },
        {
          "version": "NLT",
          "text": "These were the sons of Zilpah, the servant given to Leah by her father, Laban. The number of Jacob’s descendants through Zilpah was sixteen."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Zilpah, whom Laban gave to Leah his daughter; and these she bore to Jacob—sixteen persons."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Zilpah, whom Laban gave to Leah his daughter; and these she bore to Jacob: sixteen persons."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Numbers 26:12-14",
          "text": "These were the descendants of Simeon by their clans: The Nemuelite clan from Nemuel, the Jaminite clan from Jamin, the Jachinite clan from Jachin, / the Zerahite clan from Zerah, and the Shaulite clan from Shaul. / These were the clans of Simeon, and there were 22,200 men."
        },
        {
          "reference": "1 Chronicles 7:30-31",
          "text": "The children of Asher: Imnah, Ishvah, Ishvi, Beriah, and their sister Serah. / The sons of Beriah: Heber, as well as Malchiel, who was the father of Birzaith."
        },
        {
          "reference": "Deuteronomy 10:22",
          "text": "Your fathers went down to Egypt, seventy in all, and now the LORD your God has made you as numerous as the stars in the sky."
        },
        {
          "reference": "Exodus 6:15",
          "text": "The sons of Simeon were Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul, the son of a Canaanite woman. These were the clans of Simeon."
        },
        {
          "reference": "Numbers 1:23",
          "text": "those registered to the tribe of Simeon numbered 59,300."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Acts 7:14",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Genesis 35:23-26",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. / The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. ..."
        },
        {
          "reference": "Genesis 29:24",
          "text": "And Laban gave his servant girl Zilpah to his daughter Leah as her maidservant."
        },
        {
          "reference": "Genesis 30:9-13",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife. / And Leah’s servant Zilpah bore Jacob a son. / Then Leah said, “How fortunate!” So she named him Gad. ..."
        },
        {
          "reference": "Genesis 35:25-26",
          "text": "The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. / And the sons of Leah’s maidservant Zilpah were Gad and Asher. These are the sons of Jacob, who were born to him in Paddan-aram."
        },
        {
          "reference": "Genesis 37:2",
          "text": "This is the account of Jacob. When Joseph was seventeen years old, he was tending the flock with his brothers, the sons of his father’s wives Bilhah and Zilpah, and he brought their father a bad report about them."
        },
        {
          "reference": "Genesis 41:50-52",
          "text": "Before the years of famine arrived, two sons were born to Joseph by Asenath daughter of Potiphera, priest of On. / Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        }
      ]
    },
    {
      "reference": "Genesis 46:19",
      "book": "Genesis",
      "chapter": 46,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Jacob’s wife Rachel: Joseph and Benjamin."
        },
        {
          "version": "NLT",
          "text": "The sons of Jacob’s wife Rachel were Joseph and Benjamin."
        },
        {
          "version": "ESV",
          "text": "The sons of Rachel, Jacob’s wife: Joseph and Benjamin."
        },
        {
          "version": "NKJV",
          "text": "The sons of Rachel, Jacob’s wife, were Joseph and Benjamin."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 35:24",
          "text": "The sons of Rachel were Joseph and Benjamin."
        },
        {
          "reference": "Genesis 30:22-24",
          "text": "Then God remembered Rachel. He listened to her and opened her womb, / and she conceived and gave birth to a son. “God has taken away my shame,” she said. / She named him Joseph, and said, “May the LORD add to me another son.”"
        },
        {
          "reference": "Genesis 37:3",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors."
        },
        {
          "reference": "Genesis 41:50-52",
          "text": "Before the years of famine arrived, two sons were born to Joseph by Asenath daughter of Potiphera, priest of On. / Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 48:1-2",
          "text": "Some time later Joseph was told, “Your father is ill.” So he set out with his two sons, Manasseh and Ephraim. / When Jacob was told, “Your son Joseph has come to you,” Israel rallied his strength and sat up in bed."
        },
        {
          "reference": "Genesis 48:5",
          "text": "And now your two sons born to you in Egypt before I came to you here shall be reckoned as mine; Ephraim and Manasseh shall be mine, just as Reuben and Simeon are mine."
        },
        {
          "reference": "Genesis 48:13-14",
          "text": "And Joseph took both of them—with Ephraim in his right hand toward Israel’s left hand, and Manasseh in his left hand toward Israel’s right hand—and brought them close to him. / But Israel stretched out his right hand and put it on the head of Ephraim, the younger; and crossing his hands, he put his left on Manasseh’s head, although Manasseh was the firstborn."
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "1 Chronicles 2:1-2",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, / Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Deuteronomy 33:13-17",
          "text": "Concerning Joseph he said: “May his land be blessed by the LORD with the precious dew from heaven above and the deep waters that lie beneath, / with the bountiful harvest from the sun and the abundant yield of the seasons, / with the best of the ancient mountains and the bounty of the everlasting hills, ..."
        },
        {
          "reference": "Joshua 14:4",
          "text": "The descendants of Joseph became two tribes, Manasseh and Ephraim. And no portion of the land was given to the Levites, except for cities in which to live, along with pasturelands for their flocks and herds."
        },
        {
          "reference": "1 Kings 11:28",
          "text": "Now Jeroboam was a mighty man of valor. So when Solomon noticed that the young man was industrious, he put him in charge of the whole labor force of the house of Joseph."
        },
        {
          "reference": "Psalm 105:17-22",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right. ..."
        }
      ]
    },
    {
      "reference": "Genesis 46:20",
      "book": "Genesis",
      "chapter": 46,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "In Egypt, Manasseh and Ephraim were born to Joseph by Asenath daughter of Potiphera, priest of On."
        },
        {
          "version": "NLT",
          "text": "Joseph’s sons, born in the land of Egypt, were Manasseh and Ephraim. Their mother was Asenath, daughter of Potiphera, the priest of On."
        },
        {
          "version": "ESV",
          "text": "And to Joseph in the land of Egypt were born Manasseh and Ephraim, whom Asenath, the daughter of Potiphera the priest of On, bore to him."
        },
        {
          "version": "NKJV",
          "text": "And to Joseph in the land of Egypt were born Manasseh and Ephraim, whom Asenath, the daughter of Poti-Pherah priest of On, bore to him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:50-52",
          "text": "Before the years of famine arrived, two sons were born to Joseph by Asenath daughter of Potiphera, priest of On. / Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 48:5-6",
          "text": "And now your two sons born to you in Egypt before I came to you here shall be reckoned as mine; Ephraim and Manasseh shall be mine, just as Reuben and Simeon are mine. / Any children born to you after them shall be yours, and they shall be called by the names of their brothers in the territory they inherit."
        },
        {
          "reference": "Genesis 41:45",
          "text": "Pharaoh gave Joseph the name Zaphenath-paneah, and he gave him Asenath daughter of Potiphera, priest of On, to be his wife. And Joseph took charge of all the land of Egypt."
        },
        {
          "reference": "Genesis 50:23",
          "text": "He saw Ephraim’s sons to the third generation, and indeed the sons of Machir son of Manasseh were brought up on Joseph’s knees."
        },
        {
          "reference": "1 Chronicles 7:14-29",
          "text": "The descendants of Manasseh: Asriel through his Aramean concubine. She also gave birth to Machir the father of Gilead. / Machir took a wife from among the Huppites and Shuppites. The name of his sister was Maacah. Another descendant was named Zelophehad, who had only daughters. / Machir’s wife Maacah gave birth to a son, and she named him Peresh. His brother was named Sheresh, and his sons were Ulam and Rekem. ..."
        },
        {
          "reference": "Numbers 26:28-37",
          "text": "The descendants of Joseph included the clans of Manasseh and Ephraim. / These were the descendants of Manasseh: The Machirite clan from Machir, the father of Gilead, and the Gileadite clan from Gilead. / These were the descendants of Gilead: the Iezerite clan from Iezer, the Helekite clan from Helek, ..."
        },
        {
          "reference": "Joshua 16:1-4",
          "text": "The allotment for the descendants of Joseph extended from the Jordan at Jericho to the waters of Jericho on the east, through the wilderness that goes up from Jericho into the hill country of Bethel. / It went on from Bethel (that is, Luz) and proceeded to the border of the Archites in Ataroth. / Then it descended westward to the border of the Japhletites as far as the border of Lower Beth-horon and on to Gezer, and it ended at the Sea. ..."
        },
        {
          "reference": "Joshua 17:1-2",
          "text": "Now this was the allotment for the tribe of Manasseh as Joseph’s firstborn son, namely for Machir the firstborn of Manasseh and father of the Gileadites, who had received Gilead and Bashan because Machir was a man of war. / So this allotment was for the rest of the descendants of Manasseh—the clans of Abiezer, Helek, Asriel, Shechem, Hepher, and Shemida. These are the other male descendants of the clans of Manasseh son of Joseph."
        },
        {
          "reference": "1 Chronicles 5:1",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Romans 9:6-13",
          "text": "It is not as though God’s word has failed. For not all who are descended from Israel are Israel. / Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. ..."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        }
      ]
    },
    {
      "reference": "Genesis 46:21",
      "book": "Genesis",
      "chapter": 46,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Benjamin: Bela, Beker, Ashbel, Gera, Naaman, Ehi, Rosh, Muppim, Huppim and Ard."
        },
        {
          "version": "NLT",
          "text": "Benjamin’s sons were Bela, Beker, Ashbel, Gera, Naaman, Ehi, Rosh, Muppim, Huppim, and Ard."
        },
        {
          "version": "ESV",
          "text": "And the sons of Benjamin: Bela, Becher, Ashbel, Gera, Naaman, Ehi, Rosh, Muppim, Huppim, and Ard."
        },
        {
          "version": "NKJV",
          "text": "The sons of Benjamin were Belah, Becher, Ashbel, Gera, Naaman, Ehi, Rosh, Muppim, Huppim, and Ard."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Numbers 26:38-41",
          "text": "These were the descendants of Benjamin by their clans: The Belaite clan from Bela, the Ashbelite clan from Ashbel, the Ahiramite clan from Ahiram, / the Shuphamite clan from Shupham, and the Huphamite clan from Hupham. / And the descendants of Bela from Ard and Naaman were the Ardite clan from Ard and the Naamite clan from Naaman. ..."
        },
        {
          "reference": "1 Chronicles 7:6-12",
          "text": "The three sons of Benjamin: Bela, Becher, and Jediael. / The sons of Bela: Ezbon, Uzzi, Uzziel, Jerimoth, and Iri, heads of their families—five in all. There were 22,034 mighty men of valor listed in their genealogies. / The sons of Becher: Zemirah, Joash, Eliezer, Elioenai, Omri, Jeremoth, Abijah, Anathoth, and Alemeth; all these were Becher’s sons. ..."
        },
        {
          "reference": "1 Chronicles 8:1-7",
          "text": "Benjamin was the father of Bela his firstborn, Ashbel the second, Aharah the third, / Nohah the fourth, and Rapha the fifth. / The sons of Bela: Addar, Gera, Abihud, ..."
        },
        {
          "reference": "Genesis 35:16-18",
          "text": "Later, they set out from Bethel, and while they were still some distance from Ephrath, Rachel began to give birth, and her labor was difficult. / During her severe labor, the midwife said to her, “Do not be afraid, for you are having another son.” / And with her last breath—for she was dying—she named him Ben-oni. But his father called him Benjamin."
        },
        {
          "reference": "Genesis 42:4",
          "text": "But Jacob did not send Joseph’s brother Benjamin with his brothers, for he said, “I am afraid that harm might befall him.”"
        },
        {
          "reference": "Genesis 44:20",
          "text": "And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’"
        },
        {
          "reference": "Genesis 48:7",
          "text": "Now as for me, when I was returning from Paddan, to my sorrow Rachel died along the way in the land of Canaan, some distance from Ephrath. So I buried her there beside the road to Ephrath” (that is, Bethlehem)."
        },
        {
          "reference": "1 Samuel 9:1-2",
          "text": "Now there was a Benjamite, a powerful man, whose name was Kish son of Abiel, the son of Zeror, the son of Becorath, the son of Aphiah of Benjamin. / And he had a son named Saul, choice and handsome, without equal among the Israelites—a head taller than any of the people."
        },
        {
          "reference": "1 Samuel 14:49-51",
          "text": "Now the sons of Saul were Jonathan, Ishvi, and Malchishua. His two daughters were named Merab (his firstborn) and Michal (his younger daughter). / His wife’s name was Ahinoam daughter of Ahimaaz. The name of the commander of his army was Abner, the son of Saul’s uncle Ner. / Saul’s father Kish and Abner’s father Ner were sons of Abiel."
        },
        {
          "reference": "1 Chronicles 12:1-2",
          "text": "Now these were the men who came to David at Ziklag, while he was still banished from the presence of Saul son of Kish (they were among the mighty men who helped him in battle; / they were archers using both the right and left hands to sling stones and shoot arrows; and they were Saul’s kinsmen from Benjamin):"
        },
        {
          "reference": "Judges 20:35-37",
          "text": "The LORD defeated Benjamin in the presence of Israel, and on that day the Israelites slaughtered 25,100 Benjamites, all armed with swords. / Then the Benjamites realized they had been defeated. Now the men of Israel had retreated before Benjamin because they were relying on the ambush they had set against Gibeah. / The men in ambush rushed suddenly against Gibeah; they advanced and put the whole city to the sword."
        },
        {
          "reference": "1 Chronicles 9:35-39",
          "text": "Jeiel the father of Gibeon lived in Gibeon. His wife’s name was Maacah. / Abdon was his firstborn son, then Zur, Kish, Baal, Ner, Nadab, / Gedor, Ahio, Zechariah, and Mikloth. ..."
        },
        {
          "reference": "Romans 11:1",
          "text": "I ask then, did God reject His people? Certainly not! I am an Israelite myself, a descendant of Abraham, from the tribe of Benjamin."
        },
        {
          "reference": "Philippians 3:5",
          "text": "circumcised on the eighth day, of the people of Israel, of the tribe of Benjamin; a Hebrew of Hebrews; as to the law, a Pharisee;"
        },
        {
          "reference": "Acts 13:21",
          "text": "Then the people asked for a king, and God gave them Saul son of Kish, from the tribe of Benjamin, who ruled forty years."
        }
      ]
    },
    {
      "reference": "Genesis 46:22",
      "book": "Genesis",
      "chapter": 46,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the sons of Rachel who were born to Jacob—fourteen in all."
        },
        {
          "version": "NLT",
          "text": "These were the sons of Rachel and Jacob. The number of Jacob’s descendants through Rachel was fourteen."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Rachel, who were born to Jacob—fourteen persons in all."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Rachel, who were born to Jacob: fourteen persons in all."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 35:24",
          "text": "The sons of Rachel were Joseph and Benjamin."
        },
        {
          "reference": "Genesis 30:22-24",
          "text": "Then God remembered Rachel. He listened to her and opened her womb, / and she conceived and gave birth to a son. “God has taken away my shame,” she said. / She named him Joseph, and said, “May the LORD add to me another son.”"
        },
        {
          "reference": "Genesis 41:50-52",
          "text": "Before the years of famine arrived, two sons were born to Joseph by Asenath daughter of Potiphera, priest of On. / Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 48:5",
          "text": "And now your two sons born to you in Egypt before I came to you here shall be reckoned as mine; Ephraim and Manasseh shall be mine, just as Reuben and Simeon are mine."
        },
        {
          "reference": "Genesis 48:13-20",
          "text": "And Joseph took both of them—with Ephraim in his right hand toward Israel’s left hand, and Manasseh in his left hand toward Israel’s right hand—and brought them close to him. / But Israel stretched out his right hand and put it on the head of Ephraim, the younger; and crossing his hands, he put his left on Manasseh’s head, although Manasseh was the firstborn. / Then he blessed Joseph and said: “May the God before whom my fathers Abraham and Isaac walked, the God who has been my shepherd all my life to this day, ..."
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "1 Chronicles 2:1-2",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun, / Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Deuteronomy 33:13-17",
          "text": "Concerning Joseph he said: “May his land be blessed by the LORD with the precious dew from heaven above and the deep waters that lie beneath, / with the bountiful harvest from the sun and the abundant yield of the seasons, / with the best of the ancient mountains and the bounty of the everlasting hills, ..."
        },
        {
          "reference": "Joshua 14:4",
          "text": "The descendants of Joseph became two tribes, Manasseh and Ephraim. And no portion of the land was given to the Levites, except for cities in which to live, along with pasturelands for their flocks and herds."
        },
        {
          "reference": "Psalm 105:17-22",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right. ..."
        },
        {
          "reference": "Acts 7:9-14",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. ..."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Revelation 7:8",
          "text": "from the tribe of Zebulun 12,000, from the tribe of Joseph 12,000, and from the tribe of Benjamin 12,000."
        }
      ]
    },
    {
      "reference": "Genesis 46:23",
      "book": "Genesis",
      "chapter": 46,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "The son of Dan: Hushim."
        },
        {
          "version": "NLT",
          "text": "The son of Dan was Hushim."
        },
        {
          "version": "ESV",
          "text": "The son of Dan: Hushim."
        },
        {
          "version": "NKJV",
          "text": "The son of Dan was Hushim."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Numbers 26:48-50",
          "text": "These were the descendants of Naphtali by their clans: The Jahzeelite clan from Jahzeel, the Gunite clan from Guni, / the Jezerite clan from Jezer, and the Shillemite clan from Shillem. / These were the clans of Naphtali, and their registration numbered 45,400."
        },
        {
          "reference": "1 Chronicles 7:13",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum—the descendants of Bilhah."
        },
        {
          "reference": "Genesis 30:9-13",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife. / And Leah’s servant Zilpah bore Jacob a son. / Then Leah said, “How fortunate!” So she named him Gad. ..."
        },
        {
          "reference": "Genesis 35:25-26",
          "text": "The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. / And the sons of Leah’s maidservant Zilpah were Gad and Asher. These are the sons of Jacob, who were born to him in Paddan-aram."
        },
        {
          "reference": "Genesis 49:13",
          "text": "Zebulun shall dwell by the seashore and become a harbor for ships; his border shall extend to Sidon."
        },
        {
          "reference": "Deuteronomy 33:18",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents."
        },
        {
          "reference": "Joshua 19:10-16",
          "text": "The third lot came up for the clans of the tribe of Zebulun: The border of their inheritance stretched as far as Sarid. / It went up westward to Maralah, reached Dabbesheth, and met the brook east of Jokneam. / From Sarid it turned eastward along the border of Chisloth-tabor and went on to Daberath and up to Japhia. ..."
        },
        {
          "reference": "Judges 5:18",
          "text": "Zebulun was a people who risked their lives; Naphtali, too, on the heights of the battlefield."
        },
        {
          "reference": "2 Kings 15:29",
          "text": "In the days of Pekah king of Israel, Tiglath-pileser king of Assyria came and captured Ijon, Abel-beth-maacah, Janoah, Kedesh, Hazor, Gilead, and Galilee, including all the land of Naphtali, and he took the people as captives to Assyria."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-15",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles—"
        },
        {
          "reference": "Revelation 7:6",
          "text": "from the tribe of Asher 12,000, from the tribe of Naphtali 12,000, from the tribe of Manasseh 12,000,"
        },
        {
          "reference": "Acts 7:8-9",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs. / Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Romans 11:1",
          "text": "I ask then, did God reject His people? Certainly not! I am an Israelite myself, a descendant of Abraham, from the tribe of Benjamin."
        },
        {
          "reference": "Philippians 3:5",
          "text": "circumcised on the eighth day, of the people of Israel, of the tribe of Benjamin; a Hebrew of Hebrews; as to the law, a Pharisee;"
        }
      ]
    },
    {
      "reference": "Genesis 46:24",
      "book": "Genesis",
      "chapter": 46,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer and Shillem."
        },
        {
          "version": "NLT",
          "text": "The sons of Naphtali were Jahzeel, Guni, Jezer, and Shillem."
        },
        {
          "version": "ESV",
          "text": "The sons of Naphtali: Jahzeel, Guni, Jezer, and Shillem."
        },
        {
          "version": "NKJV",
          "text": "The sons of Naphtali were Jahzeel, Guni, Jezer, and Shillem."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Numbers 26:48-49",
          "text": "These were the descendants of Naphtali by their clans: The Jahzeelite clan from Jahzeel, the Gunite clan from Guni, / the Jezerite clan from Jezer, and the Shillemite clan from Shillem."
        },
        {
          "reference": "1 Chronicles 7:13",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum—the descendants of Bilhah."
        },
        {
          "reference": "Genesis 30:7-8",
          "text": "And Rachel’s servant Bilhah conceived again and bore Jacob a second son. / Then Rachel said, “In my great struggles, I have wrestled with my sister and won.” So she named him Naphtali."
        },
        {
          "reference": "Genesis 35:25-26",
          "text": "The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. / And the sons of Leah’s maidservant Zilpah were Gad and Asher. These are the sons of Jacob, who were born to him in Paddan-aram."
        },
        {
          "reference": "Genesis 49:21",
          "text": "Naphtali is a doe set free that bears beautiful fawns."
        },
        {
          "reference": "Deuteronomy 33:23",
          "text": "Concerning Naphtali he said: “Naphtali is abounding with favor, full of the blessing of the LORD; he shall take possession of the sea and the south.”"
        },
        {
          "reference": "Joshua 19:32-39",
          "text": "The sixth lot came out for the clans of the tribe of Naphtali: / Their border started at Heleph and the great tree of Zaanannim, passing Adami-nekeb and Jabneel as far as Lakkum and ending at the Jordan. / Then the border turned westward to Aznoth-tabor and ran from there to Hukkok, touching Zebulun on the south side, Asher on the west, and Judah at the Jordan on the east. ..."
        },
        {
          "reference": "Judges 4:6-10",
          "text": "She summoned Barak son of Abinoam from Kedesh in Naphtali and said to him, “Surely the LORD, the God of Israel, is commanding you: ‘Go and march to Mount Tabor, taking with you ten thousand men of Naphtali and Zebulun. / And I will draw out Sisera the commander of Jabin’s army, his chariots, and his troops to the River Kishon, and I will deliver him into your hand.’” / Barak said to her, “If you will go with me, I will go; but if you will not go with me, I will not go.” ..."
        },
        {
          "reference": "Judges 5:18",
          "text": "Zebulun was a people who risked their lives; Naphtali, too, on the heights of the battlefield."
        },
        {
          "reference": "1 Kings 7:14",
          "text": "He was the son of a widow from the tribe of Naphtali, and his father was a man of Tyre, a craftsman in bronze. Huram had great skill, understanding, and knowledge for every kind of bronze work. So he came to King Solomon and carried out all his work."
        },
        {
          "reference": "2 Kings 15:29",
          "text": "In the days of Pekah king of Israel, Tiglath-pileser king of Assyria came and captured Ijon, Abel-beth-maacah, Janoah, Kedesh, Hazor, Gilead, and Galilee, including all the land of Naphtali, and he took the people as captives to Assyria."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-15",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles—"
        },
        {
          "reference": "Luke 2:36",
          "text": "There was also a prophetess named Anna, the daughter of Phanuel, of the tribe of Asher, who was well along in years. She had been married for seven years,"
        },
        {
          "reference": "John 1:45-46",
          "text": "Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.” / “Can anything good come from Nazareth?” Nathanael asked. “Come and see,” said Philip."
        }
      ]
    },
    {
      "reference": "Genesis 46:25",
      "book": "Genesis",
      "chapter": 46,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "These were the sons born to Jacob by Bilhah, whom Laban had given to his daughter Rachel—seven in all."
        },
        {
          "version": "NLT",
          "text": "These were the sons of Bilhah, the servant given to Rachel by her father, Laban. The number of Jacob’s descendants through Bilhah was seven."
        },
        {
          "version": "ESV",
          "text": "These are the sons of Bilhah, whom Laban gave to Rachel his daughter, and these she bore to Jacob—seven persons in all."
        },
        {
          "version": "NKJV",
          "text": "These were the sons of Bilhah, whom Laban gave to Rachel his daughter, and she bore these to Jacob: seven persons in all."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 29:18-30",
          "text": "Since Jacob loved Rachel, he answered, “I will serve you seven years for your younger daughter Rachel.” / Laban replied, “Better that I give her to you than to another. Stay here with me.” / So Jacob served seven years for Rachel, yet it seemed but a few days because of his love for her. ..."
        },
        {
          "reference": "Genesis 30:9-13",
          "text": "When Leah saw that she had stopped having children, she gave her servant Zilpah to Jacob as a wife. / And Leah’s servant Zilpah bore Jacob a son. / Then Leah said, “How fortunate!” So she named him Gad. ..."
        },
        {
          "reference": "Genesis 35:23-26",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. / The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. ..."
        },
        {
          "reference": "Genesis 41:50-52",
          "text": "Before the years of famine arrived, two sons were born to Joseph by Asenath daughter of Potiphera, priest of On. / Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 48:5-6",
          "text": "And now your two sons born to you in Egypt before I came to you here shall be reckoned as mine; Ephraim and Manasseh shall be mine, just as Reuben and Simeon are mine. / Any children born to you after them shall be yours, and they shall be called by the names of their brothers in the territory they inherit."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Numbers 26:12-14",
          "text": "These were the descendants of Simeon by their clans: The Nemuelite clan from Nemuel, the Jaminite clan from Jamin, the Jachinite clan from Jachin, / the Zerahite clan from Zerah, and the Shaulite clan from Shaul. / These were the clans of Simeon, and there were 22,200 men."
        },
        {
          "reference": "Deuteronomy 10:22",
          "text": "Your fathers went down to Egypt, seventy in all, and now the LORD your God has made you as numerous as the stars in the sky."
        },
        {
          "reference": "1 Chronicles 7:13",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum—the descendants of Bilhah."
        },
        {
          "reference": "1 Chronicles 12:32",
          "text": "From Issachar, men who understood the times and knew what Israel should do: 200 chiefs with all their kinsmen at their command."
        },
        {
          "reference": "Acts 7:14",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Romans 9:4-5",
          "text": "the people of Israel. Theirs is the adoption as sons; theirs the divine glory and the covenants; theirs the giving of the law, the temple worship, and the promises. / Theirs are the patriarchs, and from them proceeds the human descent of Christ, who is God over all, forever worthy of praise! Amen."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Revelation 7:4-8",
          "text": "And I heard the number of those who were sealed, 144,000 from all the tribes of Israel: / From the tribe of Judah 12,000 were sealed, from the tribe of Reuben 12,000, from the tribe of Gad 12,000, / from the tribe of Asher 12,000, from the tribe of Naphtali 12,000, from the tribe of Manasseh 12,000, ..."
        },
        {
          "reference": "Genesis 30:1-8",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?” / Then she said, “Here is my maidservant Bilhah. Sleep with her, that she may bear children for me, so that through her I too can build a family.” ..."
        }
      ]
    },
    {
      "reference": "Genesis 46:26",
      "book": "Genesis",
      "chapter": 46,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "All those who went to Egypt with Jacob—those who were his direct descendants, not counting his sons’ wives—numbered sixty-six persons."
        },
        {
          "version": "NLT",
          "text": "The total number of Jacob’s direct descendants who went with him to Egypt, not counting his sons’ wives, was sixty-six."
        },
        {
          "version": "ESV",
          "text": "All the persons belonging to Jacob who came into Egypt, who were his own descendants, not including Jacob’s sons’ wives, were sixty-six persons in all."
        },
        {
          "version": "NKJV",
          "text": "All the persons who went with Jacob to Egypt, who came from his body, besides Jacob’s sons’ wives, were sixty-six persons in all."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:5",
          "text": "The descendants of Jacob numbered seventy in all, including Joseph, who was already in Egypt."
        },
        {
          "reference": "Acts 7:14",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Genesis 35:23-26",
          "text": "The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. / The sons of Rachel’s maidservant Bilhah were Dan and Naphtali. ..."
        },
        {
          "reference": "Genesis 29:31-35",
          "text": "When the LORD saw that Leah was unloved, He opened her womb; but Rachel was barren. / And Leah conceived and gave birth to a son, and she named him Reuben, for she said, “The LORD has seen my affliction. Surely my husband will love me now.” / Again she conceived and gave birth to a son, and she said, “Because the LORD has heard that I am unloved, He has given me this son as well.” So she named him Simeon. ..."
        },
        {
          "reference": "Genesis 30:1-24",
          "text": "When Rachel saw that she was not bearing any children for Jacob, she envied her sister. “Give me children, or I will die!” she said to Jacob. / Jacob became angry with Rachel and said, “Am I in the place of God, who has withheld children from you?” / Then she said, “Here is my maidservant Bilhah. Sleep with her, that she may bear children for me, so that through her I too can build a family.” ..."
        },
        {
          "reference": "Genesis 31:41",
          "text": "Thus for twenty years I have served in your household—fourteen years for your two daughters and six years for your flocks—and you have changed my wages ten times!"
        },
        {
          "reference": "Genesis 37:2",
          "text": "This is the account of Jacob. When Joseph was seventeen years old, he was tending the flock with his brothers, the sons of his father’s wives Bilhah and Zilpah, and he brought their father a bad report about them."
        },
        {
          "reference": "Genesis 41:46",
          "text": "Now Joseph was thirty years old when he entered the service of Pharaoh king of Egypt. And Joseph left Pharaoh’s presence and traveled throughout the land of Egypt."
        },
        {
          "reference": "Genesis 42:13",
          "text": "But they answered, “Your servants are twelve brothers, the sons of one man in the land of Canaan. The youngest is now with our father, and one is no more.”"
        },
        {
          "reference": "Genesis 45:7",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance."
        },
        {
          "reference": "Genesis 45:11",
          "text": "And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 47:12",
          "text": "Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Deuteronomy 10:22",
          "text": "Your fathers went down to Egypt, seventy in all, and now the LORD your God has made you as numerous as the stars in the sky."
        },
        {
          "reference": "Numbers 26:5-51",
          "text": "Reuben was the firstborn of Israel. These were the descendants of Reuben: The Hanochite clan from Hanoch, the Palluite clan from Pallu, / the Hezronite clan from Hezron, and the Carmite clan from Carmi. / These were the clans of Reuben, and their registration numbered 43,730. ..."
        }
      ]
    },
    {
      "reference": "Genesis 46:27",
      "book": "Genesis",
      "chapter": 46,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "With the two sons who had been born to Joseph in Egypt, the members of Jacob’s family, which went to Egypt, were seventy in all."
        },
        {
          "version": "NLT",
          "text": "In addition, Joseph had two sons who were born in Egypt. So altogether, there were seventy members of Jacob’s family in the land of Egypt."
        },
        {
          "version": "ESV",
          "text": "And the sons of Joseph, who were born to him in Egypt, were two. All the persons of the house of Jacob who came into Egypt were seventy."
        },
        {
          "version": "NKJV",
          "text": "And the sons of Joseph who were born to him in Egypt were two persons. All the persons of the house of Jacob who went to Egypt were seventy."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:5",
          "text": "The descendants of Jacob numbered seventy in all, including Joseph, who was already in Egypt."
        },
        {
          "reference": "Acts 7:14",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Deuteronomy 10:22",
          "text": "Your fathers went down to Egypt, seventy in all, and now the LORD your God has made you as numerous as the stars in the sky."
        },
        {
          "reference": "Genesis 15:13",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years."
        },
        {
          "reference": "Genesis 47:12",
          "text": "Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 12:40-41",
          "text": "Now the duration of the Israelites’ stay in Egypt was 430 years. / At the end of the 430 years, to the very day, all the LORD’s divisions went out of the land of Egypt."
        },
        {
          "reference": "Numbers 26:59",
          "text": "and Amram’s wife was named Jochebed. She was also a daughter of Levi, born to Levi in Egypt. To Amram she bore Aaron, Moses, and their sister Miriam."
        },
        {
          "reference": "Genesis 35:11",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you."
        },
        {
          "reference": "Genesis 41:54",
          "text": "the seven years of famine began, just as Joseph had said. And although there was famine in every country, there was food throughout the land of Egypt."
        },
        {
          "reference": "Genesis 42:2",
          "text": "“Look,” he added, “I have heard that there is grain in Egypt. Go down there and buy some for us, so that we may live and not die.”"
        },
        {
          "reference": "Genesis 45:11",
          "text": "And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 47:27",
          "text": "Now the Israelites settled in the land of Egypt, in the region of Goshen. They acquired property there and became fruitful and increased greatly in number."
        },
        {
          "reference": "Genesis 50:24",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.”"
        },
        {
          "reference": "Exodus 6:14-25",
          "text": "These were the heads of their fathers’ houses: The sons of Reuben, the firstborn of Israel, were Hanoch and Pallu, Hezron and Carmi. These were the clans of Reuben. / The sons of Simeon were Jemuel, Jamin, Ohad, Jachin, Zohar, and Shaul, the son of a Canaanite woman. These were the clans of Simeon. / These were the names of the sons of Levi according to their records: Gershon, Kohath, and Merari. Levi lived 137 years. ..."
        }
      ]
    },
    {
      "reference": "Genesis 46:28",
      "book": "Genesis",
      "chapter": 46,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Jacob sent Judah ahead of him to Joseph to get directions to Goshen. When they arrived in the region of Goshen,"
        },
        {
          "version": "NLT",
          "text": "As they neared their destination, Jacob sent Judah ahead to meet Joseph and get directions to the region of Goshen. And when they finally arrived there,"
        },
        {
          "version": "ESV",
          "text": "He had sent Judah ahead of him to Joseph to show the way before him in Goshen, and they came into the land of Goshen."
        },
        {
          "version": "NKJV",
          "text": "Then he sent Judah before him to Joseph, to point out before him the way to Goshen. And they came to the land of Goshen."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:9-13",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’ ..."
        },
        {
          "reference": "Genesis 47:1-6",
          "text": "So Joseph went and told Pharaoh: “My father and my brothers, with their flocks and herds and all they own, have come from the land of Canaan and are now in Goshen.” / And he chose five of his brothers and presented them before Pharaoh. / “What is your occupation?” Pharaoh asked Joseph’s brothers. “Your servants are shepherds,” they replied, “both we and our fathers.” ..."
        },
        {
          "reference": "Genesis 37:12-14",
          "text": "Some time later, Joseph’s brothers had gone to pasture their father’s flocks near Shechem. / Israel said to him, “Are not your brothers pasturing the flocks at Shechem? Get ready; I am sending you to them.” “I am ready,” Joseph replied. / Then Israel told him, “Go now and see how your brothers and the flocks are faring, and bring word back to me.” So he sent him off from the Valley of Hebron. And when Joseph arrived in Shechem,"
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 50:15-21",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph bears a grudge? Then he will surely repay us for all the evil that we did to him.” / So they sent word to Joseph, saying, “Before he died, your father commanded, / ‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. ..."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Exodus 4:27-31",
          "text": "Meanwhile, the LORD had said to Aaron, “Go and meet Moses in the wilderness.” So he went and met Moses at the mountain of God and kissed him. / And Moses told Aaron everything the LORD had sent him to say, and all the signs He had commanded him to perform. / Then Moses and Aaron went and assembled all the elders of the Israelites, ..."
        },
        {
          "reference": "Exodus 18:5-7",
          "text": "Moses’ father-in-law Jethro, along with Moses’ wife and sons, came to him in the desert, where he was encamped at the mountain of God. / He sent word to Moses, “I, your father-in-law Jethro, am coming to you with your wife and her two sons.” / So Moses went out to meet his father-in-law and bowed down and kissed him. They greeted each other and went into the tent."
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Acts 7:13-15",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "John 4:5-6",
          "text": "So He came to a town of Samaria called Sychar, near the plot of ground that Jacob had given to his son Joseph. / Since Jacob’s well was there, Jesus, weary from His journey, sat down by the well. It was about the sixth hour."
        },
        {
          "reference": "John 1:45-46",
          "text": "Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.” / “Can anything good come from Nazareth?” Nathanael asked. “Come and see,” said Philip."
        },
        {
          "reference": "Matthew 2:13-15",
          "text": "When the Magi had gone, an angel of the Lord appeared to Joseph in a dream. “Get up!” he said. “Take the Child and His mother and flee to Egypt. Stay there until I tell you, for Herod is going to search for the Child to kill Him.” / So he got up, took the Child and His mother by night, and withdrew to Egypt, / where he stayed until the death of Herod. This fulfilled what the Lord had spoken through the prophet: “Out of Egypt I called My Son.”"
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        }
      ]
    },
    {
      "reference": "Genesis 46:29",
      "book": "Genesis",
      "chapter": 46,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph had his chariot made ready and went to Goshen to meet his father Israel. As soon as Joseph appeared before him, he threw his arms around his father and wept for a long time."
        },
        {
          "version": "NLT",
          "text": "Joseph prepared his chariot and traveled to Goshen to meet his father, Jacob. When Joseph arrived, he embraced his father and wept, holding him for a long time."
        },
        {
          "version": "ESV",
          "text": "Then Joseph prepared his chariot and went up to meet Israel his father in Goshen. He presented himself to him and fell on his neck and wept on his neck a good while."
        },
        {
          "version": "NKJV",
          "text": "So Joseph made ready his chariot and went up to Goshen to meet his father Israel; and he presented himself to him, and fell on his neck and wept on his neck a good while."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:14-15",
          "text": "Then Joseph threw his arms around his brother Benjamin and wept, and Benjamin wept as they embraced. / Joseph kissed each of his brothers as he wept over them. And afterward his brothers talked with him."
        },
        {
          "reference": "Genesis 37:3-4",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. / When Joseph’s brothers saw that their father loved him more than any of them, they hated him and could not speak a kind word to him."
        },
        {
          "reference": "Genesis 37:23-24",
          "text": "So when Joseph came to his brothers, they stripped him of his robe—the robe of many colors he was wearing— / and they took him and threw him into the pit. Now the pit was empty, with no water in it."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 41:41-43",
          "text": "Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.” / Then Pharaoh removed the signet ring from his finger, put it on Joseph’s finger, clothed him in garments of fine linen, and placed a gold chain around his neck. / He had Joseph ride in his second chariot, with men calling out before him, “Bow the knee!” So he placed him over all the land of Egypt."
        },
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        },
        {
          "reference": "Genesis 43:26-30",
          "text": "When Joseph came home, they presented him with the gifts they had brought, and they bowed to the ground before him. / He asked if they were well, and then he asked, “How is your elderly father you told me about? Is he still alive?” / “Your servant our father is well,” they answered. “He is still alive.” And they bowed down to honor him. ..."
        },
        {
          "reference": "Genesis 45:1-3",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it. / Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 50:1",
          "text": "Then Joseph fell upon his father’s face, wept over him, and kissed him."
        },
        {
          "reference": "Exodus 4:27-31",
          "text": "Meanwhile, the LORD had said to Aaron, “Go and meet Moses in the wilderness.” So he went and met Moses at the mountain of God and kissed him. / And Moses told Aaron everything the LORD had sent him to say, and all the signs He had commanded him to perform. / Then Moses and Aaron went and assembled all the elders of the Israelites, ..."
        },
        {
          "reference": "Exodus 18:7",
          "text": "So Moses went out to meet his father-in-law and bowed down and kissed him. They greeted each other and went into the tent."
        },
        {
          "reference": "2 Samuel 14:33",
          "text": "So Joab went and told the king, and David summoned Absalom, who came to him and bowed facedown before him. Then the king kissed Absalom."
        },
        {
          "reference": "2 Samuel 19:39",
          "text": "So all the people crossed the Jordan, and then the king crossed over. The king kissed Barzillai and blessed him, and Barzillai returned home."
        },
        {
          "reference": "Luke 15:20",
          "text": "So he got up and went to his father. But while he was still in the distance, his father saw him and was filled with compassion. He ran to his son, embraced him, and kissed him."
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        }
      ]
    },
    {
      "reference": "Genesis 46:30",
      "book": "Genesis",
      "chapter": 46,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "Israel said to Joseph, “Now I am ready to die, since I have seen for myself that you are still alive.”"
        },
        {
          "version": "NLT",
          "text": "Finally, Jacob said to Joseph, “Now I am ready to die, since I have seen your face again and know you are still alive.”"
        },
        {
          "version": "ESV",
          "text": "Israel said to Joseph, “Now let me die, since I have seen your face and know that you are still alive.”"
        },
        {
          "version": "NKJV",
          "text": "And Israel said to Joseph, “Now let me die, since I have seen your face, because you are still alive.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:28",
          "text": "“Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 37:35",
          "text": "All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 44:28",
          "text": "When one of them was gone, I said: “Surely he has been torn to pieces.” And I have not seen him since."
        },
        {
          "reference": "Genesis 42:36",
          "text": "Their father Jacob said to them, “You have deprived me of my sons. Joseph is gone and Simeon is no more. Now you want to take Benjamin. Everything is going against me!”"
        },
        {
          "reference": "Genesis 37:33-34",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days."
        },
        {
          "reference": "Genesis 50:17-21",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? ..."
        },
        {
          "reference": "Genesis 48:11",
          "text": "“I never expected to see your face again,” Israel said to Joseph, “but now God has let me see your children as well.”"
        },
        {
          "reference": "Genesis 43:30",
          "text": "Joseph hurried out because he was moved to tears for his brother, and he went to a private room to weep."
        },
        {
          "reference": "Genesis 50:1",
          "text": "Then Joseph fell upon his father’s face, wept over him, and kissed him."
        },
        {
          "reference": "Genesis 45:3",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Luke 2:29-30",
          "text": "“Sovereign Lord, as You have promised, You now dismiss Your servant in peace. / For my eyes have seen Your salvation,"
        },
        {
          "reference": "John 16:22",
          "text": "So also you have sorrow now, but I will see you again and your hearts will rejoice, and no one will take away your joy."
        },
        {
          "reference": "Luke 15:24",
          "text": "For this son of mine was dead and is alive again! He was lost and is found!’ So they began to celebrate."
        },
        {
          "reference": "1 Thessalonians 2:19-20",
          "text": "After all, who is our hope, our joy, our crown of boasting, if it is not you yourselves in the presence of our Lord Jesus at His coming? / You are indeed our glory and our joy."
        },
        {
          "reference": "Philippians 1:25-26",
          "text": "Convinced of this, I know that I will remain and will continue with all of you for your progress and joy in the faith, / so that through my coming to you again your exultation in Christ Jesus will resound on account of me."
        }
      ]
    },
    {
      "reference": "Genesis 46:31",
      "book": "Genesis",
      "chapter": 46,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Joseph said to his brothers and to his father’s household, “I will go up and speak to Pharaoh and will say to him, ‘My brothers and my father’s household, who were living in the land of Canaan, have come to me."
        },
        {
          "version": "NLT",
          "text": "And Joseph said to his brothers and to his father’s entire family, “I will go to Pharaoh and tell him, ‘My brothers and my father’s entire family have come to me from the land of Canaan."
        },
        {
          "version": "ESV",
          "text": "Joseph said to his brothers and to his father’s household, “I will go up and tell Pharaoh and will say to him, ‘My brothers and my father’s household, who were in the land of Canaan, have come to me."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph said to his brothers and to his father’s household, “I will go up and tell Pharaoh, and say to him, ‘My brothers and those of my father’s house, who were in the land of Canaan, have come to me."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:18",
          "text": "The elders of Israel will listen to what you say, and you must go with them to the king of Egypt and tell him, ‘The LORD, the God of the Hebrews, has met with us. Now please let us take a three-day journey into the wilderness, so that we may sacrifice to the LORD our God.’"
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 47:1-6",
          "text": "So Joseph went and told Pharaoh: “My father and my brothers, with their flocks and herds and all they own, have come from the land of Canaan and are now in Goshen.” / And he chose five of his brothers and presented them before Pharaoh. / “What is your occupation?” Pharaoh asked Joseph’s brothers. “Your servants are shepherds,” they replied, “both we and our fathers.” ..."
        },
        {
          "reference": "Exodus 10:8-11",
          "text": "So Moses and Aaron were brought back to Pharaoh. “Go, worship the LORD your God,” he said. “But who exactly will be going?” / “We will go with our young and old,” Moses replied. “We will go with our sons and daughters, and with our flocks and herds, for we must hold a feast to the LORD.” / Then Pharaoh told them, “May the LORD be with you if I ever let you go with your little ones. Clearly you are bent on evil. ..."
        },
        {
          "reference": "Exodus 8:25-26",
          "text": "Then Pharaoh summoned Moses and Aaron and said, “Go, sacrifice to your God within this land.” / But Moses replied, “It would not be right to do that, because the sacrifices we offer to the LORD our God would be detestable to the Egyptians. If we offer sacrifices that are detestable before the Egyptians, will they not stone us?"
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Genesis 50:7-8",
          "text": "Then Joseph went to bury his father, and all the servants of Pharaoh accompanied him—the elders of Pharaoh’s household and all the elders of the land of Egypt— / along with all of Joseph’s household, and his brothers, and his father’s household. Only their children and flocks and herds were left in Goshen."
        },
        {
          "reference": "Exodus 12:31-32",
          "text": "Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested. / Take your flocks and herds as well, just as you have said, and depart! And bless me also.”"
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Exodus 4:29-31",
          "text": "Then Moses and Aaron went and assembled all the elders of the Israelites, / and Aaron relayed everything the LORD had said to Moses. And Moses performed the signs before the people, / and they believed. And when they heard that the LORD had attended to the Israelites and had seen their affliction, they bowed down and worshiped."
        },
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        }
      ]
    },
    {
      "reference": "Genesis 46:32",
      "book": "Genesis",
      "chapter": 46,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "The men are shepherds; they tend livestock, and they have brought along their flocks and herds and everything they own.’"
        },
        {
          "version": "NLT",
          "text": "These men are shepherds, and they raise livestock. They have brought with them their flocks and herds and everything they own.’”"
        },
        {
          "version": "ESV",
          "text": "And the men are shepherds, for they have been keepers of livestock, and they have brought their flocks and their herds and all that they have.’"
        },
        {
          "version": "NKJV",
          "text": "And the men are shepherds, for their occupation has been to feed livestock; and they have brought their flocks, their herds, and all that they have.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 8:26",
          "text": "But Moses replied, “It would not be right to do that, because the sacrifices we offer to the LORD our God would be detestable to the Egyptians. If we offer sacrifices that are detestable before the Egyptians, will they not stone us?"
        },
        {
          "reference": "Genesis 47:3-4",
          "text": "“What is your occupation?” Pharaoh asked Joseph’s brothers. “Your servants are shepherds,” they replied, “both we and our fathers.” / Then they said to Pharaoh, “We have come to live in the land for a time, because there is no pasture for the flocks of your servants, since the famine in the land of Canaan has been severe. So now, please allow your servants to settle in the land of Goshen.”"
        },
        {
          "reference": "Exodus 10:9",
          "text": "“We will go with our young and old,” Moses replied. “We will go with our sons and daughters, and with our flocks and herds, for we must hold a feast to the LORD.”"
        },
        {
          "reference": "Exodus 12:38",
          "text": "And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Numbers 32:1-4",
          "text": "Now the Reubenites and Gadites, who had very large herds and flocks, surveyed the lands of Jazer and Gilead, and they saw that the region was suitable for livestock. / So the Gadites and Reubenites came to Moses, Eleazar the priest, and the leaders of the congregation, and said, / “Ataroth, Dibon, Jazer, Nimrah, Heshbon, Elealeh, Sebam, Nebo, and Beon, ..."
        },
        {
          "reference": "1 Samuel 17:34-36",
          "text": "David replied, “Your servant has been tending his father’s sheep, and whenever a lion or a bear came and carried off a lamb from the flock, / I went after it, struck it down, and delivered the lamb from its mouth. If it reared up against me, I would grab it by its fur, strike it down, and kill it. / Your servant has killed lions and bears; this uncircumcised Philistine will be like one of them, for he has defied the armies of the living God.”"
        },
        {
          "reference": "2 Samuel 7:8",
          "text": "Now then, you are to tell My servant David that this is what the LORD of Hosts says: I took you from the pasture, from following the flock, to be the ruler over My people Israel."
        },
        {
          "reference": "Psalm 78:70-72",
          "text": "He chose David His servant and took him from the sheepfolds; / from tending the ewes He brought him to be shepherd of His people Jacob, of Israel His inheritance. / So David shepherded them with integrity of heart and guided them with skillful hands."
        },
        {
          "reference": "Isaiah 40:11",
          "text": "He tends His flock like a shepherd; He gathers the lambs in His arms and carries them close to His heart. He gently leads the nursing ewes."
        },
        {
          "reference": "Ezekiel 34:12-16",
          "text": "As a shepherd looks for his scattered sheep when he is among the flock, so I will look for My flock. I will rescue them from all the places to which they were scattered on a day of clouds and darkness. / I will bring them out from the peoples, gather them from the countries, and bring them into their own land. I will feed them on the mountains of Israel, in the ravines, and in all the settlements of the land. / I will feed them in good pasture, and the lofty mountains of Israel will be their grazing land. There they will lie down in a good grazing land; they will feed in rich pasture on the mountains of Israel. ..."
        },
        {
          "reference": "John 10:11-14",
          "text": "I am the good shepherd. The good shepherd lays down His life for the sheep. / The hired hand is not the shepherd, and the sheep are not his own. When he sees the wolf coming, he abandons the sheep and runs away. Then the wolf pounces on them and scatters the flock. / The man runs away because he is a hired servant and is unconcerned for the sheep. ..."
        },
        {
          "reference": "Matthew 9:36",
          "text": "When He saw the crowds, He was moved with compassion for them, because they were harassed and helpless, like sheep without a shepherd."
        },
        {
          "reference": "Luke 2:8-20",
          "text": "And there were shepherds residing in the fields nearby, keeping watch over their flocks by night. / Just then an angel of the Lord stood before them, and the glory of the Lord shone around them, and they were terrified. / But the angel said to them, “Do not be afraid! For behold, I bring you good news of great joy that will be for all the people: ..."
        },
        {
          "reference": "John 21:15-17",
          "text": "When they had finished eating, Jesus asked Simon Peter, “Simon son of John, do you love Me more than these?” “Yes, Lord,” he answered, “You know I love You.” Jesus replied, “Feed My lambs.” / Jesus asked a second time, “Simon son of John, do you love Me?” “Yes, Lord,” he answered, “You know I love You.” Jesus told him, “Shepherd My sheep.” / Jesus asked a third time, “Simon son of John, do you love Me?” Peter was deeply hurt that Jesus had asked him a third time, “Do you love Me?” “Lord, You know all things,” he replied. “You know I love You.” Jesus said to him, “Feed My sheep."
        },
        {
          "reference": "Hebrews 13:20",
          "text": "Now may the God of peace, who through the blood of the eternal covenant brought back from the dead our Lord Jesus, that great Shepherd of the sheep,"
        }
      ]
    },
    {
      "reference": "Genesis 46:33",
      "book": "Genesis",
      "chapter": 46,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "When Pharaoh calls you in and asks, ‘What is your occupation?’"
        },
        {
          "version": "NLT",
          "text": "Then he said, “When Pharaoh calls for you and asks you about your occupation,"
        },
        {
          "version": "ESV",
          "text": "When Pharaoh calls you and says, ‘What is your occupation?’"
        },
        {
          "version": "NKJV",
          "text": "So it shall be, when Pharaoh calls you and says, ‘What is your occupation?’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Exodus 1:13-14",
          "text": "They worked the Israelites ruthlessly / and made their lives bitter with hard labor in brick and mortar, and with all kinds of work in the fields. Every service they imposed was harsh."
        },
        {
          "reference": "Exodus 3:18",
          "text": "The elders of Israel will listen to what you say, and you must go with them to the king of Egypt and tell him, ‘The LORD, the God of the Hebrews, has met with us. Now please let us take a three-day journey into the wilderness, so that we may sacrifice to the LORD our God.’"
        },
        {
          "reference": "Exodus 5:4-5",
          "text": "But the king of Egypt said to them, “Moses and Aaron, why do you draw the people away from their work? Get back to your labor!” / Pharaoh also said, “Look, the people of the land are now numerous, and you would be stopping them from their labor.”"
        },
        {
          "reference": "Exodus 6:6-7",
          "text": "Therefore tell the Israelites: ‘I am the LORD, and I will bring you out from under the yoke of the Egyptians and deliver you from their bondage. I will redeem you with an outstretched arm and with mighty acts of judgment. / I will take you as My own people, and I will be your God. Then you will know that I am the LORD your God, who brought you out from under the yoke of the Egyptians."
        },
        {
          "reference": "Exodus 8:25-26",
          "text": "Then Pharaoh summoned Moses and Aaron and said, “Go, sacrifice to your God within this land.” / But Moses replied, “It would not be right to do that, because the sacrifices we offer to the LORD our God would be detestable to the Egyptians. If we offer sacrifices that are detestable before the Egyptians, will they not stone us?"
        },
        {
          "reference": "Exodus 9:1",
          "text": "Then the LORD said to Moses, “Go to Pharaoh and tell him that this is what the LORD, the God of the Hebrews, says: ‘Let My people go, so that they may worship Me."
        },
        {
          "reference": "Exodus 10:24-26",
          "text": "Then Pharaoh summoned Moses and said, “Go, worship the LORD. Even your little ones may go with you; only your flocks and herds must stay behind.” / But Moses replied, “You must also provide us with sacrifices and burnt offerings to present to the LORD our God. / Even our livestock must go with us; not a hoof will be left behind, for we will need some of them to worship the LORD our God, and we will not know how we are to worship the LORD until we arrive.”"
        },
        {
          "reference": "Exodus 12:31-32",
          "text": "Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested. / Take your flocks and herds as well, just as you have said, and depart! And bless me also.”"
        },
        {
          "reference": "Exodus 14:5",
          "text": "When the king of Egypt was told that the people had fled, Pharaoh and his officials changed their minds about them and said, “What have we done? We have released Israel from serving us.”"
        },
        {
          "reference": "Exodus 14:11-12",
          "text": "They said to Moses, “Was it because there were no graves in Egypt that you brought us into the wilderness to die? What have you done to us by bringing us out of Egypt? / Did we not say to you in Egypt, ‘Leave us alone so that we may serve the Egyptians’? For it would have been better for us to serve the Egyptians than to die in the wilderness.”"
        },
        {
          "reference": "Exodus 15:9",
          "text": "The enemy declared, ‘I will pursue, I will overtake. I will divide the spoils; I will gorge myself on them. I will draw my sword; my hand will destroy them.’"
        },
        {
          "reference": "Exodus 18:1",
          "text": "Now Moses’ father-in-law Jethro, the priest of Midian, heard about all that God had done for Moses and His people Israel, and how the LORD had brought Israel out of Egypt."
        },
        {
          "reference": "Exodus 19:4-6",
          "text": "‘You have seen for yourselves what I did to Egypt, and how I carried you on eagles’ wings and brought you to Myself. / Now if you will indeed obey My voice and keep My covenant, you will be My treasured possession out of all the nations—for the whole earth is Mine. / And unto Me you shall be a kingdom of priests and a holy nation.’ These are the words that you are to speak to the Israelites.”"
        },
        {
          "reference": "Exodus 20:2",
          "text": "“I am the LORD your God, who brought you out of the land of Egypt, out of the house of slavery."
        }
      ]
    },
    {
      "reference": "Genesis 46:34",
      "book": "Genesis",
      "chapter": 46,
      "verse": 34,
      "translations": [
        {
          "version": "NIV",
          "text": "you should answer, ‘Your servants have tended livestock from our boyhood on, just as our fathers did.’ Then you will be allowed to settle in the region of Goshen, for all shepherds are detestable to the Egyptians.”"
        },
        {
          "version": "NLT",
          "text": "you must tell him, ‘We, your servants, have raised livestock all our lives, as our ancestors have always done.’ When you tell him this, he will let you live here in the region of Goshen, for the Egyptians despise shepherds.”"
        },
        {
          "version": "ESV",
          "text": "you shall say, ‘Your servants have been keepers of livestock from our youth even until now, both we and our fathers,’ in order that you may dwell in the land of Goshen, for every shepherd is an abomination to the Egyptians.”"
        },
        {
          "version": "NKJV",
          "text": "that you shall say, ‘Your servants’ occupation has been with livestock from our youth even till now, both we and also our fathers,’ that you may dwell in the land of Goshen; for every shepherd is an abomination to the Egyptians.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 8:26",
          "text": "But Moses replied, “It would not be right to do that, because the sacrifices we offer to the LORD our God would be detestable to the Egyptians. If we offer sacrifices that are detestable before the Egyptians, will they not stone us?"
        },
        {
          "reference": "Genesis 43:32",
          "text": "They separately served Joseph, his brothers, and the Egyptians. They ate separately because the Egyptians would not eat with the Hebrews, since that was detestable to them."
        },
        {
          "reference": "Genesis 47:3-4",
          "text": "“What is your occupation?” Pharaoh asked Joseph’s brothers. “Your servants are shepherds,” they replied, “both we and our fathers.” / Then they said to Pharaoh, “We have come to live in the land for a time, because there is no pasture for the flocks of your servants, since the famine in the land of Canaan has been severe. So now, please allow your servants to settle in the land of Goshen.”"
        },
        {
          "reference": "Genesis 37:2",
          "text": "This is the account of Jacob. When Joseph was seventeen years old, he was tending the flock with his brothers, the sons of his father’s wives Bilhah and Zilpah, and he brought their father a bad report about them."
        },
        {
          "reference": "1 Samuel 16:11",
          "text": "And Samuel asked him, “Are these all the sons you have?” “There is still the youngest,” Jesse replied, “but he is tending the sheep.” “Send for him,” Samuel replied. “For we will not sit down to eat until he arrives.”"
        },
        {
          "reference": "1 Samuel 17:15",
          "text": "but David went back and forth from Saul to tend his father’s sheep in Bethlehem."
        },
        {
          "reference": "1 Samuel 17:34-36",
          "text": "David replied, “Your servant has been tending his father’s sheep, and whenever a lion or a bear came and carried off a lamb from the flock, / I went after it, struck it down, and delivered the lamb from its mouth. If it reared up against me, I would grab it by its fur, strike it down, and kill it. / Your servant has killed lions and bears; this uncircumcised Philistine will be like one of them, for he has defied the armies of the living God.”"
        },
        {
          "reference": "2 Samuel 7:8",
          "text": "Now then, you are to tell My servant David that this is what the LORD of Hosts says: I took you from the pasture, from following the flock, to be the ruler over My people Israel."
        },
        {
          "reference": "Amos 1:1",
          "text": "These are the words of Amos, who was among the sheepherders of Tekoa—what he saw concerning Israel two years before the earthquake, in the days when Uzziah was king of Judah and Jeroboam son of Jehoash was king of Israel."
        },
        {
          "reference": "Luke 2:8",
          "text": "And there were shepherds residing in the fields nearby, keeping watch over their flocks by night."
        },
        {
          "reference": "John 10:11-14",
          "text": "I am the good shepherd. The good shepherd lays down His life for the sheep. / The hired hand is not the shepherd, and the sheep are not his own. When he sees the wolf coming, he abandons the sheep and runs away. Then the wolf pounces on them and scatters the flock. / The man runs away because he is a hired servant and is unconcerned for the sheep. ..."
        },
        {
          "reference": "Matthew 9:36",
          "text": "When He saw the crowds, He was moved with compassion for them, because they were harassed and helpless, like sheep without a shepherd."
        },
        {
          "reference": "Matthew 25:32-33",
          "text": "All the nations will be gathered before Him, and He will separate the people one from another, as a shepherd separates the sheep from the goats. / He will place the sheep on His right and the goats on His left."
        },
        {
          "reference": "Hebrews 13:20",
          "text": "Now may the God of peace, who through the blood of the eternal covenant brought back from the dead our Lord Jesus, that great Shepherd of the sheep,"
        },
        {
          "reference": "1 Peter 5:2-4",
          "text": "Be shepherds of God’s flock that is among you, watching over them not out of compulsion, but willingly, as God would have you; not out of greed, but out of eagerness; / not lording it over those entrusted to you, but being examples to the flock. / And when the Chief Shepherd appears, you will receive the crown of glory that will never fade away."
        }
      ]
    }
  ]
}