{
  "book": "genesis",
  "chapter": 47,
  "verses": [
    {
      "reference": "Genesis 47:1",
      "book": "Genesis",
      "chapter": 47,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph went and told Pharaoh, “My father and brothers, with their flocks and herds and everything they own, have come from the land of Canaan and are now in Goshen.”"
        },
        {
          "version": "NLT",
          "text": "Then Joseph went to see Pharaoh and told him, “My father and my brothers have arrived from the land of Canaan. They have come with all their flocks and herds and possessions, and they are now in the region of Goshen.”"
        },
        {
          "version": "ESV",
          "text": "So Joseph went in and told Pharaoh, “My father and my brothers, with their flocks and herds and all that they possess, have come from the land of Canaan. They are now in the land of Goshen.”"
        },
        {
          "version": "NKJV",
          "text": "Then Joseph went and told Pharaoh, and said, “My father and my brothers, their flocks and their herds and all that they possess, have come from the land of Canaan; and indeed they are in the land of Goshen.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 46:31-34",
          "text": "Joseph said to his brothers and to his father’s household, “I will go up and inform Pharaoh: ‘My brothers and my father’s household from the land of Canaan have come to me. / The men are shepherds; they raise livestock, and they have brought their flocks and herds and all that they own.’ / When Pharaoh summons you and asks, ‘What is your occupation?’ ..."
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Acts 7:11-14",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. ..."
        },
        {
          "reference": "Genesis 45:9-11",
          "text": "Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay. / You shall settle in the land of Goshen and be near me—you and your children and grandchildren, your flocks and herds, and everything you own. / And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Exodus 12:40-41",
          "text": "Now the duration of the Israelites’ stay in Egypt was 430 years. / At the end of the 430 years, to the very day, all the LORD’s divisions went out of the land of Egypt."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 41:54-57",
          "text": "the seven years of famine began, just as Joseph had said. And although there was famine in every country, there was food throughout the land of Egypt. / When extreme hunger came to all the land of Egypt and the people cried out to Pharaoh for food, he told all the Egyptians, “Go to Joseph and do whatever he tells you.” / When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. ..."
        },
        {
          "reference": "Genesis 50:22-23",
          "text": "Now Joseph and his father’s household remained in Egypt, and Joseph lived to the age of 110. / He saw Ephraim’s sons to the third generation, and indeed the sons of Machir son of Manasseh were brought up on Joseph’s knees."
        },
        {
          "reference": "Exodus 3:7-10",
          "text": "The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings. / I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites. / And now the cry of the Israelites has reached Me, and I have seen how severely the Egyptians are oppressing them. ..."
        },
        {
          "reference": "Acts 7:6-7",
          "text": "God told him that his descendants would be foreigners in a strange land, and that they would be enslaved and mistreated four hundred years. / ‘But I will punish the nation that enslaves them,’ God said, ‘and afterward they will come forth and worship Me in this place.’"
        },
        {
          "reference": "Genesis 12:10",
          "text": "Now there was a famine in the land. So Abram went down to Egypt to live there for a while because the famine was severe."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        }
      ]
    },
    {
      "reference": "Genesis 47:2",
      "book": "Genesis",
      "chapter": 47,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "He chose five of his brothers and presented them before Pharaoh."
        },
        {
          "version": "NLT",
          "text": "Joseph took five of his brothers with him and presented them to Pharaoh."
        },
        {
          "version": "ESV",
          "text": "And from among his brothers he took five men and presented them to Pharaoh."
        },
        {
          "version": "NKJV",
          "text": "And he took five men from among his brothers and presented them to Pharaoh."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 18:21-22",
          "text": "Furthermore, select capable men from among the people—God-fearing, trustworthy men who are averse to dishonest gain. Appoint them over the people as leaders of thousands, of hundreds, of fifties, and of tens. / Have these men judge the people at all times. Then they can bring you any major issue, but all minor cases they can judge on their own, so that your load may be lightened as they share it with you."
        },
        {
          "reference": "Acts 7:13-14",
          "text": "On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. / Then Joseph sent for his father Jacob and all his relatives, seventy-five in all."
        },
        {
          "reference": "Genesis 46:31-34",
          "text": "Joseph said to his brothers and to his father’s household, “I will go up and inform Pharaoh: ‘My brothers and my father’s household from the land of Canaan have come to me. / The men are shepherds; they raise livestock, and they have brought their flocks and herds and all that they own.’ / When Pharaoh summons you and asks, ‘What is your occupation?’ ..."
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Acts 7:10",
          "text": "and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 45:16-20",
          "text": "When the news reached Pharaoh’s house that Joseph’s brothers had come, Pharaoh and his servants were pleased. / Pharaoh said to Joseph, “Tell your brothers, ‘Do as follows: Load your animals and return to the land of Canaan. / Then bring your father and your families and return to me. I will give you the best of the land of Egypt, and you shall eat from the fat of the land.’ ..."
        },
        {
          "reference": "Exodus 12:37-38",
          "text": "The Israelites journeyed from Rameses to Succoth with about 600,000 men on foot, besides women and children. / And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Genesis 50:4-6",
          "text": "When the days of mourning had passed, Joseph said to Pharaoh’s court, “If I have found favor in your eyes, please tell Pharaoh that / my father made me swear an oath when he said, ‘I am about to die. You must bury me in the tomb that I dug for myself in the land of Canaan.’ Now let me go and bury my father, and then return.” / Pharaoh replied, “Go up and bury your father, as he made you swear to do.”"
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Exodus 3:10-12",
          "text": "Therefore, go! I am sending you to Pharaoh to bring My people the Israelites out of Egypt.” / But Moses asked God, “Who am I, that I should go to Pharaoh and bring the Israelites out of Egypt?” / “I will surely be with you,” God said, “and this will be the sign to you that I have sent you: When you have brought the people out of Egypt, all of you will worship God on this mountain.”"
        },
        {
          "reference": "Acts 7:6-7",
          "text": "God told him that his descendants would be foreigners in a strange land, and that they would be enslaved and mistreated four hundred years. / ‘But I will punish the nation that enslaves them,’ God said, ‘and afterward they will come forth and worship Me in this place.’"
        },
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        }
      ]
    },
    {
      "reference": "Genesis 47:3",
      "book": "Genesis",
      "chapter": 47,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Pharaoh asked the brothers, “What is your occupation?” “Your servants are shepherds,” they replied to Pharaoh, “just as our fathers were.”"
        },
        {
          "version": "NLT",
          "text": "And Pharaoh asked the brothers, “What is your occupation?” They replied, “We, your servants, are shepherds, just like our ancestors."
        },
        {
          "version": "ESV",
          "text": "Pharaoh said to his brothers, “What is your occupation?” And they said to Pharaoh, “Your servants are shepherds, as our fathers were.”"
        },
        {
          "version": "NKJV",
          "text": "Then Pharaoh said to his brothers, “What is your occupation?” And they said to Pharaoh, “Your servants are shepherds, both we and also our fathers.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Exodus 1:13-14",
          "text": "They worked the Israelites ruthlessly / and made their lives bitter with hard labor in brick and mortar, and with all kinds of work in the fields. Every service they imposed was harsh."
        },
        {
          "reference": "Exodus 5:4-5",
          "text": "But the king of Egypt said to them, “Moses and Aaron, why do you draw the people away from their work? Get back to your labor!” / Pharaoh also said, “Look, the people of the land are now numerous, and you would be stopping them from their labor.”"
        },
        {
          "reference": "Exodus 6:6",
          "text": "Therefore tell the Israelites: ‘I am the LORD, and I will bring you out from under the yoke of the Egyptians and deliver you from their bondage. I will redeem you with an outstretched arm and with mighty acts of judgment."
        },
        {
          "reference": "Exodus 6:9",
          "text": "Moses relayed this message to the Israelites, but on account of their broken spirit and cruel bondage, they did not listen to him."
        },
        {
          "reference": "Exodus 6:11",
          "text": "“Go and tell Pharaoh king of Egypt to let the Israelites go out of his land.”"
        },
        {
          "reference": "Exodus 6:13",
          "text": "Then the LORD spoke to Moses and Aaron and gave them a charge concerning both the Israelites and Pharaoh king of Egypt, to bring the Israelites out of the land of Egypt."
        },
        {
          "reference": "Exodus 6:26",
          "text": "It was this Aaron and Moses to whom the LORD said, “Bring the Israelites out of the land of Egypt by their divisions.”"
        },
        {
          "reference": "Exodus 6:28-30",
          "text": "Now on the day that the LORD spoke to Moses in Egypt, / He said to him, “I am the LORD; tell Pharaoh king of Egypt everything I say to you.” / But in the LORD’s presence Moses replied, “Since I am unskilled in speech, why would Pharaoh listen to me?”"
        },
        {
          "reference": "Exodus 7:16",
          "text": "Then say to him, ‘The LORD, the God of the Hebrews, has sent me to tell you: Let My people go, so that they may worship Me in the wilderness. But until now you have not listened."
        },
        {
          "reference": "Exodus 8:1",
          "text": "Then the LORD said to Moses, “Go to Pharaoh and tell him that this is what the LORD says: ‘Let My people go, so that they may worship Me."
        },
        {
          "reference": "Exodus 9:1",
          "text": "Then the LORD said to Moses, “Go to Pharaoh and tell him that this is what the LORD, the God of the Hebrews, says: ‘Let My people go, so that they may worship Me."
        },
        {
          "reference": "Exodus 9:13",
          "text": "Then the LORD said to Moses, “Get up early in the morning, stand before Pharaoh, and tell him that this is what the LORD, the God of the Hebrews, says: ‘Let My people go, so that they may worship Me."
        },
        {
          "reference": "Exodus 10:3",
          "text": "So Moses and Aaron went to Pharaoh and told him, “This is what the LORD, the God of the Hebrews, says: ‘How long will you refuse to humble yourself before Me? Let My people go, so that they may worship Me."
        },
        {
          "reference": "Exodus 12:31",
          "text": "Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested."
        }
      ]
    },
    {
      "reference": "Genesis 47:4",
      "book": "Genesis",
      "chapter": 47,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "They also said to him, “We have come to live here for a while, because the famine is severe in Canaan and your servants’ flocks have no pasture. So now, please let your servants settle in Goshen.”"
        },
        {
          "version": "NLT",
          "text": "We have come to live here in Egypt for a while, for there is no pasture for our flocks in Canaan. The famine is very severe there. So please, we request permission to live in the region of Goshen.”"
        },
        {
          "version": "ESV",
          "text": "They said to Pharaoh, “We have come to sojourn in the land, for there is no pasture for your servants’ flocks, for the famine is severe in the land of Canaan. And now, please let your servants dwell in the land of Goshen.”"
        },
        {
          "version": "NKJV",
          "text": "And they said to Pharaoh, “We have come to dwell in the land, because your servants have no pasture for their flocks, for the famine is severe in the land of Canaan. Now therefore, please let your servants dwell in the land of Goshen.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 12:48-49",
          "text": "If a foreigner resides with you and wants to celebrate the LORD’s Passover, all the males in the household must be circumcised; then he may come near to celebrate it, and he shall be like a native of the land. But no uncircumcised man may eat of it. / The same law shall apply to both the native and the foreigner who resides among you.”"
        },
        {
          "reference": "Leviticus 25:35-36",
          "text": "Now if your countryman becomes destitute and cannot support himself among you, then you are to help him as you would a foreigner or stranger, so that he can continue to live among you. / Do not take any interest or profit from him, but fear your God, that your countryman may live among you."
        },
        {
          "reference": "Deuteronomy 10:18-19",
          "text": "He executes justice for the fatherless and widow, and He loves the foreigner, giving him food and clothing. / So you also must love the foreigner, since you yourselves were foreigners in the land of Egypt."
        },
        {
          "reference": "Psalm 105:23",
          "text": "Then Israel entered Egypt; Jacob dwelt in the land of Ham."
        },
        {
          "reference": "Isaiah 19:23-25",
          "text": "In that day there will be a highway from Egypt to Assyria. The Assyrians will go to Egypt, and the Egyptians to Assyria. The Egyptians and Assyrians will worship together. / In that day Israel will join a three-party alliance with Egypt and Assyria—a blessing upon the earth. / The LORD of Hosts will bless them, saying, “Blessed be Egypt My people, Assyria My handiwork, and Israel My inheritance.”"
        },
        {
          "reference": "Acts 7:11-15",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. ..."
        },
        {
          "reference": "Hebrews 11:9",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Deuteronomy 26:5",
          "text": "and you are to declare before the LORD your God, “My father was a wandering Aramean, and he went down to Egypt few in number and lived there and became a great nation, mighty and numerous."
        },
        {
          "reference": "Psalm 105:13",
          "text": "they wandered from nation to nation, from one kingdom to another."
        },
        {
          "reference": "Acts 7:6",
          "text": "God told him that his descendants would be foreigners in a strange land, and that they would be enslaved and mistreated four hundred years."
        },
        {
          "reference": "Hebrews 11:13-16",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth. / Now those who say such things show that they are seeking a country of their own. / If they had been thinking of the country they had left, they would have had opportunity to return. ..."
        },
        {
          "reference": "Exodus 22:21",
          "text": "You must not exploit or oppress a foreign resident, for you yourselves were foreigners in the land of Egypt."
        },
        {
          "reference": "Leviticus 19:34",
          "text": "You must treat the foreigner living among you as native-born and love him as yourself, for you were foreigners in the land of Egypt. I am the LORD your God."
        },
        {
          "reference": "Jeremiah 42:10-12",
          "text": "‘If you will indeed stay in this land, then I will build you up and not tear you down; I will plant you and not uproot you, for I will relent of the disaster I have brought upon you. / Do not be afraid of the king of Babylon, whom you now fear; do not be afraid of him, declares the LORD, for I am with you to save you and deliver you from him. / And I will show you compassion, and he will have compassion on you and restore you to your own land.’"
        }
      ]
    },
    {
      "reference": "Genesis 47:5",
      "book": "Genesis",
      "chapter": 47,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "Pharaoh said to Joseph, “Your father and your brothers have come to you,"
        },
        {
          "version": "NLT",
          "text": "Then Pharaoh said to Joseph, “Now that your father and brothers have joined you here,"
        },
        {
          "version": "ESV",
          "text": "Then Pharaoh said to Joseph, “Your father and your brothers have come to you."
        },
        {
          "version": "NKJV",
          "text": "Then Pharaoh spoke to Joseph, saying, “Your father and your brothers have come to you."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:17-18",
          "text": "Pharaoh said to Joseph, “Tell your brothers, ‘Do as follows: Load your animals and return to the land of Canaan. / Then bring your father and your families and return to me. I will give you the best of the land of Egypt, and you shall eat from the fat of the land.’"
        },
        {
          "reference": "Genesis 46:31-34",
          "text": "Joseph said to his brothers and to his father’s household, “I will go up and inform Pharaoh: ‘My brothers and my father’s household from the land of Canaan have come to me. / The men are shepherds; they raise livestock, and they have brought their flocks and herds and all that they own.’ / When Pharaoh summons you and asks, ‘What is your occupation?’ ..."
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Genesis 50:4-6",
          "text": "When the days of mourning had passed, Joseph said to Pharaoh’s court, “If I have found favor in your eyes, please tell Pharaoh that / my father made me swear an oath when he said, ‘I am about to die. You must bury me in the tomb that I dug for myself in the land of Canaan.’ Now let me go and bury my father, and then return.” / Pharaoh replied, “Go up and bury your father, as he made you swear to do.”"
        },
        {
          "reference": "Exodus 12:40-41",
          "text": "Now the duration of the Israelites’ stay in Egypt was 430 years. / At the end of the 430 years, to the very day, all the LORD’s divisions went out of the land of Egypt."
        },
        {
          "reference": "Acts 7:11-14",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. ..."
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Exodus 1:1-7",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Genesis 41:39-41",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.”"
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Exodus 3:7-10",
          "text": "The LORD said, “I have indeed seen the affliction of My people in Egypt. I have heard them crying out because of their oppressors, and I am aware of their sufferings. / I have come down to rescue them from the hand of the Egyptians and to bring them up out of that land to a good and spacious land, a land flowing with milk and honey—the home of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites. / And now the cry of the Israelites has reached Me, and I have seen how severely the Egyptians are oppressing them. ..."
        },
        {
          "reference": "Acts 7:6-7",
          "text": "God told him that his descendants would be foreigners in a strange land, and that they would be enslaved and mistreated four hundred years. / ‘But I will punish the nation that enslaves them,’ God said, ‘and afterward they will come forth and worship Me in this place.’"
        },
        {
          "reference": "Genesis 12:10",
          "text": "Now there was a famine in the land. So Abram went down to Egypt to live there for a while because the famine was severe."
        }
      ]
    },
    {
      "reference": "Genesis 47:6",
      "book": "Genesis",
      "chapter": 47,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "and the land of Egypt is before you; settle your father and your brothers in the best part of the land. Let them live in Goshen. And if you know of any among them with special ability, put them in charge of my own livestock.”"
        },
        {
          "version": "NLT",
          "text": "choose any place in the entire land of Egypt for them to live. Give them the best land of Egypt. Let them live in the region of Goshen. And if any of them have special skills, put them in charge of my livestock, too.”"
        },
        {
          "version": "ESV",
          "text": "The land of Egypt is before you. Settle your father and your brothers in the best of the land. Let them settle in the land of Goshen, and if you know any able men among them, put them in charge of my livestock.”"
        },
        {
          "version": "NKJV",
          "text": "The land of Egypt is before you. Have your father and brothers dwell in the best of the land; let them dwell in the land of Goshen. And if you know any competent men among them, then make them chief herdsmen over my livestock.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 12:37-38",
          "text": "The Israelites journeyed from Rameses to Succoth with about 600,000 men on foot, besides women and children. / And a mixed multitude also went up with them, along with great droves of livestock, both flocks and herds."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:11-14",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. ..."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Acts 7:17-19",
          "text": "As the time drew near for God to fulfill His promise to Abraham, our people in Egypt increased greatly in number. / Then another king, who knew nothing of Joseph, arose over Egypt. / He exploited our people and oppressed our fathers, forcing them to abandon their infants so they would die."
        },
        {
          "reference": "Psalm 105:23",
          "text": "Then Israel entered Egypt; Jacob dwelt in the land of Ham."
        },
        {
          "reference": "Psalm 105:24",
          "text": "And the LORD made His people very fruitful, more numerous than their foes,"
        },
        {
          "reference": "Psalm 105:25",
          "text": "whose hearts He turned to hate His people, to conspire against His servants."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Deuteronomy 26:5",
          "text": "and you are to declare before the LORD your God, “My father was a wandering Aramean, and he went down to Egypt few in number and lived there and became a great nation, mighty and numerous."
        },
        {
          "reference": "Deuteronomy 10:22",
          "text": "Your fathers went down to Egypt, seventy in all, and now the LORD your God has made you as numerous as the stars in the sky."
        },
        {
          "reference": "Isaiah 52:4",
          "text": "For this is what the Lord GOD says: “At first My people went down to Egypt to live, then Assyria oppressed them without cause."
        }
      ]
    },
    {
      "reference": "Genesis 47:7",
      "book": "Genesis",
      "chapter": 47,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Joseph brought his father Jacob in and presented him before Pharaoh. After Jacob blessed Pharaoh,"
        },
        {
          "version": "NLT",
          "text": "Then Joseph brought in his father, Jacob, and presented him to Pharaoh. And Jacob blessed Pharaoh."
        },
        {
          "version": "ESV",
          "text": "Then Joseph brought in Jacob his father and stood him before Pharaoh, and Jacob blessed Pharaoh."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph brought in his father Jacob and set him before Pharaoh; and Jacob blessed Pharaoh."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 18:7-12",
          "text": "So Moses went out to meet his father-in-law and bowed down and kissed him. They greeted each other and went into the tent. / Then Moses recounted to his father-in-law all that the LORD had done to Pharaoh and the Egyptians for Israel’s sake, all the hardships they had encountered along the way, and how the LORD had delivered them. / And Jethro rejoiced over all the good things the LORD had done for Israel, whom He had rescued from the hand of the Egyptians. ..."
        },
        {
          "reference": "Hebrews 7:7",
          "text": "And indisputably, the lesser is blessed by the greater."
        },
        {
          "reference": "1 Kings 8:66",
          "text": "On the fifteenth day Solomon sent the people away. So they blessed the king and went home, joyful and glad in heart for all the good things that the LORD had done for His servant David and for His people Israel."
        },
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 27:27-29",
          "text": "So he came near and kissed him. When Isaac smelled his clothing, he blessed him and said: “Ah, the smell of my son is like the smell of a field that the LORD has blessed. / May God give to you the dew of heaven and the richness of the earth—an abundance of grain and new wine. / May peoples serve you and nations bow down to you. May you be the master of your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed, and those who bless you be blessed.”"
        },
        {
          "reference": "Genesis 28:3-4",
          "text": "May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples. / And may He give the blessing of Abraham to you and your descendants, so that you may possess the land where you dwell as a foreigner, the land God gave to Abraham.”"
        },
        {
          "reference": "Genesis 32:28-29",
          "text": "Then the man said, “Your name will no longer be Jacob, but Israel, because you have struggled with God and with men, and you have prevailed.” / And Jacob requested, “Please tell me your name.” But he replied, “Why do you ask my name?” Then he blessed Jacob there."
        },
        {
          "reference": "Genesis 48:9-20",
          "text": "Joseph said to his father, “They are the sons God has given me in this place.” So Jacob said, “Please bring them to me, that I may bless them.” / Now Israel’s eyesight was poor because of old age; he could hardly see. Joseph brought his sons to him, and his father kissed them and embraced them. / “I never expected to see your face again,” Israel said to Joseph, “but now God has let me see your children as well.” ..."
        },
        {
          "reference": "Genesis 49:28",
          "text": "These are the tribes of Israel, twelve in all, and this was what their father said to them. He blessed them, and he blessed each one with a suitable blessing."
        },
        {
          "reference": "Numbers 6:23-27",
          "text": "“Tell Aaron and his sons: This is how you are to bless the Israelites. Say to them: / ‘May the LORD bless you and keep you; / may the LORD cause His face to shine upon you and be gracious to you; ..."
        },
        {
          "reference": "Deuteronomy 33:1-29",
          "text": "This is the blessing that Moses the man of God pronounced upon the Israelites before his death. / He said: “The LORD came from Sinai and dawned upon us from Seir; He shone forth from Mount Paran and came with myriads of holy ones, with flaming fire at His right hand. / Surely You love the people; all the holy ones are in Your hand, and they sit down at Your feet; each receives Your words— ..."
        },
        {
          "reference": "1 Samuel 2:20",
          "text": "And Eli would bless Elkanah and his wife, saying, “May the LORD give you children by this woman in place of the one she dedicated to the LORD.” Then they would go home."
        },
        {
          "reference": "2 Samuel 6:18",
          "text": "When David had finished sacrificing the burnt offerings and peace offerings, he blessed the people in the name of the LORD of Hosts."
        },
        {
          "reference": "1 Chronicles 16:43",
          "text": "Then all the people departed for their homes, and David returned home to bless his household."
        },
        {
          "reference": "Psalm 67:1",
          "text": "For the choirmaster. With stringed instruments. A Psalm. A song. May God be gracious to us and bless us, and cause His face to shine upon us, Selah"
        }
      ]
    },
    {
      "reference": "Genesis 47:8",
      "book": "Genesis",
      "chapter": 47,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "Pharaoh asked him, “How old are you?”"
        },
        {
          "version": "NLT",
          "text": "“How old are you?” Pharaoh asked him."
        },
        {
          "version": "ESV",
          "text": "And Pharaoh said to Jacob, “How many are the days of the years of your life?”"
        },
        {
          "version": "NKJV",
          "text": "Pharaoh said to Jacob, “How old are you?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:4-6",
          "text": "When the LORD saw that he had gone over to look, God called out to him from within the bush, “Moses, Moses!” “Here I am,” he answered. / “Do not come any closer,” God said. “Take off your sandals, for the place where you are standing is holy ground.” / Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Acts 7:2-4",
          "text": "And Stephen declared: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Haran, / and told him, ‘Leave your country and your kindred and go to the land I will show you.’ / So Abraham left the land of the Chaldeans and settled in Haran. After his father died, God brought him out of that place and into this land where you are now living."
        },
        {
          "reference": "Hebrews 11:9-10",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise. / For he was looking forward to the city with foundations, whose architect and builder is God."
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 15:13-16",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions. / You, however, will go to your fathers in peace and be buried at a ripe old age. ..."
        },
        {
          "reference": "Genesis 46:2-4",
          "text": "And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. / I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 35:9-12",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him. / And God said to him, “Though your name is Jacob, you will no longer be called Jacob. Instead, your name will be Israel.” So God named him Israel. / And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. ..."
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Exodus 6:2-5",
          "text": "God also told Moses, “I am the LORD. / I appeared to Abraham, to Isaac, and to Jacob as God Almighty, but by My name the LORD I did not make Myself known to them. / I also established My covenant with them to give them the land of Canaan, the land where they lived as foreigners. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Hebrews 11:13-16",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth. / Now those who say such things show that they are seeking a country of their own. / If they had been thinking of the country they had left, they would have had opportunity to return. ..."
        }
      ]
    },
    {
      "reference": "Genesis 47:9",
      "book": "Genesis",
      "chapter": 47,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "And Jacob said to Pharaoh, “The years of my pilgrimage are a hundred and thirty. My years have been few and difficult, and they do not equal the years of the pilgrimage of my fathers.”"
        },
        {
          "version": "NLT",
          "text": "Jacob replied, “I have traveled this earth for 130 hard years. But my life has been short compared to the lives of my ancestors.”"
        },
        {
          "version": "ESV",
          "text": "And Jacob said to Pharaoh, “The days of the years of my sojourning are 130 years. Few and evil have been the days of the years of my life, and they have not attained to the days of the years of the life of my fathers in the days of their sojourning.”"
        },
        {
          "version": "NKJV",
          "text": "And Jacob said to Pharaoh, “The days of the years of my pilgrimage are one hundred and thirty years; few and evil have been the days of the years of my life, and they have not attained to the days of the years of the life of my fathers in the days of their pilgrimage.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:13",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth."
        },
        {
          "reference": "Psalm 39:12",
          "text": "Hear my prayer, O LORD, and give ear to my cry for help; do not be deaf to my weeping. For I am a foreigner dwelling with You, a stranger like all my fathers."
        },
        {
          "reference": "Psalm 90:10",
          "text": "The length of our days is seventy years—or eighty if we are strong—yet their pride is but labor and sorrow, for they quickly pass, and we fly away."
        },
        {
          "reference": "1 Chronicles 29:15",
          "text": "For we are foreigners and strangers in Your presence, as were all our forefathers. Our days on earth are like a shadow, without hope."
        },
        {
          "reference": "Job 14:1-2",
          "text": "“Man, who is born of woman, is short of days and full of trouble. / Like a flower, he comes forth, then withers away; like a fleeting shadow, he does not endure."
        },
        {
          "reference": "James 4:14",
          "text": "You do not even know what will happen tomorrow! What is your life? You are a mist that appears for a little while and then vanishes."
        },
        {
          "reference": "2 Corinthians 5:1-4",
          "text": "For we know that if the earthly tent we live in is dismantled, we have a building from God, an eternal house in heaven, not built by human hands. / For in this tent we groan, longing to be clothed with our heavenly dwelling, / because when we are clothed, we will not be found naked. ..."
        },
        {
          "reference": "Philippians 3:20-21",
          "text": "But our citizenship is in heaven, and we eagerly await a Savior from there, the Lord Jesus Christ, / who, by the power that enables Him to subject all things to Himself, will transform our lowly bodies to be like His glorious body."
        },
        {
          "reference": "1 Peter 2:11",
          "text": "Beloved, I urge you, as foreigners and exiles, to abstain from the desires of the flesh, which war against your soul."
        },
        {
          "reference": "Hebrews 11:9-10",
          "text": "By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise. / For he was looking forward to the city with foundations, whose architect and builder is God."
        },
        {
          "reference": "Ecclesiastes 12:7",
          "text": "before the dust returns to the ground from which it came and the spirit returns to God who gave it."
        },
        {
          "reference": "Isaiah 40:6-8",
          "text": "A voice says, “Cry out!” And I asked, “What should I cry out?” “All flesh is like grass, and all its glory like the flowers of the field. / The grass withers and the flowers fall when the breath of the LORD blows on them; indeed, the people are grass. / The grass withers and the flowers fall, but the word of our God stands forever.”"
        },
        {
          "reference": "1 Peter 1:24",
          "text": "For, “All flesh is like grass, and all its glory like the flowers of the field; the grass withers and the flowers fall,"
        },
        {
          "reference": "2 Samuel 19:34-35",
          "text": "But Barzillai replied, “How many years of my life remain, that I should go up to Jerusalem with the king? / I am now eighty years old. Can I discern what is good and what is not? Can your servant taste what he eats or drinks? Can I still hear the voice of singing men and women? Why should your servant be an added burden to my lord the king?"
        },
        {
          "reference": "Job 7:6-7",
          "text": "My days are swifter than a weaver’s shuttle; they come to an end without hope. / Remember that my life is but a breath. My eyes will never again see happiness."
        }
      ]
    },
    {
      "reference": "Genesis 47:10",
      "book": "Genesis",
      "chapter": 47,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob blessed Pharaoh and went out from his presence."
        },
        {
          "version": "NLT",
          "text": "Then Jacob blessed Pharaoh again before leaving his court."
        },
        {
          "version": "ESV",
          "text": "And Jacob blessed Pharaoh and went out from the presence of Pharaoh."
        },
        {
          "version": "NKJV",
          "text": "So Jacob blessed Pharaoh, and went out from before Pharaoh."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 7:7",
          "text": "And indisputably, the lesser is blessed by the greater."
        },
        {
          "reference": "Genesis 27:27-29",
          "text": "So he came near and kissed him. When Isaac smelled his clothing, he blessed him and said: “Ah, the smell of my son is like the smell of a field that the LORD has blessed. / May God give to you the dew of heaven and the richness of the earth—an abundance of grain and new wine. / May peoples serve you and nations bow down to you. May you be the master of your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed, and those who bless you be blessed.”"
        },
        {
          "reference": "Genesis 28:1-4",
          "text": "So Isaac called for Jacob and blessed him. “Do not take a wife from the Canaanite women,” he commanded. / “Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother. / May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples. ..."
        },
        {
          "reference": "Genesis 48:15-16",
          "text": "Then he blessed Joseph and said: “May the God before whom my fathers Abraham and Isaac walked, the God who has been my shepherd all my life to this day, / the angel who has redeemed me from all harm—may He bless these boys. And may they be called by my name and the names of my fathers Abraham and Isaac, and may they grow into a multitude upon the earth.”"
        },
        {
          "reference": "Genesis 49:28",
          "text": "These are the tribes of Israel, twelve in all, and this was what their father said to them. He blessed them, and he blessed each one with a suitable blessing."
        },
        {
          "reference": "Numbers 6:23-27",
          "text": "“Tell Aaron and his sons: This is how you are to bless the Israelites. Say to them: / ‘May the LORD bless you and keep you; / may the LORD cause His face to shine upon you and be gracious to you; ..."
        },
        {
          "reference": "Deuteronomy 33:1",
          "text": "This is the blessing that Moses the man of God pronounced upon the Israelites before his death."
        },
        {
          "reference": "1 Kings 8:14-15",
          "text": "And as the whole assembly of Israel stood there, the king turned around and blessed them all / and said: “Blessed be the LORD, the God of Israel, who has fulfilled with His own hand what He spoke with His mouth to my father David, saying,"
        },
        {
          "reference": "1 Chronicles 29:10",
          "text": "Then David blessed the LORD in the sight of all the assembly and said: “May You be blessed, O LORD, God of our father Israel, from everlasting to everlasting."
        },
        {
          "reference": "Psalm 72:17",
          "text": "May his name endure forever; may his name continue as long as the sun shines. In him may all nations be blessed; may they call him blessed."
        },
        {
          "reference": "Psalm 128:5-6",
          "text": "May the LORD bless you from Zion, that you may see the prosperity of Jerusalem all the days of your life, / that you may see your children’s children. Peace be upon Israel!"
        },
        {
          "reference": "Isaiah 65:16",
          "text": "Whoever invokes a blessing in the land will do so by the God of truth, and whoever takes an oath in the land will swear by the God of truth. For the former troubles will be forgotten and hidden from My sight."
        },
        {
          "reference": "Matthew 5:3-12",
          "text": "“Blessed are the poor in spirit, for theirs is the kingdom of heaven. / Blessed are those who mourn, for they will be comforted. / Blessed are the meek, for they will inherit the earth. ..."
        },
        {
          "reference": "Luke 2:28-32",
          "text": "Simeon took Him in his arms and blessed God, saying: / “Sovereign Lord, as You have promised, You now dismiss Your servant in peace. / For my eyes have seen Your salvation, ..."
        },
        {
          "reference": "Luke 24:50-51",
          "text": "When Jesus had led them out as far as Bethany, He lifted up His hands and blessed them. / While He was blessing them, He left them and was carried up into heaven."
        }
      ]
    },
    {
      "reference": "Genesis 47:11",
      "book": "Genesis",
      "chapter": 47,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "So Joseph settled his father and his brothers in Egypt and gave them property in the best part of the land, the district of Rameses, as Pharaoh directed."
        },
        {
          "version": "NLT",
          "text": "So Joseph assigned the best land of Egypt—the region of Rameses—to his father and his brothers, and he settled them there, just as Pharaoh had commanded."
        },
        {
          "version": "ESV",
          "text": "Then Joseph settled his father and his brothers and gave them a possession in the land of Egypt, in the best of the land, in the land of Rameses, as Pharaoh had commanded."
        },
        {
          "version": "NKJV",
          "text": "And Joseph situated his father and his brothers, and gave them a possession in the land of Egypt, in the best of the land, in the land of Rameses, as Pharaoh had commanded."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Exodus 12:37",
          "text": "The Israelites journeyed from Rameses to Succoth with about 600,000 men on foot, besides women and children."
        },
        {
          "reference": "Exodus 13:20",
          "text": "They set out from Succoth and camped at Etham on the edge of the wilderness."
        },
        {
          "reference": "Exodus 15:22",
          "text": "Then Moses led Israel from the Red Sea, and they went out into the Desert of Shur. For three days they walked in the desert without finding water."
        },
        {
          "reference": "Exodus 16:1",
          "text": "On the fifteenth day of the second month after they had left the land of Egypt, the whole congregation of Israel set out from Elim and came to the Desert of Sin, which is between Elim and Sinai."
        },
        {
          "reference": "Exodus 17:1",
          "text": "Then the whole congregation of Israel left the Desert of Sin, moving from place to place as the LORD commanded. They camped at Rephidim, but there was no water for the people to drink."
        },
        {
          "reference": "Exodus 19:1-2",
          "text": "In the third month, on the same day of the month that the Israelites had left the land of Egypt, they came to the Wilderness of Sinai. / After they had set out from Rephidim, they entered the Wilderness of Sinai, and Israel camped there in front of the mountain."
        },
        {
          "reference": "Numbers 33:5-6",
          "text": "The Israelites set out from Rameses and camped at Succoth. / They set out from Succoth and camped at Etham, on the edge of the wilderness."
        },
        {
          "reference": "Deuteronomy 1:1",
          "text": "These are the words that Moses spoke to all Israel in the wilderness east of the Jordan—in the Arabah opposite Suph—between Paran and Tophel, Laban, Hazeroth, and Dizahab."
        },
        {
          "reference": "Joshua 24:4",
          "text": "and to Isaac I gave Jacob and Esau. I gave Esau Mount Seir to possess, but Jacob and his sons went down to Egypt."
        },
        {
          "reference": "Psalm 105:23",
          "text": "Then Israel entered Egypt; Jacob dwelt in the land of Ham."
        },
        {
          "reference": "Isaiah 52:4",
          "text": "For this is what the Lord GOD says: “At first My people went down to Egypt to live, then Assyria oppressed them without cause."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Acts 7:17",
          "text": "As the time drew near for God to fulfill His promise to Abraham, our people in Egypt increased greatly in number."
        },
        {
          "reference": "Acts 7:18-19",
          "text": "Then another king, who knew nothing of Joseph, arose over Egypt. / He exploited our people and oppressed our fathers, forcing them to abandon their infants so they would die."
        }
      ]
    },
    {
      "reference": "Genesis 47:12",
      "book": "Genesis",
      "chapter": 47,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph also provided his father and his brothers and all his father’s household with food, according to the number of their children."
        },
        {
          "version": "NLT",
          "text": "And Joseph provided food for his father and his brothers in amounts appropriate to the number of their dependents, including the smallest children."
        },
        {
          "version": "ESV",
          "text": "And Joseph provided his father, his brothers, and all his father’s household with food, according to the number of their dependents."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph provided his father, his brothers, and all his father’s household with bread, according to the number in their families."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:11",
          "text": "And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 50:21",
          "text": "Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 16:35",
          "text": "The Israelites ate manna forty years, until they came to a land where they could settle; they ate manna until they reached the border of Canaan."
        },
        {
          "reference": "Deuteronomy 8:3",
          "text": "He humbled you, and in your hunger He gave you manna to eat, which neither you nor your fathers had known, so that you might understand that man does not live on bread alone, but on every word that comes from the mouth of the LORD."
        },
        {
          "reference": "Psalm 37:25",
          "text": "I once was young and now am old, yet never have I seen the righteous abandoned or their children begging for bread."
        },
        {
          "reference": "Psalm 105:16-17",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Psalm 111:5",
          "text": "He provides food for those who fear Him; He remembers His covenant forever."
        },
        {
          "reference": "Proverbs 10:3",
          "text": "The LORD does not let the righteous go hungry, but He denies the craving of the wicked."
        },
        {
          "reference": "Isaiah 33:16",
          "text": "he will dwell on the heights; the mountain fortress will be his refuge; his food will be provided and his water assured."
        },
        {
          "reference": "Isaiah 58:7",
          "text": "Isn’t it to share your bread with the hungry, to bring the poor and homeless into your home, to clothe the naked when you see him, and not to turn away from your own flesh and blood?"
        },
        {
          "reference": "Matthew 6:11",
          "text": "Give us this day our daily bread."
        },
        {
          "reference": "Matthew 6:25-26",
          "text": "Therefore I tell you, do not worry about your life, what you will eat or drink; or about your body, what you will wear. Is not life more than food, and the body more than clothes? / Look at the birds of the air: They do not sow or reap or gather into barns, and yet your heavenly Father feeds them. Are you not much more valuable than they?"
        },
        {
          "reference": "Matthew 25:35-40",
          "text": "For I was hungry and you gave Me something to eat, I was thirsty and you gave Me something to drink, I was a stranger and you took Me in, / I was naked and you clothed Me, I was sick and you looked after Me, I was in prison and you visited Me.’ / Then the righteous will answer Him, ‘Lord, when did we see You hungry and feed You, or thirsty and give You something to drink? ..."
        },
        {
          "reference": "Luke 12:24",
          "text": "Consider the ravens: They do not sow or reap, they have no storehouse or barn; yet God feeds them. How much more valuable you are than the birds!"
        },
        {
          "reference": "John 6:32-35",
          "text": "Jesus said to them, “Truly, truly, I tell you, it was not Moses who gave you the bread from heaven, but it is My Father who gives you the true bread from heaven. / For the bread of God is He who comes down from heaven and gives life to the world.” / “Sir,” they said, “give us this bread at all times.” ..."
        }
      ]
    },
    {
      "reference": "Genesis 47:13",
      "book": "Genesis",
      "chapter": 47,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "There was no food, however, in the whole region because the famine was severe; both Egypt and Canaan wasted away because of the famine."
        },
        {
          "version": "NLT",
          "text": "Meanwhile, the famine became so severe that all the food was used up, and people were starving throughout the lands of Egypt and Canaan."
        },
        {
          "version": "ESV",
          "text": "Now there was no food in all the land, for the famine was very severe, so that the land of Egypt and the land of Canaan languished by reason of the famine."
        },
        {
          "version": "NKJV",
          "text": "Now there was no bread in all the land; for the famine was very severe, so that the land of Egypt and the land of Canaan languished because of the famine."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:54-57",
          "text": "the seven years of famine began, just as Joseph had said. And although there was famine in every country, there was food throughout the land of Egypt. / When extreme hunger came to all the land of Egypt and the people cried out to Pharaoh for food, he told all the Egyptians, “Go to Joseph and do whatever he tells you.” / When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. ..."
        },
        {
          "reference": "Genesis 42:5-6",
          "text": "So the sons of Israel were among those who came to buy grain, since the famine had also spread to the land of Canaan. / Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground."
        },
        {
          "reference": "Genesis 45:6-11",
          "text": "For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt. ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Exodus 16:3",
          "text": "“If only we had died by the LORD’s hand in the land of Egypt!” they said. “There we sat by pots of meat and ate our fill of bread, but you have brought us into this desert to starve this whole assembly to death!”"
        },
        {
          "reference": "Leviticus 26:26",
          "text": "When I cut off your supply of bread, ten women will bake your bread in a single oven and dole out your bread by weight, so that you will eat but not be satisfied."
        },
        {
          "reference": "Deuteronomy 28:48",
          "text": "you will serve your enemies the LORD will send against you in famine, thirst, nakedness, and destitution. He will place an iron yoke on your neck until He has destroyed you."
        },
        {
          "reference": "2 Kings 6:25",
          "text": "So there was a great famine in Samaria. Indeed, they besieged the city so long that a donkey’s head sold for eighty shekels of silver, and a quarter cab of dove’s dung sold for five shekels of silver."
        },
        {
          "reference": "2 Kings 7:4",
          "text": "If we say, ‘Let us go into the city,’ we will die there from the famine in the city; but if we sit here, we will also die. So come now, let us go over to the camp of the Arameans. If they let us live, we will live; if they kill us, we will die.”"
        },
        {
          "reference": "Nehemiah 5:3",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.”"
        },
        {
          "reference": "Psalm 105:16",
          "text": "He called down famine on the land and cut off all their supplies of food."
        },
        {
          "reference": "Isaiah 3:1",
          "text": "For behold, the Lord GOD of Hosts is about to remove from Jerusalem and Judah both supply and support: the whole supply of food and water,"
        },
        {
          "reference": "Jeremiah 14:1-6",
          "text": "This is the word of the LORD that came to Jeremiah concerning the drought: / “Judah mourns and her gates languish. Her people wail for the land, and a cry goes up from Jerusalem. / The nobles send their servants for water; they go to the cisterns, but find no water; their jars return empty. They are ashamed and humiliated; they cover their heads. ..."
        },
        {
          "reference": "Lamentations 5:10",
          "text": "Our skin is as hot as an oven with fever from our hunger."
        }
      ]
    },
    {
      "reference": "Genesis 47:14",
      "book": "Genesis",
      "chapter": 47,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph collected all the money that was to be found in Egypt and Canaan in payment for the grain they were buying, and he brought it to Pharaoh’s palace."
        },
        {
          "version": "NLT",
          "text": "By selling grain to the people, Joseph eventually collected all the money in Egypt and Canaan, and he put the money in Pharaoh’s treasury."
        },
        {
          "version": "ESV",
          "text": "And Joseph gathered up all the money that was found in the land of Egypt and in the land of Canaan, in exchange for the grain that they bought. And Joseph brought the money into Pharaoh’s house."
        },
        {
          "version": "NKJV",
          "text": "And Joseph gathered up all the money that was found in the land of Egypt and in the land of Canaan, for the grain which they bought; and Joseph brought the money into Pharaoh’s house."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:56-57",
          "text": "When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 42:6",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground."
        },
        {
          "reference": "Genesis 45:11",
          "text": "And there I will provide for you, because there will be five more years of famine. Otherwise, you and your household and everything you own will come to destitution.’"
        },
        {
          "reference": "Genesis 47:20-21",
          "text": "So Joseph acquired for Pharaoh all the land in Egypt; the Egyptians, one and all, sold their fields because the famine was so severe upon them. The land became Pharaoh’s, / and Joseph reduced the people to servitude from one end of Egypt to the other."
        },
        {
          "reference": "Exodus 12:35-36",
          "text": "Furthermore, the Israelites acted on Moses’ word and asked the Egyptians for articles of silver and gold, and for clothing. / And the LORD gave the people such favor in the sight of the Egyptians that they granted their request. In this way they plundered the Egyptians."
        },
        {
          "reference": "Exodus 16:3",
          "text": "“If only we had died by the LORD’s hand in the land of Egypt!” they said. “There we sat by pots of meat and ate our fill of bread, but you have brought us into this desert to starve this whole assembly to death!”"
        },
        {
          "reference": "Exodus 16:12",
          "text": "“I have heard the grumbling of the Israelites. Tell them, ‘At twilight you will eat meat, and in the morning you will be filled with bread. Then you will know that I am the LORD your God.’”"
        },
        {
          "reference": "1 Kings 10:14-15",
          "text": "The weight of gold that came to Solomon each year was 666 talents, / not including the revenue from the merchants, traders, and all the Arabian kings and governors of the land."
        },
        {
          "reference": "2 Kings 7:1-2",
          "text": "Then Elisha said, “Hear the word of the LORD! This is what the LORD says: ‘About this time tomorrow at the gate of Samaria, a seah of fine flour will sell for a shekel, and two seahs of barley will sell for a shekel.’” / But the officer on whose arm the king leaned answered the man of God, “Look, even if the LORD were to make windows in heaven, could this really happen?” “You will see it with your own eyes,” replied Elisha, “but you will not eat any of it.”"
        },
        {
          "reference": "2 Kings 7:16",
          "text": "Then the people went out and plundered the camp of the Arameans. It was then that a seah of fine flour sold for a shekel, and two seahs of barley sold for a shekel, according to the word of the LORD."
        },
        {
          "reference": "Nehemiah 5:3",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.”"
        },
        {
          "reference": "Psalm 105:16-17",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave."
        },
        {
          "reference": "Proverbs 11:26",
          "text": "The people will curse the hoarder of grain, but blessing will crown the one who sells it."
        },
        {
          "reference": "Isaiah 23:3",
          "text": "On the great waters came the grain of Shihor; the harvest of the Nile was the revenue of Tyre; she was the merchant of the nations."
        },
        {
          "reference": "Ezekiel 27:17",
          "text": "Judah and the land of Israel traded with you; they exchanged wheat from Minnith, cakes and honey, oil and balm for your merchandise."
        }
      ]
    },
    {
      "reference": "Genesis 47:15",
      "book": "Genesis",
      "chapter": 47,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "When the money of the people of Egypt and Canaan was gone, all Egypt came to Joseph and said, “Give us food. Why should we die before your eyes? Our money is all gone.”"
        },
        {
          "version": "NLT",
          "text": "When the people of Egypt and Canaan ran out of money, all the Egyptians came to Joseph. “Our money is gone!” they cried. “But please give us food, or we will die before your very eyes!”"
        },
        {
          "version": "ESV",
          "text": "And when the money was all spent in the land of Egypt and in the land of Canaan, all the Egyptians came to Joseph and said, “Give us food. Why should we die before your eyes? For our money is gone.”"
        },
        {
          "version": "NKJV",
          "text": "So when the money failed in the land of Egypt and in the land of Canaan, all the Egyptians came to Joseph and said, “Give us bread, for why should we die in your presence? For the money has failed.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:54-57",
          "text": "the seven years of famine began, just as Joseph had said. And although there was famine in every country, there was food throughout the land of Egypt. / When extreme hunger came to all the land of Egypt and the people cried out to Pharaoh for food, he told all the Egyptians, “Go to Joseph and do whatever he tells you.” / When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. ..."
        },
        {
          "reference": "Genesis 42:1-3",
          "text": "When Jacob learned that there was grain in Egypt, he said to his sons, “Why are you staring at one another?” / “Look,” he added, “I have heard that there is grain in Egypt. Go down there and buy some for us, so that we may live and not die.” / So ten of Joseph’s brothers went down to buy grain from Egypt."
        },
        {
          "reference": "Genesis 43:1-2",
          "text": "Now the famine was still severe in the land. / So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.”"
        },
        {
          "reference": "Genesis 45:6-11",
          "text": "For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt. ..."
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 16:3",
          "text": "“If only we had died by the LORD’s hand in the land of Egypt!” they said. “There we sat by pots of meat and ate our fill of bread, but you have brought us into this desert to starve this whole assembly to death!”"
        },
        {
          "reference": "Exodus 16:12-15",
          "text": "“I have heard the grumbling of the Israelites. Tell them, ‘At twilight you will eat meat, and in the morning you will be filled with bread. Then you will know that I am the LORD your God.’” / That evening quail came and covered the camp, and in the morning there was a layer of dew around the camp. / When the layer of dew had evaporated, there were thin flakes on the desert floor, as fine as frost on the ground. ..."
        },
        {
          "reference": "2 Kings 6:25",
          "text": "So there was a great famine in Samaria. Indeed, they besieged the city so long that a donkey’s head sold for eighty shekels of silver, and a quarter cab of dove’s dung sold for five shekels of silver."
        },
        {
          "reference": "2 Kings 7:12",
          "text": "So the king got up in the night and said to his servants, “Let me tell you what the Arameans have done to us. They know we are starving, so they have left the camp to hide in the field, thinking, ‘When they come out of the city, we will take them alive and enter the city.’”"
        },
        {
          "reference": "Nehemiah 5:3",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.”"
        },
        {
          "reference": "Psalm 105:16",
          "text": "He called down famine on the land and cut off all their supplies of food."
        },
        {
          "reference": "Isaiah 3:1",
          "text": "For behold, the Lord GOD of Hosts is about to remove from Jerusalem and Judah both supply and support: the whole supply of food and water,"
        },
        {
          "reference": "Isaiah 55:2",
          "text": "Why spend money on that which is not bread, and your labor on that which does not satisfy? Listen carefully to Me, and eat what is good, and your soul will delight in the richest of foods."
        },
        {
          "reference": "Lamentations 5:10",
          "text": "Our skin is as hot as an oven with fever from our hunger."
        },
        {
          "reference": "Ezekiel 4:16-17",
          "text": "Then He told me, “Son of man, I am going to cut off the supply of food in Jerusalem. They will anxiously eat bread rationed by weight, and in despair they will drink water by measure. / So they will lack food and water; they will be appalled at the sight of one another wasting away in their iniquity."
        }
      ]
    },
    {
      "reference": "Genesis 47:16",
      "book": "Genesis",
      "chapter": 47,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "“Then bring your livestock,” said Joseph. “I will sell you food in exchange for your livestock, since your money is gone.”"
        },
        {
          "version": "NLT",
          "text": "Joseph replied, “Since your money is gone, bring me your livestock. I will give you food in exchange for your livestock.”"
        },
        {
          "version": "ESV",
          "text": "And Joseph answered, “Give your livestock, and I will give you food in exchange for your livestock, if your money is gone.”"
        },
        {
          "version": "NKJV",
          "text": "Then Joseph said, “Give your livestock, and I will give you bread for your livestock, if the money is gone.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:56-57",
          "text": "When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 42:6",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground."
        },
        {
          "reference": "Genesis 43:18-23",
          "text": "But the brothers were frightened that they had been taken to Joseph’s house. “We have been brought here because of the silver that was returned in our bags the first time,” they said. “They intend to overpower us and take us as slaves, along with our donkeys.” / So they approached Joseph’s steward and spoke to him at the entrance to the house. / “Please, sir,” they said, “we really did come down here the first time to buy food. ..."
        },
        {
          "reference": "Genesis 45:6-11",
          "text": "For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt. ..."
        },
        {
          "reference": "Genesis 50:19-21",
          "text": "But Joseph replied, “Do not be afraid. Am I in the place of God? / As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people. / Therefore do not be afraid. I will provide for you and your little ones.” So Joseph reassured his brothers and spoke kindly to them."
        },
        {
          "reference": "Exodus 16:3",
          "text": "“If only we had died by the LORD’s hand in the land of Egypt!” they said. “There we sat by pots of meat and ate our fill of bread, but you have brought us into this desert to starve this whole assembly to death!”"
        },
        {
          "reference": "Exodus 16:12-15",
          "text": "“I have heard the grumbling of the Israelites. Tell them, ‘At twilight you will eat meat, and in the morning you will be filled with bread. Then you will know that I am the LORD your God.’” / That evening quail came and covered the camp, and in the morning there was a layer of dew around the camp. / When the layer of dew had evaporated, there were thin flakes on the desert floor, as fine as frost on the ground. ..."
        },
        {
          "reference": "Leviticus 25:35-37",
          "text": "Now if your countryman becomes destitute and cannot support himself among you, then you are to help him as you would a foreigner or stranger, so that he can continue to live among you. / Do not take any interest or profit from him, but fear your God, that your countryman may live among you. / You must not lend him your silver at interest or sell him your food for profit."
        },
        {
          "reference": "Deuteronomy 15:7-11",
          "text": "If there is a poor man among your brothers within any of the gates in the land that the LORD your God is giving you, then you are not to harden your heart or shut your hand from your poor brother. / Instead, you are to open your hand to him and freely loan him whatever he needs. / Be careful not to harbor this wicked thought in your heart: “The seventh year, the year of release, is near,” so that you look upon your poor brother begrudgingly and give him nothing. He will cry out to the LORD against you, and you will be guilty of sin. ..."
        },
        {
          "reference": "2 Kings 4:1-7",
          "text": "Now the wife of one of the sons of the prophets cried out to Elisha, “Your servant, my husband, is dead, and you know that your servant feared the LORD. And now his creditor is coming to take my two children as his slaves!” / “How can I help you?” asked Elisha. “Tell me, what do you have in the house?” She answered, “Your servant has nothing in the house but a jar of oil.” / “Go,” said Elisha, “borrow empty jars from all your neighbors. Do not gather just a few. ..."
        },
        {
          "reference": "Nehemiah 5:1-5",
          "text": "About that time there was a great outcry from the people and their wives against their fellow Jews. / Some were saying, “We and our sons and daughters are numerous. We must get grain in order to eat and stay alive.” / Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.” ..."
        },
        {
          "reference": "Proverbs 11:26",
          "text": "The people will curse the hoarder of grain, but blessing will crown the one who sells it."
        },
        {
          "reference": "Isaiah 55:1-2",
          "text": "“Come, all you who are thirsty, come to the waters; and you without money, come, buy, and eat! Come, buy wine and milk without money and without cost! / Why spend money on that which is not bread, and your labor on that which does not satisfy? Listen carefully to Me, and eat what is good, and your soul will delight in the richest of foods."
        },
        {
          "reference": "Ezekiel 18:7-8",
          "text": "He does not oppress another, but restores the pledge to the debtor. He does not commit robbery, but gives his bread to the hungry and covers the naked with clothing. / He does not engage in usury or take excess interest, but he withholds his hand from iniquity and executes true justice between men."
        },
        {
          "reference": "Matthew 6:11",
          "text": "Give us this day our daily bread."
        }
      ]
    },
    {
      "reference": "Genesis 47:17",
      "book": "Genesis",
      "chapter": 47,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "So they brought their livestock to Joseph, and he gave them food in exchange for their horses, their sheep and goats, their cattle and donkeys. And he brought them through that year with food in exchange for all their livestock."
        },
        {
          "version": "NLT",
          "text": "So they brought their livestock to Joseph in exchange for food. In exchange for their horses, flocks of sheep and goats, herds of cattle, and donkeys, Joseph provided them with food for another year."
        },
        {
          "version": "ESV",
          "text": "So they brought their livestock to Joseph, and Joseph gave them food in exchange for the horses, the flocks, the herds, and the donkeys. He supplied them with food in exchange for all their livestock that year."
        },
        {
          "version": "NKJV",
          "text": "So they brought their livestock to Joseph, and Joseph gave them bread in exchange for the horses, the flocks, the cattle of the herds, and for the donkeys. Thus he fed them with bread in exchange for all their livestock that year."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:56-57",
          "text": "When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 42:1-3",
          "text": "When Jacob learned that there was grain in Egypt, he said to his sons, “Why are you staring at one another?” / “Look,” he added, “I have heard that there is grain in Egypt. Go down there and buy some for us, so that we may live and not die.” / So ten of Joseph’s brothers went down to buy grain from Egypt."
        },
        {
          "reference": "Genesis 43:1-2",
          "text": "Now the famine was still severe in the land. / So when Jacob’s sons had eaten all the grain they had brought from Egypt, their father said to them, “Go back and buy us a little more food.”"
        },
        {
          "reference": "Genesis 45:6-11",
          "text": "For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt. ..."
        },
        {
          "reference": "Genesis 47:13-14",
          "text": "There was no food, however, in all that region, because the famine was so severe; the lands of Egypt and Canaan had been exhausted by the famine. / Joseph collected all the money to be found in the land of Egypt and the land of Canaan in exchange for the grain they were buying, and he brought it into Pharaoh’s palace."
        },
        {
          "reference": "Exodus 16:3",
          "text": "“If only we had died by the LORD’s hand in the land of Egypt!” they said. “There we sat by pots of meat and ate our fill of bread, but you have brought us into this desert to starve this whole assembly to death!”"
        },
        {
          "reference": "Exodus 16:12-15",
          "text": "“I have heard the grumbling of the Israelites. Tell them, ‘At twilight you will eat meat, and in the morning you will be filled with bread. Then you will know that I am the LORD your God.’” / That evening quail came and covered the camp, and in the morning there was a layer of dew around the camp. / When the layer of dew had evaporated, there were thin flakes on the desert floor, as fine as frost on the ground. ..."
        },
        {
          "reference": "Leviticus 25:35-37",
          "text": "Now if your countryman becomes destitute and cannot support himself among you, then you are to help him as you would a foreigner or stranger, so that he can continue to live among you. / Do not take any interest or profit from him, but fear your God, that your countryman may live among you. / You must not lend him your silver at interest or sell him your food for profit."
        },
        {
          "reference": "Deuteronomy 2:6",
          "text": "You are to pay them in silver for the food you eat and the water you drink.’”"
        },
        {
          "reference": "Deuteronomy 2:28-29",
          "text": "You can sell us food to eat and water to drink in exchange for silver. Only let us pass through on foot, / just as the descendants of Esau who live in Seir and the Moabites who live in Ar did for us, until we cross the Jordan into the land that the LORD our God is giving us.”"
        },
        {
          "reference": "2 Kings 4:42-44",
          "text": "Now a man from Baal-shalishah came to the man of God with a sack of twenty loaves of barley bread from the first ripe grain. “Give it to the people to eat,” said Elisha. / But his servant asked, “How am I to set twenty loaves before a hundred men?” “Give it to the people to eat,” said Elisha, “for this is what the LORD says: ‘They will eat and have some left over.’” / So he set it before them, and they ate and had some left over, according to the word of the LORD."
        },
        {
          "reference": "Nehemiah 5:3",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.”"
        },
        {
          "reference": "Psalm 105:16",
          "text": "He called down famine on the land and cut off all their supplies of food."
        },
        {
          "reference": "Proverbs 11:26",
          "text": "The people will curse the hoarder of grain, but blessing will crown the one who sells it."
        },
        {
          "reference": "Isaiah 55:1-2",
          "text": "“Come, all you who are thirsty, come to the waters; and you without money, come, buy, and eat! Come, buy wine and milk without money and without cost! / Why spend money on that which is not bread, and your labor on that which does not satisfy? Listen carefully to Me, and eat what is good, and your soul will delight in the richest of foods."
        }
      ]
    },
    {
      "reference": "Genesis 47:18",
      "book": "Genesis",
      "chapter": 47,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "When that year was over, they came to him the following year and said, “We cannot hide from our lord the fact that since our money is gone and our livestock belongs to you, there is nothing left for our lord except our bodies and our land."
        },
        {
          "version": "NLT",
          "text": "But that year ended, and the next year they came again and said, “We cannot hide the truth from you, my lord. Our money is gone, and all our livestock and cattle are yours. We have nothing left to give but our bodies and our land."
        },
        {
          "version": "ESV",
          "text": "And when that year was ended, they came to him the following year and said to him, “We will not hide from my lord that our money is all spent. The herds of livestock are my lord’s. There is nothing left in the sight of my lord but our bodies and our land."
        },
        {
          "version": "NKJV",
          "text": "When that year had ended, they came to him the next year and said to him, “We will not hide from my lord that our money is gone; my lord also has our herds of livestock. There is nothing left in the sight of my lord but our bodies and our lands."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:14",
          "text": "and made their lives bitter with hard labor in brick and mortar, and with all kinds of work in the fields. Every service they imposed was harsh."
        },
        {
          "reference": "Leviticus 25:39-41",
          "text": "If a countryman among you becomes destitute and sells himself to you, then you must not force him into slave labor. / Let him stay with you as a hired worker or temporary resident; he is to work for you until the Year of Jubilee. / Then he and his children are to be released, and he may return to his clan and to the property of his fathers."
        },
        {
          "reference": "Deuteronomy 15:12-15",
          "text": "If a fellow Hebrew, a man or a woman, is sold to you and serves you six years, then in the seventh year you must set him free. / And when you release him, do not send him away empty-handed. / You are to furnish him liberally from your flock, your threshing floor, and your winepress. You shall give to him as the LORD your God has blessed you. ..."
        },
        {
          "reference": "1 Samuel 8:11-17",
          "text": "He said, “This will be the manner of the king who will reign over you: He will take your sons and appoint them to serve his own chariots and horses, and to run in front of his chariots. / He will appoint some for himself as commanders of thousands and of fifties, and others to plow his ground, to reap his harvest, and to make his weapons of war and equipment for his chariots. / And he will take your daughters to be perfumers, cooks, and bakers. ..."
        },
        {
          "reference": "2 Kings 4:1",
          "text": "Now the wife of one of the sons of the prophets cried out to Elisha, “Your servant, my husband, is dead, and you know that your servant feared the LORD. And now his creditor is coming to take my two children as his slaves!”"
        },
        {
          "reference": "Nehemiah 5:4-5",
          "text": "Still others were saying, “We have borrowed money to pay the king’s tax on our fields and vineyards. / We and our children are just like our countrymen and their children, yet we are subjecting our sons and daughters to slavery. Some of our daughters are already enslaved, but we are powerless to redeem them because our fields and vineyards belong to others.”"
        },
        {
          "reference": "Isaiah 50:1",
          "text": "This is what the LORD says: “Where is your mother’s certificate of divorce with which I sent her away? Or to which of My creditors did I sell you? Look, you were sold for your iniquities, and for your transgressions your mother was sent away."
        },
        {
          "reference": "Jeremiah 34:8-11",
          "text": "After King Zedekiah had made a covenant with all the people in Jerusalem to proclaim liberty, the word came to Jeremiah from the LORD / that each man should free his Hebrew slaves, both male and female, and no one should hold his fellow Jew in bondage. / So all the officials and all the people who entered into this covenant agreed that they would free their menservants and maidservants and no longer hold them in bondage. They obeyed and released them, ..."
        },
        {
          "reference": "Ezekiel 18:7-8",
          "text": "He does not oppress another, but restores the pledge to the debtor. He does not commit robbery, but gives his bread to the hungry and covers the naked with clothing. / He does not engage in usury or take excess interest, but he withholds his hand from iniquity and executes true justice between men."
        },
        {
          "reference": "Ezekiel 18:12-13",
          "text": "He oppresses the poor and needy; he commits robbery and does not restore a pledge. He lifts his eyes to idols; he commits abominations. / He engages in usury and takes excess interest. Will this son live? He will not! Since he has committed all these abominations, he will surely die; his blood will be on his own head."
        },
        {
          "reference": "Matthew 18:25",
          "text": "Since the man was unable to pay, the master ordered that he be sold to pay his debt, along with his wife and children and everything he owned."
        },
        {
          "reference": "Luke 4:18",
          "text": "“The Spirit of the Lord is on Me, because He has anointed Me to preach good news to the poor. He has sent Me to proclaim liberty to the captives and recovery of sight to the blind, to release the oppressed,"
        },
        {
          "reference": "Luke 7:41-42",
          "text": "“Two men were debtors to a certain moneylender. One owed him five hundred denarii, and the other fifty. / When they were unable to repay him, he forgave both of them. Which one, then, will love him more?”"
        },
        {
          "reference": "Luke 15:14-16",
          "text": "After he had spent all he had, a severe famine swept through that country, and he began to be in need. / So he went and hired himself out to a citizen of that country, who sent him into his fields to feed the pigs. / He longed to fill his belly with the pods the pigs were eating, but no one would give him a thing."
        },
        {
          "reference": "John 8:34",
          "text": "Jesus replied, “Truly, truly, I tell you, everyone who sins is a slave to sin."
        }
      ]
    },
    {
      "reference": "Genesis 47:19",
      "book": "Genesis",
      "chapter": 47,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "Why should we perish before your eyes—we and our land as well? Buy us and our land in exchange for food, and we with our land will be in bondage to Pharaoh. Give us seed so that we may live and not die, and that the land may not become desolate.”"
        },
        {
          "version": "NLT",
          "text": "Why should we die before your very eyes? Buy us and our land in exchange for food; we offer our land and ourselves as slaves for Pharaoh. Just give us grain so we may live and not die, and so the land does not become empty and desolate.”"
        },
        {
          "version": "ESV",
          "text": "Why should we die before your eyes, both we and our land? Buy us and our land for food, and we with our land will be servants to Pharaoh. And give us seed that we may live and not die, and that the land may not be desolate.”"
        },
        {
          "version": "NKJV",
          "text": "Why should we die before your eyes, both we and our land? Buy us and our land for bread, and we and our land will be servants of Pharaoh; give us seed, that we may live and not die, that the land may not be desolate.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11-14",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh. / But the more they were oppressed, the more they multiplied and flourished; so the Egyptians came to dread the Israelites. / They worked the Israelites ruthlessly ..."
        },
        {
          "reference": "Leviticus 25:39-43",
          "text": "If a countryman among you becomes destitute and sells himself to you, then you must not force him into slave labor. / Let him stay with you as a hired worker or temporary resident; he is to work for you until the Year of Jubilee. / Then he and his children are to be released, and he may return to his clan and to the property of his fathers. ..."
        },
        {
          "reference": "Deuteronomy 15:12-15",
          "text": "If a fellow Hebrew, a man or a woman, is sold to you and serves you six years, then in the seventh year you must set him free. / And when you release him, do not send him away empty-handed. / You are to furnish him liberally from your flock, your threshing floor, and your winepress. You shall give to him as the LORD your God has blessed you. ..."
        },
        {
          "reference": "2 Kings 4:1-7",
          "text": "Now the wife of one of the sons of the prophets cried out to Elisha, “Your servant, my husband, is dead, and you know that your servant feared the LORD. And now his creditor is coming to take my two children as his slaves!” / “How can I help you?” asked Elisha. “Tell me, what do you have in the house?” She answered, “Your servant has nothing in the house but a jar of oil.” / “Go,” said Elisha, “borrow empty jars from all your neighbors. Do not gather just a few. ..."
        },
        {
          "reference": "Nehemiah 5:3-5",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.” / Still others were saying, “We have borrowed money to pay the king’s tax on our fields and vineyards. / We and our children are just like our countrymen and their children, yet we are subjecting our sons and daughters to slavery. Some of our daughters are already enslaved, but we are powerless to redeem them because our fields and vineyards belong to others.”"
        },
        {
          "reference": "Isaiah 5:8",
          "text": "Woe to you who add house to house and join field to field until no place is left and you live alone in the land."
        },
        {
          "reference": "Isaiah 61:1",
          "text": "The Spirit of the Lord GOD is on Me, because the LORD has anointed Me to preach good news to the poor. He has sent Me to bind up the brokenhearted, to proclaim liberty to the captives and freedom to the prisoners,"
        },
        {
          "reference": "Jeremiah 34:8-17",
          "text": "After King Zedekiah had made a covenant with all the people in Jerusalem to proclaim liberty, the word came to Jeremiah from the LORD / that each man should free his Hebrew slaves, both male and female, and no one should hold his fellow Jew in bondage. / So all the officials and all the people who entered into this covenant agreed that they would free their menservants and maidservants and no longer hold them in bondage. They obeyed and released them, ..."
        },
        {
          "reference": "Ezekiel 18:7-8",
          "text": "He does not oppress another, but restores the pledge to the debtor. He does not commit robbery, but gives his bread to the hungry and covers the naked with clothing. / He does not engage in usury or take excess interest, but he withholds his hand from iniquity and executes true justice between men."
        },
        {
          "reference": "Ezekiel 46:17",
          "text": "But if he gives a gift from his inheritance to one of his servants, it will belong to that servant until the year of freedom; then it will revert to the prince. His inheritance belongs only to his sons; it shall be theirs."
        },
        {
          "reference": "Matthew 18:25",
          "text": "Since the man was unable to pay, the master ordered that he be sold to pay his debt, along with his wife and children and everything he owned."
        },
        {
          "reference": "Matthew 25:14-30",
          "text": "For it is just like a man going on a journey, who called his servants and entrusted them with his possessions. / To one he gave five talents, to another two talents, and to another one talent—each according to his own ability. And he went on his journey. / The servant who had received the five talents went at once and put them to work and gained five more. ..."
        },
        {
          "reference": "Luke 4:18",
          "text": "“The Spirit of the Lord is on Me, because He has anointed Me to preach good news to the poor. He has sent Me to proclaim liberty to the captives and recovery of sight to the blind, to release the oppressed,"
        },
        {
          "reference": "Luke 7:41-42",
          "text": "“Two men were debtors to a certain moneylender. One owed him five hundred denarii, and the other fifty. / When they were unable to repay him, he forgave both of them. Which one, then, will love him more?”"
        },
        {
          "reference": "Luke 12:58-59",
          "text": "Make every effort to reconcile with your adversary while you are on your way to the magistrate. Otherwise, he may drag you off to the judge, and the judge may hand you over to the officer, and the officer may throw you into prison. / I tell you, you will not get out until you have paid the very last penny.”"
        }
      ]
    },
    {
      "reference": "Genesis 47:20",
      "book": "Genesis",
      "chapter": 47,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "So Joseph bought all the land in Egypt for Pharaoh. The Egyptians, one and all, sold their fields, because the famine was too severe for them. The land became Pharaoh’s,"
        },
        {
          "version": "NLT",
          "text": "So Joseph bought all the land of Egypt for Pharaoh. All the Egyptians sold him their fields because the famine was so severe, and soon all the land belonged to Pharaoh."
        },
        {
          "version": "ESV",
          "text": "So Joseph bought all the land of Egypt for Pharaoh, for all the Egyptians sold their fields, because the famine was severe on them. The land became Pharaoh’s."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph bought all the land of Egypt for Pharaoh; for every man of the Egyptians sold his field, because the famine was severe upon them. So the land became Pharaoh’s."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:56-57",
          "text": "When the famine had spread over all the land, Joseph opened up all the storehouses and sold grain to the Egyptians; for the famine was severe in the land of Egypt. / And every nation came to Joseph in Egypt to buy grain, because the famine was severe over all the earth."
        },
        {
          "reference": "Genesis 47:13-14",
          "text": "There was no food, however, in all that region, because the famine was so severe; the lands of Egypt and Canaan had been exhausted by the famine. / Joseph collected all the money to be found in the land of Egypt and the land of Canaan in exchange for the grain they were buying, and he brought it into Pharaoh’s palace."
        },
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Leviticus 25:23-24",
          "text": "The land must not be sold permanently, because it is Mine, and you are but foreigners and residents with Me. / Thus for every piece of property you possess, you must provide for the redemption of the land."
        },
        {
          "reference": "1 Kings 21:15-16",
          "text": "When Jezebel heard that Naboth had been stoned to death, she said to Ahab, “Get up and take possession of the vineyard of Naboth the Jezreelite, who refused to give it to you for silver. For Naboth is no longer alive, but dead.” / And when Ahab heard that Naboth was dead, he got up and went down to take possession of the vineyard of Naboth the Jezreelite."
        },
        {
          "reference": "2 Kings 8:6",
          "text": "When the king asked the woman, she confirmed it. So the king appointed for her an officer, saying, “Restore all that was hers, along with all the proceeds of the field from the day that she left the country until now.”"
        },
        {
          "reference": "Nehemiah 5:3-5",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.” / Still others were saying, “We have borrowed money to pay the king’s tax on our fields and vineyards. / We and our children are just like our countrymen and their children, yet we are subjecting our sons and daughters to slavery. Some of our daughters are already enslaved, but we are powerless to redeem them because our fields and vineyards belong to others.”"
        },
        {
          "reference": "Isaiah 5:8",
          "text": "Woe to you who add house to house and join field to field until no place is left and you live alone in the land."
        },
        {
          "reference": "Jeremiah 32:43-44",
          "text": "And fields will be bought in this land about which you are saying, ‘It is a desolation, without man or beast; it has been delivered into the hands of the Chaldeans.’ / Fields will be purchased with silver, and deeds will be signed, sealed, and witnessed in the land of Benjamin, in the areas surrounding Jerusalem, and in the cities of Judah—the cities of the hill country, the foothills, and the Negev—because I will restore them from captivity, declares the LORD.”"
        },
        {
          "reference": "Ezekiel 7:12-13",
          "text": "The time has come; the day has arrived. Let the buyer not rejoice and the seller not mourn, for wrath is upon the whole multitude. / The seller will surely not recover what he sold while both remain alive. For the vision concerning the whole multitude will not be revoked, and because of their iniquity, not one of them will preserve his life."
        },
        {
          "reference": "Matthew 6:19-21",
          "text": "Do not store up for yourselves treasures on earth, where moth and rust destroy, and where thieves break in and steal. / But store up for yourselves treasures in heaven, where moth and rust do not destroy, and where thieves do not break in and steal. / For where your treasure is, there your heart will be also."
        },
        {
          "reference": "Matthew 19:21-22",
          "text": "Jesus told him, “If you want to be perfect, go, sell your possessions and give to the poor, and you will have treasure in heaven. Then come, follow Me.” / When the young man heard this, he went away in sorrow, because he had great wealth."
        },
        {
          "reference": "Mark 10:21-22",
          "text": "Jesus looked at him, loved him, and said to him, “There is one thing you lack: Go, sell everything you own and give to the poor, and you will have treasure in heaven. Then come, follow Me.” / But the man was saddened by these words and went away in sorrow, because he had great wealth."
        },
        {
          "reference": "Luke 12:16-21",
          "text": "Then He told them a parable: “The ground of a certain rich man produced an abundance. / So he thought to himself, ‘What shall I do, since I have nowhere to store my crops?’ / Then he said, ‘This is what I will do: I will tear down my barns and will build bigger ones, and there I will store up all my grain and my goods. ..."
        },
        {
          "reference": "Luke 18:22-23",
          "text": "On hearing this, Jesus told him, “You still lack one thing: Sell everything you own and give to the poor, and you will have treasure in heaven. Then come, follow Me.” / But when the ruler heard this, he became very sad, because he was extremely wealthy."
        }
      ]
    },
    {
      "reference": "Genesis 47:21",
      "book": "Genesis",
      "chapter": 47,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "and Joseph reduced the people to servitude, from one end of Egypt to the other."
        },
        {
          "version": "NLT",
          "text": "As for the people, he made them all slaves, from one end of Egypt to the other."
        },
        {
          "version": "ESV",
          "text": "As for the people, he made servants of them from one end of Egypt to the other."
        },
        {
          "version": "NKJV",
          "text": "And as for the people, he moved them into the cities, from one end of the borders of Egypt to the other end."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Exodus 1:13-14",
          "text": "They worked the Israelites ruthlessly / and made their lives bitter with hard labor in brick and mortar, and with all kinds of work in the fields. Every service they imposed was harsh."
        },
        {
          "reference": "Leviticus 25:23-24",
          "text": "The land must not be sold permanently, because it is Mine, and you are but foreigners and residents with Me. / Thus for every piece of property you possess, you must provide for the redemption of the land."
        },
        {
          "reference": "Leviticus 25:39-41",
          "text": "If a countryman among you becomes destitute and sells himself to you, then you must not force him into slave labor. / Let him stay with you as a hired worker or temporary resident; he is to work for you until the Year of Jubilee. / Then he and his children are to be released, and he may return to his clan and to the property of his fathers."
        },
        {
          "reference": "Deuteronomy 15:12-15",
          "text": "If a fellow Hebrew, a man or a woman, is sold to you and serves you six years, then in the seventh year you must set him free. / And when you release him, do not send him away empty-handed. / You are to furnish him liberally from your flock, your threshing floor, and your winepress. You shall give to him as the LORD your God has blessed you. ..."
        },
        {
          "reference": "Deuteronomy 28:68",
          "text": "The LORD will return you to Egypt in ships by a route that I said you should never see again. There you will sell yourselves to your enemies as male and female slaves, but no one will buy you.”"
        },
        {
          "reference": "1 Samuel 8:11-17",
          "text": "He said, “This will be the manner of the king who will reign over you: He will take your sons and appoint them to serve his own chariots and horses, and to run in front of his chariots. / He will appoint some for himself as commanders of thousands and of fifties, and others to plow his ground, to reap his harvest, and to make his weapons of war and equipment for his chariots. / And he will take your daughters to be perfumers, cooks, and bakers. ..."
        },
        {
          "reference": "1 Kings 9:22",
          "text": "But Solomon did not consign any of the Israelites to slavery, because they were his men of war, his servants, his officers, his captains, and the commanders of his chariots and cavalry."
        },
        {
          "reference": "2 Kings 17:6",
          "text": "In the ninth year of Hoshea, the king of Assyria captured Samaria and carried away the Israelites to Assyria, where he settled them in Halah, in Gozan by the Habor River, and in the cities of the Medes."
        },
        {
          "reference": "2 Kings 25:11",
          "text": "Then Nebuzaradan captain of the guard carried into exile the people who remained in the city, along with the deserters who had defected to the king of Babylon and the rest of the population."
        },
        {
          "reference": "Nehemiah 5:4-5",
          "text": "Still others were saying, “We have borrowed money to pay the king’s tax on our fields and vineyards. / We and our children are just like our countrymen and their children, yet we are subjecting our sons and daughters to slavery. Some of our daughters are already enslaved, but we are powerless to redeem them because our fields and vineyards belong to others.”"
        },
        {
          "reference": "Isaiah 5:13",
          "text": "Therefore My people will go into exile for their lack of understanding; their dignitaries are starving and their masses are parched with thirst."
        },
        {
          "reference": "Jeremiah 34:13-14",
          "text": "“This is what the LORD, the God of Israel, says: I made a covenant with your forefathers when I brought them out of the land of Egypt, out of the house of slavery, saying: / Every seventh year, each of you must free his Hebrew brother who has sold himself to you. He may serve you six years, but then you must let him go free. But your fathers did not listen or incline their ear."
        },
        {
          "reference": "Ezekiel 30:12",
          "text": "I will make the streams dry up and sell the land to the wicked. By the hands of foreigners I will bring desolation upon the land and everything in it. I, the LORD, have spoken."
        },
        {
          "reference": "Acts 7:10-11",
          "text": "and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household. / Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food."
        }
      ]
    },
    {
      "reference": "Genesis 47:22",
      "book": "Genesis",
      "chapter": 47,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "However, he did not buy the land of the priests, because they received a regular allotment from Pharaoh and had food enough from the allotment Pharaoh gave them. That is why they did not sell their land."
        },
        {
          "version": "NLT",
          "text": "The only land he did not buy was the land belonging to the priests. They received an allotment of food directly from Pharaoh, so they didn’t need to sell their land."
        },
        {
          "version": "ESV",
          "text": "Only the land of the priests he did not buy, for the priests had a fixed allowance from Pharaoh and lived on the allowance that Pharaoh gave them; therefore they did not sell their land."
        },
        {
          "version": "NKJV",
          "text": "Only the land of the priests he did not buy; for the priests had rations allotted to them by Pharaoh, and they ate their rations which Pharaoh gave them; therefore they did not sell their lands."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Exodus 12:32",
          "text": "Take your flocks and herds as well, just as you have said, and depart! And bless me also.”"
        },
        {
          "reference": "Leviticus 25:32-34",
          "text": "As for the cities of the Levites, the Levites always have the right to redeem their houses in the cities they possess. / So whatever belongs to the Levites may be redeemed—a house sold in a city they possess—and must be released in the Jubilee, because the houses in the cities of the Levites are their possession among the Israelites. / But the open pastureland around their cities may not be sold, for this is their permanent possession."
        },
        {
          "reference": "Numbers 18:20-24",
          "text": "Then the LORD said to Aaron, “You will have no inheritance in their land, nor will you have any portion among them. I am your portion and your inheritance among the Israelites. / Behold, I have given to the Levites all the tithes in Israel as an inheritance in return for the work they do, the service of the Tent of Meeting. / No longer may the Israelites come near to the Tent of Meeting, or they will incur guilt and die. ..."
        },
        {
          "reference": "Deuteronomy 10:9",
          "text": "That is why Levi has no portion or inheritance among his brothers; the LORD is his inheritance, as the LORD your God promised him."
        },
        {
          "reference": "Deuteronomy 18:1-2",
          "text": "The Levitical priests—indeed the whole tribe of Levi—shall have no portion or inheritance with Israel. They are to eat the food offerings to the LORD; that is their inheritance. / Although they have no inheritance among their brothers, the LORD is their inheritance, as He promised them."
        },
        {
          "reference": "Joshua 13:14",
          "text": "To the tribe of Levi, however, Moses had given no inheritance. The food offerings to the LORD, the God of Israel, are their inheritance, just as He had promised them."
        },
        {
          "reference": "Joshua 21:1-3",
          "text": "Now the family heads of the Levites approached Eleazar the priest, Joshua son of Nun, and the heads of the other tribes of Israel / at Shiloh in the land of Canaan and said to them, “The LORD commanded through Moses that we be given cities in which to live, together with pasturelands for our livestock.” / So by the command of the LORD, the Israelites gave the Levites these cities and their pasturelands out of their own inheritance:"
        },
        {
          "reference": "1 Samuel 2:36",
          "text": "And everyone left in your house will come and bow down to him for a piece of silver or a morsel of bread, pleading, “Please appoint me to some priestly office so that I can eat a piece of bread.”’”"
        },
        {
          "reference": "2 Kings 23:9",
          "text": "Although the priests of the high places did not come up to the altar of the LORD in Jerusalem, they ate unleavened bread with their fellow priests."
        },
        {
          "reference": "Nehemiah 13:10-11",
          "text": "I also learned that because the portions for the Levites had not been given to them, all the Levites and singers responsible for performing the service had gone back to their own fields. / So I rebuked the officials and asked, “Why has the house of God been neglected?” Then I gathered the Levites and singers together and stationed them at their posts,"
        },
        {
          "reference": "Ezekiel 44:28-30",
          "text": "In regard to their inheritance, I am their inheritance. You are to give them no possession in Israel, for I am their possession. / They shall eat the grain offerings, the sin offerings, and the guilt offerings. Everything in Israel devoted to the LORD will belong to them. / The best of all the firstfruits and of every contribution from all your offerings will belong to the priests. You are to give your first batch of dough to the priest, so that a blessing may rest upon your homes."
        },
        {
          "reference": "Matthew 10:10",
          "text": "Take no bag for the road, or second tunic, or sandals, or staff; for the worker is worthy of his provisions."
        },
        {
          "reference": "Matthew 23:23",
          "text": "Woe to you, scribes and Pharisees, you hypocrites! You pay tithes of mint, dill, and cumin. But you have disregarded the weightier matters of the law: justice, mercy, and faithfulness. You should have practiced the latter, without neglecting the former."
        },
        {
          "reference": "Luke 10:7",
          "text": "Stay at the same house, eating and drinking whatever you are offered. For the worker is worthy of his wages. Do not move around from house to house."
        }
      ]
    },
    {
      "reference": "Genesis 47:23",
      "book": "Genesis",
      "chapter": 47,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph said to the people, “Now that I have bought you and your land today for Pharaoh, here is seed for you so you can plant the ground."
        },
        {
          "version": "NLT",
          "text": "Then Joseph said to the people, “Look, today I have bought you and your land for Pharaoh. I will provide you with seed so you can plant the fields."
        },
        {
          "version": "ESV",
          "text": "Then Joseph said to the people, “Behold, I have this day bought you and your land for Pharaoh. Now here is seed for you, and you shall sow the land."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph said to the people, “Indeed I have bought you and your land this day for Pharaoh. Look, here is seed for you, and you shall sow the land."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Leviticus 25:23-24",
          "text": "The land must not be sold permanently, because it is Mine, and you are but foreigners and residents with Me. / Thus for every piece of property you possess, you must provide for the redemption of the land."
        },
        {
          "reference": "Deuteronomy 15:12-15",
          "text": "If a fellow Hebrew, a man or a woman, is sold to you and serves you six years, then in the seventh year you must set him free. / And when you release him, do not send him away empty-handed. / You are to furnish him liberally from your flock, your threshing floor, and your winepress. You shall give to him as the LORD your God has blessed you. ..."
        },
        {
          "reference": "1 Samuel 8:11-17",
          "text": "He said, “This will be the manner of the king who will reign over you: He will take your sons and appoint them to serve his own chariots and horses, and to run in front of his chariots. / He will appoint some for himself as commanders of thousands and of fifties, and others to plow his ground, to reap his harvest, and to make his weapons of war and equipment for his chariots. / And he will take your daughters to be perfumers, cooks, and bakers. ..."
        },
        {
          "reference": "2 Kings 4:7",
          "text": "She went and told the man of God, and he said, “Go, sell the oil, and pay your debt. Then you and your sons can live on the remainder.”"
        },
        {
          "reference": "Nehemiah 5:3-5",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.” / Still others were saying, “We have borrowed money to pay the king’s tax on our fields and vineyards. / We and our children are just like our countrymen and their children, yet we are subjecting our sons and daughters to slavery. Some of our daughters are already enslaved, but we are powerless to redeem them because our fields and vineyards belong to others.”"
        },
        {
          "reference": "Isaiah 5:8",
          "text": "Woe to you who add house to house and join field to field until no place is left and you live alone in the land."
        },
        {
          "reference": "Jeremiah 34:13-14",
          "text": "“This is what the LORD, the God of Israel, says: I made a covenant with your forefathers when I brought them out of the land of Egypt, out of the house of slavery, saying: / Every seventh year, each of you must free his Hebrew brother who has sold himself to you. He may serve you six years, but then you must let him go free. But your fathers did not listen or incline their ear."
        },
        {
          "reference": "Ezekiel 46:18",
          "text": "The prince must not take any of the inheritance of the people by evicting them from their property. He is to provide an inheritance for his sons from his own property, so that none of My people will be displaced from his property.’”"
        },
        {
          "reference": "Matthew 18:25",
          "text": "Since the man was unable to pay, the master ordered that he be sold to pay his debt, along with his wife and children and everything he owned."
        },
        {
          "reference": "Matthew 25:14-30",
          "text": "For it is just like a man going on a journey, who called his servants and entrusted them with his possessions. / To one he gave five talents, to another two talents, and to another one talent—each according to his own ability. And he went on his journey. / The servant who had received the five talents went at once and put them to work and gained five more. ..."
        },
        {
          "reference": "Luke 19:12-27",
          "text": "So He said, “A man of noble birth went to a distant country to lay claim to his kingship and then return. / Beforehand, he called ten of his servants and gave them ten minas. ‘Conduct business with this until I return,’ he said. / But his subjects hated him and sent a delegation after him to say, ‘We do not want this man to rule over us.’ ..."
        },
        {
          "reference": "John 4:37-38",
          "text": "For in this case the saying ‘One sows and another reaps’ is true. / I sent you to reap what you have not worked for; others have done the hard work, and now you have taken up their labor.”"
        },
        {
          "reference": "Acts 4:34-35",
          "text": "There were no needy ones among them, because those who owned lands or houses would sell their property, bring the proceeds from the sales, / and lay them at the apostles’ feet for distribution to anyone as he had need."
        },
        {
          "reference": "Romans 13:7",
          "text": "Pay everyone what you owe him: taxes to whom taxes are due, revenue to whom revenue is due, respect to whom respect is due, honor to whom honor is due."
        }
      ]
    },
    {
      "reference": "Genesis 47:24",
      "book": "Genesis",
      "chapter": 47,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "But when the crop comes in, give a fifth of it to Pharaoh. The other four-fifths you may keep as seed for the fields and as food for yourselves and your households and your children.”"
        },
        {
          "version": "NLT",
          "text": "Then when you harvest it, one-fifth of your crop will belong to Pharaoh. You may keep the remaining four-fifths as seed for your fields and as food for you, your households, and your little ones.”"
        },
        {
          "version": "ESV",
          "text": "And at the harvests you shall give a fifth to Pharaoh, and four fifths shall be your own, as seed for the field and as food for yourselves and your households, and as food for your little ones.”"
        },
        {
          "version": "NKJV",
          "text": "And it shall come to pass in the harvest that you shall give one-fifth to Pharaoh. Four-fifths shall be your own, as seed for the field and for your food, for those of your households and as food for your little ones.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Leviticus 27:30-33",
          "text": "Thus any tithe from the land, whether from the seed of the land or the fruit of the trees, belongs to the LORD; it is holy to the LORD. / If a man wishes to redeem part of his tithe, he must add a fifth to its value. / Every tenth animal from the herd or flock that passes under the shepherd’s rod will be holy to the LORD. ..."
        },
        {
          "reference": "Deuteronomy 14:22-29",
          "text": "You must be sure to set aside a tenth of all the produce brought forth each year from your fields. / And you are to eat a tenth of your grain, new wine, and oil, and the firstborn of your herds and flocks, in the presence of the LORD your God at the place He will choose as a dwelling for His Name, so that you may learn to fear the LORD your God always. / But if the distance is too great for you to carry that with which the LORD your God has blessed you, because the place where the LORD your God will choose to put His Name is too far away, ..."
        },
        {
          "reference": "Nehemiah 10:35-39",
          "text": "We will also bring the firstfruits of our land and of every fruit tree to the house of the LORD year by year. / And we will bring the firstborn of our sons and our livestock, as it is written in the Law, and will bring the firstborn of our herds and flocks to the house of our God, to the priests who minister in the house of our God. / Moreover, we will bring to the priests at the storerooms of the house of our God the firstfruits of our dough, of our grain offerings, of the fruit of all our trees, and of our new wine and oil. A tenth of our produce belongs to the Levites, so that they shall receive tithes in all the towns where we labor. ..."
        },
        {
          "reference": "Malachi 3:8-10",
          "text": "Will a man rob God? Yet you are robbing Me! But you ask, ‘How do we rob You?’ In tithes and offerings. / You are cursed with a curse, yet you—the whole nation—are still robbing Me. / Bring the full tithe into the storehouse, so that there may be food in My house. Test Me in this,” says the LORD of Hosts. “See if I will not open the windows of heaven and pour out for you blessing without measure."
        },
        {
          "reference": "Matthew 22:21",
          "text": "“Caesar’s,” they answered. So Jesus told them, “Give to Caesar what is Caesar’s, and to God what is God’s.”"
        },
        {
          "reference": "Romans 13:6-7",
          "text": "This is also why you pay taxes. For the authorities are God’s servants, who devote themselves to their work. / Pay everyone what you owe him: taxes to whom taxes are due, revenue to whom revenue is due, respect to whom respect is due, honor to whom honor is due."
        },
        {
          "reference": "1 Corinthians 9:11-14",
          "text": "If we have sown spiritual seed among you, is it too much for us to reap a material harvest from you? / If others have this right to your support, shouldn’t we have it all the more? But we did not exercise this right. Instead, we put up with anything rather than hinder the gospel of Christ. / Do you not know that those who work in the temple eat of its food, and those who serve at the altar partake of its offerings? ..."
        },
        {
          "reference": "2 Corinthians 9:6-11",
          "text": "Remember this: Whoever sows sparingly will also reap sparingly, and whoever sows generously will also reap generously. / Each one should give what he has decided in his heart to give, not out of regret or compulsion. For God loves a cheerful giver. / And God is able to make all grace abound to you, so that in all things, at all times, having all that you need, you will abound in every good work. ..."
        },
        {
          "reference": "Hebrews 7:4-10",
          "text": "Consider how great Melchizedek was: Even the patriarch Abraham gave him a tenth of the plunder. / Now the law commands the sons of Levi who become priests to collect a tenth from the people—that is, from their brothers—though they too are descended from Abraham. / But Melchizedek, who did not trace his descent from Levi, collected a tenth from Abraham and blessed him who had the promises. ..."
        },
        {
          "reference": "Exodus 22:29",
          "text": "You must not hold back offerings from your granaries or vats. You are to give Me the firstborn of your sons."
        },
        {
          "reference": "Numbers 18:21-24",
          "text": "Behold, I have given to the Levites all the tithes in Israel as an inheritance in return for the work they do, the service of the Tent of Meeting. / No longer may the Israelites come near to the Tent of Meeting, or they will incur guilt and die. / The Levites are to perform the work of the Tent of Meeting, and they must bear their iniquity. This is a permanent statute for the generations to come. The Levites will not receive an inheritance among the Israelites. ..."
        },
        {
          "reference": "Deuteronomy 26:12-15",
          "text": "When you have finished laying aside a tenth of all your produce in the third year, the year of the tithe, you are to give it to the Levite, the foreigner, the fatherless, and the widow, that they may eat and be filled within your gates. / Then you shall declare in the presence of the LORD your God, “I have removed from my house the sacred portion and have given it to the Levite, the foreigner, the fatherless, and the widow, according to all the commandments You have given me. I have not transgressed or forgotten Your commandments. / I have not eaten any of the sacred portion while in mourning, or removed any of it while unclean, or offered any of it for the dead. I have obeyed the LORD my God; I have done everything You commanded me. ..."
        },
        {
          "reference": "1 Samuel 8:15-17",
          "text": "He will take a tenth of your grain and grape harvest and give it to his officials and servants. / And he will take your menservants and maidservants and your best cattle and donkeys and put them to his own use. / He will take a tenth of your flocks, and you yourselves will become his slaves."
        },
        {
          "reference": "2 Chronicles 31:5-6",
          "text": "As soon as the order went out, the Israelites generously provided the firstfruits of the grain, new wine, oil, and honey, and of all the produce of the field, and they brought in an abundance—a tithe of everything. / And the Israelites and Judahites who lived in the cities of Judah also brought a tithe of their herds and flocks and a tithe of the holy things consecrated to the LORD their God, and they laid them in large heaps."
        },
        {
          "reference": "Proverbs 3:9-10",
          "text": "Honor the LORD with your wealth and with the firstfruits of all your crops; / then your barns will be filled with plenty, and your vats will overflow with new wine."
        }
      ]
    },
    {
      "reference": "Genesis 47:25",
      "book": "Genesis",
      "chapter": 47,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "“You have saved our lives,” they said. “May we find favor in the eyes of our lord; we will be in bondage to Pharaoh.”"
        },
        {
          "version": "NLT",
          "text": "“You have saved our lives!” they exclaimed. “May it please you, my lord, to let us be Pharaoh’s servants.”"
        },
        {
          "version": "ESV",
          "text": "And they said, “You have saved our lives; may it please my lord, we will be servants to Pharaoh.”"
        },
        {
          "version": "NKJV",
          "text": "So they said, “You have saved our lives; let us find favor in the sight of my lord, and we will be Pharaoh’s servants.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11-14",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh. / But the more they were oppressed, the more they multiplied and flourished; so the Egyptians came to dread the Israelites. / They worked the Israelites ruthlessly ..."
        },
        {
          "reference": "Exodus 12:31-36",
          "text": "Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested. / Take your flocks and herds as well, just as you have said, and depart! And bless me also.” / And in order to send them out of the land quickly, the Egyptians urged the people on. “For otherwise,” they said, “we are all going to die!” ..."
        },
        {
          "reference": "Leviticus 25:23-28",
          "text": "The land must not be sold permanently, because it is Mine, and you are but foreigners and residents with Me. / Thus for every piece of property you possess, you must provide for the redemption of the land. / If your brother becomes impoverished and sells some of his property, his nearest of kin may come and redeem what his brother has sold. ..."
        },
        {
          "reference": "Deuteronomy 15:1-6",
          "text": "At the end of every seven years you must cancel debts. / This is the manner of remission: Every creditor shall cancel what he has loaned to his neighbor. He is not to collect anything from his neighbor or brother, because the LORD’s time of release has been proclaimed. / You may collect something from a foreigner, but you must forgive whatever your brother owes you. ..."
        },
        {
          "reference": "Deuteronomy 28:47-48",
          "text": "Because you did not serve the LORD your God with joy and gladness of heart in all your abundance, / you will serve your enemies the LORD will send against you in famine, thirst, nakedness, and destitution. He will place an iron yoke on your neck until He has destroyed you."
        },
        {
          "reference": "1 Samuel 8:10-18",
          "text": "So Samuel spoke all the words of the LORD to the people who were asking him for a king. / He said, “This will be the manner of the king who will reign over you: He will take your sons and appoint them to serve his own chariots and horses, and to run in front of his chariots. / He will appoint some for himself as commanders of thousands and of fifties, and others to plow his ground, to reap his harvest, and to make his weapons of war and equipment for his chariots. ..."
        },
        {
          "reference": "2 Kings 4:1-7",
          "text": "Now the wife of one of the sons of the prophets cried out to Elisha, “Your servant, my husband, is dead, and you know that your servant feared the LORD. And now his creditor is coming to take my two children as his slaves!” / “How can I help you?” asked Elisha. “Tell me, what do you have in the house?” She answered, “Your servant has nothing in the house but a jar of oil.” / “Go,” said Elisha, “borrow empty jars from all your neighbors. Do not gather just a few. ..."
        },
        {
          "reference": "Nehemiah 5:1-13",
          "text": "About that time there was a great outcry from the people and their wives against their fellow Jews. / Some were saying, “We and our sons and daughters are numerous. We must get grain in order to eat and stay alive.” / Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.” ..."
        },
        {
          "reference": "Isaiah 61:1-3",
          "text": "The Spirit of the Lord GOD is on Me, because the LORD has anointed Me to preach good news to the poor. He has sent Me to bind up the brokenhearted, to proclaim liberty to the captives and freedom to the prisoners, / to proclaim the year of the LORD’s favor and the day of our God’s vengeance, to comfort all who mourn, / to console the mourners in Zion—to give them a crown of beauty for ashes, the oil of joy for mourning, and a garment of praise for a spirit of despair. So they will be called oaks of righteousness, the planting of the LORD, that He may be glorified."
        },
        {
          "reference": "Jeremiah 34:8-17",
          "text": "After King Zedekiah had made a covenant with all the people in Jerusalem to proclaim liberty, the word came to Jeremiah from the LORD / that each man should free his Hebrew slaves, both male and female, and no one should hold his fellow Jew in bondage. / So all the officials and all the people who entered into this covenant agreed that they would free their menservants and maidservants and no longer hold them in bondage. They obeyed and released them, ..."
        },
        {
          "reference": "Ezekiel 18:7-9",
          "text": "He does not oppress another, but restores the pledge to the debtor. He does not commit robbery, but gives his bread to the hungry and covers the naked with clothing. / He does not engage in usury or take excess interest, but he withholds his hand from iniquity and executes true justice between men. / He follows My statutes and faithfully keeps My ordinances. That man is righteous; surely he will live, declares the Lord GOD."
        },
        {
          "reference": "Matthew 18:23-35",
          "text": "Because of this, the kingdom of heaven is like a king who wanted to settle accounts with his servants. / As he began the settlements, a debtor owing ten thousand talents was brought to him. / Since the man was unable to pay, the master ordered that he be sold to pay his debt, along with his wife and children and everything he owned. ..."
        },
        {
          "reference": "Matthew 25:14-30",
          "text": "For it is just like a man going on a journey, who called his servants and entrusted them with his possessions. / To one he gave five talents, to another two talents, and to another one talent—each according to his own ability. And he went on his journey. / The servant who had received the five talents went at once and put them to work and gained five more. ..."
        },
        {
          "reference": "Luke 4:18-19",
          "text": "“The Spirit of the Lord is on Me, because He has anointed Me to preach good news to the poor. He has sent Me to proclaim liberty to the captives and recovery of sight to the blind, to release the oppressed, / to proclaim the year of the Lord’s favor.”"
        },
        {
          "reference": "Luke 19:11-27",
          "text": "While the people were listening to this, Jesus proceeded to tell them a parable, because He was near Jerusalem and they thought the kingdom of God would appear imminently. / So He said, “A man of noble birth went to a distant country to lay claim to his kingship and then return. / Beforehand, he called ten of his servants and gave them ten minas. ‘Conduct business with this until I return,’ he said. ..."
        }
      ]
    },
    {
      "reference": "Genesis 47:26",
      "book": "Genesis",
      "chapter": 47,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "So Joseph established it as a law concerning land in Egypt—still in force today—that a fifth of the produce belongs to Pharaoh. It was only the land of the priests that did not become Pharaoh’s."
        },
        {
          "version": "NLT",
          "text": "Joseph then issued a decree still in effect in the land of Egypt, that Pharaoh should receive one-fifth of all the crops grown on his land. Only the land belonging to the priests was not given to Pharaoh."
        },
        {
          "version": "ESV",
          "text": "So Joseph made it a statute concerning the land of Egypt, and it stands to this day, that Pharaoh should have the fifth; the land of the priests alone did not become Pharaoh’s."
        },
        {
          "version": "NKJV",
          "text": "And Joseph made it a law over the land of Egypt to this day, that Pharaoh should have one-fifth, except for the land of the priests only, which did not become Pharaoh’s."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:11",
          "text": "So the Egyptians appointed taskmasters over the Israelites to oppress them with forced labor. As a result, they built Pithom and Rameses as store cities for Pharaoh."
        },
        {
          "reference": "Exodus 5:6-9",
          "text": "That same day Pharaoh commanded the taskmasters of the people and their foremen: / “You shall no longer supply the people with straw for making bricks. They must go and gather their own straw. / But require of them the same quota of bricks as before; do not reduce it. For they are lazy; that is why they are crying out, ‘Let us go and sacrifice to our God.’ ..."
        },
        {
          "reference": "Leviticus 25:23-28",
          "text": "The land must not be sold permanently, because it is Mine, and you are but foreigners and residents with Me. / Thus for every piece of property you possess, you must provide for the redemption of the land. / If your brother becomes impoverished and sells some of his property, his nearest of kin may come and redeem what his brother has sold. ..."
        },
        {
          "reference": "Deuteronomy 15:1-6",
          "text": "At the end of every seven years you must cancel debts. / This is the manner of remission: Every creditor shall cancel what he has loaned to his neighbor. He is not to collect anything from his neighbor or brother, because the LORD’s time of release has been proclaimed. / You may collect something from a foreigner, but you must forgive whatever your brother owes you. ..."
        },
        {
          "reference": "Deuteronomy 26:12",
          "text": "When you have finished laying aside a tenth of all your produce in the third year, the year of the tithe, you are to give it to the Levite, the foreigner, the fatherless, and the widow, that they may eat and be filled within your gates."
        },
        {
          "reference": "1 Samuel 8:10-18",
          "text": "So Samuel spoke all the words of the LORD to the people who were asking him for a king. / He said, “This will be the manner of the king who will reign over you: He will take your sons and appoint them to serve his own chariots and horses, and to run in front of his chariots. / He will appoint some for himself as commanders of thousands and of fifties, and others to plow his ground, to reap his harvest, and to make his weapons of war and equipment for his chariots. ..."
        },
        {
          "reference": "1 Kings 4:7",
          "text": "Solomon had twelve governors over all Israel to provide food for the king and his household. Each one would arrange provisions for one month of the year,"
        },
        {
          "reference": "2 Kings 23:35",
          "text": "So Jehoiakim paid the silver and gold to Pharaoh Neco, but to meet Pharaoh’s demand he taxed the land and exacted the silver and the gold from the people, each according to his wealth."
        },
        {
          "reference": "Nehemiah 5:3-5",
          "text": "Others were saying, “We are mortgaging our fields, our vineyards, and our homes to get grain during the famine.” / Still others were saying, “We have borrowed money to pay the king’s tax on our fields and vineyards. / We and our children are just like our countrymen and their children, yet we are subjecting our sons and daughters to slavery. Some of our daughters are already enslaved, but we are powerless to redeem them because our fields and vineyards belong to others.”"
        },
        {
          "reference": "Isaiah 5:8",
          "text": "Woe to you who add house to house and join field to field until no place is left and you live alone in the land."
        },
        {
          "reference": "Isaiah 10:1-2",
          "text": "Woe to those who enact unjust statutes and issue oppressive decrees, / to deprive the poor of fair treatment and withhold justice from the oppressed of My people, to make widows their prey and orphans their plunder."
        },
        {
          "reference": "Ezekiel 45:13-16",
          "text": "This is the contribution you are to offer: a sixth of an ephah from each homer of wheat, and a sixth of an ephah from each homer of barley. / The prescribed portion of oil, measured by the bath, is a tenth of a bath from each cor (a cor consists of ten baths or one homer, since ten baths are equivalent to a homer). / And one sheep shall be given from each flock of two hundred from the well-watered pastures of Israel. These are for the grain offerings, burnt offerings, and peace offerings, to make atonement for the people, declares the Lord GOD. ..."
        },
        {
          "reference": "Matthew 22:17-21",
          "text": "So tell us what You think: Is it lawful to pay taxes to Caesar or not?” / But Jesus knew their evil intent and said, “You hypocrites, why are you testing Me? / Show Me the coin used for the tax.” And they brought Him a denarius. ..."
        },
        {
          "reference": "Matthew 25:14-30",
          "text": "For it is just like a man going on a journey, who called his servants and entrusted them with his possessions. / To one he gave five talents, to another two talents, and to another one talent—each according to his own ability. And he went on his journey. / The servant who had received the five talents went at once and put them to work and gained five more. ..."
        },
        {
          "reference": "Mark 12:14-17",
          "text": "“Teacher,” they said, “we know that You are honest and seek favor from no one. Indeed, You are impartial and teach the way of God in accordance with the truth. Is it lawful to pay taxes to Caesar or not? Should we pay them or not?” / But Jesus saw through their hypocrisy and said, “Why are you testing Me? Bring Me a denarius to inspect.” / So they brought it, and He asked them, “Whose image is this? And whose inscription?” “Caesar’s,” they answered. ..."
        }
      ]
    },
    {
      "reference": "Genesis 47:27",
      "book": "Genesis",
      "chapter": 47,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "Now the Israelites settled in Egypt in the region of Goshen. They acquired property there and were fruitful and increased greatly in number."
        },
        {
          "version": "NLT",
          "text": "Meanwhile, the people of Israel settled in the region of Goshen in Egypt. There they acquired property, and they were fruitful, and their population grew rapidly."
        },
        {
          "version": "ESV",
          "text": "Thus Israel settled in the land of Egypt, in the land of Goshen. And they gained possessions in it, and were fruitful and multiplied greatly."
        },
        {
          "version": "NKJV",
          "text": "So Israel dwelt in the land of Egypt, in the country of Goshen; and they had possessions there and grew and multiplied exceedingly."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:7",
          "text": "but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Exodus 1:12",
          "text": "But the more they were oppressed, the more they multiplied and flourished; so the Egyptians came to dread the Israelites."
        },
        {
          "reference": "Exodus 1:20",
          "text": "So God was good to the midwives, and the people multiplied and became even more numerous."
        },
        {
          "reference": "Leviticus 26:9",
          "text": "I will turn toward you and make you fruitful and multiply you, and I will establish My covenant with you."
        },
        {
          "reference": "Deuteronomy 26:5",
          "text": "and you are to declare before the LORD your God, “My father was a wandering Aramean, and he went down to Egypt few in number and lived there and became a great nation, mighty and numerous."
        },
        {
          "reference": "Deuteronomy 28:11",
          "text": "The LORD will make you prosper abundantly—in the fruit of your womb, the offspring of your livestock, and the produce of your land—in the land that the LORD swore to your fathers to give you."
        },
        {
          "reference": "Deuteronomy 30:5",
          "text": "And the LORD your God will bring you into the land your fathers possessed, and you will take possession of it. He will cause you to prosper and multiply more than your fathers."
        },
        {
          "reference": "Joshua 21:43-45",
          "text": "Thus the LORD gave Israel all the land He had sworn to give their fathers, and they took possession of it and settled in it. / And the LORD gave them rest on every side, just as He had sworn to their fathers. None of their enemies could stand against them, for the LORD delivered all their enemies into their hand. / Not one of all the LORD’s good promises to the house of Israel had failed; everything was fulfilled."
        },
        {
          "reference": "1 Kings 4:20",
          "text": "The people of Judah and Israel were as numerous as the sand on the seashore, and they were eating and drinking and rejoicing."
        },
        {
          "reference": "Psalm 105:24",
          "text": "And the LORD made His people very fruitful, more numerous than their foes,"
        },
        {
          "reference": "Isaiah 51:2",
          "text": "Look to Abraham your father, and to Sarah who gave you birth. When I called him, he was but one; then I blessed him and multiplied him."
        },
        {
          "reference": "Jeremiah 30:19",
          "text": "Thanksgiving will proceed from them, a sound of celebration. I will multiply them, and they will not be decreased; I will honor them, and they will not be belittled."
        },
        {
          "reference": "Ezekiel 36:11",
          "text": "I will fill you with people and animals, and they will multiply and be fruitful. I will make you as inhabited as you once were, and I will make you prosper more than before. Then you will know that I am the LORD."
        },
        {
          "reference": "Acts 7:17",
          "text": "As the time drew near for God to fulfill His promise to Abraham, our people in Egypt increased greatly in number."
        },
        {
          "reference": "Acts 7:11-14",
          "text": "Then famine and great suffering swept across Egypt and Canaan, and our fathers could not find food. / When Jacob heard that there was grain in Egypt, he sent our fathers on their first visit. / On their second visit, Joseph revealed his identity to his brothers, and his family became known to Pharaoh. ..."
        }
      ]
    },
    {
      "reference": "Genesis 47:28",
      "book": "Genesis",
      "chapter": 47,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob lived in Egypt seventeen years, and the years of his life were a hundred and forty-seven."
        },
        {
          "version": "NLT",
          "text": "Jacob lived for seventeen years after his arrival in Egypt, so he lived 147 years in all."
        },
        {
          "version": "ESV",
          "text": "And Jacob lived in the land of Egypt seventeen years. So the days of Jacob, the years of his life, were 147 years."
        },
        {
          "version": "NKJV",
          "text": "And Jacob lived in the land of Egypt seventeen years. So the length of Jacob’s life was one hundred and forty-seven years."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 25:7-8",
          "text": "Abraham lived a total of 175 years. / And at a ripe old age he breathed his last and died, old and contented, and was gathered to his people."
        },
        {
          "reference": "Genesis 35:28-29",
          "text": "And Isaac lived 180 years. / Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 50:24-26",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.” / So Joseph died at the age of 110. And they embalmed his body and placed it in a coffin in Egypt."
        },
        {
          "reference": "Exodus 1:6-7",
          "text": "Now Joseph and all his brothers and all that generation died, / but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Genesis 48:1-2",
          "text": "Some time later Joseph was told, “Your father is ill.” So he set out with his two sons, Manasseh and Ephraim. / When Jacob was told, “Your son Joseph has come to you,” Israel rallied his strength and sat up in bed."
        },
        {
          "reference": "Genesis 49:1-2",
          "text": "Then Jacob called for his sons and said, “Gather around so that I can tell you what will happen to you in the days to come: / Come together and listen, O sons of Jacob; listen to your father Israel."
        },
        {
          "reference": "Genesis 15:13-16",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions. / You, however, will go to your fathers in peace and be buried at a ripe old age. ..."
        },
        {
          "reference": "Exodus 12:40-41",
          "text": "Now the duration of the Israelites’ stay in Egypt was 430 years. / At the end of the 430 years, to the very day, all the LORD’s divisions went out of the land of Egypt."
        },
        {
          "reference": "Acts 7:14-16",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 37:1",
          "text": "Now Jacob lived in the land where his father had resided, the land of Canaan."
        },
        {
          "reference": "Genesis 41:46",
          "text": "Now Joseph was thirty years old when he entered the service of Pharaoh king of Egypt. And Joseph left Pharaoh’s presence and traveled throughout the land of Egypt."
        },
        {
          "reference": "Genesis 45:6-7",
          "text": "For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance."
        }
      ]
    },
    {
      "reference": "Genesis 47:29",
      "book": "Genesis",
      "chapter": 47,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "When the time drew near for Israel to die, he called for his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise that you will show me kindness and faithfulness. Do not bury me in Egypt,"
        },
        {
          "version": "NLT",
          "text": "As the time of his death drew near, Jacob called for his son Joseph and said to him, “Please do me this favor. Put your hand under my thigh and swear that you will treat me with unfailing love by honoring this last request: Do not bury me in Egypt."
        },
        {
          "version": "ESV",
          "text": "And when the time drew near that Israel must die, he called his son Joseph and said to him, “If now I have found favor in your sight, put your hand under my thigh and promise to deal kindly and truly with me. Do not bury me in Egypt,"
        },
        {
          "version": "NKJV",
          "text": "When the time drew near that Israel must die, he called his son Joseph and said to him, “Now if I have found favor in your sight, please put your hand under my thigh, and deal kindly and truly with me. Please do not bury me in Egypt,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 24:2-3",
          "text": "So Abraham instructed the chief servant of his household, who managed all he owned, “Place your hand under my thigh, / and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling,"
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "1 Kings 2:1-4",
          "text": "As the time drew near for David to die, he charged his son Solomon, / “I am about to go the way of all the earth. So be strong and prove yourself a man. / And keep the charge of the LORD your God to walk in His ways and to keep His statutes, commandments, ordinances, and decrees, as written in the Law of Moses, so that you may prosper in all you do and wherever you turn, ..."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "2 Samuel 23:1-2",
          "text": "These are the last words of David: “The oracle of David son of Jesse, the oracle of the man raised on high, the one anointed by the God of Jacob, and the sweet psalmist of Israel: / The Spirit of the LORD spoke through me; His word was on my tongue."
        },
        {
          "reference": "1 Chronicles 29:28",
          "text": "He died at a ripe old age, full of years, riches, and honor, and his son Solomon reigned in his place."
        },
        {
          "reference": "2 Timothy 4:6-8",
          "text": "For I am already being poured out like a drink offering, and the time of my departure is at hand. / I have fought the good fight, I have finished the race, I have kept the faith. / From now on there is laid up for me the crown of righteousness, which the Lord, the righteous Judge, will award to me on that day—and not only to me, but to all who crave His appearing."
        },
        {
          "reference": "Joshua 23:14",
          "text": "Now behold, today I am going the way of all the earth, and you know with all your heart and soul that not one of the good promises the LORD your God made to you has failed. Everything was fulfilled for you; not one promise has failed."
        },
        {
          "reference": "2 Peter 1:13-15",
          "text": "I think it is right to refresh your memory as long as I live in the tent of my body, / because I know that this tent will soon be laid aside, as our Lord Jesus Christ has made clear to me. / And I will make every effort to ensure that after my departure, you will be able to recall these things at all times."
        },
        {
          "reference": "Deuteronomy 31:14",
          "text": "Then the LORD said to Moses, “Behold, the time of your death is near. Call Joshua and present yourselves at the Tent of Meeting, so that I may commission him.” So Moses and Joshua went and presented themselves at the Tent of Meeting."
        },
        {
          "reference": "John 13:1",
          "text": "It was now just before the Passover Feast, and Jesus knew that His hour had come to leave this world and return to the Father. Having loved His own who were in the world, He loved them to the very end."
        },
        {
          "reference": "2 Kings 20:1",
          "text": "In those days Hezekiah became mortally ill. The prophet Isaiah son of Amoz came to him and said, “This is what the LORD says: ‘Put your house in order, for you are about to die; you will not recover.’”"
        },
        {
          "reference": "Philippians 1:23-24",
          "text": "I am torn between the two. I desire to depart and be with Christ, which is far better indeed. / But it is more necessary for you that I remain in the body."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Psalm 37:37",
          "text": "Consider the blameless and observe the upright, for posterity awaits the man of peace."
        }
      ]
    },
    {
      "reference": "Genesis 47:30",
      "book": "Genesis",
      "chapter": 47,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "but when I rest with my fathers, carry me out of Egypt and bury me where they are buried.” “I will do as you say,” he said."
        },
        {
          "version": "NLT",
          "text": "When I die, please take my body out of Egypt and bury me with my ancestors.” So Joseph promised, “I will do as you ask.”"
        },
        {
          "version": "ESV",
          "text": "but let me lie with my fathers. Carry me out of Egypt and bury me in their burying place.” He answered, “I will do as you have said.”"
        },
        {
          "version": "NKJV",
          "text": "but let me lie with my fathers; you shall carry me out of Egypt and bury me in their burial place.” And he said, “I will do as you have said.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 50:5",
          "text": "my father made me swear an oath when he said, ‘I am about to die. You must bury me in the tomb that I dug for myself in the land of Canaan.’ Now let me go and bury my father, and then return.”"
        },
        {
          "reference": "Genesis 50:13",
          "text": "They carried him to the land of Canaan and buried him in the cave at Machpelah in the field near Mamre, which Abraham had purchased from Ephron the Hittite as a burial site."
        },
        {
          "reference": "Genesis 23:19",
          "text": "After this, Abraham buried his wife Sarah in the cave of the field at Machpelah near Mamre (that is, Hebron) in the land of Canaan."
        },
        {
          "reference": "Genesis 25:9",
          "text": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite."
        },
        {
          "reference": "Genesis 49:29-32",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah. ..."
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Genesis 15:15",
          "text": "You, however, will go to your fathers in peace and be buried at a ripe old age."
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 28:21",
          "text": "so that I may return safely to my father’s house, then the LORD will be my God."
        },
        {
          "reference": "Genesis 33:19",
          "text": "And the plot of ground where he pitched his tent, he purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        }
      ]
    },
    {
      "reference": "Genesis 47:31",
      "book": "Genesis",
      "chapter": 47,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "“Swear to me,” he said. Then Joseph swore to him, and Israel worshiped as he leaned on the top of his staff."
        },
        {
          "version": "NLT",
          "text": "“Swear that you will do it,” Jacob insisted. So Joseph gave his oath, and Jacob bowed humbly at the head of his bed."
        },
        {
          "version": "ESV",
          "text": "And he said, “Swear to me”; and he swore to him. Then Israel bowed himself upon the head of his bed."
        },
        {
          "version": "NKJV",
          "text": "Then he said, “Swear to me.” And he swore to him. So Israel bowed himself on the head of the bed."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 48:1-2",
          "text": "Some time later Joseph was told, “Your father is ill.” So he set out with his two sons, Manasseh and Ephraim. / When Jacob was told, “Your son Joseph has come to you,” Israel rallied his strength and sat up in bed."
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "1 Kings 1:47",
          "text": "The king’s servants have also gone to congratulate our lord King David, saying, ‘May your God make the name of Solomon more famous than your own name, and may He make his throne greater than your throne.’ And the king has bowed in worship on his bed,"
        },
        {
          "reference": "Genesis 24:2-3",
          "text": "So Abraham instructed the chief servant of his household, who managed all he owned, “Place your hand under my thigh, / and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling,"
        },
        {
          "reference": "Genesis 28:1-4",
          "text": "So Isaac called for Jacob and blessed him. “Do not take a wife from the Canaanite women,” he commanded. / “Go at once to Paddan-aram, to the house of your mother’s father Bethuel, and take a wife from among the daughters of Laban, your mother’s brother. / May God Almighty bless you and make you fruitful and multiply you, so that you may become a company of peoples. ..."
        },
        {
          "reference": "Genesis 49:29-33",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah. ..."
        },
        {
          "reference": "Genesis 50:5-6",
          "text": "my father made me swear an oath when he said, ‘I am about to die. You must bury me in the tomb that I dug for myself in the land of Canaan.’ Now let me go and bury my father, and then return.” / Pharaoh replied, “Go up and bury your father, as he made you swear to do.”"
        },
        {
          "reference": "Genesis 24:9",
          "text": "So the servant placed his hand under the thigh of his master Abraham and swore an oath to him concerning this matter."
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 25:8-9",
          "text": "And at a ripe old age he breathed his last and died, old and contented, and was gathered to his people. / His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite."
        },
        {
          "reference": "Genesis 15:15",
          "text": "You, however, will go to your fathers in peace and be buried at a ripe old age."
        },
        {
          "reference": "Genesis 23:1-2",
          "text": "Now Sarah lived to be 127 years old. / She died in Kiriath-arba (that is, Hebron) in the land of Canaan, and Abraham went out to mourn and to weep for her."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        }
      ]
    }
  ]
}