{
  "book": "genesis",
  "chapter": 48,
  "verses": [
    {
      "reference": "Genesis 48:1",
      "book": "Genesis",
      "chapter": 48,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Some time later Joseph was told, “Your father is ill.” So he took his two sons Manasseh and Ephraim along with him."
        },
        {
          "version": "NLT",
          "text": "One day not long after this, word came to Joseph, “Your father is failing rapidly.” So Joseph went to visit his father, and he took with him his two sons, Manasseh and Ephraim."
        },
        {
          "version": "ESV",
          "text": "After this, Joseph was told, “Behold, your father is ill.” So he took with him his two sons, Manasseh and Ephraim."
        },
        {
          "version": "NKJV",
          "text": "Now it came to pass after these things that Joseph was told, “Indeed your father is sick”; and he took with him his two sons, Manasseh and Ephraim."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Genesis 50:1-14",
          "text": "Then Joseph fell upon his father’s face, wept over him, and kissed him. / And Joseph directed the physicians in his service to embalm his father Israel. So they embalmed him, / taking the forty days required to complete the embalming. And the Egyptians mourned for him seventy days. ..."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 35:9-12",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him. / And God said to him, “Though your name is Jacob, you will no longer be called Jacob. Instead, your name will be Israel.” So God named him Israel. / And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. ..."
        },
        {
          "reference": "Genesis 41:51-52",
          "text": "Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 46:1-4",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Genesis 49:1-28",
          "text": "Then Jacob called for his sons and said, “Gather around so that I can tell you what will happen to you in the days to come: / Come together and listen, O sons of Jacob; listen to your father Israel. / Reuben, you are my firstborn, my might, and the beginning of my strength, excelling in honor, excelling in power. ..."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Genesis 17:1-8",
          "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, “I am God Almighty. Walk before Me and be blameless. / I will establish My covenant between Me and you, and I will multiply you exceedingly.” / Then Abram fell facedown, and God said to him, ..."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 37:1-11",
          "text": "Now Jacob lived in the land where his father had resided, the land of Canaan. / This is the account of Jacob. When Joseph was seventeen years old, he was tending the flock with his brothers, the sons of his father’s wives Bilhah and Zilpah, and he brought their father a bad report about them. / Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors. ..."
        },
        {
          "reference": "Genesis 45:25-28",
          "text": "So the brothers went up out of Egypt and came to their father Jacob in the land of Canaan. / “Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them. / However, when they relayed all that Joseph had told them, and when he saw the wagons that Joseph had sent to carry him back, the spirit of their father Jacob was revived. ..."
        },
        {
          "reference": "Genesis 50:22-26",
          "text": "Now Joseph and his father’s household remained in Egypt, and Joseph lived to the age of 110. / He saw Ephraim’s sons to the third generation, and indeed the sons of Machir son of Manasseh were brought up on Joseph’s knees. / Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” ..."
        },
        {
          "reference": "Exodus 1:1-7",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Joshua 14:4",
          "text": "The descendants of Joseph became two tribes, Manasseh and Ephraim. And no portion of the land was given to the Levites, except for cities in which to live, along with pasturelands for their flocks and herds."
        }
      ]
    },
    {
      "reference": "Genesis 48:2",
      "book": "Genesis",
      "chapter": 48,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "When Jacob was told, “Your son Joseph has come to you,” Israel rallied his strength and sat up on the bed."
        },
        {
          "version": "NLT",
          "text": "When Joseph arrived, Jacob was told, “Your son Joseph has come to see you.” So Jacob gathered his strength and sat up in his bed."
        },
        {
          "version": "ESV",
          "text": "And it was told to Jacob, “Your son Joseph has come to you.” Then Israel summoned his strength and sat up in bed."
        },
        {
          "version": "NKJV",
          "text": "And Jacob was told, “Look, your son Joseph is coming to you”; and Israel strengthened himself and sat up on the bed."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 47:31",
          "text": "“Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 27:1",
          "text": "When Isaac was old and his eyes were so weak that he could no longer see, he called his older son Esau and said to him, “My son.” “Here I am,” Esau replied."
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 49:33",
          "text": "When Jacob had finished instructing his sons, he pulled his feet into the bed and breathed his last, and he was gathered to his people."
        },
        {
          "reference": "1 Kings 1:47",
          "text": "The king’s servants have also gone to congratulate our lord King David, saying, ‘May your God make the name of Solomon more famous than your own name, and may He make his throne greater than your throne.’ And the king has bowed in worship on his bed,"
        },
        {
          "reference": "Genesis 50:1",
          "text": "Then Joseph fell upon his father’s face, wept over him, and kissed him."
        },
        {
          "reference": "Genesis 24:1",
          "text": "By now Abraham was old and well along in years, and the LORD had blessed him in every way."
        },
        {
          "reference": "Genesis 25:8",
          "text": "And at a ripe old age he breathed his last and died, old and contented, and was gathered to his people."
        },
        {
          "reference": "Genesis 46:4",
          "text": "I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "2 Samuel 19:32-34",
          "text": "Barzillai was quite old, eighty years of age, and since he was a very wealthy man, he had provided for the king while he stayed in Mahanaim. / The king said to Barzillai, “Cross over with me, and I will provide for you at my side in Jerusalem.” / But Barzillai replied, “How many years of my life remain, that I should go up to Jerusalem with the king?"
        },
        {
          "reference": "1 Kings 2:1-2",
          "text": "As the time drew near for David to die, he charged his son Solomon, / “I am about to go the way of all the earth. So be strong and prove yourself a man."
        },
        {
          "reference": "2 Kings 20:1",
          "text": "In those days Hezekiah became mortally ill. The prophet Isaiah son of Amoz came to him and said, “This is what the LORD says: ‘Put your house in order, for you are about to die; you will not recover.’”"
        },
        {
          "reference": "John 11:1-3",
          "text": "At this time a man named Lazarus was sick. He lived in Bethany, the village of Mary and her sister Martha. / (Mary, whose brother Lazarus was sick, was to anoint the Lord with perfume and wipe His feet with her hair.) / So the sisters sent word to Jesus, “Lord, the one You love is sick.”"
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        }
      ]
    },
    {
      "reference": "Genesis 48:3",
      "book": "Genesis",
      "chapter": 48,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan, and there he blessed me"
        },
        {
          "version": "NLT",
          "text": "Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan and blessed me."
        },
        {
          "version": "ESV",
          "text": "And Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan and blessed me,"
        },
        {
          "version": "NKJV",
          "text": "Then Jacob said to Joseph: “God Almighty appeared to me at Luz in the land of Canaan and blessed me,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 35:9-12",
          "text": "After Jacob had returned from Paddan-aram, God appeared to him again and blessed him. / And God said to him, “Though your name is Jacob, you will no longer be called Jacob. Instead, your name will be Israel.” So God named him Israel. / And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. ..."
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 17:1-8",
          "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, “I am God Almighty. Walk before Me and be blameless. / I will establish My covenant between Me and you, and I will multiply you exceedingly.” / Then Abram fell facedown, and God said to him, ..."
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Exodus 6:2-4",
          "text": "God also told Moses, “I am the LORD. / I appeared to Abraham, to Isaac, and to Jacob as God Almighty, but by My name the LORD I did not make Myself known to them. / I also established My covenant with them to give them the land of Canaan, the land where they lived as foreigners."
        },
        {
          "reference": "Genesis 26:24",
          "text": "and that night the LORD appeared to him and said, “I am the God of your father Abraham. Do not be afraid, for I am with you. I will bless you and multiply your descendants for the sake of My servant Abraham.”"
        },
        {
          "reference": "Genesis 15:1-5",
          "text": "After these events, the word of the LORD came to Abram in a vision: “Do not be afraid, Abram. I am your shield, your very great reward.” / But Abram replied, “O Lord GOD, what can You give me, since I remain childless, and the heir of my house is Eliezer of Damascus?” / Abram continued, “Behold, You have given me no offspring, so a servant in my household will be my heir.” ..."
        },
        {
          "reference": "Genesis 22:15-18",
          "text": "And the angel of the LORD called to Abraham from heaven a second time, / saying, “By Myself I have sworn, declares the LORD, that because you have done this and have not withheld your only son, / I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies. ..."
        },
        {
          "reference": "Genesis 32:28",
          "text": "Then the man said, “Your name will no longer be Jacob, but Israel, because you have struggled with God and with men, and you have prevailed.”"
        },
        {
          "reference": "Genesis 46:2-4",
          "text": "And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. / I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Acts 7:2-3",
          "text": "And Stephen declared: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Haran, / and told him, ‘Leave your country and your kindred and go to the land I will show you.’"
        },
        {
          "reference": "Hebrews 11:8-9",
          "text": "By faith Abraham, when called to go to a place he would later receive as his inheritance, obeyed and went, without knowing where he was going. / By faith he dwelt in the promised land as a stranger in a foreign country. He lived in tents, as did Isaac and Jacob, who were heirs with him of the same promise."
        },
        {
          "reference": "Hebrews 11:17-18",
          "text": "By faith Abraham, when he was tested, offered up Isaac on the altar. He who had received the promises was ready to offer his one and only son, / even though God had said to him, “Through Isaac your offspring will be reckoned.”"
        },
        {
          "reference": "Romans 4:13",
          "text": "For the promise to Abraham and his offspring that he would be heir of the world was not given through the law, but through the righteousness that comes by faith."
        },
        {
          "reference": "Galatians 3:16",
          "text": "The promises were spoken to Abraham and to his seed. The Scripture does not say, “and to seeds,” meaning many, but “and to your seed,” meaning One, who is Christ."
        }
      ]
    },
    {
      "reference": "Genesis 48:4",
      "book": "Genesis",
      "chapter": 48,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "and said to me, ‘I am going to make you fruitful and increase your numbers. I will make you a community of peoples, and I will give this land as an everlasting possession to your descendants after you.’"
        },
        {
          "version": "NLT",
          "text": "He said to me, ‘I will make you fruitful, and I will multiply your descendants. I will make you a multitude of nations. And I will give this land of Canaan to your descendants after you as an everlasting possession.’"
        },
        {
          "version": "ESV",
          "text": "and said to me, ‘Behold, I will make you fruitful and multiply you, and I will make of you a company of peoples and will give this land to your offspring after you for an everlasting possession.’"
        },
        {
          "version": "NKJV",
          "text": "and said to me, ‘Behold, I will make you fruitful and multiply you, and I will make of you a multitude of people, and give this land to your descendants after you as an everlasting possession.’"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:6-8",
          "text": "I will make you exceedingly fruitful; I will make nations of you, and kings will descend from you. / I will establish My covenant as an everlasting covenant between Me and you and your descendants after you, to be your God and the God of your descendants after you. / And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 35:11-12",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. / The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Exodus 1:7",
          "text": "but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Leviticus 26:9",
          "text": "I will turn toward you and make you fruitful and multiply you, and I will establish My covenant with you."
        },
        {
          "reference": "Deuteronomy 1:10",
          "text": "The LORD your God has multiplied you, so that today you are as numerous as the stars in the sky."
        },
        {
          "reference": "Deuteronomy 7:13",
          "text": "He will love you and bless you and multiply you. He will bless the fruit of your womb and the produce of your land—your grain, new wine, and oil, the young of your herds and the lambs of your flocks—in the land that He swore to your fathers to give you."
        },
        {
          "reference": "Deuteronomy 28:4",
          "text": "The fruit of your womb will be blessed, as well as the produce of your land and the offspring of your livestock—the calves of your herds and the lambs of your flocks."
        },
        {
          "reference": "Deuteronomy 28:11",
          "text": "The LORD will make you prosper abundantly—in the fruit of your womb, the offspring of your livestock, and the produce of your land—in the land that the LORD swore to your fathers to give you."
        },
        {
          "reference": "1 Chronicles 16:17-18",
          "text": "He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: / ‘I will give you the land of Canaan as the portion of your inheritance.’"
        },
        {
          "reference": "Psalm 105:9-11",
          "text": "the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: / “I will give you the land of Canaan as the portion of your inheritance.”"
        },
        {
          "reference": "Isaiah 51:2",
          "text": "Look to Abraham your father, and to Sarah who gave you birth. When I called him, he was but one; then I blessed him and multiplied him."
        },
        {
          "reference": "Jeremiah 30:19",
          "text": "Thanksgiving will proceed from them, a sound of celebration. I will multiply them, and they will not be decreased; I will honor them, and they will not be belittled."
        },
        {
          "reference": "Ezekiel 36:10-11",
          "text": "I will multiply the people upon you—the house of Israel in its entirety. The cities will be inhabited and the ruins rebuilt. / I will fill you with people and animals, and they will multiply and be fruitful. I will make you as inhabited as you once were, and I will make you prosper more than before. Then you will know that I am the LORD."
        },
        {
          "reference": "Acts 7:5",
          "text": "He gave him no inheritance here, not even a foot of ground. But God promised to give possession of the land to Abraham and his descendants, even though he did not yet have a child."
        },
        {
          "reference": "Romans 4:13",
          "text": "For the promise to Abraham and his offspring that he would be heir of the world was not given through the law, but through the righteousness that comes by faith."
        }
      ]
    },
    {
      "reference": "Genesis 48:5",
      "book": "Genesis",
      "chapter": 48,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "“Now then, your two sons born to you in Egypt before I came to you here will be reckoned as mine; Ephraim and Manasseh will be mine, just as Reuben and Simeon are mine."
        },
        {
          "version": "NLT",
          "text": "“Now I am claiming as my own sons these two boys of yours, Ephraim and Manasseh, who were born here in the land of Egypt before I arrived. They will be my sons, just as Reuben and Simeon are."
        },
        {
          "version": "ESV",
          "text": "And now your two sons, who were born to you in the land of Egypt before I came to you in Egypt, are mine; Ephraim and Manasseh shall be mine, as Reuben and Simeon are."
        },
        {
          "version": "NKJV",
          "text": "And now your two sons, Ephraim and Manasseh, who were born to you in the land of Egypt before I came to you in Egypt, are mine; as Reuben and Simeon, they shall be mine."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:50-52",
          "text": "Before the years of famine arrived, two sons were born to Joseph by Asenath daughter of Potiphera, priest of On. / Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 46:20",
          "text": "Manasseh and Ephraim were born to Joseph in the land of Egypt by Asenath daughter of Potiphera, priest of On."
        },
        {
          "reference": "Genesis 49:1-28",
          "text": "Then Jacob called for his sons and said, “Gather around so that I can tell you what will happen to you in the days to come: / Come together and listen, O sons of Jacob; listen to your father Israel. / Reuben, you are my firstborn, my might, and the beginning of my strength, excelling in honor, excelling in power. ..."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Joshua 14:4",
          "text": "The descendants of Joseph became two tribes, Manasseh and Ephraim. And no portion of the land was given to the Levites, except for cities in which to live, along with pasturelands for their flocks and herds."
        },
        {
          "reference": "Numbers 1:32-35",
          "text": "From the sons of Joseph: From the sons of Ephraim, according to the records of their clans and families, counting the names of all those twenty years of age or older who could serve in the army, / those registered to the tribe of Ephraim numbered 40,500. / And from the sons of Manasseh, according to the records of their clans and families, counting the names of all those twenty years of age or older who could serve in the army, ..."
        },
        {
          "reference": "Numbers 26:28-37",
          "text": "The descendants of Joseph included the clans of Manasseh and Ephraim. / These were the descendants of Manasseh: The Machirite clan from Machir, the father of Gilead, and the Gileadite clan from Gilead. / These were the descendants of Gilead: the Iezerite clan from Iezer, the Helekite clan from Helek, ..."
        },
        {
          "reference": "Deuteronomy 33:13-17",
          "text": "Concerning Joseph he said: “May his land be blessed by the LORD with the precious dew from heaven above and the deep waters that lie beneath, / with the bountiful harvest from the sun and the abundant yield of the seasons, / with the best of the ancient mountains and the bounty of the everlasting hills, ..."
        },
        {
          "reference": "1 Chronicles 7:14-29",
          "text": "The descendants of Manasseh: Asriel through his Aramean concubine. She also gave birth to Machir the father of Gilead. / Machir took a wife from among the Huppites and Shuppites. The name of his sister was Maacah. Another descendant was named Zelophehad, who had only daughters. / Machir’s wife Maacah gave birth to a son, and she named him Peresh. His brother was named Sheresh, and his sons were Ulam and Rekem. ..."
        },
        {
          "reference": "Ezekiel 47:13",
          "text": "This is what the Lord GOD says: “These are the boundaries by which you are to divide the land as an inheritance among the twelve tribes of Israel; Joseph shall receive two portions."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Romans 9:6-13",
          "text": "It is not as though God’s word has failed. For not all who are descended from Israel are Israel. / Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. ..."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        },
        {
          "reference": "Matthew 19:29",
          "text": "And everyone who has left houses or brothers or sisters or father or mother or wife or children or fields for the sake of My name will receive a hundredfold and will inherit eternal life."
        },
        {
          "reference": "John 1:12-13",
          "text": "But to all who did receive Him, to those who believed in His name, He gave the right to become children of God— / children born not of blood, nor of the desire or will of man, but born of God."
        }
      ]
    },
    {
      "reference": "Genesis 48:6",
      "book": "Genesis",
      "chapter": 48,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Any children born to you after them will be yours; in the territory they inherit they will be reckoned under the names of their brothers."
        },
        {
          "version": "NLT",
          "text": "But any children born to you in the future will be your own, and they will inherit land within the territories of their brothers Ephraim and Manasseh."
        },
        {
          "version": "ESV",
          "text": "And the children that you fathered after them shall be yours. They shall be called by the name of their brothers in their inheritance."
        },
        {
          "version": "NKJV",
          "text": "Your offspring whom you beget after them shall be yours; they will be called by the name of their brothers in their inheritance."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 25:5-6",
          "text": "Abraham left everything he owned to Isaac. / But while he was still alive, Abraham gave gifts to the sons of his concubines and sent them away from his son Isaac to the land of the east."
        },
        {
          "reference": "Genesis 35:11-12",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you. / The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Genesis 49:28",
          "text": "These are the tribes of Israel, twelve in all, and this was what their father said to them. He blessed them, and he blessed each one with a suitable blessing."
        },
        {
          "reference": "Exodus 1:7",
          "text": "but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "Joshua 14:4",
          "text": "The descendants of Joseph became two tribes, Manasseh and Ephraim. And no portion of the land was given to the Levites, except for cities in which to live, along with pasturelands for their flocks and herds."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "1 Chronicles 7:14-19",
          "text": "The descendants of Manasseh: Asriel through his Aramean concubine. She also gave birth to Machir the father of Gilead. / Machir took a wife from among the Huppites and Shuppites. The name of his sister was Maacah. Another descendant was named Zelophehad, who had only daughters. / Machir’s wife Maacah gave birth to a son, and she named him Peresh. His brother was named Sheresh, and his sons were Ulam and Rekem. ..."
        },
        {
          "reference": "Psalm 127:3-5",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward. / Like arrows in the hand of a warrior, so are children born in one’s youth. / Blessed is the man whose quiver is full of them. He will not be put to shame when he confronts the enemies at the gate."
        },
        {
          "reference": "Isaiah 43:5-7",
          "text": "Do not be afraid, for I am with you; I will bring your offspring from the east and gather you from the west. / I will say to the north, ‘Give them up!’ and to the south, ‘Do not hold them back!’ Bring My sons from afar, and My daughters from the ends of the earth— / everyone called by My name and created for My glory, whom I have indeed formed and made.”"
        },
        {
          "reference": "Jeremiah 31:9",
          "text": "They will come with weeping, and by their supplication I will lead them; I will make them walk beside streams of waters, on a level path where they will not stumble. For I am Israel’s Father, and Ephraim is My firstborn.”"
        },
        {
          "reference": "Ezekiel 47:13-14",
          "text": "This is what the Lord GOD says: “These are the boundaries by which you are to divide the land as an inheritance among the twelve tribes of Israel; Joseph shall receive two portions. / You are to divide it equally among them. Because I swore with an uplifted hand to give it to your forefathers, this land will fall to you as an inheritance."
        },
        {
          "reference": "Matthew 19:29",
          "text": "And everyone who has left houses or brothers or sisters or father or mother or wife or children or fields for the sake of My name will receive a hundredfold and will inherit eternal life."
        },
        {
          "reference": "Luke 1:33",
          "text": "and He will reign over the house of Jacob forever. His kingdom will never end!”"
        }
      ]
    },
    {
      "reference": "Genesis 48:7",
      "book": "Genesis",
      "chapter": 48,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "As I was returning from Paddan, to my sorrow Rachel died in the land of Canaan while we were still on the way, a little distance from Ephrath. So I buried her there beside the road to Ephrath” (that is, Bethlehem)."
        },
        {
          "version": "NLT",
          "text": "“Long ago, as I was returning from Paddan-aram, Rachel died in the land of Canaan. We were still on the way, some distance from Ephrath (that is, Bethlehem). So with great sorrow I buried her there beside the road to Ephrath.”"
        },
        {
          "version": "ESV",
          "text": "As for me, when I came from Paddan, to my sorrow Rachel died in the land of Canaan on the way, when there was still some distance to go to Ephrath, and I buried her there on the way to Ephrath (that is, Bethlehem).”"
        },
        {
          "version": "NKJV",
          "text": "But as for me, when I came from Padan, Rachel died beside me in the land of Canaan on the way, when there was but a little distance to go to Ephrath; and I buried her there on the way to Ephrath (that is, Bethlehem).”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 35:16-20",
          "text": "Later, they set out from Bethel, and while they were still some distance from Ephrath, Rachel began to give birth, and her labor was difficult. / During her severe labor, the midwife said to her, “Do not be afraid, for you are having another son.” / And with her last breath—for she was dying—she named him Ben-oni. But his father called him Benjamin. ..."
        },
        {
          "reference": "Genesis 49:31",
          "text": "There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah."
        },
        {
          "reference": "Genesis 33:18-20",
          "text": "After Jacob had come from Paddan-aram, he arrived safely at the city of Shechem in the land of Canaan, and he camped just outside the city. / And the plot of ground where he pitched his tent, he purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. / There he set up an altar and called it El-Elohe-Israel."
        },
        {
          "reference": "Genesis 37:1",
          "text": "Now Jacob lived in the land where his father had resided, the land of Canaan."
        },
        {
          "reference": "Genesis 50:5",
          "text": "my father made me swear an oath when he said, ‘I am about to die. You must bury me in the tomb that I dug for myself in the land of Canaan.’ Now let me go and bury my father, and then return.”"
        },
        {
          "reference": "Ruth 4:11",
          "text": "“We are witnesses,” said the elders and all the people at the gate. “May the LORD make the woman entering your home like Rachel and Leah, who together built up the house of Israel. May you be prosperous in Ephrathah and famous in Bethlehem."
        },
        {
          "reference": "1 Samuel 10:2",
          "text": "When you leave me today, you will find two men at Rachel’s tomb in Zelzah on the border of Benjamin. They will say to you, ‘The donkeys you seek have been found, and now your father has stopped worrying about the donkeys and started worrying about you, asking, “What should I do about my son?”’"
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Jeremiah 31:15",
          "text": "This is what the LORD says: “A voice is heard in Ramah, mourning and great weeping, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Genesis 23:19",
          "text": "After this, Abraham buried his wife Sarah in the cave of the field at Machpelah near Mamre (that is, Hebron) in the land of Canaan."
        },
        {
          "reference": "Genesis 28:19",
          "text": "and he called that place Bethel, though previously the city had been named Luz."
        },
        {
          "reference": "Genesis 29:30",
          "text": "Jacob slept with Rachel as well, and indeed, he loved Rachel more than Leah. So he worked for Laban another seven years."
        },
        {
          "reference": "Genesis 30:22-24",
          "text": "Then God remembered Rachel. He listened to her and opened her womb, / and she conceived and gave birth to a son. “God has taken away my shame,” she said. / She named him Joseph, and said, “May the LORD add to me another son.”"
        },
        {
          "reference": "Genesis 46:19",
          "text": "The sons of Jacob’s wife Rachel: Joseph and Benjamin."
        },
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        }
      ]
    },
    {
      "reference": "Genesis 48:8",
      "book": "Genesis",
      "chapter": 48,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "When Israel saw the sons of Joseph, he asked, “Who are these?”"
        },
        {
          "version": "NLT",
          "text": "Then Jacob looked over at the two boys. “Are these your sons?” he asked."
        },
        {
          "version": "ESV",
          "text": "When Israel saw Joseph’s sons, he said, “Who are these?”"
        },
        {
          "version": "NKJV",
          "text": "Then Israel saw Joseph’s sons, and said, “Who are these?”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:1",
          "text": "When Isaac was old and his eyes were so weak that he could no longer see, he called his older son Esau and said to him, “My son.” “Here I am,” Esau replied."
        },
        {
          "reference": "Genesis 37:33",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!”"
        },
        {
          "reference": "Genesis 45:26-28",
          "text": "“Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them. / However, when they relayed all that Joseph had told them, and when he saw the wagons that Joseph had sent to carry him back, the spirit of their father Jacob was revived. / “Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 50:23",
          "text": "He saw Ephraim’s sons to the third generation, and indeed the sons of Machir son of Manasseh were brought up on Joseph’s knees."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Deuteronomy 34:7",
          "text": "Moses was a hundred and twenty years old when he died, yet his eyes were not weak, and his vitality had not diminished."
        },
        {
          "reference": "1 Samuel 3:2",
          "text": "And at that time Eli, whose eyesight had grown so dim that he could not see, was lying in his room."
        },
        {
          "reference": "1 Kings 14:4",
          "text": "Jeroboam’s wife did as instructed; she arose and went to Shiloh and arrived at Ahijah’s house. Now Ahijah could not see, for his eyes were dim because of his age."
        },
        {
          "reference": "Psalm 71:18",
          "text": "Even when I am old and gray, do not forsake me, O God, until I proclaim Your power to the next generation, Your might to all who are to come."
        },
        {
          "reference": "Psalm 92:14",
          "text": "In old age they will still bear fruit; healthy and green they will remain,"
        },
        {
          "reference": "Isaiah 46:4",
          "text": "Even to your old age, I will be the same, and I will bear you up when you turn gray. I have made you, and I will carry you; I will sustain you and deliver you."
        },
        {
          "reference": "Matthew 17:3",
          "text": "Suddenly Moses and Elijah appeared before them, talking with Jesus."
        },
        {
          "reference": "Matthew 22:32",
          "text": "‘I am the God of Abraham, the God of Isaac, and the God of Jacob’? He is not the God of the dead, but of the living.”"
        },
        {
          "reference": "Luke 2:28-30",
          "text": "Simeon took Him in his arms and blessed God, saying: / “Sovereign Lord, as You have promised, You now dismiss Your servant in peace. / For my eyes have seen Your salvation,"
        }
      ]
    },
    {
      "reference": "Genesis 48:9",
      "book": "Genesis",
      "chapter": 48,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "“They are the sons God has given me here,” Joseph said to his father. Then Israel said, &#8220Bring them to me so I may bless them.”"
        },
        {
          "version": "NLT",
          "text": "“Yes,” Joseph told him, “these are the sons God has given me here in Egypt.” And Jacob said, “Bring them closer to me, so I can bless them.”"
        },
        {
          "version": "ESV",
          "text": "Joseph said to his father, “They are my sons, whom God has given me here.” And he said, “Bring them to me, please, that I may bless them.”"
        },
        {
          "version": "NKJV",
          "text": "Joseph said to his father, “They are my sons, whom God has given me in this place. ” And he said, “Please bring them to me, and I will bless them.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 48:10",
      "book": "Genesis",
      "chapter": 48,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "Now Israel’s eyes were failing because of old age, and he could hardly see. So Joseph brought his sons close to him, and his father kissed them and embraced them."
        },
        {
          "version": "NLT",
          "text": "Jacob was half blind because of his age and could hardly see. So Joseph brought the boys close to him, and Jacob kissed and embraced them."
        },
        {
          "version": "ESV",
          "text": "Now the eyes of Israel were dim with age, so that he could not see. So Joseph brought them near him, and he kissed them and embraced them."
        },
        {
          "version": "NKJV",
          "text": "Now the eyes of Israel were dim with age, so that he could not see. Then Joseph brought them near him, and he kissed them and embraced them."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:1",
          "text": "When Isaac was old and his eyes were so weak that he could no longer see, he called his older son Esau and said to him, “My son.” “Here I am,” Esau replied."
        },
        {
          "reference": "Deuteronomy 34:7",
          "text": "Moses was a hundred and twenty years old when he died, yet his eyes were not weak, and his vitality had not diminished."
        },
        {
          "reference": "1 Samuel 3:2",
          "text": "And at that time Eli, whose eyesight had grown so dim that he could not see, was lying in his room."
        },
        {
          "reference": "1 Kings 14:4",
          "text": "Jeroboam’s wife did as instructed; she arose and went to Shiloh and arrived at Ahijah’s house. Now Ahijah could not see, for his eyes were dim because of his age."
        },
        {
          "reference": "1 Kings 18:43",
          "text": "“Go and look toward the sea,” he said to his servant. So the servant went and looked, and he said, “There is nothing there.” Seven times Elijah said, “Go back.”"
        },
        {
          "reference": "2 Kings 6:17",
          "text": "Then Elisha prayed, “O LORD, please open his eyes that he may see.” And the LORD opened the eyes of the young man, and he saw that the hills were full of horses and chariots of fire all around Elisha."
        },
        {
          "reference": "Job 17:7",
          "text": "My eyes have grown dim with grief, and my whole body is but a shadow."
        },
        {
          "reference": "Job 29:15",
          "text": "I served as eyes to the blind and as feet to the lame."
        },
        {
          "reference": "Psalm 6:7",
          "text": "My eyes fail from grief; they grow dim because of all my foes."
        },
        {
          "reference": "Psalm 31:9",
          "text": "Be merciful to me, O LORD, for I am in distress; my eyes fail from sorrow, my soul and body as well."
        },
        {
          "reference": "Psalm 38:10",
          "text": "My heart pounds, my strength fails, and even the light of my eyes has faded."
        },
        {
          "reference": "Ecclesiastes 12:3",
          "text": "on the day the keepers of the house tremble and the strong men stoop, when those grinding cease because they are few and those watching through windows see dimly,"
        },
        {
          "reference": "Isaiah 42:16",
          "text": "I will lead the blind by a way they did not know; I will guide them on unfamiliar paths. I will turn darkness into light before them and rough places into level ground. These things I will do for them, and I will not forsake them."
        },
        {
          "reference": "Matthew 9:27-30",
          "text": "As Jesus went on from there, two blind men followed Him, crying out, “Have mercy on us, Son of David!” / After Jesus had entered the house, the blind men came to Him. “Do you believe that I am able to do this?” He asked. “Yes, Lord,” they answered. / Then He touched their eyes and said, “According to your faith will it be done to you.” ..."
        },
        {
          "reference": "Matthew 20:30-34",
          "text": "And there were two blind men sitting beside the road. When they heard that Jesus was passing by, they cried out, “Lord, Son of David, have mercy on us!” / The crowd admonished them to be silent, but they cried out all the louder, “Lord, Son of David, have mercy on us!” / Jesus stopped and called them. “What do you want Me to do for you?” He asked. ..."
        }
      ]
    },
    {
      "reference": "Genesis 48:11",
      "book": "Genesis",
      "chapter": 48,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Israel said to Joseph, “I never expected to see your face again, and now God has allowed me to see your children too.”"
        },
        {
          "version": "NLT",
          "text": "Then Jacob said to Joseph, “I never thought I would see your face again, but now God has let me see your children, too!”"
        },
        {
          "version": "ESV",
          "text": "And Israel said to Joseph, “I never expected to see your face; and behold, God has let me see your offspring also.”"
        },
        {
          "version": "NKJV",
          "text": "And Israel said to Joseph, “I had not thought to see your face; but in fact, God has also shown me your offspring!”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:33-35",
          "text": "His father recognized it and said, “It is my son’s robe! A vicious animal has devoured him. Joseph has surely been torn to pieces!” / Then Jacob tore his clothes, put sackcloth around his waist, and mourned for his son many days. / All his sons and daughters tried to comfort him, but he refused to be comforted. “No,” he said. “I will go down to Sheol mourning for my son.” So his father wept for him."
        },
        {
          "reference": "Genesis 45:26-28",
          "text": "“Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them. / However, when they relayed all that Joseph had told them, and when he saw the wagons that Joseph had sent to carry him back, the spirit of their father Jacob was revived. / “Enough!” declared Israel. “My son Joseph is still alive! I will go to see him before I die.”"
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 50:20",
          "text": "As for you, what you intended against me for evil, God intended for good, in order to accomplish a day like this—to preserve the lives of many people."
        },
        {
          "reference": "Exodus 3:16",
          "text": "Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt."
        },
        {
          "reference": "Exodus 4:31",
          "text": "and they believed. And when they heard that the LORD had attended to the Israelites and had seen their affliction, they bowed down and worshiped."
        },
        {
          "reference": "Ruth 4:14-15",
          "text": "Then the women said to Naomi, “Blessed be the LORD, who has not left you this day without a kinsman-redeemer. May his name become famous in Israel. / He will renew your life and sustain you in your old age. For your daughter-in-law, who loves you and is better to you than seven sons, has given him birth.”"
        },
        {
          "reference": "1 Samuel 2:1",
          "text": "At that time Hannah prayed: “My heart rejoices in the LORD; my horn is exalted in the LORD. My mouth speaks boldly against my enemies, for I rejoice in Your salvation."
        },
        {
          "reference": "1 Samuel 2:21",
          "text": "So the LORD attended to Hannah, and she conceived and gave birth to three sons and two daughters. Meanwhile, the boy Samuel grew up in the presence of the LORD."
        },
        {
          "reference": "2 Samuel 14:14",
          "text": "For we will surely die and be like water poured out on the ground, which cannot be recovered. Yet God does not take away a life, but He devises ways that the banished one may not be cast out from Him."
        },
        {
          "reference": "Job 42:16-17",
          "text": "After this, Job lived 140 years and saw his children and their children to the fourth generation. / And so Job died, old and full of years."
        },
        {
          "reference": "Psalm 126:1-3",
          "text": "A song of ascents. When the LORD restored the captives of Zion, we were like dreamers. / Then our mouths were filled with laughter, our tongues with shouts of joy. Then it was said among the nations, “The LORD has done great things for them.” / The LORD has done great things for us; we are filled with joy."
        },
        {
          "reference": "Isaiah 25:8-9",
          "text": "He will swallow up death forever. The Lord GOD will wipe away the tears from every face and remove the disgrace of His people from the whole earth. For the LORD has spoken. / And in that day it will be said, “Surely this is our God; we have waited for Him, and He has saved us. This is the LORD for whom we have waited. Let us rejoice and be glad in His salvation.”"
        },
        {
          "reference": "Isaiah 38:5",
          "text": "“Go and tell Hezekiah that this is what the LORD, the God of your father David, says: ‘I have heard your prayer; I have seen your tears. Behold, I will add fifteen years to your life."
        },
        {
          "reference": "Jeremiah 31:16-17",
          "text": "This is what the LORD says: “Keep your voice from weeping and your eyes from tears, for the reward for your work will come, declares the LORD. Then your children will return from the land of the enemy. / So there is hope for your future, declares the LORD, and your children will return to their own land."
        }
      ]
    },
    {
      "reference": "Genesis 48:12",
      "book": "Genesis",
      "chapter": 48,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Joseph removed them from Israel’s knees and bowed down with his face to the ground."
        },
        {
          "version": "NLT",
          "text": "Joseph moved the boys, who were at their grandfather’s knees, and he bowed with his face to the ground."
        },
        {
          "version": "ESV",
          "text": "Then Joseph removed them from his knees, and he bowed himself with his face to the earth."
        },
        {
          "version": "NKJV",
          "text": "So Joseph brought them from beside his knees, and he bowed down with his face to the earth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:30-33",
          "text": "As soon as Isaac had finished blessing him and Jacob had left his father’s presence, his brother Esau returned from the hunt. / He too made some tasty food, brought it to his father, and said to him, “My father, sit up and eat of your son’s game, so that you may bless me.” / But his father Isaac replied, “Who are you?” “I am Esau, your firstborn son,” he answered. ..."
        },
        {
          "reference": "Genesis 37:3",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors."
        },
        {
          "reference": "Genesis 41:51",
          "text": "Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.”"
        },
        {
          "reference": "Genesis 50:23",
          "text": "He saw Ephraim’s sons to the third generation, and indeed the sons of Machir son of Manasseh were brought up on Joseph’s knees."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Deuteronomy 33:17",
          "text": "His majesty is like a firstborn bull, and his horns are like those of a wild ox. With them he will gore the nations, even to the ends of the earth. Such are the myriads of Ephraim, and such are the thousands of Manasseh.”"
        },
        {
          "reference": "Joshua 14:4",
          "text": "The descendants of Joseph became two tribes, Manasseh and Ephraim. And no portion of the land was given to the Levites, except for cities in which to live, along with pasturelands for their flocks and herds."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Psalm 127:3-5",
          "text": "Children are indeed a heritage from the LORD, and the fruit of the womb is His reward. / Like arrows in the hand of a warrior, so are children born in one’s youth. / Blessed is the man whose quiver is full of them. He will not be put to shame when he confronts the enemies at the gate."
        },
        {
          "reference": "Isaiah 8:18",
          "text": "Here am I, and the children the LORD has given me as signs and symbols in Israel from the LORD of Hosts, who dwells on Mount Zion."
        },
        {
          "reference": "Matthew 19:13-15",
          "text": "Then little children were brought to Jesus for Him to place His hands on them and pray for them. And the disciples rebuked those who brought them. / But Jesus said, “Let the little children come to Me, and do not hinder them! For the kingdom of heaven belongs to such as these.” / And after He had placed His hands on them, He went on from there."
        },
        {
          "reference": "Mark 10:13-16",
          "text": "Now people were bringing the little children to Jesus for Him to place His hands on them, and the disciples rebuked those who brought them. / But when Jesus saw this, He was indignant and told them, “Let the little children come to Me, and do not hinder them! For the kingdom of God belongs to such as these. / Truly I tell you, anyone who does not receive the kingdom of God like a little child will never enter it.” ..."
        },
        {
          "reference": "Luke 18:15-17",
          "text": "Now people were even bringing their babies to Jesus for Him to place His hands on them. And when the disciples saw this, they rebuked those who brought them. / But Jesus called the children to Him and said, “Let the little children come to Me, and do not hinder them! For the kingdom of God belongs to such as these. / Truly I tell you, anyone who does not receive the kingdom of God like a little child will never enter it.”"
        },
        {
          "reference": "John 1:12-13",
          "text": "But to all who did receive Him, to those who believed in His name, He gave the right to become children of God— / children born not of blood, nor of the desire or will of man, but born of God."
        },
        {
          "reference": "Acts 7:14-15",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died."
        }
      ]
    },
    {
      "reference": "Genesis 48:13",
      "book": "Genesis",
      "chapter": 48,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "And Joseph took both of them, Ephraim on his right toward Israel’s left hand and Manasseh on his left toward Israel’s right hand, and brought them close to him."
        },
        {
          "version": "NLT",
          "text": "Then he positioned the boys in front of Jacob. With his right hand he directed Ephraim toward Jacob’s left hand, and with his left hand he put Manasseh at Jacob’s right hand."
        },
        {
          "version": "ESV",
          "text": "And Joseph took them both, Ephraim in his right hand toward Israel’s left hand, and Manasseh in his left hand toward Israel’s right hand, and brought them near him."
        },
        {
          "version": "NKJV",
          "text": "And Joseph took them both, Ephraim with his right hand toward Israel’s left hand, and Manasseh with his left hand toward Israel’s right hand, and brought them near him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 41:51-52",
          "text": "Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 37:3",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors."
        },
        {
          "reference": "Genesis 41:50",
          "text": "Before the years of famine arrived, two sons were born to Joseph by Asenath daughter of Potiphera, priest of On."
        },
        {
          "reference": "Genesis 46:20",
          "text": "Manasseh and Ephraim were born to Joseph in the land of Egypt by Asenath daughter of Potiphera, priest of On."
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "Deuteronomy 33:13-17",
          "text": "Concerning Joseph he said: “May his land be blessed by the LORD with the precious dew from heaven above and the deep waters that lie beneath, / with the bountiful harvest from the sun and the abundant yield of the seasons, / with the best of the ancient mountains and the bounty of the everlasting hills, ..."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "1 Chronicles 7:14-29",
          "text": "The descendants of Manasseh: Asriel through his Aramean concubine. She also gave birth to Machir the father of Gilead. / Machir took a wife from among the Huppites and Shuppites. The name of his sister was Maacah. Another descendant was named Zelophehad, who had only daughters. / Machir’s wife Maacah gave birth to a son, and she named him Peresh. His brother was named Sheresh, and his sons were Ulam and Rekem. ..."
        },
        {
          "reference": "Numbers 1:32-35",
          "text": "From the sons of Joseph: From the sons of Ephraim, according to the records of their clans and families, counting the names of all those twenty years of age or older who could serve in the army, / those registered to the tribe of Ephraim numbered 40,500. / And from the sons of Manasseh, according to the records of their clans and families, counting the names of all those twenty years of age or older who could serve in the army, ..."
        },
        {
          "reference": "Numbers 2:18-24",
          "text": "On the west side, the divisions of Ephraim are to camp under their standard: The leader of the Ephraimites is Elishama son of Ammihud, / and his division numbers 40,500. / The tribe of Manasseh will be next to it. The leader of the Manassites is Gamaliel son of Pedahzur, ..."
        },
        {
          "reference": "Numbers 26:28-37",
          "text": "The descendants of Joseph included the clans of Manasseh and Ephraim. / These were the descendants of Manasseh: The Machirite clan from Machir, the father of Gilead, and the Gileadite clan from Gilead. / These were the descendants of Gilead: the Iezerite clan from Iezer, the Helekite clan from Helek, ..."
        },
        {
          "reference": "Joshua 14:4",
          "text": "The descendants of Joseph became two tribes, Manasseh and Ephraim. And no portion of the land was given to the Levites, except for cities in which to live, along with pasturelands for their flocks and herds."
        },
        {
          "reference": "Ezekiel 37:16-19",
          "text": "“And you, son of man, take a single stick and write on it: ‘Belonging to Judah and to the Israelites associated with him.’ Then take another stick and write on it: ‘Belonging to Joseph—the stick of Ephraim—and to all the house of Israel associated with him.’ / Then join them together into one stick, so that they become one in your hand. / When your people ask you, ‘Won’t you explain to us what you mean by these?’ ..."
        },
        {
          "reference": "1 Kings 3:13",
          "text": "Moreover, I will give you what you did not request—both riches and honor—so that during all your days no man in any kingdom will be your equal."
        }
      ]
    },
    {
      "reference": "Genesis 48:14",
      "book": "Genesis",
      "chapter": 48,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "But Israel reached out his right hand and put it on Ephraim’s head, though he was the younger, and crossing his arms, he put his left hand on Manasseh’s head, even though Manasseh was the firstborn."
        },
        {
          "version": "NLT",
          "text": "But Jacob crossed his arms as he reached out to lay his hands on the boys’ heads. He put his right hand on the head of Ephraim, though he was the younger boy, and his left hand on the head of Manasseh, though he was the firstborn."
        },
        {
          "version": "ESV",
          "text": "And Israel stretched out his right hand and laid it on the head of Ephraim, who was the younger, and his left hand on the head of Manasseh, crossing his hands (for Manasseh was the firstborn)."
        },
        {
          "version": "NKJV",
          "text": "Then Israel stretched out his right hand and laid it on Ephraim’s head, who was the younger, and his left hand on Manasseh’s head, guiding his hands knowingly, for Manasseh was the firstborn."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 27:27-29",
          "text": "So he came near and kissed him. When Isaac smelled his clothing, he blessed him and said: “Ah, the smell of my son is like the smell of a field that the LORD has blessed. / May God give to you the dew of heaven and the richness of the earth—an abundance of grain and new wine. / May peoples serve you and nations bow down to you. May you be the master of your brothers, and may the sons of your mother bow down to you. May those who curse you be cursed, and those who bless you be blessed.”"
        },
        {
          "reference": "Genesis 27:38-40",
          "text": "Esau said to his father, “Do you have only one blessing, my father? Bless me too, O my father!” Then Esau wept aloud. / His father Isaac answered him: “Behold, your dwelling place shall be away from the richness of the land, away from the dew of heaven above. / You shall live by the sword and serve your brother. But when you rebel, you will tear his yoke from your neck.”"
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 37:3",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors."
        },
        {
          "reference": "Genesis 41:51-52",
          "text": "Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 49:22-26",
          "text": "Joseph is a fruitful vine—a fruitful vine by a spring, whose branches scale the wall. / The archers attacked him with bitterness; they aimed at him in hostility. / Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, ..."
        },
        {
          "reference": "Deuteronomy 33:13-17",
          "text": "Concerning Joseph he said: “May his land be blessed by the LORD with the precious dew from heaven above and the deep waters that lie beneath, / with the bountiful harvest from the sun and the abundant yield of the seasons, / with the best of the ancient mountains and the bounty of the everlasting hills, ..."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Matthew 19:13-15",
          "text": "Then little children were brought to Jesus for Him to place His hands on them and pray for them. And the disciples rebuked those who brought them. / But Jesus said, “Let the little children come to Me, and do not hinder them! For the kingdom of heaven belongs to such as these.” / And after He had placed His hands on them, He went on from there."
        },
        {
          "reference": "Mark 10:13-16",
          "text": "Now people were bringing the little children to Jesus for Him to place His hands on them, and the disciples rebuked those who brought them. / But when Jesus saw this, He was indignant and told them, “Let the little children come to Me, and do not hinder them! For the kingdom of God belongs to such as these. / Truly I tell you, anyone who does not receive the kingdom of God like a little child will never enter it.” ..."
        },
        {
          "reference": "Luke 18:15-17",
          "text": "Now people were even bringing their babies to Jesus for Him to place His hands on them. And when the disciples saw this, they rebuked those who brought them. / But Jesus called the children to Him and said, “Let the little children come to Me, and do not hinder them! For the kingdom of God belongs to such as these. / Truly I tell you, anyone who does not receive the kingdom of God like a little child will never enter it.”"
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Acts 7:14-16",
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five in all. / So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        }
      ]
    },
    {
      "reference": "Genesis 48:15",
      "book": "Genesis",
      "chapter": 48,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he blessed Joseph and said, “May the God before whom my fathers Abraham and Isaac walked faithfully, the God who has been my shepherd all my life to this day,"
        },
        {
          "version": "NLT",
          "text": "Then he blessed Joseph and said, “May the God before whom my grandfather Abraham and my father, Isaac, walked— the God who has been my shepherd all my life, to this very day,"
        },
        {
          "version": "ESV",
          "text": "And he blessed Joseph and said, “The God before whom my fathers Abraham and Isaac walked, the God who has been my shepherd all my life long to this day,"
        },
        {
          "version": "NKJV",
          "text": "And he blessed Joseph, and said: “God, before whom my fathers Abraham and Isaac walked, The God who has fed me all my life long to this day,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 35:3",
          "text": "Then let us arise and go to Bethel. I will build an altar there to God, who answered me in my day of distress. He has been with me wherever I have gone.”"
        },
        {
          "reference": "Genesis 49:24-25",
          "text": "Yet he steadied his bow, and his strong arms were tempered by the hands of the Mighty One of Jacob, in the name of the Shepherd, the Rock of Israel, / by the God of your father who helps you, and by the Almighty who blesses you, with blessings of the heavens above, with blessings of the depths below, with blessings of the breasts and womb."
        },
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Exodus 3:15-16",
          "text": "God also told Moses, “Say to the Israelites, ‘The LORD, the God of your fathers—the God of Abraham, the God of Isaac, and the God of Jacob—has sent me to you.’ This is My name forever, and this is how I am to be remembered in every generation. / Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt."
        },
        {
          "reference": "Exodus 4:5",
          "text": "“This is so that they may believe that the LORD, the God of their fathers—the God of Abraham, the God of Isaac, and the God of Jacob—has appeared to you.”"
        },
        {
          "reference": "Deuteronomy 1:31",
          "text": "and in the wilderness, where the LORD your God carried you, as a man carries his son, all the way by which you traveled until you reached this place.”"
        },
        {
          "reference": "Deuteronomy 32:11-12",
          "text": "As an eagle stirs up its nest and hovers over its young, He spread His wings to catch them and carried them on His pinions. / The LORD alone led him, and no foreign god was with him."
        },
        {
          "reference": "Psalm 23:1-4",
          "text": "A Psalm of David. The LORD is my shepherd; I shall not want. / He makes me lie down in green pastures; He leads me beside quiet waters. / He restores my soul; He guides me in the paths of righteousness for the sake of His name. ..."
        },
        {
          "reference": "Psalm 77:20",
          "text": "You led Your people like a flock by the hand of Moses and Aaron."
        },
        {
          "reference": "Psalm 80:1",
          "text": "For the choirmaster. To the tune of “The Lilies of the Covenant.” A Psalm of Asaph. Hear us, O Shepherd of Israel, who leads Joseph like a flock; You who sit enthroned between the cherubim, shine forth"
        },
        {
          "reference": "Isaiah 40:11",
          "text": "He tends His flock like a shepherd; He gathers the lambs in His arms and carries them close to His heart. He gently leads the nursing ewes."
        },
        {
          "reference": "Isaiah 63:9",
          "text": "In all their distress, He too was afflicted, and the Angel of His Presence saved them. In His love and compassion He redeemed them; He lifted them up and carried them all the days of old."
        },
        {
          "reference": "Hosea 12:4-5",
          "text": "Yes, he struggled with the angel and prevailed; he wept and sought His favor; he found Him at Bethel and spoke with Him there— / the LORD God of Hosts, the LORD is His name of renown."
        },
        {
          "reference": "Matthew 22:32",
          "text": "‘I am the God of Abraham, the God of Isaac, and the God of Jacob’? He is not the God of the dead, but of the living.”"
        }
      ]
    },
    {
      "reference": "Genesis 48:16",
      "book": "Genesis",
      "chapter": 48,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "the Angel who has delivered me from all harm —may he bless these boys. May they be called by my name and the names of my fathers Abraham and Isaac, and may they increase greatly on the earth.”"
        },
        {
          "version": "NLT",
          "text": "the Angel who has redeemed me from all harm— may he bless these boys. May they preserve my name and the names of Abraham and Isaac. And may their descendants multiply greatly throughout the earth.”"
        },
        {
          "version": "ESV",
          "text": "the angel who has redeemed me from all evil, bless the boys; and in them let my name be carried on, and the name of my fathers Abraham and Isaac; and let them grow into a multitude in the midst of the earth.”"
        },
        {
          "version": "NKJV",
          "text": "The Angel who has redeemed me from all evil, Bless the lads; Let my name be named upon them, And the name of my fathers Abraham and Isaac; And let them grow into a multitude in the midst of the earth.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 31:11-13",
          "text": "In that dream the angel of God said to me, ‘Jacob!’ And I replied, ‘Here I am.’ / ‘Look up,’ he said, ‘and see that all the males that are mating with the flock are streaked, spotted, or speckled; for I have seen all that Laban has done to you. / I am the God of Bethel, where you anointed the pillar and made a solemn vow to Me. Now get up, leave this land at once, and return to your native land.’”"
        },
        {
          "reference": "Genesis 32:24-30",
          "text": "So Jacob was left all alone, and there a man wrestled with him until daybreak. / When the man saw that he could not overpower Jacob, he struck the socket of Jacob’s hip and dislocated it as they wrestled. / Then the man said, “Let me go, for it is daybreak.” But Jacob replied, “I will not let you go unless you bless me.” ..."
        },
        {
          "reference": "Genesis 35:3",
          "text": "Then let us arise and go to Bethel. I will build an altar there to God, who answered me in my day of distress. He has been with me wherever I have gone.”"
        },
        {
          "reference": "Genesis 46:3-4",
          "text": "“I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. / I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Exodus 23:20-23",
          "text": "Behold, I am sending an angel before you to protect you along the way and to bring you to the place I have prepared. / Pay attention to him and listen to his voice; do not defy him, for he will not forgive rebellion, since My Name is in him. / But if you will listen carefully to his voice and do everything I say, I will be an enemy to your enemies and a foe to your foes. ..."
        },
        {
          "reference": "Exodus 14:19",
          "text": "And the angel of God, who had gone before the camp of Israel, withdrew and went behind them. The pillar of cloud also moved from before them and stood behind them,"
        },
        {
          "reference": "Numbers 20:16",
          "text": "and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory."
        },
        {
          "reference": "Isaiah 63:9",
          "text": "In all their distress, He too was afflicted, and the Angel of His Presence saved them. In His love and compassion He redeemed them; He lifted them up and carried them all the days of old."
        },
        {
          "reference": "Hosea 12:4-5",
          "text": "Yes, he struggled with the angel and prevailed; he wept and sought His favor; he found Him at Bethel and spoke with Him there— / the LORD God of Hosts, the LORD is His name of renown."
        },
        {
          "reference": "Psalm 34:7",
          "text": "The angel of the LORD encamps around those who fear Him, and he delivers them."
        },
        {
          "reference": "Psalm 91:11",
          "text": "For He will command His angels concerning you to guard you in all your ways."
        },
        {
          "reference": "Matthew 18:10",
          "text": "See that you do not look down on any of these little ones. For I tell you that their angels in heaven always see the face of My Father in heaven."
        },
        {
          "reference": "Matthew 28:20",
          "text": "and teaching them to obey all that I have commanded you. And surely I am with you always, even to the end of the age.”"
        },
        {
          "reference": "Luke 1:19",
          "text": "“I am Gabriel,” replied the angel. “I stand in the presence of God, and I have been sent to speak to you and to bring you this good news."
        }
      ]
    },
    {
      "reference": "Genesis 48:17",
      "book": "Genesis",
      "chapter": 48,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "When Joseph saw his father placing his right hand on Ephraim’s head he was displeased; so he took hold of his father’s hand to move it from Ephraim’s head to Manasseh’s head."
        },
        {
          "version": "NLT",
          "text": "But Joseph was upset when he saw that his father placed his right hand on Ephraim’s head. So Joseph lifted it to move it from Ephraim’s head to Manasseh’s head."
        },
        {
          "version": "ESV",
          "text": "When Joseph saw that his father laid his right hand on the head of Ephraim, it displeased him, and he took his father’s hand to move it from Ephraim’s head to Manasseh’s head."
        },
        {
          "version": "NKJV",
          "text": "Now when Joseph saw that his father laid his right hand on the head of Ephraim, it displeased him; so he took hold of his father’s hand to remove it from Ephraim’s head to Manasseh’s head."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:18-29",
          "text": "So Jacob went to his father and said, “My father.” “Here I am!” he answered. “Which one are you, my son?” / Jacob said to his father, “I am Esau, your firstborn. I have done as you told me. Please sit up and eat some of my game, so that you may bless me.” / But Isaac asked his son, “How did you ever find it so quickly, my son?” “Because the LORD your God brought it to me,” he replied. ..."
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 27:36",
          "text": "So Esau declared, “Is he not rightly named Jacob? For he has cheated me twice. He took my birthright, and now he has taken my blessing.” Then he asked, “Haven’t you saved a blessing for me?”"
        },
        {
          "reference": "Genesis 37:3",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors."
        },
        {
          "reference": "Genesis 41:51-52",
          "text": "Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 49:3-4",
          "text": "Reuben, you are my firstborn, my might, and the beginning of my strength, excelling in honor, excelling in power. / Uncontrolled as the waters, you will no longer excel, because you went up to your father’s bed, onto my couch, and defiled it."
        },
        {
          "reference": "Exodus 13:2",
          "text": "“Consecrate to Me every firstborn male. The firstborn from every womb among the Israelites belongs to Me, both of man and beast.”"
        },
        {
          "reference": "Deuteronomy 21:17",
          "text": "Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Psalm 78:67-68",
          "text": "He rejected the tent of Joseph and refused the tribe of Ephraim. / But He chose the tribe of Judah, Mount Zion, which He loved."
        },
        {
          "reference": "Romans 9:12-13",
          "text": "not by works but by Him who calls, she was told, “The older will serve the younger.” / So it is written: “Jacob I loved, but Esau I hated.”"
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Matthew 19:30",
          "text": "But many who are first will be last, and the last will be first."
        },
        {
          "reference": "Matthew 20:16",
          "text": "So the last will be first, and the first will be last.”"
        },
        {
          "reference": "Luke 1:51-52",
          "text": "He has performed mighty deeds with His arm; He has scattered those who are proud in the thoughts of their hearts. / He has brought down rulers from their thrones, but has exalted the humble."
        }
      ]
    },
    {
      "reference": "Genesis 48:18",
      "book": "Genesis",
      "chapter": 48,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph said to him, “No, my father, this one is the firstborn; put your right hand on his head.”"
        },
        {
          "version": "NLT",
          "text": "“No, my father,” he said. “This one is the firstborn. Put your right hand on his head.”"
        },
        {
          "version": "ESV",
          "text": "And Joseph said to his father, “Not this way, my father; since this one is the firstborn, put your right hand on his head.”"
        },
        {
          "version": "NKJV",
          "text": "And Joseph said to his father, “Not so, my father, for this one is the firstborn; put your right hand on his head.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 27:18-29",
          "text": "So Jacob went to his father and said, “My father.” “Here I am!” he answered. “Which one are you, my son?” / Jacob said to his father, “I am Esau, your firstborn. I have done as you told me. Please sit up and eat some of my game, so that you may bless me.” / But Isaac asked his son, “How did you ever find it so quickly, my son?” “Because the LORD your God brought it to me,” he replied. ..."
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 37:3",
          "text": "Now Israel loved Joseph more than his other sons, because Joseph had been born to him in his old age; so he made him a robe of many colors."
        },
        {
          "reference": "Genesis 41:51-52",
          "text": "Joseph named the firstborn Manasseh, saying, “God has made me forget all my hardship and all my father’s household.” / And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 49:3-4",
          "text": "Reuben, you are my firstborn, my might, and the beginning of my strength, excelling in honor, excelling in power. / Uncontrolled as the waters, you will no longer excel, because you went up to your father’s bed, onto my couch, and defiled it."
        },
        {
          "reference": "Deuteronomy 21:15-17",
          "text": "If a man has two wives, one beloved and the other unloved, and both bear him sons, but the unloved wife has the firstborn son, / when that man assigns his inheritance to his sons he must not appoint the son of the beloved wife as the firstborn over the son of the unloved wife. / Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "1 Samuel 16:6-13",
          "text": "When they arrived, Samuel saw Eliab and said, “Surely here before the LORD is His anointed.” / But the LORD said to Samuel, “Do not consider his appearance or height, for I have rejected him; the LORD does not see as man does. For man sees the outward appearance, but the LORD sees the heart.” / Then Jesse called Abinadab and presented him to Samuel, who said, “The LORD has not chosen this one either.” ..."
        },
        {
          "reference": "1 Kings 2:15",
          "text": "“You know that the kingship was mine,” he said. “All Israel expected that I should reign, but the kingship has turned to my brother, for it has come to him from the LORD."
        },
        {
          "reference": "Psalm 78:67-68",
          "text": "He rejected the tent of Joseph and refused the tribe of Ephraim. / But He chose the tribe of Judah, Mount Zion, which He loved."
        },
        {
          "reference": "Romans 9:10-13",
          "text": "Not only that, but Rebecca’s children were conceived by one man, our father Isaac. / Yet before the twins were born or had done anything good or bad, in order that God’s plan of election might stand, / not by works but by Him who calls, she was told, “The older will serve the younger.” ..."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Matthew 19:30",
          "text": "But many who are first will be last, and the last will be first."
        },
        {
          "reference": "Matthew 20:16",
          "text": "So the last will be first, and the first will be last.”"
        },
        {
          "reference": "Luke 13:30",
          "text": "And indeed, some who are last will be first, and some who are first will be last.”"
        }
      ]
    },
    {
      "reference": "Genesis 48:19",
      "book": "Genesis",
      "chapter": 48,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "But his father refused and said, “I know, my son, I know. He too will become a people, and he too will become great. Nevertheless, his younger brother will be greater than he, and his descendants will become a group of nations.”"
        },
        {
          "version": "NLT",
          "text": "But his father refused. “I know, my son; I know,” he replied. “Manasseh will also become a great people, but his younger brother will become even greater. And his descendants will become a multitude of nations.”"
        },
        {
          "version": "ESV",
          "text": "But his father refused and said, “I know, my son, I know. He also shall become a people, and he also shall be great. Nevertheless, his younger brother shall be greater than he, and his offspring shall become a multitude of nations.”"
        },
        {
          "version": "NKJV",
          "text": "But his father refused and said, “I know, my son, I know. He also shall become a people, and he also shall be great; but truly his younger brother shall be greater than he, and his descendants shall become a multitude of nations.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 17:20",
          "text": "As for Ishmael, I have heard you, and I will surely bless him; I will make him fruitful and multiply him greatly. He will become the father of twelve rulers, and I will make him into a great nation."
        },
        {
          "reference": "Genesis 25:23",
          "text": "and He declared to her: “Two nations are in your womb, and two peoples from within you will be separated; one people will be stronger than the other, and the older will serve the younger.”"
        },
        {
          "reference": "Genesis 35:11",
          "text": "And God told him, “I am God Almighty. Be fruitful and multiply. A nation—even a company of nations—shall come from you, and kings shall descend from you."
        },
        {
          "reference": "Genesis 41:52",
          "text": "And the second son he named Ephraim, saying, “God has made me fruitful in the land of my affliction.”"
        },
        {
          "reference": "Genesis 49:10",
          "text": "The scepter will not depart from Judah, nor the staff from between his feet, until Shiloh comes and the allegiance of the nations is his."
        },
        {
          "reference": "Deuteronomy 33:17",
          "text": "His majesty is like a firstborn bull, and his horns are like those of a wild ox. With them he will gore the nations, even to the ends of the earth. Such are the myriads of Ephraim, and such are the thousands of Manasseh.”"
        },
        {
          "reference": "Numbers 1:33-35",
          "text": "those registered to the tribe of Ephraim numbered 40,500. / And from the sons of Manasseh, according to the records of their clans and families, counting the names of all those twenty years of age or older who could serve in the army, / those registered to the tribe of Manasseh numbered 32,200."
        },
        {
          "reference": "Numbers 2:18-21",
          "text": "On the west side, the divisions of Ephraim are to camp under their standard: The leader of the Ephraimites is Elishama son of Ammihud, / and his division numbers 40,500. / The tribe of Manasseh will be next to it. The leader of the Manassites is Gamaliel son of Pedahzur, ..."
        },
        {
          "reference": "Numbers 26:28-37",
          "text": "The descendants of Joseph included the clans of Manasseh and Ephraim. / These were the descendants of Manasseh: The Machirite clan from Machir, the father of Gilead, and the Gileadite clan from Gilead. / These were the descendants of Gilead: the Iezerite clan from Iezer, the Helekite clan from Helek, ..."
        },
        {
          "reference": "Joshua 17:17-18",
          "text": "So Joshua said to the house of Joseph—to Ephraim and Manasseh—“You have many people and great strength. You shall not have just one allotment, / because the hill country will be yours as well. It is a forest; clear it, and its farthest limits will be yours. Although the Canaanites have iron chariots and although they are strong, you can drive them out.”"
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "1 Chronicles 7:14-20",
          "text": "The descendants of Manasseh: Asriel through his Aramean concubine. She also gave birth to Machir the father of Gilead. / Machir took a wife from among the Huppites and Shuppites. The name of his sister was Maacah. Another descendant was named Zelophehad, who had only daughters. / Machir’s wife Maacah gave birth to a son, and she named him Peresh. His brother was named Sheresh, and his sons were Ulam and Rekem. ..."
        },
        {
          "reference": "Psalm 78:67-68",
          "text": "He rejected the tent of Joseph and refused the tribe of Ephraim. / But He chose the tribe of Judah, Mount Zion, which He loved."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Jeremiah 31:9",
          "text": "They will come with weeping, and by their supplication I will lead them; I will make them walk beside streams of waters, on a level path where they will not stumble. For I am Israel’s Father, and Ephraim is My firstborn.”"
        }
      ]
    },
    {
      "reference": "Genesis 48:20",
      "book": "Genesis",
      "chapter": 48,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "He blessed them that day and said, “In your name will Israel pronounce this blessing: ‘May God make you like Ephraim and Manasseh.’” So he put Ephraim ahead of Manasseh."
        },
        {
          "version": "NLT",
          "text": "So Jacob blessed the boys that day with this blessing: “The people of Israel will use your names when they give a blessing. They will say, ‘May God make you as prosperous as Ephraim and Manasseh.’” In this way, Jacob put Ephraim ahead of Manasseh."
        },
        {
          "version": "ESV",
          "text": "So he blessed them that day, saying, “By you Israel will pronounce blessings, saying, ‘God make you as Ephraim and as Manasseh.’” Thus he put Ephraim before Manasseh."
        },
        {
          "version": "NKJV",
          "text": "So he blessed them that day, saying, “By you Israel will bless, saying, ‘May God make you as Ephraim and as Manasseh!’ ” And thus he set Ephraim before Manasseh."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Genesis 12:2-3",
          "text": "I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 28:14",
          "text": "Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring."
        },
        {
          "reference": "Numbers 6:23-27",
          "text": "“Tell Aaron and his sons: This is how you are to bless the Israelites. Say to them: / ‘May the LORD bless you and keep you; / may the LORD cause His face to shine upon you and be gracious to you; ..."
        },
        {
          "reference": "Deuteronomy 33:17",
          "text": "His majesty is like a firstborn bull, and his horns are like those of a wild ox. With them he will gore the nations, even to the ends of the earth. Such are the myriads of Ephraim, and such are the thousands of Manasseh.”"
        },
        {
          "reference": "Joshua 17:17-18",
          "text": "So Joshua said to the house of Joseph—to Ephraim and Manasseh—“You have many people and great strength. You shall not have just one allotment, / because the hill country will be yours as well. It is a forest; clear it, and its farthest limits will be yours. Although the Canaanites have iron chariots and although they are strong, you can drive them out.”"
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Psalm 67:1-2",
          "text": "For the choirmaster. With stringed instruments. A Psalm. A song. May God be gracious to us and bless us, and cause His face to shine upon us, Selah / that Your ways may be known on earth, Your salvation among all nations."
        },
        {
          "reference": "Isaiah 19:24-25",
          "text": "In that day Israel will join a three-party alliance with Egypt and Assyria—a blessing upon the earth. / The LORD of Hosts will bless them, saying, “Blessed be Egypt My people, Assyria My handiwork, and Israel My inheritance.”"
        },
        {
          "reference": "Jeremiah 31:9",
          "text": "They will come with weeping, and by their supplication I will lead them; I will make them walk beside streams of waters, on a level path where they will not stumble. For I am Israel’s Father, and Ephraim is My firstborn.”"
        },
        {
          "reference": "Ezekiel 37:19",
          "text": "you are to tell them that this is what the Lord GOD says: ‘I will take the stick of Joseph, which is in the hand of Ephraim, and the tribes of Israel associated with him, and I will put them together with the stick of Judah. I will make them into a single stick, and they will become one in My hand.’"
        },
        {
          "reference": "Matthew 19:13-15",
          "text": "Then little children were brought to Jesus for Him to place His hands on them and pray for them. And the disciples rebuked those who brought them. / But Jesus said, “Let the little children come to Me, and do not hinder them! For the kingdom of heaven belongs to such as these.” / And after He had placed His hands on them, He went on from there."
        },
        {
          "reference": "Luke 2:34",
          "text": "Then Simeon blessed them and said to His mother Mary: “Behold, this Child is appointed to cause the rise and fall of many in Israel, and to be a sign that will be spoken against,"
        },
        {
          "reference": "Acts 3:25-26",
          "text": "And you are sons of the prophets and of the covenant God made with your fathers when He said to Abraham, ‘Through your offspring all the families of the earth will be blessed.’ / When God raised up His Servant, He sent Him first to you to bless you by turning each of you from your wicked ways.”"
        },
        {
          "reference": "Romans 9:7-13",
          "text": "Nor because they are Abraham’s descendants are they all his children. On the contrary, “Through Isaac your offspring will be reckoned.” / So it is not the children of the flesh who are God’s children, but it is the children of the promise who are regarded as offspring. / For this is what the promise stated: “At the appointed time I will return, and Sarah will have a son.” ..."
        }
      ]
    },
    {
      "reference": "Genesis 48:21",
      "book": "Genesis",
      "chapter": 48,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Israel said to Joseph, “I am about to die, but God will be with you and take you back to the land of your fathers."
        },
        {
          "version": "NLT",
          "text": "Then Jacob said to Joseph, “Look, I am about to die, but God will be with you and will take you back to Canaan, the land of your ancestors."
        },
        {
          "version": "ESV",
          "text": "Then Israel said to Joseph, “Behold, I am about to die, but God will be with you and will bring you again to the land of your fathers."
        },
        {
          "version": "NKJV",
          "text": "Then Israel said to Joseph, “Behold, I am dying, but God will be with you and bring you back to the land of your fathers."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 28:15",
          "text": "Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 46:4",
          "text": "I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Exodus 3:12",
          "text": "“I will surely be with you,” God said, “and this will be the sign to you that I have sent you: When you have brought the people out of Egypt, all of you will worship God on this mountain.”"
        },
        {
          "reference": "Deuteronomy 31:6",
          "text": "Be strong and courageous; do not be afraid or terrified of them, for it is the LORD your God who goes with you; He will never leave you nor forsake you.”"
        },
        {
          "reference": "Joshua 1:5",
          "text": "No one shall stand against you all the days of your life. As I was with Moses, so will I be with you; I will never leave you nor forsake you."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Isaiah 43:2",
          "text": "When you pass through the waters, I will be with you; and when you go through the rivers, they will not overwhelm you. When you walk through the fire, you will not be scorched; the flames will not set you ablaze."
        },
        {
          "reference": "Jeremiah 1:8",
          "text": "Do not be afraid of them, for I am with you to deliver you,” declares the LORD."
        },
        {
          "reference": "Jeremiah 30:11",
          "text": "For I am with you to save you, declares the LORD. Though I will completely destroy all the nations to which I have scattered you, I will not completely destroy you. Yet I will discipline you justly, and will by no means leave you unpunished.”"
        },
        {
          "reference": "Matthew 28:20",
          "text": "and teaching them to obey all that I have commanded you. And surely I am with you always, even to the end of the age.”"
        },
        {
          "reference": "John 14:18",
          "text": "I will not leave you as orphans; I will come to you."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Romans 8:31",
          "text": "What then shall we say in response to these things? If God is for us, who can be against us?"
        },
        {
          "reference": "2 Corinthians 1:10",
          "text": "He has delivered us from such a deadly peril, and He will deliver us. In Him we have placed our hope that He will yet again deliver us,"
        },
        {
          "reference": "Philippians 4:9",
          "text": "Whatever you have learned or received or heard from me, or seen in me, put it into practice. And the God of peace will be with you."
        }
      ]
    },
    {
      "reference": "Genesis 48:22",
      "book": "Genesis",
      "chapter": 48,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "And to you I give one more ridge of land than to your brothers, the ridge I took from the Amorites with my sword and my bow.”"
        },
        {
          "version": "NLT",
          "text": "And beyond what I have given your brothers, I am giving you an extra portion of the land that I took from the Amorites with my sword and bow.”"
        },
        {
          "version": "ESV",
          "text": "Moreover, I have given to you rather than to your brothers one mountain slope that I took from the hand of the Amorites with my sword and with my bow.”"
        },
        {
          "version": "NKJV",
          "text": "Moreover I have given to you one portion above your brothers, which I took from the hand of the Amorite with my sword and my bow.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "John 4:5",
          "text": "So He came to a town of Samaria called Sychar, near the plot of ground that Jacob had given to his son Joseph."
        },
        {
          "reference": "Genesis 33:19",
          "text": "And the plot of ground where he pitched his tent, he purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver."
        },
        {
          "reference": "Genesis 34:28",
          "text": "They took their flocks and herds and donkeys, and everything else in the city or in the field."
        },
        {
          "reference": "Genesis 49:26",
          "text": "The blessings of your father have surpassed the blessings of the ancient mountains and the bounty of the everlasting hills. May they rest on the head of Joseph, on the brow of the prince of his brothers."
        },
        {
          "reference": "Deuteronomy 21:17",
          "text": "Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Chronicles 5:2",
          "text": "And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "John 4:12",
          "text": "Are You greater than our father Jacob, who gave us this well and drank from it himself, as did his sons and his livestock?”"
        },
        {
          "reference": "Genesis 35:22",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons:"
        },
        {
          "reference": "Genesis 50:24",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.”"
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 15:18",
          "text": "On that day the LORD made a covenant with Abram, saying, “To your descendants I have given this land—from the river of Egypt to the great River Euphrates—"
        },
        {
          "reference": "Genesis 28:13",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie."
        }
      ]
    }
  ]
}