{
  "book": "genesis",
  "chapter": 49,
  "verses": [
    {
      "reference": "Genesis 49:1",
      "book": "Genesis",
      "chapter": 49,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Jacob called for his sons and said: “Gather around so I can tell you what will happen to you in days to come."
        },
        {
          "version": "NLT",
          "text": "Then Jacob called together all his sons and said, “Gather around me, and I will tell you what will happen to each of you in the days to come."
        },
        {
          "version": "ESV",
          "text": "Then Jacob called his sons and said, “Gather yourselves together, that I may tell you what shall happen to you in days to come."
        },
        {
          "version": "NKJV",
          "text": "And Jacob called his sons and said, “Gather together, that I may tell you what shall befall you in the last days:"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:1",
          "text": "This is the blessing that Moses the man of God pronounced upon the Israelites before his death."
        },
        {
          "reference": "Numbers 24:14",
          "text": "Now I am going back to my people, but come, let me warn you what this people will do to your people in the days to come.”"
        },
        {
          "reference": "Isaiah 2:2",
          "text": "In the last days the mountain of the house of the LORD will be established as the chief of the mountains; it will be raised above the hills, and all nations will stream to it."
        },
        {
          "reference": "Micah 4:1",
          "text": "In the last days the mountain of the house of the LORD will be established as the chief of the mountains; it will be raised above the hills, and the peoples will stream to it."
        },
        {
          "reference": "Hebrews 1:1-2",
          "text": "On many past occasions and in many different ways, God spoke to our fathers through the prophets. / But in these last days He has spoken to us by His Son, whom He appointed heir of all things, and through whom He made the universe."
        },
        {
          "reference": "Revelation 1:1",
          "text": "This is the revelation of Jesus Christ, which God gave Him to show His servants what must soon come to pass. He made it known by sending His angel to His servant John,"
        },
        {
          "reference": "John 16:13",
          "text": "However, when the Spirit of truth comes, He will guide you into all truth. For He will not speak on His own, but He will speak what He hears, and He will declare to you what is to come."
        },
        {
          "reference": "Acts 2:17",
          "text": "‘In the last days, God says, I will pour out My Spirit on all people. Your sons and daughters will prophesy, your young men will see visions, your old men will dream dreams."
        },
        {
          "reference": "2 Timothy 3:1",
          "text": "But understand this: In the last days terrible times will come."
        },
        {
          "reference": "Daniel 2:28",
          "text": "But there is a God in heaven who reveals mysteries, and He has made known to King Nebuchadnezzar what will happen in the latter days. Your dream and the visions that came into your mind as you lay on your bed were these:"
        },
        {
          "reference": "Daniel 10:14",
          "text": "Now I have come to explain to you what will happen to your people in the latter days, for the vision concerns those days.”"
        },
        {
          "reference": "Jeremiah 23:20",
          "text": "The anger of the LORD will not turn back until He has fully accomplished the purposes of His heart. In the days to come you will understand this clearly."
        },
        {
          "reference": "Ezekiel 38:16",
          "text": "You will advance against My people Israel like a cloud covering the land. It will happen in the latter days, O Gog, that I will bring you against My land, so that the nations may know Me when I show Myself holy in you before their eyes."
        },
        {
          "reference": "Hosea 3:5",
          "text": "Afterward, the people of Israel will return and seek the LORD their God and David their king. They will come trembling to the LORD and to His goodness in the last days."
        },
        {
          "reference": "Isaiah 46:10",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’"
        }
      ]
    },
    {
      "reference": "Genesis 49:2",
      "book": "Genesis",
      "chapter": 49,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "&#8220Assemble and listen, sons of Jacob; listen to your father Israel."
        },
        {
          "version": "NLT",
          "text": "“Come and listen, you sons of Jacob; listen to Israel, your father."
        },
        {
          "version": "ESV",
          "text": "“Assemble and listen, O sons of Jacob, listen to Israel your father."
        },
        {
          "version": "NKJV",
          "text": "“Gather together and hear, you sons of Jacob, And listen to Israel your father."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:1-29",
          "text": "This is the blessing that Moses the man of God pronounced upon the Israelites before his death. / He said: “The LORD came from Sinai and dawned upon us from Seir; He shone forth from Mount Paran and came with myriads of holy ones, with flaming fire at His right hand. / Surely You love the people; all the holy ones are in Your hand, and they sit down at Your feet; each receives Your words— ..."
        },
        {
          "reference": "Numbers 24:14",
          "text": "Now I am going back to my people, but come, let me warn you what this people will do to your people in the days to come.”"
        },
        {
          "reference": "Genesis 48:1-22",
          "text": "Some time later Joseph was told, “Your father is ill.” So he set out with his two sons, Manasseh and Ephraim. / When Jacob was told, “Your son Joseph has come to you,” Israel rallied his strength and sat up in bed. / Jacob said to Joseph, “God Almighty appeared to me at Luz in the land of Canaan, and there He blessed me ..."
        },
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Revelation 5:5",
          "text": "Then one of the elders said to me, “Do not weep! Behold, the Lion of the tribe of Judah, the Root of David, has triumphed to open the scroll and its seven seals.”"
        },
        {
          "reference": "Genesis 35:22-26",
          "text": "While Israel was living in that region, Reuben went in and slept with his father’s concubine Bilhah, and Israel heard about it. Jacob had twelve sons: / The sons of Leah were Reuben the firstborn of Jacob, Simeon, Levi, Judah, Issachar, and Zebulun. / The sons of Rachel were Joseph and Benjamin. ..."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Ezekiel 48:1-35",
          "text": "“Now these are the names of the tribes: At the northern frontier, Dan will have one portion bordering the road of Hethlon to Lebo-hamath and running on to Hazar-enan on the border of Damascus with Hamath to the north, and extending from the east side to the west side. / Asher will have one portion bordering the territory of Dan from east to west. / Naphtali will have one portion bordering the territory of Asher from east to west. ..."
        },
        {
          "reference": "Joshua 13:1-33",
          "text": "Now Joshua was old and well along in years, and the LORD said to him, “You are old and well along in years, but very much of the land remains to be possessed. / This is the land that remains: All the territory of the Philistines and the Geshurites, / from the Shihor east of Egypt to the territory of Ekron on the north (considered to be Canaanite territory)—that of the five Philistine rulers of Gaza, Ashdod, Ashkelon, Gath, and Ekron, as well as that of the Avvites; ..."
        },
        {
          "reference": "Judges 5:1-31",
          "text": "On that day Deborah and Barak son of Abinoam sang this song: / “When the princes take the lead in Israel, when the people volunteer, bless the LORD. / Listen, O kings! Give ear, O princes! I will sing to the LORD; I will sing praise to the LORD, the God of Israel. ..."
        },
        {
          "reference": "1 Kings 12:16-24",
          "text": "When all Israel saw that the king had refused to listen to them, they answered the king: “What portion do we have in David, and what inheritance in the son of Jesse? To your tents, O Israel! Look now to your own house, O David!” So the Israelites went home, / but Rehoboam still reigned over the Israelites living in the cities of Judah. / Then King Rehoboam sent out Adoram, who was in charge of the forced labor, but all Israel stoned him to death. And King Rehoboam mounted his chariot in haste and escaped to Jerusalem. ..."
        },
        {
          "reference": "Psalm 78:67-68",
          "text": "He rejected the tent of Joseph and refused the tribe of Ephraim. / But He chose the tribe of Judah, Mount Zion, which He loved."
        },
        {
          "reference": "Isaiah 11:1-16",
          "text": "Then a shoot will spring up from the stump of Jesse, and a Branch from his roots will bear fruit. / The Spirit of the LORD will rest on Him—the Spirit of wisdom and understanding, the Spirit of counsel and strength, the Spirit of knowledge and fear of the LORD. / And He will delight in the fear of the LORD. He will not judge by what His eyes see, and He will not decide by what His ears hear, ..."
        },
        {
          "reference": "Jeremiah 31:9",
          "text": "They will come with weeping, and by their supplication I will lead them; I will make them walk beside streams of waters, on a level path where they will not stumble. For I am Israel’s Father, and Ephraim is My firstborn.”"
        },
        {
          "reference": "Matthew 19:28",
          "text": "Jesus said to them, “Truly I tell you, in the renewal of all things, when the Son of Man sits on His glorious throne, you who have followed Me will also sit on twelve thrones, judging the twelve tribes of Israel."
        }
      ]
    },
    {
      "reference": "Genesis 49:3",
      "book": "Genesis",
      "chapter": 49,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "“Reuben, you are my firstborn, my might, the first sign of my strength, excelling in honor, excelling in power."
        },
        {
          "version": "NLT",
          "text": "“Reuben, you are my firstborn, my strength, the child of my vigorous youth. You are first in rank and first in power."
        },
        {
          "version": "ESV",
          "text": "“Reuben, you are my firstborn, my might, and the firstfruits of my strength, preeminent in dignity and preeminent in power."
        },
        {
          "version": "NKJV",
          "text": "“Reuben, you are my firstborn, My might and the beginning of my strength, The excellency of dignity and the excellency of power."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 21:17",
          "text": "Instead, he must acknowledge the firstborn, the son of his unloved wife, by giving him a double portion of all that he has. For that son is the firstfruits of his father’s strength; the right of the firstborn belongs to him."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Exodus 4:22",
          "text": "Then tell Pharaoh that this is what the LORD says: ‘Israel is My firstborn son,"
        },
        {
          "reference": "Psalm 78:51",
          "text": "He struck all the firstborn of Egypt, the virility in the tents of Ham."
        },
        {
          "reference": "Psalm 105:36",
          "text": "Then He struck all the firstborn in their land, the firstfruits of all their vigor."
        },
        {
          "reference": "Hosea 12:3",
          "text": "In the womb he grasped his brother’s heel, and in his vigor he wrestled with God."
        },
        {
          "reference": "1 Kings 2:9",
          "text": "Now therefore, do not hold him guiltless, for you are a wise man. You know what you ought to do to him to bring his gray head down to Sheol in blood.”"
        },
        {
          "reference": "1 Chronicles 26:10",
          "text": "Hosah the Merarite also had sons: Shimri the first (although he was not the firstborn, his father had appointed him as the first),"
        },
        {
          "reference": "1 Chronicles 2:1",
          "text": "These were the sons of Israel: Reuben, Simeon, Levi, Judah, Issachar, Zebulun,"
        },
        {
          "reference": "Jeremiah 31:9",
          "text": "They will come with weeping, and by their supplication I will lead them; I will make them walk beside streams of waters, on a level path where they will not stumble. For I am Israel’s Father, and Ephraim is My firstborn.”"
        },
        {
          "reference": "Romans 8:29",
          "text": "For those God foreknew, He also predestined to be conformed to the image of His Son, so that He would be the firstborn among many brothers."
        },
        {
          "reference": "Colossians 1:15",
          "text": "The Son is the image of the invisible God, the firstborn over all creation."
        },
        {
          "reference": "Hebrews 12:16",
          "text": "See to it that no one is sexually immoral, or is godless like Esau, who for a single meal sold his birthright."
        },
        {
          "reference": "Revelation 1:5",
          "text": "and from Jesus Christ, the faithful witness, the firstborn from the dead, and the ruler of the kings of the earth. To Him who loves us and has released us from our sins by His blood,"
        },
        {
          "reference": "John 1:14",
          "text": "The Word became flesh and made His dwelling among us. We have seen His glory, the glory of the one and only Son from the Father, full of grace and truth."
        }
      ]
    },
    {
      "reference": "Genesis 49:4",
      "book": "Genesis",
      "chapter": 49,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "Turbulent as the waters, you will no longer excel, for you went up onto your father’s bed, onto my couch and defiled it."
        },
        {
          "version": "NLT",
          "text": "But you are as unruly as a flood, and you will be first no longer. For you went to bed with my wife; you defiled my marriage couch."
        },
        {
          "version": "ESV",
          "text": "Unstable as water, you shall not have preeminence, because you went up to your father’s bed; then you defiled it—he went up to my couch!"
        },
        {
          "version": "NKJV",
          "text": "Unstable as water, you shall not excel, Because you went up to your father’s bed; Then you defiled it — He went up to my couch."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Deuteronomy 33:6",
          "text": "Let Reuben live and not die, nor his men be few.”"
        },
        {
          "reference": "1 Kings 2:35",
          "text": "And the king appointed Benaiah son of Jehoiada in Joab’s place over the army, and he appointed Zadok the priest in Abiathar’s place."
        },
        {
          "reference": "1 Kings 12:20",
          "text": "When all Israel heard that Jeroboam had returned, they summoned him to the assembly and made him king over all Israel. Only the tribe of Judah followed the house of David."
        },
        {
          "reference": "1 Kings 11:11",
          "text": "Then the LORD said to Solomon, “Because you have done this and have not kept My covenant and My statutes, which I have commanded you, I will tear the kingdom away from you and give it to your servant."
        },
        {
          "reference": "1 Kings 11:31",
          "text": "and said to Jeroboam, “Take ten pieces for yourself, for this is what the LORD, the God of Israel, says: ‘Behold, I will tear the kingdom out of the hand of Solomon, and I will give you ten tribes."
        },
        {
          "reference": "1 Kings 11:37",
          "text": "But as for you, I will take you, and you shall reign over all that your heart desires, and you will be king over Israel."
        },
        {
          "reference": "1 Kings 12:16",
          "text": "When all Israel saw that the king had refused to listen to them, they answered the king: “What portion do we have in David, and what inheritance in the son of Jesse? To your tents, O Israel! Look now to your own house, O David!” So the Israelites went home,"
        },
        {
          "reference": "1 Kings 12:26-27",
          "text": "Jeroboam said in his heart, “Now the kingdom might revert to the house of David. / If these people go up to offer sacrifices in the house of the LORD at Jerusalem, their hearts will return to their lord, Rehoboam king of Judah; then they will kill me and return to Rehoboam king of Judah.”"
        },
        {
          "reference": "1 Kings 12:33",
          "text": "On the fifteenth day of the eighth month, a month of his own choosing, Jeroboam offered sacrifices on the altar he had set up in Bethel. So he ordained a feast for the Israelites, offered sacrifices on the altar, and burned incense."
        },
        {
          "reference": "1 Kings 14:7-8",
          "text": "Go, tell Jeroboam that this is what the LORD, the God of Israel, says: ‘I raised you up from among the people and appointed you ruler over My people Israel. / I tore the kingdom away from the house of David and gave it to you. But you have not been like My servant David, who kept My commandments and followed Me with all his heart, doing only what was right in My eyes."
        },
        {
          "reference": "1 Kings 14:10",
          "text": "Because of all this, behold, I am bringing disaster on the house of Jeroboam: I will cut off from Jeroboam every male, both slave and free, in Israel; I will burn up the house of Jeroboam as one burns up dung until it is gone!"
        },
        {
          "reference": "1 Kings 14:14",
          "text": "Moreover, the LORD will raise up for Himself a king over Israel who will cut off the house of Jeroboam. This is the day—yes, even today!"
        },
        {
          "reference": "1 Kings 15:29",
          "text": "As soon as Baasha became king, he struck down the entire household of Jeroboam. He did not leave to Jeroboam anyone who breathed, but destroyed them all according to the word that the LORD had spoken through His servant Ahijah the Shilonite,"
        },
        {
          "reference": "1 Kings 16:3",
          "text": "So now I will consume Baasha and his house, and I will make your house like that of Jeroboam son of Nebat:"
        }
      ]
    },
    {
      "reference": "Genesis 49:5",
      "book": "Genesis",
      "chapter": 49,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "“Simeon and Levi are brothers— their swords are weapons of violence."
        },
        {
          "version": "NLT",
          "text": "“Simeon and Levi are two of a kind; their weapons are instruments of violence."
        },
        {
          "version": "ESV",
          "text": "“Simeon and Levi are brothers; weapons of violence are their swords."
        },
        {
          "version": "NKJV",
          "text": "“Simeon and Levi are brothers; Instruments of cruelty are in their dwelling place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 34:25-30",
          "text": "Three days later, while they were still in pain, two of Jacob’s sons (Dinah’s brothers Simeon and Levi) took their swords, went into the unsuspecting city, and slaughtered every male. / They killed Hamor and his son Shechem with their swords, took Dinah out of Shechem’s house, and went away. / Jacob’s other sons came upon the slaughter and looted the city, because their sister had been defiled. ..."
        },
        {
          "reference": "Joshua 5:2-3",
          "text": "At that time the LORD said to Joshua, “Make flint knives and circumcise the sons of Israel once again.” / So Joshua made flint knives and circumcised the sons of Israel at Gibeath-haaraloth."
        },
        {
          "reference": "Judges 9:4-5",
          "text": "So they gave him seventy shekels of silver from the temple of Baal-berith, with which Abimelech hired some worthless and reckless men to follow him. / He went to his father’s house in Ophrah, and on one stone murdered his seventy brothers, the sons of Jerubbaal. But Jotham, the youngest son of Jerubbaal, survived, because he hid himself."
        },
        {
          "reference": "1 Chronicles 7:21-22",
          "text": "Zabad his son, and Shuthelah his son. Ezer and Elead were killed by the natives of Gath, because they went down to steal their livestock. / Their father Ephraim mourned for many days, and his relatives came to comfort him."
        },
        {
          "reference": "1 Chronicles 12:1-2",
          "text": "Now these were the men who came to David at Ziklag, while he was still banished from the presence of Saul son of Kish (they were among the mighty men who helped him in battle; / they were archers using both the right and left hands to sling stones and shoot arrows; and they were Saul’s kinsmen from Benjamin):"
        },
        {
          "reference": "2 Samuel 2:18-23",
          "text": "The three sons of Zeruiah were there: Joab, Abishai, and Asahel. Now Asahel was fleet of foot like a wild gazelle, / and he chased Abner, not turning to the right or to the left in his pursuit. / And Abner glanced back and said, “Is that you, Asahel?” “It is,” Asahel replied. ..."
        },
        {
          "reference": "2 Samuel 3:30",
          "text": "(Joab and his brother Abishai murdered Abner because he had killed their brother Asahel in the battle at Gibeon.)"
        },
        {
          "reference": "1 Kings 2:5-6",
          "text": "Moreover, you know what Joab son of Zeruiah did to me—what he did to Abner son of Ner and Amasa son of Jether, the two commanders of the armies of Israel. He killed them in peacetime to avenge the blood of war. He stained with the blood of war the belt around his waist and the sandals on his feet. / So act according to your wisdom, and do not let his gray head go down to Sheol in peace."
        },
        {
          "reference": "1 Kings 2:32-33",
          "text": "The LORD will bring his bloodshed back upon his own head, for without the knowledge of my father David he struck down two men more righteous and better than he when he put to the sword Abner son of Ner, commander of Israel’s army, and Amasa son of Jether, commander of Judah’s army. / Their blood will come back upon the heads of Joab and his descendants forever; but for David, his descendants, his house, and his throne, there shall be peace from the LORD forever.”"
        },
        {
          "reference": "Ezekiel 25:12-14",
          "text": "This is what the Lord GOD says: ‘Because Edom acted vengefully against the house of Judah, and in so doing incurred grievous guilt, / therefore this is what the Lord GOD says: I will stretch out My hand against Edom and cut off from it both man and beast. I will make it a wasteland, and from Teman to Dedan they will fall by the sword. / I will take My vengeance on Edom by the hand of My people Israel, and they will deal with Edom according to My anger and wrath. Then they will know My vengeance, declares the Lord GOD.’"
        },
        {
          "reference": "Amos 1:11",
          "text": "This is what the LORD says: “For three transgressions of Edom, even four, I will not revoke My judgment, because he pursued his brother with the sword and stifled all compassion; his anger raged continually, and his fury flamed incessantly."
        },
        {
          "reference": "Matthew 10:34-36",
          "text": "Do not assume that I have come to bring peace to the earth; I have not come to bring peace, but a sword. / For I have come to turn ‘a man against his father, a daughter against her mother, a daughter-in-law against her mother-in-law. / A man’s enemies will be the members of his own household.’"
        },
        {
          "reference": "Luke 22:49-51",
          "text": "Those around Jesus saw what was about to happen and said, “Lord, should we strike with our swords?” / And one of them struck the servant of the high priest, cutting off his right ear. / But Jesus answered, “No more of this!” And He touched the man’s ear and healed him."
        },
        {
          "reference": "John 18:10-11",
          "text": "Then Simon Peter drew his sword and struck the servant of the high priest, cutting off his right ear. The servant’s name was Malchus. / “Put your sword back in its sheath!” Jesus said to Peter. “Shall I not drink the cup the Father has given Me?”"
        },
        {
          "reference": "Acts 7:23-25",
          "text": "When Moses was forty years old, he decided to visit his brothers, the children of Israel. / And when he saw one of them being mistreated, Moses went to his defense and avenged him by striking down the Egyptian who was oppressing him. / He assumed his brothers would understand that God was using him to deliver them, but they did not."
        }
      ]
    },
    {
      "reference": "Genesis 49:6",
      "book": "Genesis",
      "chapter": 49,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Let me not enter their council, let me not join their assembly, for they have killed men in their anger and hamstrung oxen as they pleased."
        },
        {
          "version": "NLT",
          "text": "May I never join in their meetings; may I never be a party to their plans. For in their anger they murdered men, and they crippled oxen just for sport."
        },
        {
          "version": "ESV",
          "text": "Let my soul come not into their council; O my glory, be not joined to their company. For in their anger they killed men, and in their willfulness they hamstrung oxen."
        },
        {
          "version": "NKJV",
          "text": "Let not my soul enter their council; Let not my honor be united to their assembly; For in their anger they slew a man, And in their self-will they hamstrung an ox."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 34:25-30",
          "text": "Three days later, while they were still in pain, two of Jacob’s sons (Dinah’s brothers Simeon and Levi) took their swords, went into the unsuspecting city, and slaughtered every male. / They killed Hamor and his son Shechem with their swords, took Dinah out of Shechem’s house, and went away. / Jacob’s other sons came upon the slaughter and looted the city, because their sister had been defiled. ..."
        },
        {
          "reference": "Exodus 20:13",
          "text": "You shall not murder."
        },
        {
          "reference": "Deuteronomy 27:24",
          "text": "‘Cursed is he who strikes down his neighbor in secret.’ And let all the people say, ‘Amen!’"
        },
        {
          "reference": "Proverbs 1:10-16",
          "text": "My son, if sinners entice you, do not yield to them. / If they say, “Come along, let us lie in wait for blood, let us ambush the innocent without cause, / let us swallow them alive like Sheol, and whole like those descending into the Pit. ..."
        },
        {
          "reference": "Hosea 6:9",
          "text": "Like raiders who lie in ambush, so does a band of priests; they murder on the way to Shechem; surely they have committed atrocities."
        },
        {
          "reference": "Matthew 5:21-22",
          "text": "You have heard that it was said to the ancients, ‘Do not murder’ and ‘Anyone who murders will be subject to judgment.’ / But I tell you that anyone who is angry with his brother will be subject to judgment. Again, anyone who says to his brother, ‘Raca,’ will be subject to the Sanhedrin. But anyone who says, ‘You fool!’ will be subject to the fire of hell."
        },
        {
          "reference": "Luke 22:49-51",
          "text": "Those around Jesus saw what was about to happen and said, “Lord, should we strike with our swords?” / And one of them struck the servant of the high priest, cutting off his right ear. / But Jesus answered, “No more of this!” And He touched the man’s ear and healed him."
        },
        {
          "reference": "John 8:44",
          "text": "You belong to your father, the devil, and you want to carry out his desires. He was a murderer from the beginning, refusing to uphold the truth, because there is no truth in him. When he lies, he speaks his native language, because he is a liar and the father of lies."
        },
        {
          "reference": "Acts 7:52",
          "text": "Which of the prophets did your fathers fail to persecute? They even killed those who foretold the coming of the Righteous One. And now you are His betrayers and murderers—"
        },
        {
          "reference": "Romans 3:15-17",
          "text": "“Their feet are swift to shed blood; / ruin and misery lie in their wake, / and the way of peace they have not known.”"
        },
        {
          "reference": "1 Corinthians 6:9-10",
          "text": "Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral, nor idolaters, nor adulterers, nor men who submit to or perform homosexual acts, / nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers, will inherit the kingdom of God."
        },
        {
          "reference": "Galatians 5:19-21",
          "text": "The acts of the flesh are obvious: sexual immorality, impurity, and debauchery; / idolatry and sorcery; hatred, discord, jealousy, and rage; rivalries, divisions, factions, / and envy; drunkenness, orgies, and the like. I warn you, as I did before, that those who practice such things will not inherit the kingdom of God."
        },
        {
          "reference": "Ephesians 5:11",
          "text": "Have no fellowship with the fruitless deeds of darkness, but rather expose them."
        },
        {
          "reference": "Colossians 3:5-8",
          "text": "Put to death, therefore, the components of your earthly nature: sexual immorality, impurity, lust, evil desires, and greed, which is idolatry. / Because of these, the wrath of God is coming on the sons of disobedience. / When you lived among them, you also used to walk in these ways. ..."
        },
        {
          "reference": "1 Timothy 1:9-10",
          "text": "We realize that law is not enacted for the righteous, but for the lawless and rebellious, for the ungodly and sinful, for the unholy and profane, for killers of father or mother, for murderers, / for the sexually immoral, for homosexuals, for slave traders and liars and perjurers, and for anyone else who is averse to sound teaching"
        }
      ]
    },
    {
      "reference": "Genesis 49:7",
      "book": "Genesis",
      "chapter": 49,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "Cursed be their anger, so fierce, and their fury, so cruel! I will scatter them in Jacob and disperse them in Israel."
        },
        {
          "version": "NLT",
          "text": "A curse on their anger, for it is fierce; a curse on their wrath, for it is cruel. I will scatter them among the descendants of Jacob; I will disperse them throughout Israel."
        },
        {
          "version": "ESV",
          "text": "Cursed be their anger, for it is fierce, and their wrath, for it is cruel! I will divide them in Jacob and scatter them in Israel."
        },
        {
          "version": "NKJV",
          "text": "Cursed be their anger, for it is fierce; And their wrath, for it is cruel! I will divide them in Jacob And scatter them in Israel."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:8-11",
          "text": "Concerning Levi he said: “Give Your Thummim to Levi and Your Urim to Your godly one, whom You tested at Massah and contested at the waters of Meribah. / He said of his father and mother, ‘I do not consider them.’ He disregarded his brothers and did not know his own sons, for he kept Your word and maintained Your covenant. / He will teach Your ordinances to Jacob and Your law to Israel; he will set incense before You and whole burnt offerings on Your altar. ..."
        },
        {
          "reference": "Joshua 19:1-9",
          "text": "The second lot came out for the clans of the tribe of Simeon: Their inheritance lay within the territory of Judah / and included Beersheba (or Sheba), Moladah, / Hazar-shual, Balah, Ezem, ..."
        },
        {
          "reference": "1 Chronicles 4:24-31",
          "text": "The descendants of Simeon: Nemuel, Jamin, Jarib, Zerah, and Shaul. / The sons of Shaul: Shallum, Mibsam, and Mishma. / The sons of Mishma: Hammuel, Zaccur, and Shimei. ..."
        },
        {
          "reference": "Ezekiel 48:24-28",
          "text": "Simeon will have one portion bordering the territory of Benjamin from east to west. / Issachar will have one portion bordering the territory of Simeon from east to west. / Zebulun will have one portion bordering the territory of Issachar from east to west. ..."
        },
        {
          "reference": "Judges 1:3",
          "text": "Then the men of Judah said to their brothers the Simeonites, “Come up with us to our allotted territory, and let us fight against the Canaanites. And we likewise will go with you to your territory.” So the Simeonites went with them."
        },
        {
          "reference": "Judges 1:17",
          "text": "Then the men of Judah went with their brothers the Simeonites, attacked the Canaanites living in Zephath, and devoted the city to destruction. So it was called Hormah."
        },
        {
          "reference": "1 Kings 19:3",
          "text": "And Elijah was afraid and ran for his life. When he came to Beersheba in Judah, he left his servant there,"
        },
        {
          "reference": "2 Kings 10:32-33",
          "text": "In those days the LORD began to reduce the size of Israel. Hazael defeated the Israelites throughout their territory / from the Jordan eastward through all the land of Gilead (the region of Gad, Reuben, and Manasseh), and from Aroer by the Arnon Valley through Gilead to Bashan."
        },
        {
          "reference": "2 Chronicles 15:9",
          "text": "And he assembled all Judah and Benjamin, along with those from the tribes of Ephraim, Manasseh, and Simeon who had settled among them, for great numbers had come over to him from Israel when they saw that the LORD his God was with him."
        },
        {
          "reference": "Psalm 60:6-8",
          "text": "God has spoken from His sanctuary: “I will triumph! I will parcel out Shechem and apportion the Valley of Succoth. / Gilead is Mine, and Manasseh is Mine; Ephraim is My helmet, Judah is My scepter. / Moab is My washbasin; upon Edom I toss My sandal; over Philistia I shout in triumph.”"
        },
        {
          "reference": "Psalm 108:7-9",
          "text": "God has spoken from His sanctuary: “I will triumph! I will parcel out Shechem and apportion the Valley of Succoth. / Gilead is Mine, and Manasseh is Mine; Ephraim is My helmet, Judah is My scepter. / Moab is My washbasin; upon Edom I toss My sandal; over Philistia I shout in triumph.”"
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-16",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles— ..."
        },
        {
          "reference": "Matthew 10:5-6",
          "text": "These twelve Jesus sent out with the following instructions: “Do not go onto the road of the Gentiles or enter any town of the Samaritans. / Go rather to the lost sheep of Israel."
        },
        {
          "reference": "Luke 9:52-56",
          "text": "He sent messengers on ahead, who went into a village of the Samaritans to make arrangements for Him. / But the people there refused to welcome Him, because He was heading for Jerusalem. / When the disciples James and John saw this, they asked, “Lord, do You want us to call down fire from heaven to consume them?” ..."
        }
      ]
    },
    {
      "reference": "Genesis 49:8",
      "book": "Genesis",
      "chapter": 49,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "“Judah, your brothers will praise you; your hand will be on the neck of your enemies; your father’s sons will bow down to you."
        },
        {
          "version": "NLT",
          "text": "“Judah, your brothers will praise you. You will grasp your enemies by the neck. All your relatives will bow before you."
        },
        {
          "version": "ESV",
          "text": "“Judah, your brothers shall praise you; your hand shall be on the neck of your enemies; your father’s sons shall bow down before you."
        },
        {
          "version": "NKJV",
          "text": "“Judah, you are he whom your brothers shall praise; Your hand shall be on the neck of your enemies; Your father’s children shall bow down before you."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 5:5",
          "text": "Then one of the elders said to me, “Do not weep! Behold, the Lion of the tribe of Judah, the Root of David, has triumphed to open the scroll and its seven seals.”"
        },
        {
          "reference": "Matthew 1:2-3",
          "text": "Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers. / Judah was the father of Perez and Zerah by Tamar, Perez the father of Hezron, and Hezron the father of Ram."
        },
        {
          "reference": "Hebrews 7:14",
          "text": "For it is clear that our Lord descended from Judah, a tribe as to which Moses said nothing about priests."
        },
        {
          "reference": "Micah 5:2",
          "text": "But you, Bethlehem Ephrathah, who are small among the clans of Judah, out of you will come forth for Me One to be ruler over Israel—One whose origins are of old, from the days of eternity."
        },
        {
          "reference": "Isaiah 11:1",
          "text": "Then a shoot will spring up from the stump of Jesse, and a Branch from his roots will bear fruit."
        },
        {
          "reference": "Numbers 24:9",
          "text": "He crouches, he lies down like a lion, like a lioness—who dares to rouse him? Blessed are those who bless you and cursed are those who curse you.”"
        },
        {
          "reference": "1 Chronicles 5:2",
          "text": "And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Psalm 18:40",
          "text": "You have made my enemies retreat before me; I destroyed those who hated me."
        },
        {
          "reference": "Psalm 110:1",
          "text": "A Psalm of David. The LORD said to my Lord: “Sit at My right hand until I make Your enemies a footstool for Your feet.”"
        },
        {
          "reference": "Zechariah 9:9",
          "text": "Rejoice greatly, O Daughter of Zion! Shout in triumph, O Daughter of Jerusalem! See, your King comes to you, righteous and victorious, humble and riding on a donkey, on a colt, the foal of a donkey."
        },
        {
          "reference": "1 Samuel 17:51",
          "text": "David ran and stood over him. He grabbed the Philistine’s sword and pulled it from its sheath and killed him, and he cut off his head with the sword. When the Philistines saw that their hero was dead, they turned and ran."
        },
        {
          "reference": "2 Samuel 22:41",
          "text": "You have made my enemies retreat before me; I destroyed those who hated me."
        },
        {
          "reference": "Psalm 2:8-9",
          "text": "Ask Me, and I will make the nations Your inheritance, the ends of the earth Your possession. / You will break them with an iron scepter; You will shatter them like pottery.”"
        },
        {
          "reference": "John 1:49",
          "text": "“Rabbi,” Nathanael answered, “You are the Son of God! You are the King of Israel!”"
        },
        {
          "reference": "Luke 3:33",
          "text": "the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah,"
        }
      ]
    },
    {
      "reference": "Genesis 49:9",
      "book": "Genesis",
      "chapter": 49,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "You are a lion’s cub, Judah; you return from the prey, my son. Like a lion he crouches and lies down, like a lioness—who dares to rouse him?"
        },
        {
          "version": "NLT",
          "text": "Judah, my son, is a young lion that has finished eating its prey. Like a lion he crouches and lies down; like a lioness—who dares to rouse him?"
        },
        {
          "version": "ESV",
          "text": "Judah is a lion’s cub; from the prey, my son, you have gone up. He stooped down; he crouched as a lion and as a lioness; who dares rouse him?"
        },
        {
          "version": "NKJV",
          "text": "Judah is a lion’s whelp; From the prey, my son, you have gone up. He bows down, he lies down as a lion; And as a lion, who shall rouse him?"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Revelation 5:5",
          "text": "Then one of the elders said to me, “Do not weep! Behold, the Lion of the tribe of Judah, the Root of David, has triumphed to open the scroll and its seven seals.”"
        },
        {
          "reference": "Numbers 24:9",
          "text": "He crouches, he lies down like a lion, like a lioness—who dares to rouse him? Blessed are those who bless you and cursed are those who curse you.”"
        },
        {
          "reference": "Hosea 5:14",
          "text": "For I am like a lion to Ephraim and like a young lion to the house of Judah. I, even I, will tear them to pieces and then go away. I will carry them off where no one can rescue them."
        },
        {
          "reference": "Amos 3:8",
          "text": "The lion has roared—who will not fear? The Lord GOD has spoken—who will not prophesy?"
        },
        {
          "reference": "Isaiah 31:4",
          "text": "For this is what the LORD has said to me: “Like a lion roaring or a young lion over its prey—and though a band of shepherds is called out against it, it is not terrified by their shouting or subdued by their clamor—so the LORD of Hosts will come down to do battle on Mount Zion and its heights."
        },
        {
          "reference": "Ezekiel 19:5-7",
          "text": "When she saw that she had waited in vain, that her hope was lost, she took another of her cubs and made him a young lion. / He prowled among the lions, and became a young lion. After learning to tear his prey, he devoured men. / He broke down their strongholds and devastated their cities. The land and everything in it shuddered at the sound of his roaring."
        },
        {
          "reference": "Micah 5:8",
          "text": "Then the remnant of Jacob will be among the nations, in the midst of many peoples, like a lion among the beasts of the forest, like a young lion among flocks of sheep, which tramples and tears as it passes through, with no one to rescue them."
        },
        {
          "reference": "1 Peter 5:8",
          "text": "Be sober-minded and alert. Your adversary the devil prowls around like a roaring lion, seeking someone to devour."
        },
        {
          "reference": "Isaiah 11:1-10",
          "text": "Then a shoot will spring up from the stump of Jesse, and a Branch from his roots will bear fruit. / The Spirit of the LORD will rest on Him—the Spirit of wisdom and understanding, the Spirit of counsel and strength, the Spirit of knowledge and fear of the LORD. / And He will delight in the fear of the LORD. He will not judge by what His eyes see, and He will not decide by what His ears hear, ..."
        },
        {
          "reference": "Jeremiah 50:44",
          "text": "Behold, one will come up like a lion from the thickets of the Jordan to the watered pasture. For in an instant I will chase Babylon from her land. Who is the chosen one I will appoint for this? For who is like Me, and who can challenge Me? What shepherd can stand against Me?”"
        },
        {
          "reference": "2 Samuel 17:10",
          "text": "Then even the most valiant soldier with the heart of a lion will melt with fear, because all Israel knows that your father is a mighty man who has valiant men with him."
        },
        {
          "reference": "Proverbs 28:1",
          "text": "The wicked flee when no one pursues, but the righteous are as bold as a lion."
        },
        {
          "reference": "Revelation 22:16",
          "text": "“I, Jesus, have sent My angel to give you this testimony for the churches. I am the Root and the Offspring of David, the bright Morning Star.”"
        },
        {
          "reference": "Matthew 2:6",
          "text": "‘But you, Bethlehem, in the land of Judah, are by no means least among the rulers of Judah, for out of you will come a ruler who will be the shepherd of My people Israel.’”"
        },
        {
          "reference": "Hebrews 7:14",
          "text": "For it is clear that our Lord descended from Judah, a tribe as to which Moses said nothing about priests."
        }
      ]
    },
    {
      "reference": "Genesis 49:10",
      "book": "Genesis",
      "chapter": 49,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "The scepter will not depart from Judah, nor the ruler’s staff from between his feet, until he to whom it belongs shall come and the obedience of the nations shall be his."
        },
        {
          "version": "NLT",
          "text": "The scepter will not depart from Judah, nor the ruler’s staff from his descendants, until the coming of the one to whom it belongs, the one whom all nations will honor."
        },
        {
          "version": "ESV",
          "text": "The scepter shall not depart from Judah, nor the ruler’s staff from between his feet, until tribute comes to him; and to him shall be the obedience of the peoples."
        },
        {
          "version": "NKJV",
          "text": "The scepter shall not depart from Judah, Nor a lawgiver from between his feet, Until Shiloh comes; And to Him shall be the obedience of the people."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Isaiah 11:1-10",
          "text": "Then a shoot will spring up from the stump of Jesse, and a Branch from his roots will bear fruit. / The Spirit of the LORD will rest on Him—the Spirit of wisdom and understanding, the Spirit of counsel and strength, the Spirit of knowledge and fear of the LORD. / And He will delight in the fear of the LORD. He will not judge by what His eyes see, and He will not decide by what His ears hear, ..."
        },
        {
          "reference": "Micah 5:2",
          "text": "But you, Bethlehem Ephrathah, who are small among the clans of Judah, out of you will come forth for Me One to be ruler over Israel—One whose origins are of old, from the days of eternity."
        },
        {
          "reference": "Numbers 24:17",
          "text": "I see him, but not now; I behold him, but not near. A star will come forth from Jacob, and a scepter will arise from Israel. He will crush the skulls of Moab and strike down all the sons of Sheth."
        },
        {
          "reference": "Psalm 2:6-9",
          "text": "“I have installed My King on Zion, upon My holy mountain.” / I will proclaim the decree spoken to Me by the LORD: “You are My Son; today I have become Your Father. / Ask Me, and I will make the nations Your inheritance, the ends of the earth Your possession. ..."
        },
        {
          "reference": "Ezekiel 21:27",
          "text": "A ruin, a ruin, I will make it a ruin! And it will not be restored until the arrival of Him to whom it belongs, to whom I have assigned the right of judgment.’"
        },
        {
          "reference": "Jeremiah 23:5-6",
          "text": "Behold, the days are coming, declares the LORD, when I will raise up for David a righteous Branch, and He will reign wisely as King and will administer justice and righteousness in the land. / In His days Judah will be saved, and Israel will dwell securely. And this is His name by which He will be called: The LORD Our Righteousness."
        },
        {
          "reference": "Zechariah 9:9-10",
          "text": "Rejoice greatly, O Daughter of Zion! Shout in triumph, O Daughter of Jerusalem! See, your King comes to you, righteous and victorious, humble and riding on a donkey, on a colt, the foal of a donkey. / And I will cut off the chariot from Ephraim and the horse from Jerusalem, and the bow of war will be broken. Then He will proclaim peace to the nations. His dominion will extend from sea to sea, and from the Euphrates to the ends of the earth."
        },
        {
          "reference": "2 Samuel 7:12-16",
          "text": "And when your days are fulfilled and you rest with your fathers, I will raise up your descendant after you, who will come from your own body, and I will establish his kingdom. / He will build a house for My Name, and I will establish the throne of his kingdom forever. / I will be his Father, and he will be My son. When he does wrong, I will discipline him with the rod of men and with the blows of the sons of men. ..."
        },
        {
          "reference": "Isaiah 9:6-7",
          "text": "For unto us a child is born, unto us a son is given, and the government will be upon His shoulders. And He will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace. / Of the increase of His government and peace there will be no end. He will reign on the throne of David and over his kingdom, to establish and sustain it with justice and righteousness from that time and forevermore. The zeal of the LORD of Hosts will accomplish this."
        },
        {
          "reference": "Revelation 5:5",
          "text": "Then one of the elders said to me, “Do not weep! Behold, the Lion of the tribe of Judah, the Root of David, has triumphed to open the scroll and its seven seals.”"
        },
        {
          "reference": "Matthew 1:1-2",
          "text": "This is the record of the genealogy of Jesus Christ, the son of David, the son of Abraham: / Abraham was the father of Isaac, Isaac the father of Jacob, and Jacob the father of Judah and his brothers."
        },
        {
          "reference": "Luke 1:32-33",
          "text": "He will be great and will be called the Son of the Most High. The Lord God will give Him the throne of His father David, / and He will reign over the house of Jacob forever. His kingdom will never end!”"
        },
        {
          "reference": "John 18:36-37",
          "text": "Jesus answered, “My kingdom is not of this world; if it were, My servants would fight to prevent My arrest by the Jews. But now My kingdom is not of this realm.” / “Then You are a king!” Pilate said. “You say that I am a king,” Jesus answered. “For this reason I was born and have come into the world, to testify to the truth. Everyone who belongs to the truth listens to My voice.”"
        },
        {
          "reference": "Hebrews 7:14",
          "text": "For it is clear that our Lord descended from Judah, a tribe as to which Moses said nothing about priests."
        },
        {
          "reference": "Revelation 19:11-16",
          "text": "Then I saw heaven standing open, and there before me was a white horse. And its rider is called Faithful and True. With righteousness He judges and wages war. / He has eyes like blazing fire, and many royal crowns on His head. He has a name written on Him that only He Himself knows. / He is dressed in a robe dipped in blood, and His name is The Word of God. ..."
        }
      ]
    },
    {
      "reference": "Genesis 49:11",
      "book": "Genesis",
      "chapter": 49,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "He will tether his donkey to a vine, his colt to the choicest branch; he will wash his garments in wine, his robes in the blood of grapes."
        },
        {
          "version": "NLT",
          "text": "He ties his foal to a grapevine, the colt of his donkey to a choice vine. He washes his clothes in wine, his robes in the blood of grapes."
        },
        {
          "version": "ESV",
          "text": "Binding his foal to the vine and his donkey’s colt to the choice vine, he has washed his garments in wine and his vesture in the blood of grapes."
        },
        {
          "version": "NKJV",
          "text": "Binding his donkey to the vine, And his donkey’s colt to the choice vine, He washed his garments in wine, And his clothes in the blood of grapes."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Isaiah 63:1-3",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.” / Why are Your clothes red, and Your garments like one who treads the winepress? / “I have trodden the winepress alone, and no one from the nations was with Me. I trampled them in My anger and trod them down in My fury; their blood spattered My garments, and all My clothes were stained."
        },
        {
          "reference": "Revelation 19:13",
          "text": "He is dressed in a robe dipped in blood, and His name is The Word of God."
        },
        {
          "reference": "John 15:1-5",
          "text": "“I am the true vine, and My Father is the keeper of the vineyard. / He cuts off every branch in Me that bears no fruit, and every branch that does bear fruit, He prunes to make it even more fruitful. / You are already clean because of the word I have spoken to you. ..."
        },
        {
          "reference": "Matthew 21:5",
          "text": "“Say to the Daughter of Zion, ‘See, your King comes to you, gentle and riding on a donkey, on a colt, the foal of a donkey.’”"
        },
        {
          "reference": "Zechariah 9:9",
          "text": "Rejoice greatly, O Daughter of Zion! Shout in triumph, O Daughter of Jerusalem! See, your King comes to you, righteous and victorious, humble and riding on a donkey, on a colt, the foal of a donkey."
        },
        {
          "reference": "Revelation 7:14",
          "text": "“Sir,” I answered, “you know.” So he replied, “These are the ones who have come out of the great tribulation; they have washed their robes and made them white in the blood of the Lamb."
        },
        {
          "reference": "Isaiah 55:1",
          "text": "“Come, all you who are thirsty, come to the waters; and you without money, come, buy, and eat! Come, buy wine and milk without money and without cost!"
        },
        {
          "reference": "Jeremiah 2:21",
          "text": "I had planted you like a choice vine from the very best seed. How could you turn yourself before Me into a rotten, wild vine?"
        },
        {
          "reference": "John 2:1-11",
          "text": "On the third day a wedding took place at Cana in Galilee. Jesus’ mother was there, / and Jesus and His disciples had also been invited to the wedding. / When the wine ran out, Jesus’ mother said to Him, “They have no more wine.” ..."
        },
        {
          "reference": "Revelation 14:18-20",
          "text": "Still another angel, with authority over the fire, came from the altar and called out in a loud voice to the angel with the sharp sickle, “Swing your sharp sickle and gather the clusters of grapes from the vine of the earth, because its grapes are ripe.” / So the angel swung his sickle over the earth and gathered the grapes of the earth, and he threw them into the great winepress of God’s wrath. / And the winepress was trodden outside the city, and the blood that flowed from it rose as high as the bridles of the horses for a distance of 1,600 stadia."
        },
        {
          "reference": "Numbers 24:17",
          "text": "I see him, but not now; I behold him, but not near. A star will come forth from Jacob, and a scepter will arise from Israel. He will crush the skulls of Moab and strike down all the sons of Sheth."
        },
        {
          "reference": "Hosea 14:7",
          "text": "They will return and dwell in his shade; they will grow grain and blossom like the vine. His renown will be like the wine of Lebanon."
        },
        {
          "reference": "Amos 9:13",
          "text": "“Behold, the days are coming,” declares the LORD, “when the plowman will overtake the reaper and the treader of grapes, the sower of seed. The mountains will drip with sweet wine, with which all the hills will flow."
        },
        {
          "reference": "Joel 3:18",
          "text": "And in that day the mountains will drip with sweet wine, and the hills will flow with milk. All the streams of Judah will run with water, and a spring will flow from the house of the LORD to water the Valley of Acacias."
        },
        {
          "reference": "Deuteronomy 32:14",
          "text": "with curds from the herd and milk from the flock, with the fat of lambs, with rams from Bashan, and goats, with the choicest grains of wheat. From the juice of the finest grapes you drank the wine."
        }
      ]
    },
    {
      "reference": "Genesis 49:12",
      "book": "Genesis",
      "chapter": 49,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "His eyes will be darker than wine, his teeth whiter than milk."
        },
        {
          "version": "NLT",
          "text": "His eyes are darker than wine, and his teeth are whiter than milk."
        },
        {
          "version": "ESV",
          "text": "His eyes are darker than wine, and his teeth whiter than milk."
        },
        {
          "version": "NKJV",
          "text": "His eyes are darker than wine, And his teeth whiter than milk."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Isaiah 63:1-3",
          "text": "Who is this coming from Edom, from Bozrah with crimson-stained garments? Who is this robed in splendor, marching in the greatness of His strength? “It is I, proclaiming vindication, mighty to save.” / Why are Your clothes red, and Your garments like one who treads the winepress? / “I have trodden the winepress alone, and no one from the nations was with Me. I trampled them in My anger and trod them down in My fury; their blood spattered My garments, and all My clothes were stained."
        },
        {
          "reference": "Revelation 19:13",
          "text": "He is dressed in a robe dipped in blood, and His name is The Word of God."
        },
        {
          "reference": "Song of Solomon 5:10-16",
          "text": "My beloved is dazzling and ruddy, outstanding among ten thousand. / His head is purest gold; his hair is wavy and black as a raven. / His eyes are like doves beside the streams of water, bathed in milk and mounted like jewels. ..."
        },
        {
          "reference": "Matthew 26:27-29",
          "text": "Then He took the cup, gave thanks, and gave it to them, saying, “Drink from it, all of you. / This is My blood of the covenant, which is poured out for many for the forgiveness of sins. / I tell you, I will not drink of this fruit of the vine from now on until that day when I drink it anew with you in My Father’s kingdom.”"
        },
        {
          "reference": "John 2:1-11",
          "text": "On the third day a wedding took place at Cana in Galilee. Jesus’ mother was there, / and Jesus and His disciples had also been invited to the wedding. / When the wine ran out, Jesus’ mother said to Him, “They have no more wine.” ..."
        },
        {
          "reference": "Revelation 1:14-15",
          "text": "The hair of His head was white like wool, as white as snow, and His eyes were like a blazing fire. / His feet were like polished bronze refined in a furnace, and His voice was like the roar of many waters."
        },
        {
          "reference": "Isaiah 55:1",
          "text": "“Come, all you who are thirsty, come to the waters; and you without money, come, buy, and eat! Come, buy wine and milk without money and without cost!"
        },
        {
          "reference": "Joel 3:18",
          "text": "And in that day the mountains will drip with sweet wine, and the hills will flow with milk. All the streams of Judah will run with water, and a spring will flow from the house of the LORD to water the Valley of Acacias."
        },
        {
          "reference": "Amos 9:13",
          "text": "“Behold, the days are coming,” declares the LORD, “when the plowman will overtake the reaper and the treader of grapes, the sower of seed. The mountains will drip with sweet wine, with which all the hills will flow."
        },
        {
          "reference": "Jeremiah 31:12",
          "text": "They will come and shout for joy on the heights of Zion; they will be radiant over the bounty of the LORD—the grain, new wine, and oil, and the young of the flocks and herds. Their life will be like a well-watered garden, and never again will they languish."
        },
        {
          "reference": "Deuteronomy 33:28",
          "text": "So Israel dwells securely; the fountain of Jacob lives untroubled in a land of grain and new wine, where even the heavens drip with dew."
        },
        {
          "reference": "Proverbs 3:10",
          "text": "then your barns will be filled with plenty, and your vats will overflow with new wine."
        },
        {
          "reference": "Isaiah 25:6",
          "text": "On this mountain the LORD of Hosts will prepare a lavish banquet for all the peoples, a feast of aged wine, of choice meat, of finely aged wine."
        },
        {
          "reference": "Ezekiel 27:18",
          "text": "Because of your many products and your great wealth of goods, Damascus traded with you wine from Helbon, wool from Zahar,"
        },
        {
          "reference": "Numbers 13:23",
          "text": "When they came to the Valley of Eshcol, they cut down a branch with a single cluster of grapes, which they carried on a pole between two men. They also took some pomegranates and figs."
        }
      ]
    },
    {
      "reference": "Genesis 49:13",
      "book": "Genesis",
      "chapter": 49,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "“Zebulun will live by the seashore and become a haven for ships; his border will extend toward Sidon."
        },
        {
          "version": "NLT",
          "text": "“Zebulun will settle by the seashore and will be a harbor for ships; his borders will extend to Sidon."
        },
        {
          "version": "ESV",
          "text": "“Zebulun shall dwell at the shore of the sea; he shall become a haven for ships, and his border shall be at Sidon."
        },
        {
          "version": "NKJV",
          "text": "“Zebulun shall dwell by the haven of the sea; He shall become a haven for ships, And his border shall adjoin Sidon."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:18-19",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents. / They will call the peoples to a mountain; there they will offer sacrifices of righteousness. For they will feast on the abundance of the seas and the hidden treasures of the sand.”"
        },
        {
          "reference": "Joshua 19:10-16",
          "text": "The third lot came up for the clans of the tribe of Zebulun: The border of their inheritance stretched as far as Sarid. / It went up westward to Maralah, reached Dabbesheth, and met the brook east of Jokneam. / From Sarid it turned eastward along the border of Chisloth-tabor and went on to Daberath and up to Japhia. ..."
        },
        {
          "reference": "Judges 5:17",
          "text": "Gilead remained beyond the Jordan. Dan, why did you linger by the ships? Asher stayed at the coast and remained in his harbors."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-16",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles— ..."
        },
        {
          "reference": "Ezekiel 48:1-7",
          "text": "“Now these are the names of the tribes: At the northern frontier, Dan will have one portion bordering the road of Hethlon to Lebo-hamath and running on to Hazar-enan on the border of Damascus with Hamath to the north, and extending from the east side to the west side. / Asher will have one portion bordering the territory of Dan from east to west. / Naphtali will have one portion bordering the territory of Asher from east to west. ..."
        },
        {
          "reference": "Ezekiel 48:23-27",
          "text": "As for the rest of the tribes: Benjamin will have one portion extending from the east side to the west side. / Simeon will have one portion bordering the territory of Benjamin from east to west. / Issachar will have one portion bordering the territory of Simeon from east to west. ..."
        },
        {
          "reference": "1 Kings 9:26",
          "text": "King Solomon also assembled a fleet of ships at Ezion-geber, which is near Eloth in Edom, on the shore of the Red Sea."
        },
        {
          "reference": "1 Chronicles 12:33-37",
          "text": "From Zebulun: 50,000 fit for service, trained for battle with all kinds of weapons of war, who with one purpose were devoted to David. / From Naphtali: 1,000 commanders, accompanied by 37,000 men with shield and spear. / From Dan: 28,600 prepared for battle. ..."
        },
        {
          "reference": "Isaiah 23:1-18",
          "text": "This is the burden against Tyre: Wail, O ships of Tarshish, for Tyre is laid waste, without house or harbor. Word has reached them from the land of Cyprus. / Be silent, O dwellers of the coastland, you merchants of Sidon, whose traders have crossed the sea. / On the great waters came the grain of Shihor; the harvest of the Nile was the revenue of Tyre; she was the merchant of the nations. ..."
        },
        {
          "reference": "Jeremiah 25:22",
          "text": "all the kings of Tyre and Sidon; the kings of the coastlands across the sea;"
        },
        {
          "reference": "Jeremiah 47:4",
          "text": "For the day has come to destroy all the Philistines, to cut off from Tyre and Sidon every remaining ally. Indeed, the LORD is about to destroy the Philistines, the remnant from the coasts of Caphtor."
        },
        {
          "reference": "Zechariah 9:1-4",
          "text": "This is the burden of the word of the LORD against the land of Hadrach and Damascus its resting place—for the eyes of men and of all the tribes of Israel are upon the LORD— / and also against Hamath, which borders it, as well as Tyre and Sidon, though they are very shrewd. / Tyre has built herself a fortress; she has heaped up silver like dust, and gold like the dirt of the streets. ..."
        },
        {
          "reference": "Matthew 11:21-22",
          "text": "“Woe to you, Chorazin! Woe to you, Bethsaida! For if the miracles that were performed in you had been performed in Tyre and Sidon, they would have repented long ago in sackcloth and ashes. / But I tell you, it will be more bearable for Tyre and Sidon on the day of judgment than for you."
        },
        {
          "reference": "Mark 7:31",
          "text": "Then Jesus left the region of Tyre and went through Sidon to the Sea of Galilee and into the region of the Decapolis."
        }
      ]
    },
    {
      "reference": "Genesis 49:14",
      "book": "Genesis",
      "chapter": 49,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "“Issachar is a rawboned donkey lying down among the sheep pens."
        },
        {
          "version": "NLT",
          "text": "“Issachar is a sturdy donkey, resting between two saddlepacks."
        },
        {
          "version": "ESV",
          "text": "“Issachar is a strong donkey, crouching between the sheepfolds."
        },
        {
          "version": "NKJV",
          "text": "“Issachar is a strong donkey, Lying down between two burdens;"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:18-19",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents. / They will call the peoples to a mountain; there they will offer sacrifices of righteousness. For they will feast on the abundance of the seas and the hidden treasures of the sand.”"
        },
        {
          "reference": "Judges 5:15-16",
          "text": "The princes of Issachar were with Deborah, and Issachar was with Barak, rushing into the valley at his heels. In the clans of Reuben there was great indecision. / Why did you sit among the sheepfolds to hear the whistling for the flocks? In the clans of Reuben there was great indecision."
        },
        {
          "reference": "1 Chronicles 12:32",
          "text": "From Issachar, men who understood the times and knew what Israel should do: 200 chiefs with all their kinsmen at their command."
        },
        {
          "reference": "Hosea 10:11",
          "text": "Ephraim is a well-trained heifer that loves to thresh; but I will place a yoke on her fair neck. I will harness Ephraim, Judah will plow, and Jacob will break the hard ground."
        },
        {
          "reference": "Psalm 68:13",
          "text": "Though you lie down among the sheepfolds, the wings of the dove are covered with silver, and her feathers with shimmering gold.”"
        },
        {
          "reference": "1 Kings 4:7-8",
          "text": "Solomon had twelve governors over all Israel to provide food for the king and his household. Each one would arrange provisions for one month of the year, / and these were their names: Ben-hur in the hill country of Ephraim;"
        },
        {
          "reference": "1 Kings 11:28",
          "text": "Now Jeroboam was a mighty man of valor. So when Solomon noticed that the young man was industrious, he put him in charge of the whole labor force of the house of Joseph."
        },
        {
          "reference": "1 Chronicles 7:1-5",
          "text": "The sons of Issachar: Tola, Puah, Jashub, and Shimron—four in all. / The sons of Tola: Uzzi, Rephaiah, Jeriel, Jahmai, Ibsam, and Shemuel, the heads of their families. In the days of David, 22,600 descendants of Tola were numbered in their genealogies as mighty men of valor. / The son of Uzzi: Izrahiah. The sons of Izrahiah: Michael, Obadiah, Joel, and Isshiah. All five of them were chiefs. ..."
        },
        {
          "reference": "1 Chronicles 12:40",
          "text": "And their neighbors from as far away as Issachar, Zebulun, and Naphtali came bringing food on donkeys, camels, mules, and oxen—abundant supplies of flour, fig cakes and raisin cakes, wine and oil, oxen and sheep. Indeed, there was joy in Israel."
        },
        {
          "reference": "1 Chronicles 27:18",
          "text": "over Judah was Elihu, one of David’s brothers; over Issachar was Omri son of Michael;"
        },
        {
          "reference": "Matthew 11:28-30",
          "text": "Come to Me, all you who are weary and burdened, and I will give you rest. / Take My yoke upon you and learn from Me, for I am gentle and humble in heart, and you will find rest for your souls. / For My yoke is easy and My burden is light.”"
        },
        {
          "reference": "Luke 10:39-42",
          "text": "She had a sister named Mary, who sat at the Lord’s feet listening to His message. / But Martha was distracted by all the preparations to be made. She came to Jesus and said, “Lord, do You not care that my sister has left me to serve alone? Tell her to help me!” / “Martha, Martha,” the Lord replied, “you are worried and upset about many things. ..."
        },
        {
          "reference": "Matthew 23:4",
          "text": "They tie up heavy, burdensome loads and lay them on men’s shoulders, but they themselves are not willing to lift a finger to move them."
        },
        {
          "reference": "Acts 15:10",
          "text": "Now then, why do you test God by placing on the necks of the disciples a yoke that neither we nor our fathers have been able to bear?"
        },
        {
          "reference": "Galatians 6:2",
          "text": "Carry one another’s burdens, and in this way you will fulfill the law of Christ."
        }
      ]
    },
    {
      "reference": "Genesis 49:15",
      "book": "Genesis",
      "chapter": 49,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "When he sees how good is his resting place and how pleasant is his land, he will bend his shoulder to the burden and submit to forced labor."
        },
        {
          "version": "NLT",
          "text": "When he sees how good the countryside is and how pleasant the land, he will bend his shoulder to the load and submit himself to hard labor."
        },
        {
          "version": "ESV",
          "text": "He saw that a resting place was good, and that the land was pleasant, so he bowed his shoulder to bear, and became a servant at forced labor."
        },
        {
          "version": "NKJV",
          "text": "He saw that rest was good, And that the land was pleasant; He bowed his shoulder to bear a burden, And became a band of slaves."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:18-19",
          "text": "Concerning Zebulun he said: “Rejoice, Zebulun, in your journeys, and Issachar, in your tents. / They will call the peoples to a mountain; there they will offer sacrifices of righteousness. For they will feast on the abundance of the seas and the hidden treasures of the sand.”"
        },
        {
          "reference": "Judges 5:15-16",
          "text": "The princes of Issachar were with Deborah, and Issachar was with Barak, rushing into the valley at his heels. In the clans of Reuben there was great indecision. / Why did you sit among the sheepfolds to hear the whistling for the flocks? In the clans of Reuben there was great indecision."
        },
        {
          "reference": "1 Chronicles 12:32",
          "text": "From Issachar, men who understood the times and knew what Israel should do: 200 chiefs with all their kinsmen at their command."
        },
        {
          "reference": "Hosea 10:11",
          "text": "Ephraim is a well-trained heifer that loves to thresh; but I will place a yoke on her fair neck. I will harness Ephraim, Judah will plow, and Jacob will break the hard ground."
        },
        {
          "reference": "Matthew 11:28-30",
          "text": "Come to Me, all you who are weary and burdened, and I will give you rest. / Take My yoke upon you and learn from Me, for I am gentle and humble in heart, and you will find rest for your souls. / For My yoke is easy and My burden is light.”"
        },
        {
          "reference": "Isaiah 28:12",
          "text": "to whom He has said: “This is the place of rest, let the weary rest; this is the place of repose.” But they would not listen."
        },
        {
          "reference": "Jeremiah 6:16",
          "text": "This is what the LORD says: “Stand at the crossroads and look. Ask for the ancient paths: ‘Where is the good way?’ Then walk in it, and you will find rest for your souls. But they said, ‘We will not walk in it!’"
        },
        {
          "reference": "Hebrews 4:9-11",
          "text": "There remains, then, a Sabbath rest for the people of God. / For whoever enters God’s rest also rests from his own work, just as God did from His. / Let us, therefore, make every effort to enter that rest, so that no one will fall by following the same pattern of disobedience."
        },
        {
          "reference": "Psalm 23:2",
          "text": "He makes me lie down in green pastures; He leads me beside quiet waters."
        },
        {
          "reference": "Isaiah 30:15",
          "text": "For the Lord GOD, the Holy One of Israel, has said: “By repentance and rest you would be saved; your strength would lie in quiet confidence—but you were not willing.”"
        },
        {
          "reference": "1 Kings 4:7",
          "text": "Solomon had twelve governors over all Israel to provide food for the king and his household. Each one would arrange provisions for one month of the year,"
        },
        {
          "reference": "1 Kings 4:20",
          "text": "The people of Judah and Israel were as numerous as the sand on the seashore, and they were eating and drinking and rejoicing."
        },
        {
          "reference": "1 Kings 4:25",
          "text": "Throughout the days of Solomon, Judah and Israel dwelt securely from Dan to Beersheba, each man under his own vine and his own fig tree."
        },
        {
          "reference": "1 Kings 4:29",
          "text": "And God gave Solomon wisdom, exceedingly deep insight, and understanding beyond measure, like the sand on the seashore."
        },
        {
          "reference": "1 Kings 4:34",
          "text": "So men of all nations came to listen to Solomon’s wisdom, sent by all the kings of the earth, who had heard of his wisdom."
        }
      ]
    },
    {
      "reference": "Genesis 49:16",
      "book": "Genesis",
      "chapter": 49,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "&#8220Dan will provide justice for his people as one of the tribes of Israel."
        },
        {
          "version": "NLT",
          "text": "“Dan will govern his people, like any other tribe in Israel."
        },
        {
          "version": "ESV",
          "text": "“Dan shall judge his people as one of the tribes of Israel."
        },
        {
          "version": "NKJV",
          "text": "“Dan shall judge his people As one of the tribes of Israel."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 49:17",
      "book": "Genesis",
      "chapter": 49,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "Dan will be a snake by the roadside, a viper along the path, that bites the horse’s heels so that its rider tumbles backward."
        },
        {
          "version": "NLT",
          "text": "Dan will be a snake beside the road, a poisonous viper along the path that bites the horse’s hooves so its rider is thrown off."
        },
        {
          "version": "ESV",
          "text": "Dan shall be a serpent in the way, a viper by the path, that bites the horse’s heels so that his rider falls backward."
        },
        {
          "version": "NKJV",
          "text": "Dan shall be a serpent by the way, A viper by the path, That bites the horse’s heels So that its rider shall fall backward."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 18:27-28",
          "text": "After they had taken Micah’s idols and his priest, they went to Laish, to a quiet and unsuspecting people, and they struck them with their swords and burned down the city. / There was no one to deliver them, because the city was far from Sidon and had no alliance with anyone; it was in a valley near Beth-rehob. And the Danites rebuilt the city and lived there."
        },
        {
          "reference": "Judges 18:30-31",
          "text": "The Danites set up idols for themselves, and Jonathan son of Gershom, the son of Moses, and his sons were priests for the tribe of Dan until the day of the captivity of the land. / So they set up for themselves Micah’s graven image, and it was there the whole time the house of God was in Shiloh."
        },
        {
          "reference": "Judges 5:17",
          "text": "Gilead remained beyond the Jordan. Dan, why did you linger by the ships? Asher stayed at the coast and remained in his harbors."
        },
        {
          "reference": "Numbers 23:22-24",
          "text": "God brought them out of Egypt with strength like a wild ox. / For there is no spell against Jacob and no divination against Israel. It will now be said of Jacob and Israel, ‘What great things God has done!’ / Behold, the people rise like a lioness; they rouse themselves like a lion, not resting until they devour their prey and drink the blood of the slain.”"
        },
        {
          "reference": "Numbers 24:17-19",
          "text": "I see him, but not now; I behold him, but not near. A star will come forth from Jacob, and a scepter will arise from Israel. He will crush the skulls of Moab and strike down all the sons of Sheth. / Edom will become a possession, as will Seir, his enemy; but Israel will perform with valor. / A ruler will come from Jacob and destroy the survivors of the city.”"
        },
        {
          "reference": "Deuteronomy 33:22",
          "text": "Concerning Dan he said: “Dan is a lion’s cub, leaping out of Bashan.”"
        },
        {
          "reference": "Judges 13:2-5",
          "text": "Now there was a man from Zorah named Manoah, from the clan of the Danites, whose wife was barren and had no children. / The angel of the LORD appeared to the woman and said to her, “It is true that you are barren and have no children; but you will conceive and give birth to a son. / Now please be careful not to drink wine or strong drink, and not to eat anything unclean. ..."
        },
        {
          "reference": "Judges 16:23-30",
          "text": "Now the lords of the Philistines gathered together to offer a great sacrifice to their god Dagon. They rejoiced and said, “Our god has delivered Samson our enemy into our hands.” / And when the people saw him, they praised their god, saying: “Our god has delivered into our hands our enemy who destroyed our land and multiplied our dead.” / And while their hearts were merry, they said, “Call for Samson to entertain us.” So they called Samson out of the prison to entertain them. And they stationed him between the pillars. ..."
        },
        {
          "reference": "Psalm 58:4-5",
          "text": "Their venom is like the venom of a snake, like a cobra that shuts its ears, / refusing to hear the tune of the charmer who skillfully weaves his spell."
        },
        {
          "reference": "Psalm 140:3",
          "text": "They sharpen their tongues like snakes; the venom of vipers is on their lips. Selah"
        },
        {
          "reference": "Jeremiah 8:17",
          "text": "“For behold, I will send snakes among you, vipers that cannot be charmed, and they will bite you,” declares the LORD."
        },
        {
          "reference": "Isaiah 30:6",
          "text": "This is the burden against the beasts of the Negev: Through a land of hardship and distress, of lioness and lion, of viper and flying serpent, they carry their wealth on the backs of donkeys and their treasures on the humps of camels, to a people of no profit to them."
        },
        {
          "reference": "Isaiah 59:5",
          "text": "They hatch the eggs of vipers and weave a spider’s web. Whoever eats their eggs will die; crack one open, and a viper is hatched."
        },
        {
          "reference": "Matthew 10:16",
          "text": "Behold, I am sending you out like sheep among wolves; therefore be as shrewd as snakes and as innocent as doves."
        },
        {
          "reference": "Luke 10:19",
          "text": "Behold, I have given you authority to tread on snakes and scorpions, and over all the power of the enemy. Nothing will harm you."
        }
      ]
    },
    {
      "reference": "Genesis 49:18",
      "book": "Genesis",
      "chapter": 49,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "“I look for your deliverance, LORD."
        },
        {
          "version": "NLT",
          "text": "I trust in you for salvation, O LORD!"
        },
        {
          "version": "ESV",
          "text": "I wait for your salvation, O LORD."
        },
        {
          "version": "NKJV",
          "text": "I have waited for your salvation, O LORD!"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Psalm 62:1",
          "text": "For the choirmaster. According to Jeduthun. A Psalm of David. In God alone my soul finds rest; my salvation comes from Him."
        },
        {
          "reference": "Isaiah 25:9",
          "text": "And in that day it will be said, “Surely this is our God; we have waited for Him, and He has saved us. This is the LORD for whom we have waited. Let us rejoice and be glad in His salvation.”"
        },
        {
          "reference": "Lamentations 3:26",
          "text": "It is good to wait quietly for the salvation of the LORD."
        },
        {
          "reference": "Psalm 130:5",
          "text": "I wait for the LORD; my soul does wait, and in His word I put my hope."
        },
        {
          "reference": "Isaiah 33:2",
          "text": "O LORD, be gracious to us! We wait for You. Be our strength every morning and our salvation in time of trouble."
        },
        {
          "reference": "Micah 7:7",
          "text": "But as for me, I will look to the LORD; I will wait for the God of my salvation. My God will hear me."
        },
        {
          "reference": "Psalm 27:14",
          "text": "Wait patiently for the LORD; be strong and courageous. Wait patiently for the LORD!"
        },
        {
          "reference": "Isaiah 40:31",
          "text": "But those who wait upon the LORD will renew their strength; they will mount up with wings like eagles; they will run and not grow weary, they will walk and not faint."
        },
        {
          "reference": "Psalm 37:7",
          "text": "Be still before the LORD and wait patiently for Him; do not fret when men prosper in their ways, when they carry out wicked schemes."
        },
        {
          "reference": "Habakkuk 3:16",
          "text": "I heard and trembled within; my lips quivered at the sound. Decay entered my bones; I trembled where I stood. Yet I must wait patiently for the day of distress to come upon the people who invade us."
        },
        {
          "reference": "Romans 8:25",
          "text": "But if we hope for what we do not yet see, we wait for it patiently."
        },
        {
          "reference": "Titus 2:13",
          "text": "as we await the blessed hope and glorious appearance of our great God and Savior Jesus Christ."
        },
        {
          "reference": "Hebrews 9:28",
          "text": "so also Christ was offered once to bear the sins of many; and He will appear a second time, not to bear sin, but to bring salvation to those who eagerly await Him."
        },
        {
          "reference": "1 Thessalonians 1:10",
          "text": "and to await His Son from heaven, whom He raised from the dead—Jesus our deliverer from the coming wrath."
        },
        {
          "reference": "James 5:7-8",
          "text": "Be patient, then, brothers, until the Lord’s coming. See how the farmer awaits the precious fruit of the soil—how patient he is for the fall and spring rains. / You, too, be patient and strengthen your hearts, because the Lord’s coming is near."
        }
      ]
    },
    {
      "reference": "Genesis 49:19",
      "book": "Genesis",
      "chapter": 49,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "“Gad will be attacked by a band of raiders, but he will attack them at their heels."
        },
        {
          "version": "NLT",
          "text": "“Gad will be attacked by marauding bands, but he will attack them when they retreat."
        },
        {
          "version": "ESV",
          "text": "“Raiders shall raid Gad, but he shall raid at their heels."
        },
        {
          "version": "NKJV",
          "text": "“Gad, a troop shall tramp upon him, But he shall triumph at last."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Judges 6:12",
          "text": "And the angel of the LORD appeared to Gideon and said, “The LORD is with you, O mighty man of valor.”"
        },
        {
          "reference": "Judges 7:7",
          "text": "Then the LORD said to Gideon, “With the three hundred men who lapped the water I will save you and deliver the Midianites into your hand. But all the others are to go home.”"
        },
        {
          "reference": "Judges 8:4-5",
          "text": "Then Gideon and his three hundred men came to the Jordan and crossed it, exhausted yet still in pursuit. / So Gideon said to the men of Succoth, “Please give my troops some bread, for they are exhausted, and I am still pursuing Zebah and Zalmunna, the kings of Midian.”"
        },
        {
          "reference": "1 Chronicles 12:8",
          "text": "Some Gadites defected to David at his stronghold in the wilderness. They were mighty men of valor, trained for battle, experts with the shield and spear, whose faces were like the faces of lions and who were as swift as gazelles on the mountains:"
        },
        {
          "reference": "Deuteronomy 33:20",
          "text": "Concerning Gad he said: “Blessed is he who enlarges the domain of Gad! He lies down like a lion and tears off an arm or a head."
        },
        {
          "reference": "Joshua 11:21",
          "text": "At that time Joshua proceeded to eliminate the Anakim from the hill country of Hebron, Debir, and Anab, and from all the hill country of Judah and of Israel. Joshua devoted them to destruction, along with their cities."
        },
        {
          "reference": "Joshua 12:7-8",
          "text": "And these are the kings of the land that Joshua and the Israelites conquered beyond the Jordan to the west, from Baal-gad in the Valley of Lebanon to Mount Halak, which rises toward Seir (according to the allotments to the tribes of Israel, Joshua gave them as an inheritance / the hill country, the foothills, the Arabah, the slopes, the wilderness, and the Negev—the lands of the Hittites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites):"
        },
        {
          "reference": "2 Kings 15:29",
          "text": "In the days of Pekah king of Israel, Tiglath-pileser king of Assyria came and captured Ijon, Abel-beth-maacah, Janoah, Kedesh, Hazor, Gilead, and Galilee, including all the land of Naphtali, and he took the people as captives to Assyria."
        },
        {
          "reference": "1 Samuel 13:5-6",
          "text": "Now the Philistines assembled to fight against Israel with three thousand chariots, six thousand horsemen, and troops as numerous as the sand on the seashore. They went up and camped at Michmash, east of Beth-aven. / Seeing that they were in danger because their troops were hard-pressed, the men of Israel hid in caves and thickets, among the rocks, and in cellars and cisterns."
        },
        {
          "reference": "1 Samuel 14:47-48",
          "text": "After Saul had assumed the kingship over Israel, he fought against all his enemies on every side—the Moabites, the Ammonites, the Edomites, the kings of Zobah, and the Philistines. Wherever he turned, he routed them. / He fought valiantly and defeated the Amalekites, delivering Israel from the hands of its plunderers."
        },
        {
          "reference": "Jeremiah 49:1",
          "text": "Concerning the Ammonites, this is what the LORD says: “Has Israel no sons? Is he without heir? Why then has Milcom taken possession of Gad? Why have his people settled in their cities?"
        },
        {
          "reference": "Jeremiah 49:28",
          "text": "Concerning Kedar and the kingdoms of Hazor, which Nebuchadnezzar king of Babylon defeated, this is what the LORD says: “Rise up, advance against Kedar, and destroy the people of the east!"
        },
        {
          "reference": "Obadiah 1:19",
          "text": "Those from the Negev will possess the mountains of Esau; those from the foothills will possess the land of the Philistines. They will occupy the fields of Ephraim and Samaria, and Benjamin will possess Gilead."
        },
        {
          "reference": "Zechariah 10:5",
          "text": "They will be like mighty men in battle, trampling the enemy in the mire of the streets. They will fight because the LORD is with them, and they will put the horsemen to shame."
        },
        {
          "reference": "Matthew 4:24-25",
          "text": "News about Him spread all over Syria, and people brought to Him all who were ill with various diseases, those suffering acute pain, the demon-possessed, those having seizures, and the paralyzed, and He healed them. / Large crowds followed Him, having come from Galilee, the Decapolis, Jerusalem, Judea, and beyond the Jordan."
        }
      ]
    },
    {
      "reference": "Genesis 49:20",
      "book": "Genesis",
      "chapter": 49,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "&#8220Asher’s food will be rich; he will provide delicacies fit for a king."
        },
        {
          "version": "NLT",
          "text": "“Asher will dine on rich foods and produce food fit for kings."
        },
        {
          "version": "ESV",
          "text": "“Asher’s food shall be rich, and he shall yield royal delicacies."
        },
        {
          "version": "NKJV",
          "text": "“Bread from Asher shall be rich, And he shall yield royal dainties."
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 49:21",
      "book": "Genesis",
      "chapter": 49,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "“Naphtali is a doe set free that bears beautiful fawns."
        },
        {
          "version": "NLT",
          "text": "“Naphtali is a doe set free that bears beautiful fawns."
        },
        {
          "version": "ESV",
          "text": "“Naphtali is a doe let loose that bears beautiful fawns."
        },
        {
          "version": "NKJV",
          "text": "“Naphtali is a deer let loose; He uses beautiful words."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:23",
          "text": "Concerning Naphtali he said: “Naphtali is abounding with favor, full of the blessing of the LORD; he shall take possession of the sea and the south.”"
        },
        {
          "reference": "Judges 4:6-10",
          "text": "She summoned Barak son of Abinoam from Kedesh in Naphtali and said to him, “Surely the LORD, the God of Israel, is commanding you: ‘Go and march to Mount Tabor, taking with you ten thousand men of Naphtali and Zebulun. / And I will draw out Sisera the commander of Jabin’s army, his chariots, and his troops to the River Kishon, and I will deliver him into your hand.’” / Barak said to her, “If you will go with me, I will go; but if you will not go with me, I will not go.” ..."
        },
        {
          "reference": "Judges 5:18",
          "text": "Zebulun was a people who risked their lives; Naphtali, too, on the heights of the battlefield."
        },
        {
          "reference": "1 Chronicles 7:13",
          "text": "The sons of Naphtali: Jahziel, Guni, Jezer, and Shallum—the descendants of Bilhah."
        },
        {
          "reference": "Isaiah 9:1",
          "text": "Nevertheless, there will be no more gloom for those in distress. In the past He humbled the land of Zebulun and the land of Naphtali, but in the future He will honor the Way of the Sea, beyond the Jordan, Galilee of the nations:"
        },
        {
          "reference": "Matthew 4:13-16",
          "text": "Leaving Nazareth, He went and lived in Capernaum, which is by the sea in the region of Zebulun and Naphtali, / to fulfill what was spoken through the prophet Isaiah: / “Land of Zebulun and land of Naphtali, the Way of the Sea, beyond the Jordan, Galilee of the Gentiles— ..."
        },
        {
          "reference": "John 1:45-46",
          "text": "Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law, the One the prophets foretold—Jesus of Nazareth, the son of Joseph.” / “Can anything good come from Nazareth?” Nathanael asked. “Come and see,” said Philip."
        },
        {
          "reference": "Matthew 10:5-6",
          "text": "These twelve Jesus sent out with the following instructions: “Do not go onto the road of the Gentiles or enter any town of the Samaritans. / Go rather to the lost sheep of Israel."
        },
        {
          "reference": "Luke 2:39-40",
          "text": "When Jesus’ parents had done everything required by the Law of the Lord, they returned to Galilee, to their own town of Nazareth. / And the Child grew and became strong. He was filled with wisdom, and the grace of God was upon Him."
        },
        {
          "reference": "John 7:52",
          "text": "“Aren’t you also from Galilee?” they replied. “Look into it, and you will see that no prophet comes out of Galilee.”"
        },
        {
          "reference": "Joshua 19:32-39",
          "text": "The sixth lot came out for the clans of the tribe of Naphtali: / Their border started at Heleph and the great tree of Zaanannim, passing Adami-nekeb and Jabneel as far as Lakkum and ending at the Jordan. / Then the border turned westward to Aznoth-tabor and ran from there to Hukkok, touching Zebulun on the south side, Asher on the west, and Judah at the Jordan on the east. ..."
        },
        {
          "reference": "2 Kings 15:29",
          "text": "In the days of Pekah king of Israel, Tiglath-pileser king of Assyria came and captured Ijon, Abel-beth-maacah, Janoah, Kedesh, Hazor, Gilead, and Galilee, including all the land of Naphtali, and he took the people as captives to Assyria."
        },
        {
          "reference": "2 Kings 17:6",
          "text": "In the ninth year of Hoshea, the king of Assyria captured Samaria and carried away the Israelites to Assyria, where he settled them in Halah, in Gozan by the Habor River, and in the cities of the Medes."
        },
        {
          "reference": "2 Kings 18:11",
          "text": "The king of Assyria exiled the Israelites to Assyria and settled them in Halah, in Gozan by the Habor River, and in the cities of the Medes."
        },
        {
          "reference": "2 Kings 15:27",
          "text": "In the fifty-second year of Azariah’s reign over Judah, Pekah son of Remaliah became king of Israel, and he reigned in Samaria twenty years."
        }
      ]
    },
    {
      "reference": "Genesis 49:22",
      "book": "Genesis",
      "chapter": 49,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "“Joseph is a fruitful vine, a fruitful vine near a spring, whose branches climb over a wall."
        },
        {
          "version": "NLT",
          "text": "“Joseph is the foal of a wild donkey, the foal of a wild donkey at a spring— one of the wild donkeys on the ridge."
        },
        {
          "version": "ESV",
          "text": "“Joseph is a fruitful bough, a fruitful bough by a spring; his branches run over the wall."
        },
        {
          "version": "NKJV",
          "text": "“Joseph is a fruitful bough, A fruitful bough by a well; His branches run over the wall."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "John 15:1-5",
          "text": "“I am the true vine, and My Father is the keeper of the vineyard. / He cuts off every branch in Me that bears no fruit, and every branch that does bear fruit, He prunes to make it even more fruitful. / You are already clean because of the word I have spoken to you. ..."
        },
        {
          "reference": "Psalm 1:3",
          "text": "He is like a tree planted by streams of water, yielding its fruit in season, whose leaf does not wither, and who prospers in all he does."
        },
        {
          "reference": "Isaiah 27:6",
          "text": "In the days to come, Jacob will take root. Israel will bud and blossom and fill the whole world with fruit."
        },
        {
          "reference": "Ezekiel 19:10-11",
          "text": "Your mother was like a vine in your vineyard, planted by the water; it was fruitful and full of branches because of the abundant waters. / It had strong branches, fit for a ruler’s scepter. It towered high above the thick branches, conspicuous for its height and for its dense foliage."
        },
        {
          "reference": "Hosea 14:5-7",
          "text": "I will be like the dew to Israel; he will blossom like the lily and take root like the cedars of Lebanon. / His shoots will sprout, and his splendor will be like the olive tree, his fragrance like the cedars of Lebanon. / They will return and dwell in his shade; they will grow grain and blossom like the vine. His renown will be like the wine of Lebanon."
        },
        {
          "reference": "Psalm 80:8-11",
          "text": "You uprooted a vine from Egypt; You drove out the nations and transplanted it. / You cleared the ground for it, and it took root and filled the land. / The mountains were covered by its shade, and the mighty cedars with its branches. ..."
        },
        {
          "reference": "Jeremiah 17:7-8",
          "text": "But blessed is the man who trusts in the LORD, whose confidence is in Him. / He is like a tree planted by the waters that sends out its roots toward the stream. It does not fear when the heat comes, and its leaves are always green. It does not worry in a year of drought, nor does it cease to produce fruit."
        },
        {
          "reference": "Zechariah 8:12",
          "text": "“For the seed will be prosperous, the vine will yield its fruit, the ground will yield its produce, and the skies will give their dew. To the remnant of this people I will give all these things as an inheritance."
        },
        {
          "reference": "Matthew 7:17-20",
          "text": "Likewise, every good tree bears good fruit, but a bad tree bears bad fruit. / A good tree cannot bear bad fruit, and a bad tree cannot bear good fruit. / Every tree that does not bear good fruit is cut down and thrown into the fire. ..."
        },
        {
          "reference": "John 15:16",
          "text": "You did not choose Me, but I chose you. And I appointed you to go and bear fruit—fruit that will remain—so that whatever you ask the Father in My name, He will give you."
        },
        {
          "reference": "Galatians 5:22-23",
          "text": "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, / gentleness, and self-control. Against such things there is no law."
        },
        {
          "reference": "Colossians 1:10",
          "text": "so that you may walk in a manner worthy of the Lord and may please Him in every way: bearing fruit in every good work, growing in the knowledge of God,"
        },
        {
          "reference": "James 3:17-18",
          "text": "But the wisdom from above is first of all pure, then peace-loving, gentle, accommodating, full of mercy and good fruit, impartial, and sincere. / Peacemakers who sow in peace reap the fruit of righteousness."
        },
        {
          "reference": "Psalm 128:3",
          "text": "Your wife will be like a fruitful vine flourishing within your house, your sons like olive shoots sitting around your table."
        },
        {
          "reference": "Isaiah 32:15-16",
          "text": "until the Spirit is poured out upon us from on high. Then the desert will be an orchard, and the orchard will seem like a forest. / Then justice will inhabit the wilderness, and righteousness will dwell in the fertile field."
        }
      ]
    },
    {
      "reference": "Genesis 49:23",
      "book": "Genesis",
      "chapter": 49,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "With bitterness archers attacked him; they shot at him with hostility."
        },
        {
          "version": "NLT",
          "text": "Archers attacked him savagely; they shot at him and harassed him."
        },
        {
          "version": "ESV",
          "text": "The archers bitterly attacked him, shot at him, and harassed him severely,"
        },
        {
          "version": "NKJV",
          "text": "The archers have bitterly grieved him, Shot at him and hated him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Psalm 18:34-35",
          "text": "He trains my hands for battle; my arms can bend a bow of bronze. / You have given me Your shield of salvation; Your right hand upholds me, and Your gentleness exalts me."
        },
        {
          "reference": "Psalm 64:3-4",
          "text": "who sharpen their tongues like swords and aim their bitter words like arrows, / ambushing the innocent in seclusion, shooting suddenly, without fear."
        },
        {
          "reference": "Psalm 120:3-4",
          "text": "What will He do to you, and what will be added to you, O deceitful tongue? / Sharp arrows will come from the warrior, with burning coals of the broom tree!"
        },
        {
          "reference": "Psalm 140:3-4",
          "text": "They sharpen their tongues like snakes; the venom of vipers is on their lips. Selah / Guard me, O LORD, from the hands of the wicked. Keep me safe from men of violence who scheme to make me stumble."
        },
        {
          "reference": "Isaiah 54:17",
          "text": "No weapon formed against you shall prosper, and you will refute every tongue that accuses you. This is the heritage of the servants of the LORD, and their vindication is from Me,” declares the LORD."
        },
        {
          "reference": "Jeremiah 20:10-11",
          "text": "For I have heard the whispering of many: “Terror is on every side! Report him; let us report him!” All my trusted friends watch for my fall: “Perhaps he will be deceived so that we may prevail against him and take our vengeance upon him.” / But the LORD is with me like a fearsome warrior. Therefore, my persecutors will stumble and will not prevail. Since they have not succeeded, they will be utterly put to shame, with an everlasting disgrace that will never be forgotten."
        },
        {
          "reference": "Lamentations 3:52",
          "text": "Without cause my enemies hunted me like a bird."
        },
        {
          "reference": "Zechariah 9:13",
          "text": "For I will bend Judah as My bow and fit it with Ephraim. I will rouse your sons, O Zion, against the sons of Greece. I will make you like the sword of a mighty man."
        },
        {
          "reference": "Matthew 5:11-12",
          "text": "Blessed are you when people insult you, persecute you, and falsely say all kinds of evil against you because of Me. / Rejoice and be glad, because great is your reward in heaven, for in the same way they persecuted the prophets before you."
        },
        {
          "reference": "Matthew 10:22",
          "text": "You will be hated by everyone because of My name, but the one who perseveres to the end will be saved."
        },
        {
          "reference": "Luke 6:22-23",
          "text": "Blessed are you when people hate you, and when they exclude you and insult you and reject your name as evil because of the Son of Man. / Rejoice in that day and leap for joy, because great is your reward in heaven. For their fathers treated the prophets in the same way."
        },
        {
          "reference": "John 15:18-20",
          "text": "If the world hates you, understand that it hated Me first. / If you were of the world, it would love you as its own. Instead, the world hates you, because you are not of the world, but I have chosen you out of the world. / Remember the word that I spoke to you: ‘No servant is greater than his master.’ If they persecuted Me, they will persecute you as well; if they kept My word, they will keep yours as well."
        },
        {
          "reference": "Acts 7:9",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him"
        },
        {
          "reference": "Acts 9:4-5",
          "text": "He fell to the ground and heard a voice say to him, “Saul, Saul, why do you persecute Me?” / “Who are You, Lord?” Saul asked. “I am Jesus, whom you are persecuting,” He replied."
        },
        {
          "reference": "Romans 8:35-37",
          "text": "Who shall separate us from the love of Christ? Shall trouble or distress or persecution or famine or nakedness or danger or sword? / As it is written: “For Your sake we face death all day long; we are considered as sheep to be slaughtered.” / No, in all these things we are more than conquerors through Him who loved us."
        }
      ]
    },
    {
      "reference": "Genesis 49:24",
      "book": "Genesis",
      "chapter": 49,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "But his bow remained steady, his strong arms stayed limber, because of the hand of the Mighty One of Jacob, because of the Shepherd, the Rock of Israel,"
        },
        {
          "version": "NLT",
          "text": "But his bow remained taut, and his arms were strengthened by the hands of the Mighty One of Jacob, by the Shepherd, the Rock of Israel."
        },
        {
          "version": "ESV",
          "text": "yet his bow remained unmoved; his arms were made agile by the hands of the Mighty One of Jacob (from there is the Shepherd, the Stone of Israel),"
        },
        {
          "version": "NKJV",
          "text": "But his bow remained in strength, And the arms of his hands were made strong By the hands of the Mighty God of Jacob (From there is the Shepherd, the Stone of Israel),"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Psalm 18:32-34",
          "text": "It is God who arms me with strength and makes my way clear. / He makes my feet like those of a deer and stations me upon the heights. / He trains my hands for battle; my arms can bend a bow of bronze."
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Psalm 23:4",
          "text": "Even though I walk through the valley of the shadow of death, I will fear no evil, for You are with me; Your rod and Your staff, they comfort me."
        },
        {
          "reference": "Isaiah 40:29-31",
          "text": "He gives power to the faint and increases the strength of the weak. / Even youths grow tired and weary, and young men stumble and fall. / But those who wait upon the LORD will renew their strength; they will mount up with wings like eagles; they will run and not grow weary, they will walk and not faint."
        },
        {
          "reference": "Psalm 28:7",
          "text": "The LORD is my strength and my shield; my heart trusts in Him, and I am helped. Therefore my heart rejoices, and I give thanks to Him with my song."
        },
        {
          "reference": "2 Samuel 22:35",
          "text": "He trains my hands for battle; my arms can bend a bow of bronze."
        },
        {
          "reference": "Psalm 144:1",
          "text": "Of David. Blessed be the LORD, my Rock, who trains my hands for war, my fingers for battle."
        },
        {
          "reference": "Isaiah 49:5",
          "text": "And now says the LORD, who formed Me from the womb to be His Servant, to bring Jacob back to Him, that Israel might be gathered to Him—for I am honored in the sight of the LORD, and My God is My strength—"
        },
        {
          "reference": "Psalm 73:26",
          "text": "My flesh and my heart may fail, but God is the strength of my heart and my portion forever."
        },
        {
          "reference": "Habakkuk 3:19",
          "text": "GOD the Lord is my strength; He makes my feet like those of a deer; He makes me walk upon the heights! For the choirmaster. With stringed instruments."
        },
        {
          "reference": "2 Corinthians 12:9-10",
          "text": "But He said to me, “My grace is sufficient for you, for My power is perfected in weakness.” Therefore I will boast all the more gladly in my weaknesses, so that the power of Christ may rest on me. / That is why, for the sake of Christ, I delight in weaknesses, in insults, in hardships, in persecutions, in difficulties. For when I am weak, then I am strong."
        },
        {
          "reference": "Philippians 4:13",
          "text": "I can do all things through Christ who gives me strength."
        },
        {
          "reference": "Ephesians 6:10",
          "text": "Finally, be strong in the Lord and in His mighty power."
        },
        {
          "reference": "2 Timothy 4:17",
          "text": "But the Lord stood by me and strengthened me, so that through me the message would be fully proclaimed, and all the Gentiles would hear it. So I was delivered from the mouth of the lion."
        },
        {
          "reference": "Hebrews 11:34",
          "text": "quenched the raging fire, and escaped the edge of the sword; who gained strength from weakness, became mighty in battle, and put foreign armies to flight."
        }
      ]
    },
    {
      "reference": "Genesis 49:25",
      "book": "Genesis",
      "chapter": 49,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "because of your father’s God, who helps you, because of the Almighty, who blesses you with blessings of the skies above, blessings of the deep springs below, blessings of the breast and womb."
        },
        {
          "version": "NLT",
          "text": "May the God of your father help you; may the Almighty bless you with the blessings of the heavens above, and blessings of the watery depths below, and blessings of the breasts and womb."
        },
        {
          "version": "ESV",
          "text": "by the God of your father who will help you, by the Almighty who will bless you with blessings of heaven above, blessings of the deep that crouches beneath, blessings of the breasts and of the womb."
        },
        {
          "version": "NKJV",
          "text": "By the God of your father who will help you, And by the Almighty who will bless you With blessings of heaven above, Blessings of the deep that lies beneath, Blessings of the breasts and of the womb."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:13-16",
          "text": "Concerning Joseph he said: “May his land be blessed by the LORD with the precious dew from heaven above and the deep waters that lie beneath, / with the bountiful harvest from the sun and the abundant yield of the seasons, / with the best of the ancient mountains and the bounty of the everlasting hills, ..."
        },
        {
          "reference": "Psalm 132:15",
          "text": "I will bless her with abundant provisions; I will satisfy her poor with bread."
        },
        {
          "reference": "Isaiah 44:3",
          "text": "For I will pour water on the thirsty land, and currents on the dry ground. I will pour out My Spirit on your descendants, and My blessing on your offspring."
        },
        {
          "reference": "Isaiah 55:10",
          "text": "For just as rain and snow fall from heaven and do not return without watering the earth, making it bud and sprout, and providing seed to sow and food to eat,"
        },
        {
          "reference": "Ezekiel 34:26",
          "text": "I will make them and the places around My hill a blessing. I will send down showers in season—showers of blessing."
        },
        {
          "reference": "Hosea 2:21-22",
          "text": "“On that day I will respond—” declares the LORD—“I will respond to the heavens, and they will respond to the earth. / And the earth will respond to the grain, to the new wine and oil, and they will respond to Jezreel."
        },
        {
          "reference": "Joel 2:23",
          "text": "Be glad, O children of Zion, and rejoice in the LORD your God, for He has given you the autumn rains for your vindication. He sends you showers, both autumn and spring rains, as before."
        },
        {
          "reference": "Zechariah 10:1",
          "text": "Ask the LORD for rain in springtime; the LORD makes the storm clouds, and He will give everyone showers of rain and crops in the field."
        },
        {
          "reference": "James 1:17",
          "text": "Every good and perfect gift is from above, coming down from the Father of the heavenly lights, with whom there is no change or shifting shadow."
        },
        {
          "reference": "Philippians 4:19",
          "text": "And my God will supply all your needs according to His glorious riches in Christ Jesus."
        },
        {
          "reference": "Ephesians 1:3",
          "text": "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us in Christ with every spiritual blessing in the heavenly realms."
        },
        {
          "reference": "2 Corinthians 9:8",
          "text": "And God is able to make all grace abound to you, so that in all things, at all times, having all that you need, you will abound in every good work."
        },
        {
          "reference": "Matthew 7:11",
          "text": "So if you who are evil know how to give good gifts to your children, how much more will your Father in heaven give good things to those who ask Him!"
        },
        {
          "reference": "Luke 11:13",
          "text": "So if you who are evil know how to give good gifts to your children, how much more will your Father in heaven give the Holy Spirit to those who ask Him!”"
        },
        {
          "reference": "John 4:10",
          "text": "Jesus answered, “If you knew the gift of God and who is asking you for a drink, you would have asked Him, and He would have given you living water.”"
        }
      ]
    },
    {
      "reference": "Genesis 49:26",
      "book": "Genesis",
      "chapter": 49,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "Your father’s blessings are greater than the blessings of the ancient mountains, than the bounty of the age-old hills. Let all these rest on the head of Joseph, on the brow of the prince among his brothers."
        },
        {
          "version": "NLT",
          "text": "May my fatherly blessings on you surpass the blessings of my ancestors, reaching to the heights of the eternal hills. May these blessings rest on the head of Joseph, who is a prince among his brothers."
        },
        {
          "version": "ESV",
          "text": "The blessings of your father are mighty beyond the blessings of my parents, up to the bounties of the everlasting hills. May they be on the head of Joseph, and on the brow of him who was set apart from his brothers."
        },
        {
          "version": "NKJV",
          "text": "The blessings of your father Have excelled the blessings of my ancestors, Up to the utmost bound of the everlasting hills. They shall be on the head of Joseph, And on the crown of the head of him who was separate from his brothers."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:13-16",
          "text": "Concerning Joseph he said: “May his land be blessed by the LORD with the precious dew from heaven above and the deep waters that lie beneath, / with the bountiful harvest from the sun and the abundant yield of the seasons, / with the best of the ancient mountains and the bounty of the everlasting hills, ..."
        },
        {
          "reference": "Psalm 23:5",
          "text": "You prepare a table before me in the presence of my enemies. You anoint my head with oil; my cup overflows."
        },
        {
          "reference": "Psalm 133:2",
          "text": "It is like fine oil on the head, running down on the beard, running down Aaron’s beard over the collar of his robes."
        },
        {
          "reference": "Isaiah 61:9",
          "text": "Their descendants will be known among the nations, and their offspring among the peoples. All who see them will acknowledge that they are a people the LORD has blessed."
        },
        {
          "reference": "Isaiah 65:23",
          "text": "They will not labor in vain or bear children doomed to disaster; for they will be a people blessed by the LORD—they and their descendants with them."
        },
        {
          "reference": "Ezekiel 34:26",
          "text": "I will make them and the places around My hill a blessing. I will send down showers in season—showers of blessing."
        },
        {
          "reference": "Ezekiel 37:25",
          "text": "They will live in the land that I gave to My servant Jacob, where your fathers lived. They will live there forever with their children and grandchildren, and My servant David will be their prince forever."
        },
        {
          "reference": "Hosea 14:5-7",
          "text": "I will be like the dew to Israel; he will blossom like the lily and take root like the cedars of Lebanon. / His shoots will sprout, and his splendor will be like the olive tree, his fragrance like the cedars of Lebanon. / They will return and dwell in his shade; they will grow grain and blossom like the vine. His renown will be like the wine of Lebanon."
        },
        {
          "reference": "Zechariah 8:12",
          "text": "“For the seed will be prosperous, the vine will yield its fruit, the ground will yield its produce, and the skies will give their dew. To the remnant of this people I will give all these things as an inheritance."
        },
        {
          "reference": "John 1:16",
          "text": "From His fullness we have all received grace upon grace."
        },
        {
          "reference": "John 10:10",
          "text": "The thief comes only to steal and kill and destroy. I have come that they may have life, and have it in all its fullness."
        },
        {
          "reference": "Romans 15:29",
          "text": "I know that when I come to you, I will come in the fullness of the blessing of Christ."
        },
        {
          "reference": "2 Corinthians 9:8",
          "text": "And God is able to make all grace abound to you, so that in all things, at all times, having all that you need, you will abound in every good work."
        },
        {
          "reference": "Ephesians 1:3",
          "text": "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us in Christ with every spiritual blessing in the heavenly realms."
        },
        {
          "reference": "Ephesians 3:20",
          "text": "Now to Him who is able to do immeasurably more than all we ask or imagine, according to His power that is at work within us,"
        }
      ]
    },
    {
      "reference": "Genesis 49:27",
      "book": "Genesis",
      "chapter": 49,
      "verse": 27,
      "translations": [
        {
          "version": "NIV",
          "text": "&#8220Benjamin is a ravenous wolf; in the morning he devours the prey, in the evening he divides the plunder.”"
        },
        {
          "version": "NLT",
          "text": "“Benjamin is a ravenous wolf, devouring his enemies in the morning and dividing his plunder in the evening.”"
        },
        {
          "version": "ESV",
          "text": "“Benjamin is a ravenous wolf, in the morning devouring the prey and at evening dividing the spoil.”"
        },
        {
          "version": "NKJV",
          "text": "“Benjamin is a ravenous wolf; In the morning he shall devour the prey, And at night he shall divide the spoil.”"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 49:28",
      "book": "Genesis",
      "chapter": 49,
      "verse": 28,
      "translations": [
        {
          "version": "NIV",
          "text": "All these are the twelve tribes of Israel, and this is what their father said to them when he blessed them, giving each the blessing appropriate to him."
        },
        {
          "version": "NLT",
          "text": "These are the twelve tribes of Israel, and this is what their father said as he told his sons good-bye. He blessed each one with an appropriate message."
        },
        {
          "version": "ESV",
          "text": "All these are the twelve tribes of Israel. This is what their father said to them as he blessed them, blessing each with the blessing suitable to him."
        },
        {
          "version": "NKJV",
          "text": "All these are the twelve tribes of Israel, and this is what their father spoke to them. And he blessed them; he blessed each one according to his own blessing."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Deuteronomy 33:1-29",
          "text": "This is the blessing that Moses the man of God pronounced upon the Israelites before his death. / He said: “The LORD came from Sinai and dawned upon us from Seir; He shone forth from Mount Paran and came with myriads of holy ones, with flaming fire at His right hand. / Surely You love the people; all the holy ones are in Your hand, and they sit down at Your feet; each receives Your words— ..."
        },
        {
          "reference": "Hebrews 11:20-21",
          "text": "By faith Isaac blessed Jacob and Esau concerning the future. / By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Numbers 24:1-9",
          "text": "And when Balaam saw that it pleased the LORD to bless Israel, he did not seek omens as on previous occasions, but he turned his face toward the wilderness. / When Balaam looked up and saw Israel encamped tribe by tribe, the Spirit of God came upon him, / and he lifted up an oracle, saying: “This is the prophecy of Balaam son of Beor, the prophecy of a man whose eyes are open, ..."
        },
        {
          "reference": "Revelation 7:4-8",
          "text": "And I heard the number of those who were sealed, 144,000 from all the tribes of Israel: / From the tribe of Judah 12,000 were sealed, from the tribe of Reuben 12,000, from the tribe of Gad 12,000, / from the tribe of Asher 12,000, from the tribe of Naphtali 12,000, from the tribe of Manasseh 12,000, ..."
        },
        {
          "reference": "Joshua 13:7-33",
          "text": "Now therefore divide this land as an inheritance to the nine tribes and the half-tribe of Manasseh.” / The other half of Manasseh, along with the Reubenites and Gadites, had received the inheritance Moses had given them beyond the Jordan to the east, just as Moses the servant of the LORD had assigned to them: / The area from Aroer on the rim of the Arnon Valley, along with the city in the middle of the valley, the whole plateau of Medeba as far as Dibon, ..."
        },
        {
          "reference": "Ezekiel 48:1-29",
          "text": "“Now these are the names of the tribes: At the northern frontier, Dan will have one portion bordering the road of Hethlon to Lebo-hamath and running on to Hazar-enan on the border of Damascus with Hamath to the north, and extending from the east side to the west side. / Asher will have one portion bordering the territory of Dan from east to west. / Naphtali will have one portion bordering the territory of Asher from east to west. ..."
        },
        {
          "reference": "1 Chronicles 5:1-2",
          "text": "These were the sons of Reuben the firstborn of Israel. Though he was the firstborn, his birthright was given to the sons of Joseph son of Israel, because Reuben defiled his father’s bed. So he is not reckoned according to birthright. / And though Judah prevailed over his brothers and a ruler came from him, the birthright belonged to Joseph."
        },
        {
          "reference": "Judges 5:14-18",
          "text": "Some came from Ephraim, with their roots in Amalek; Benjamin came with your people after you. The commanders came down from Machir, the bearers of the marshal’s staff from Zebulun. / The princes of Issachar were with Deborah, and Issachar was with Barak, rushing into the valley at his heels. In the clans of Reuben there was great indecision. / Why did you sit among the sheepfolds to hear the whistling for the flocks? In the clans of Reuben there was great indecision. ..."
        },
        {
          "reference": "1 Kings 18:31",
          "text": "And Elijah took twelve stones, one for each tribe of the sons of Jacob, to whom the word of the LORD had come and said, “Israel shall be your name.”"
        },
        {
          "reference": "Romans 11:1-5",
          "text": "I ask then, did God reject His people? Certainly not! I am an Israelite myself, a descendant of Abraham, from the tribe of Benjamin. / God did not reject His people, whom He foreknew. Do you not know what the Scripture says about Elijah, how he appealed to God against Israel: / “Lord, they have killed Your prophets and torn down Your altars. I am the only one left, and they are seeking my life as well”? ..."
        },
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Acts 7:8",
          "text": "Then God gave Abraham the covenant of circumcision, and Abraham became the father of Isaac and circumcised him on the eighth day. And Isaac became the father of Jacob, and Jacob of the twelve patriarchs."
        },
        {
          "reference": "Psalm 105:8-11",
          "text": "He remembers His covenant forever, the word He ordained for a thousand generations— / the covenant He made with Abraham, and the oath He swore to Isaac. / He confirmed it to Jacob as a decree, to Israel as an everlasting covenant: ..."
        },
        {
          "reference": "Matthew 19:28",
          "text": "Jesus said to them, “Truly I tell you, in the renewal of all things, when the Son of Man sits on His glorious throne, you who have followed Me will also sit on twelve thrones, judging the twelve tribes of Israel."
        },
        {
          "reference": "1 Chronicles 12:23-40",
          "text": "Now these are the numbers of men armed for battle who came to David at Hebron to turn Saul’s kingdom over to him, in accordance with the word of the LORD: / From Judah: 6,800 armed troops bearing shields and spears. / From Simeon: 7,100 mighty men of valor, ready for battle. ..."
        }
      ]
    },
    {
      "reference": "Genesis 49:29",
      "book": "Genesis",
      "chapter": 49,
      "verse": 29,
      "translations": [
        {
          "version": "NIV",
          "text": "Then he gave them these instructions: “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite,"
        },
        {
          "version": "NLT",
          "text": "Then Jacob instructed them, “Soon I will die and join my ancestors. Bury me with my father and grandfather in the cave in the field of Ephron the Hittite."
        },
        {
          "version": "ESV",
          "text": "Then he commanded them and said to them, “I am to be gathered to my people; bury me with my fathers in the cave that is in the field of Ephron the Hittite,"
        },
        {
          "version": "NKJV",
          "text": "Then he charged them and said to them: “I am to be gathered to my people; bury me with my fathers in the cave that is in the field of Ephron the Hittite,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 23:19",
          "text": "After this, Abraham buried his wife Sarah in the cave of the field at Machpelah near Mamre (that is, Hebron) in the land of Canaan."
        },
        {
          "reference": "Genesis 25:8-10",
          "text": "And at a ripe old age he breathed his last and died, old and contented, and was gathered to his people. / His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite. / This was the field that Abraham had bought from the Hittites. Abraham was buried there with his wife Sarah."
        },
        {
          "reference": "Genesis 50:12-14",
          "text": "So Jacob’s sons did as he had charged them. / They carried him to the land of Canaan and buried him in the cave at Machpelah in the field near Mamre, which Abraham had purchased from Ephron the Hittite as a burial site. / After Joseph had buried his father, he returned to Egypt with his brothers and all who had gone with him to bury his father."
        },
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Genesis 15:15",
          "text": "You, however, will go to your fathers in peace and be buried at a ripe old age."
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Hebrews 11:21-22",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff. / By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "1 Kings 2:10",
          "text": "Then David rested with his fathers and was buried in the City of David."
        },
        {
          "reference": "2 Samuel 19:37",
          "text": "Please let your servant return, that I may die in my own city near the tomb of my father and mother. But here is your servant Chimham. Let him cross over with my lord the king, and do for him what is good in your sight.”"
        },
        {
          "reference": "2 Kings 21:18",
          "text": "And Manasseh rested with his fathers and was buried in his palace garden, the garden of Uzza. And his son Amon reigned in his place."
        },
        {
          "reference": "2 Chronicles 16:14",
          "text": "And he was buried in the tomb that he had cut out for himself in the City of David. They laid him on a bier that was full of spices and various blended perfumes; then they made a great fire in his honor."
        },
        {
          "reference": "2 Chronicles 21:20",
          "text": "Jehoram was thirty-two years old when he became king, and he reigned in Jerusalem eight years. He died, to no one’s regret, and was buried in the City of David, but not in the tombs of the kings."
        }
      ]
    },
    {
      "reference": "Genesis 49:30",
      "book": "Genesis",
      "chapter": 49,
      "verse": 30,
      "translations": [
        {
          "version": "NIV",
          "text": "the cave in the field of Machpelah, near Mamre in Canaan, which Abraham bought along with the field as a burial place from Ephron the Hittite."
        },
        {
          "version": "NLT",
          "text": "This is the cave in the field of Machpelah, near Mamre in Canaan, that Abraham bought from Ephron the Hittite as a permanent burial site."
        },
        {
          "version": "ESV",
          "text": "in the cave that is in the field at Machpelah, to the east of Mamre, in the land of Canaan, which Abraham bought with the field from Ephron the Hittite to possess as a burying place."
        },
        {
          "version": "NKJV",
          "text": "in the cave that is in the field of Machpelah, which is before Mamre in the land of Canaan, which Abraham bought with the field of Ephron the Hittite as a possession for a burial place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 23:19",
          "text": "After this, Abraham buried his wife Sarah in the cave of the field at Machpelah near Mamre (that is, Hebron) in the land of Canaan."
        },
        {
          "reference": "Genesis 25:9",
          "text": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite."
        },
        {
          "reference": "Genesis 50:13",
          "text": "They carried him to the land of Canaan and buried him in the cave at Machpelah in the field near Mamre, which Abraham had purchased from Ephron the Hittite as a burial site."
        },
        {
          "reference": "Acts 7:16",
          "text": "Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 35:27-29",
          "text": "Jacob returned to his father Isaac at Mamre, near Kiriath-arba (that is, Hebron), where Abraham and Isaac had stayed. / And Isaac lived 180 years. / Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 47:29-30",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.”"
        },
        {
          "reference": "Genesis 50:24-25",
          "text": "Then Joseph said to his brothers, “I am about to die, but God will surely visit you and bring you up from this land to the land He promised on oath to Abraham, Isaac, and Jacob.” / And Joseph made the sons of Israel take an oath and said, “God will surely attend to you, and then you must carry my bones up from this place.”"
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "John 19:41-42",
          "text": "Now there was a garden in the place where Jesus was crucified, and in the garden a new tomb in which no one had yet been laid. / And because it was the Jewish day of Preparation and the tomb was nearby, they placed Jesus there."
        },
        {
          "reference": "Matthew 27:59-60",
          "text": "So Joseph took the body, wrapped it in a clean linen cloth, / and placed it in his own new tomb that he had cut into the rock. Then he rolled a great stone across the entrance to the tomb and went away."
        },
        {
          "reference": "1 Kings 2:10",
          "text": "Then David rested with his fathers and was buried in the City of David."
        },
        {
          "reference": "2 Samuel 19:37",
          "text": "Please let your servant return, that I may die in my own city near the tomb of my father and mother. But here is your servant Chimham. Let him cross over with my lord the king, and do for him what is good in your sight.”"
        },
        {
          "reference": "2 Samuel 21:14",
          "text": "And they buried the bones of Saul and his son Jonathan in Zela in the land of Benjamin, in the tomb of Saul’s father Kish. After they had done everything the king had commanded, God answered their prayers for the land."
        }
      ]
    },
    {
      "reference": "Genesis 49:31",
      "book": "Genesis",
      "chapter": 49,
      "verse": 31,
      "translations": [
        {
          "version": "NIV",
          "text": "There Abraham and his wife Sarah were buried, there Isaac and his wife Rebekah were buried, and there I buried Leah."
        },
        {
          "version": "NLT",
          "text": "There Abraham and his wife Sarah are buried. There Isaac and his wife, Rebekah, are buried. And there I buried Leah."
        },
        {
          "version": "ESV",
          "text": "There they buried Abraham and Sarah his wife. There they buried Isaac and Rebekah his wife, and there I buried Leah—"
        },
        {
          "version": "NKJV",
          "text": "There they buried Abraham and Sarah his wife, there they buried Isaac and Rebekah his wife, and there I buried Leah."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 23:19",
          "text": "After this, Abraham buried his wife Sarah in the cave of the field at Machpelah near Mamre (that is, Hebron) in the land of Canaan."
        },
        {
          "reference": "Genesis 25:9",
          "text": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite."
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 50:13",
          "text": "They carried him to the land of Canaan and buried him in the cave at Machpelah in the field near Mamre, which Abraham had purchased from Ephron the Hittite as a burial site."
        },
        {
          "reference": "Ruth 1:16-17",
          "text": "But Ruth replied: “Do not urge me to leave you or to turn from following you. For wherever you go, I will go, and wherever you live, I will live; your people will be my people, and your God will be my God. / Where you die, I will die, and there I will be buried. May the LORD punish me, and ever so severely, if anything but death separates you and me.”"
        },
        {
          "reference": "Hebrews 11:13",
          "text": "All these people died in faith, without having received the things they were promised. However, they saw them and welcomed them from afar. And they acknowledged that they were strangers and exiles on the earth."
        },
        {
          "reference": "Hebrews 11:16",
          "text": "Instead, they were longing for a better country, a heavenly one. Therefore God is not ashamed to be called their God, for He has prepared a city for them."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Matthew 27:60",
          "text": "and placed it in his own new tomb that he had cut into the rock. Then he rolled a great stone across the entrance to the tomb and went away."
        },
        {
          "reference": "John 19:41-42",
          "text": "Now there was a garden in the place where Jesus was crucified, and in the garden a new tomb in which no one had yet been laid. / And because it was the Jewish day of Preparation and the tomb was nearby, they placed Jesus there."
        },
        {
          "reference": "1 Kings 2:10",
          "text": "Then David rested with his fathers and was buried in the City of David."
        },
        {
          "reference": "2 Samuel 2:32",
          "text": "And they took Asahel and buried him in his father’s tomb in Bethlehem. Then Joab and his men marched all night and reached Hebron at daybreak."
        },
        {
          "reference": "2 Kings 21:18",
          "text": "And Manasseh rested with his fathers and was buried in his palace garden, the garden of Uzza. And his son Amon reigned in his place."
        },
        {
          "reference": "2 Chronicles 16:14",
          "text": "And he was buried in the tomb that he had cut out for himself in the City of David. They laid him on a bier that was full of spices and various blended perfumes; then they made a great fire in his honor."
        }
      ]
    },
    {
      "reference": "Genesis 49:32",
      "book": "Genesis",
      "chapter": 49,
      "verse": 32,
      "translations": [
        {
          "version": "NIV",
          "text": "The field and the cave in it were bought from the Hittites.”"
        },
        {
          "version": "NLT",
          "text": "It is the plot of land and the cave that my grandfather Abraham bought from the Hittites.”"
        },
        {
          "version": "ESV",
          "text": "the field and the cave that is in it were bought from the Hittites.”"
        },
        {
          "version": "NKJV",
          "text": "The field and the cave that is there were purchased from the sons of Heth.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 23:16-20",
          "text": "Abraham agreed to Ephron’s terms and weighed out for him the price he had named in the hearing of the Hittites: four hundred shekels of silver, according to the standard of the merchants. / So Ephron’s field at Machpelah near Mamre, the cave that was in it, and all the trees within the boundaries of the field were deeded over / to Abraham’s possession in the presence of all the Hittites who had come to the gate of his city. ..."
        },
        {
          "reference": "Genesis 25:9-10",
          "text": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite. / This was the field that Abraham had bought from the Hittites. Abraham was buried there with his wife Sarah."
        },
        {
          "reference": "Genesis 50:13",
          "text": "They carried him to the land of Canaan and buried him in the cave at Machpelah in the field near Mamre, which Abraham had purchased from Ephron the Hittite as a burial site."
        },
        {
          "reference": "Genesis 35:27-29",
          "text": "Jacob returned to his father Isaac at Mamre, near Kiriath-arba (that is, Hebron), where Abraham and Isaac had stayed. / And Isaac lived 180 years. / Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Genesis 48:21-22",
          "text": "Then Israel said to Joseph, “Look, I am about to die, but God will be with you and bring you back to the land of your fathers. / And to you, as one who is above your brothers, I give the ridge of land that I took from the Amorites with my sword and bow.”"
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Hebrews 11:21-22",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff. / By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 15:18-21",
          "text": "On that day the LORD made a covenant with Abram, saying, “To your descendants I have given this land—from the river of Egypt to the great River Euphrates— / the land of the Kenites, Kenizzites, Kadmonites, / Hittites, Perizzites, Rephaites, ..."
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 28:13",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie."
        },
        {
          "reference": "Genesis 33:19",
          "text": "And the plot of ground where he pitched his tent, he purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver."
        }
      ]
    },
    {
      "reference": "Genesis 49:33",
      "book": "Genesis",
      "chapter": 49,
      "verse": 33,
      "translations": [
        {
          "version": "NIV",
          "text": "When Jacob had finished giving instructions to his sons, he drew his feet up into the bed, breathed his last and was gathered to his people."
        },
        {
          "version": "NLT",
          "text": "When Jacob had finished this charge to his sons, he drew his feet into the bed, breathed his last, and joined his ancestors in death."
        },
        {
          "version": "ESV",
          "text": "When Jacob finished commanding his sons, he drew up his feet into the bed and breathed his last and was gathered to his people."
        },
        {
          "version": "NKJV",
          "text": "And when Jacob had finished commanding his sons, he drew his feet up into the bed and breathed his last, and was gathered to his people."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:21",
          "text": "By faith Jacob, when he was dying, blessed each of Joseph’s sons and worshiped as he leaned on the top of his staff."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 25:8",
          "text": "And at a ripe old age he breathed his last and died, old and contented, and was gathered to his people."
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 50:1-3",
          "text": "Then Joseph fell upon his father’s face, wept over him, and kissed him. / And Joseph directed the physicians in his service to embalm his father Israel. So they embalmed him, / taking the forty days required to complete the embalming. And the Egyptians mourned for him seventy days."
        },
        {
          "reference": "Genesis 50:12-14",
          "text": "So Jacob’s sons did as he had charged them. / They carried him to the land of Canaan and buried him in the cave at Machpelah in the field near Mamre, which Abraham had purchased from Ephron the Hittite as a burial site. / After Joseph had buried his father, he returned to Egypt with his brothers and all who had gone with him to bury his father."
        },
        {
          "reference": "1 Kings 2:10",
          "text": "Then David rested with his fathers and was buried in the City of David."
        },
        {
          "reference": "1 Chronicles 29:28",
          "text": "He died at a ripe old age, full of years, riches, and honor, and his son Solomon reigned in his place."
        },
        {
          "reference": "Numbers 20:24-29",
          "text": "“Aaron will be gathered to his people; he will not enter the land that I have given the Israelites, because both of you rebelled against My command at the waters of Meribah. / Take Aaron and his son Eleazar and bring them up Mount Hor. / Remove Aaron’s priestly garments and put them on his son Eleazar. Aaron will be gathered to his people and will die there.” ..."
        },
        {
          "reference": "Deuteronomy 34:5-6",
          "text": "So Moses the servant of the LORD died there in the land of Moab, as the LORD had said. / And He buried him in a valley in the land of Moab facing Beth-peor, and no one to this day knows the location of his grave."
        },
        {
          "reference": "John 11:11-14",
          "text": "After He had said this, He told them, “Our friend Lazarus has fallen asleep, but I am going there to wake him up.” / His disciples replied, “Lord, if he is sleeping, he will get better.” / They thought that Jesus was talking about actual sleep, but He was speaking about the death of Lazarus. ..."
        },
        {
          "reference": "Matthew 27:50",
          "text": "When Jesus had cried out again in a loud voice, He yielded up His spirit."
        },
        {
          "reference": "Luke 23:46",
          "text": "Then Jesus called out in a loud voice, “Father, into Your hands I commit My Spirit.” And when He had said this, He breathed His last."
        },
        {
          "reference": "Acts 13:36",
          "text": "For when David had served God’s purpose in his own generation, he fell asleep. His body was buried with his fathers and saw decay."
        },
        {
          "reference": "2 Timothy 4:6-7",
          "text": "For I am already being poured out like a drink offering, and the time of my departure is at hand. / I have fought the good fight, I have finished the race, I have kept the faith."
        }
      ]
    }
  ]
}