{
  "book": "genesis",
  "chapter": 50,
  "verses": [
    {
      "reference": "Genesis 50:1",
      "book": "Genesis",
      "chapter": 50,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph threw himself on his father and wept over him and kissed him."
        },
        {
          "version": "NLT",
          "text": "Joseph threw himself on his father and wept over him and kissed him."
        },
        {
          "version": "ESV",
          "text": "Then Joseph fell on his father’s face and wept over him and kissed him."
        },
        {
          "version": "NKJV",
          "text": "Then Joseph fell on his father’s face and wept over him, and kissed him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "John 11:33-35",
          "text": "When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled. / “Where have you put him?” He asked. “Come and see, Lord,” they answered. / Jesus wept."
        },
        {
          "reference": "1 Kings 17:21-22",
          "text": "Then he stretched himself out over the child three times and cried out to the LORD, “O LORD my God, please let this boy’s life return to him!” / And the LORD listened to the voice of Elijah, and the child’s life returned to him, and he lived."
        },
        {
          "reference": "Acts 8:2",
          "text": "God-fearing men buried Stephen and mourned deeply over him."
        },
        {
          "reference": "2 Samuel 1:11-12",
          "text": "Then David took hold of his own clothes and tore them, and all the men who were with him did the same. / They mourned and wept and fasted until evening for Saul and his son Jonathan, and for the people of the LORD and the house of Israel, because they had fallen by the sword."
        },
        {
          "reference": "Matthew 9:23-25",
          "text": "When Jesus entered the house of the synagogue leader, He saw the flute players and the noisy crowd. / “Go away,” He told them. “The girl is not dead, but asleep.” And they laughed at Him. / After the crowd had been put outside, Jesus went in and took the girl by the hand, and she got up."
        },
        {
          "reference": "Luke 7:12-15",
          "text": "As He approached the town gate, He saw a dead man being carried out, the only son of his mother, and she was a widow. And a large crowd from the town was with her. / When the Lord saw her, He had compassion on her and said, “Do not weep.” / Then He went up and touched the coffin, and those carrying it stood still. “Young man,” He said, “I tell you, get up!” ..."
        },
        {
          "reference": "1 Thessalonians 4:13",
          "text": "Brothers, we do not want you to be uninformed about those who sleep in death, so that you will not grieve like the rest, who are without hope."
        },
        {
          "reference": "2 Kings 4:32-35",
          "text": "When Elisha reached the house, there was the boy lying dead on his bed. / So he went in, closed the door behind the two of them, and prayed to the LORD. / Then Elisha got on the bed and lay on the boy, mouth to mouth, eye to eye, and hand to hand. As he stretched himself out over him, the boy’s body became warm. ..."
        },
        {
          "reference": "John 20:11-13",
          "text": "But Mary stood outside the tomb weeping. And as she wept, she bent down to look into the tomb, / and she saw two angels in white sitting where the body of Jesus had lain, one at the head and the other at the feet. / “Woman, why are you weeping?” they asked. “Because they have taken my Lord away,” she said, “and I do not know where they have put Him.”"
        },
        {
          "reference": "Acts 9:39-41",
          "text": "So Peter got up and went with them. On his arrival, they took him to the upper room. All the widows stood around him, weeping and showing him the tunics and other clothing that Dorcas had made while she was still with them. / Then Peter sent them all out of the room. He knelt down and prayed, and turning toward her body, he said, “Tabitha, get up!” She opened her eyes, and seeing Peter, she sat up. / Peter took her by the hand and helped her up. Then he called the saints and widows and presented her to them alive."
        },
        {
          "reference": "1 Corinthians 15:55-57",
          "text": "“Where, O Death, is your victory? Where, O Death, is your sting?” / The sting of death is sin, and the power of sin is the law. / But thanks be to God, who gives us the victory through our Lord Jesus Christ!"
        },
        {
          "reference": "2 Samuel 18:33",
          "text": "The king was shaken and went up to the chamber over the gate and wept. And as he walked, he cried out, “O my son Absalom! My son, my son Absalom! If only I had died instead of you, O Absalom, my son, my son!”"
        },
        {
          "reference": "Mark 5:38-42",
          "text": "When they arrived at the house of the synagogue leader, Jesus saw the commotion and the people weeping and wailing loudly. / He went inside and asked, “Why all this commotion and weeping? The child is not dead, but asleep.” / And they laughed at Him. After He had put them all outside, He took the child’s father and mother and His own companions, and went in to see the child. ..."
        },
        {
          "reference": "Job 1:20-21",
          "text": "Then Job stood up, tore his robe, and shaved his head. He fell to the ground and worshiped, / saying: “Naked I came from my mother’s womb, and naked I will return. The LORD gave, and the LORD has taken away. Blessed be the name of the LORD.”"
        },
        {
          "reference": "Revelation 21:4",
          "text": "‘He will wipe away every tear from their eyes,’ and there will be no more death or mourning or crying or pain, for the former things have passed away.”"
        }
      ]
    },
    {
      "reference": "Genesis 50:2",
      "book": "Genesis",
      "chapter": 50,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Joseph directed the physicians in his service to embalm his father Israel. So the physicians embalmed him,"
        },
        {
          "version": "NLT",
          "text": "Then Joseph told the physicians who served him to embalm his father’s body; so Jacob was embalmed."
        },
        {
          "version": "ESV",
          "text": "And Joseph commanded his servants the physicians to embalm his father. So the physicians embalmed Israel."
        },
        {
          "version": "NKJV",
          "text": "And Joseph commanded his servants the physicians to embalm his father. So the physicians embalmed Israel."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "John 19:39-40",
          "text": "Nicodemus, who had previously come to Jesus at night, also brought a mixture of myrrh and aloes, about seventy-five pounds. / So they took the body of Jesus and wrapped it in linen cloths with the spices, according to the Jewish burial custom."
        },
        {
          "reference": "Mark 16:1",
          "text": "When the Sabbath was over, Mary Magdalene, Mary the mother of James, and Salome bought spices so they could go and anoint the body of Jesus."
        },
        {
          "reference": "Matthew 26:12",
          "text": "By pouring this perfume on Me, she has prepared My body for burial."
        },
        {
          "reference": "Luke 23:56",
          "text": "Then they returned to prepare spices and perfumes. And they rested on the Sabbath, according to the commandment."
        },
        {
          "reference": "John 12:7",
          "text": "“Leave her alone,” Jesus replied. “She has kept this perfume in preparation for the day of My burial."
        },
        {
          "reference": "2 Chronicles 16:14",
          "text": "And he was buried in the tomb that he had cut out for himself in the City of David. They laid him on a bier that was full of spices and various blended perfumes; then they made a great fire in his honor."
        },
        {
          "reference": "2 Kings 9:34-37",
          "text": "Then Jehu went in and ate and drank. “Take care of this cursed woman,” he said, “and bury her, for she was the daughter of a king.” / But when they went out to bury her, they found nothing but her skull, her feet, and the palms of her hands. / So they went back and told Jehu, who replied, “This is the word of the LORD, which He spoke through His servant Elijah the Tishbite: ‘On the plot of ground at Jezreel the dogs will devour the flesh of Jezebel. ..."
        },
        {
          "reference": "Amos 6:10",
          "text": "And when the relative who is to burn the bodies picks them up to remove them from the house, he will call to one inside, “Is anyone else with you?” “None,” that person will answer. “Silence,” the relative will retort, “for the name of the LORD must not be invoked.”"
        },
        {
          "reference": "Matthew 27:59",
          "text": "So Joseph took the body, wrapped it in a clean linen cloth,"
        },
        {
          "reference": "Acts 9:37",
          "text": "At that time, however, she became sick and died, and her body was washed and placed in an upper room."
        },
        {
          "reference": "John 11:44",
          "text": "The man who had been dead came out with his hands and feet bound in strips of linen, and his face wrapped in a cloth. “Unwrap him and let him go,” Jesus told them."
        },
        {
          "reference": "1 Samuel 31:12-13",
          "text": "all their men of valor set out, journeyed all night, and retrieved the bodies of Saul and his sons from the wall of Beth-shan. When they arrived at Jabesh, they burned the bodies there. / Then they took their bones and buried them under the tamarisk tree in Jabesh, and they fasted seven days."
        },
        {
          "reference": "2 Samuel 2:5",
          "text": "So David sent messengers to the men of Jabesh-gilead to tell them, “The LORD bless you, because you showed this kindness to Saul your lord when you buried him."
        },
        {
          "reference": "2 Kings 23:18",
          "text": "“Let him rest,” said Josiah. “Do not let anyone disturb his bones.” So they left his bones undisturbed, along with those of the prophet who had come from Samaria."
        },
        {
          "reference": "Ezekiel 37:4-6",
          "text": "And He said to me, “Prophesy concerning these bones and tell them, ‘Dry bones, hear the word of the LORD! / This is what the Lord GOD says to these bones: I will cause breath to enter you, and you will come to life. / I will attach tendons to you and make flesh grow upon you and cover you with skin. I will put breath within you so that you will come to life. Then you will know that I am the LORD.’”"
        }
      ]
    },
    {
      "reference": "Genesis 50:3",
      "book": "Genesis",
      "chapter": 50,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "taking a full forty days, for that was the time required for embalming. And the Egyptians mourned for him seventy days."
        },
        {
          "version": "NLT",
          "text": "The embalming process took the usual forty days. And the Egyptians mourned his death for seventy days."
        },
        {
          "version": "ESV",
          "text": "Forty days were required for it, for that is how many are required for embalming. And the Egyptians wept for him seventy days."
        },
        {
          "version": "NKJV",
          "text": "Forty days were required for him, for such are the days required for those who are embalmed; and the Egyptians mourned for him seventy days."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:8-11",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.” ..."
        },
        {
          "reference": "Numbers 20:29",
          "text": "When the whole congregation saw that Aaron had died, the entire house of Israel mourned for him thirty days."
        },
        {
          "reference": "Deuteronomy 34:8",
          "text": "The Israelites grieved for Moses in the plains of Moab thirty days, until the time of weeping and mourning for Moses came to an end."
        },
        {
          "reference": "2 Chronicles 35:24-25",
          "text": "So his servants took him out of his chariot, put him in his second chariot, and brought him to Jerusalem, where he died. And Josiah was buried in the tomb of his fathers, and all Judah and Jerusalem mourned for him. / Then Jeremiah lamented over Josiah, and to this day all the male and female singers recite laments over Josiah. They established them as a statute for Israel, and indeed they are written in the Book of Laments."
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "John 11:31-35",
          "text": "When the Jews who were in the house consoling Mary saw how quickly she got up and went out, they followed her, supposing she was going to the tomb to mourn there. / When Mary came to Jesus and saw Him, she fell at His feet and said, “Lord, if You had been here, my brother would not have died.” / When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled. ..."
        },
        {
          "reference": "Acts 8:2",
          "text": "God-fearing men buried Stephen and mourned deeply over him."
        },
        {
          "reference": "1 Samuel 31:13",
          "text": "Then they took their bones and buried them under the tamarisk tree in Jabesh, and they fasted seven days."
        },
        {
          "reference": "2 Samuel 1:12",
          "text": "They mourned and wept and fasted until evening for Saul and his son Jonathan, and for the people of the LORD and the house of Israel, because they had fallen by the sword."
        },
        {
          "reference": "2 Kings 13:14",
          "text": "When Elisha had fallen sick with the illness from which he would die, Jehoash king of Israel came down to him and wept over him, saying, “My father, my father, the chariots and horsemen of Israel!”"
        },
        {
          "reference": "Jeremiah 9:17-20",
          "text": "This is what the LORD of Hosts says: “Take note, and summon the wailing women; send for the most skillful among them. / Let them come quickly and take up a lament over us, that our eyes may overflow with tears, and our eyelids may gush with water. / For the sound of wailing is heard from Zion: ‘How devastated we are! How great is our shame! For we have abandoned the land because our dwellings have been torn down.’” ..."
        },
        {
          "reference": "Ezekiel 24:16-18",
          "text": "“Son of man, behold, I am about to take away the desire of your eyes with a fatal blow. But you must not mourn or weep or let your tears flow. / Groan quietly; do not mourn for the dead. Put on your turban and strap your sandals on your feet; do not cover your lips or eat the bread of mourners.” / So I spoke to the people in the morning, and in the evening my wife died. And the next morning I did as I had been commanded."
        },
        {
          "reference": "Amos 5:16-17",
          "text": "Therefore this is what the LORD, the God of Hosts, the Lord, says: “There will be wailing in all the public squares and cries of ‘Alas! Alas!’ in all the streets. The farmer will be summoned to mourn, and the mourners to wail. / There will be wailing in all the vineyards, for I will pass through your midst,” says the LORD."
        },
        {
          "reference": "Mark 5:38-39",
          "text": "When they arrived at the house of the synagogue leader, Jesus saw the commotion and the people weeping and wailing loudly. / He went inside and asked, “Why all this commotion and weeping? The child is not dead, but asleep.”"
        },
        {
          "reference": "Luke 7:12-13",
          "text": "As He approached the town gate, He saw a dead man being carried out, the only son of his mother, and she was a widow. And a large crowd from the town was with her. / When the Lord saw her, He had compassion on her and said, “Do not weep.”"
        }
      ]
    },
    {
      "reference": "Genesis 50:4",
      "book": "Genesis",
      "chapter": 50,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "When the days of mourning had passed, Joseph said to Pharaoh’s court, “If I have found favor in your eyes, speak to Pharaoh for me. Tell him,"
        },
        {
          "version": "NLT",
          "text": "When the period of mourning was over, Joseph approached Pharaoh’s advisers and said, “Please do me this favor and speak to Pharaoh on my behalf."
        },
        {
          "version": "ESV",
          "text": "And when the days of weeping for him were past, Joseph spoke to the household of Pharaoh, saying, “If now I have found favor in your eyes, please speak in the ears of Pharaoh, saying,"
        },
        {
          "version": "NKJV",
          "text": "Now when the days of his mourning were past, Joseph spoke to the household of Pharaoh, saying, “If now I have found favor in your eyes, please speak in the hearing of Pharaoh, saying,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Nehemiah 2:5",
          "text": "and answered the king, “If it pleases the king, and if your servant has found favor in your sight, I ask that you send me to Judah, to the city where my fathers are buried, so that I may rebuild it.”"
        },
        {
          "reference": "Esther 4:2",
          "text": "But he went only as far as the king’s gate, because the law prohibited anyone wearing sackcloth from entering that gate."
        },
        {
          "reference": "1 Kings 2:16-17",
          "text": "So now I have just one request of you; do not deny me.” “State your request,” she told him. / Adonijah replied, “Please speak to King Solomon, since he will not turn you down. Let him give me Abishag the Shunammite as my wife.”"
        },
        {
          "reference": "1 Samuel 25:35",
          "text": "Then David accepted from her hand what she had brought him, and he said to her, “Go home in peace. See, I have heeded your voice and granted your request.”"
        },
        {
          "reference": "2 Samuel 14:12",
          "text": "Then the woman said, “Please, may your servant speak a word to my lord the king?” “Speak,” he replied."
        },
        {
          "reference": "2 Kings 4:13",
          "text": "and Elisha said to Gehazi, “Now tell her, ‘Look, you have gone to all this trouble for us. What can we do for you? Can we speak on your behalf to the king or the commander of the army?’” “I have a home among my own people,” she replied."
        },
        {
          "reference": "Exodus 3:11",
          "text": "But Moses asked God, “Who am I, that I should go to Pharaoh and bring the Israelites out of Egypt?”"
        },
        {
          "reference": "Exodus 5:1-3",
          "text": "After that, Moses and Aaron went to Pharaoh and said, “This is what the LORD, the God of Israel, says: ‘Let My people go, so that they may hold a feast to Me in the wilderness.’” / But Pharaoh replied, “Who is the LORD that I should obey His voice and let Israel go? I do not know the LORD, and I will not let Israel go.” / “The God of the Hebrews has met with us,” they answered. “Please let us go on a three-day journey into the wilderness to sacrifice to the LORD our God, or He may strike us with plagues or with the sword.”"
        },
        {
          "reference": "Numbers 20:14-17",
          "text": "From Kadesh, Moses sent messengers to tell the king of Edom, “This is what your brother Israel says: You know all the hardship that has befallen us, / how our fathers went down to Egypt, where we lived many years. The Egyptians mistreated us and our fathers, / and when we cried out to the LORD, He heard our voice, sent an angel, and brought us out of Egypt. Now look, we are in Kadesh, a city on the edge of your territory. ..."
        },
        {
          "reference": "Deuteronomy 1:16",
          "text": "At that time I charged your judges: “Hear the disputes between your brothers, and judge fairly between a man and his brother or a foreign resident."
        },
        {
          "reference": "Matthew 8:8",
          "text": "The centurion answered, “Lord, I am not worthy to have You come under my roof. But just say the word, and my servant will be healed."
        },
        {
          "reference": "Matthew 10:18",
          "text": "On My account you will be brought before governors and kings as witnesses to them and to the Gentiles."
        },
        {
          "reference": "Matthew 27:58",
          "text": "He went to Pilate to ask for the body of Jesus, and Pilate ordered that it be given to him."
        },
        {
          "reference": "Mark 15:43",
          "text": "Joseph of Arimathea, a prominent Council member who himself was waiting for the kingdom of God, boldly went to Pilate to ask for the body of Jesus."
        },
        {
          "reference": "Luke 7:6-7",
          "text": "So Jesus went with them. But when He was not far from the house, the centurion sent friends with the message: “Lord, do not trouble Yourself, for I am not worthy to have You come under my roof. / That is why I did not consider myself worthy to come to You. But just say the word, and my servant will be healed."
        }
      ]
    },
    {
      "reference": "Genesis 50:5",
      "book": "Genesis",
      "chapter": 50,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "My father made me swear an oath and said, “I am about to die; bury me in the tomb I dug for myself in the land of Canaan.” Now let me go up and bury my father; then I will return.’”"
        },
        {
          "version": "NLT",
          "text": "Tell him that my father made me swear an oath. He said to me, ‘Listen, I am about to die. Take my body back to the land of Canaan, and bury me in the tomb I prepared for myself.’ So please allow me to go and bury my father. After his burial, I will return without delay.”"
        },
        {
          "version": "ESV",
          "text": "‘My father made me swear, saying, “I am about to die: in my tomb that I hewed out for myself in the land of Canaan, there shall you bury me.” Now therefore, let me please go up and bury my father. Then I will return.’”"
        },
        {
          "version": "NKJV",
          "text": "‘My father made me swear, saying, “Behold, I am dying; in my grave which I dug for myself in the land of Canaan, there you shall bury me.” Now therefore, please let me go up and bury my father, and I will come back.’ ”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 23:4",
          "text": "“I am a foreigner and an outsider among you. Give me a burial site among you so that I can bury my dead.”"
        },
        {
          "reference": "Genesis 49:29-32",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah. ..."
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Genesis 15:13-16",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions. / You, however, will go to your fathers in peace and be buried at a ripe old age. ..."
        },
        {
          "reference": "Genesis 24:2-9",
          "text": "So Abraham instructed the chief servant of his household, who managed all he owned, “Place your hand under my thigh, / and I will have you swear by the LORD, the God of heaven and the God of earth, that you will not take a wife for my son from the daughters of the Canaanites among whom I am dwelling, / but will go to my country and my kindred to take a wife for my son Isaac.” ..."
        },
        {
          "reference": "Genesis 28:20-22",
          "text": "Then Jacob made a vow, saying, “If God will be with me and watch over me on this journey, and if He will provide me with food to eat and clothes to wear, / so that I may return safely to my father’s house, then the LORD will be my God. / And this stone I have set up as a pillar will be God’s house, and of all that You give me I will surely give You a tenth.”"
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 48:21",
          "text": "Then Israel said to Joseph, “Look, I am about to die, but God will be with you and bring you back to the land of your fathers."
        },
        {
          "reference": "Genesis 25:8-10",
          "text": "And at a ripe old age he breathed his last and died, old and contented, and was gathered to his people. / His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite. / This was the field that Abraham had bought from the Hittites. Abraham was buried there with his wife Sarah."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        }
      ]
    },
    {
      "reference": "Genesis 50:6",
      "book": "Genesis",
      "chapter": 50,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "Pharaoh said, “Go up and bury your father, as he made you swear to do.”"
        },
        {
          "version": "NLT",
          "text": "Pharaoh agreed to Joseph’s request. “Go and bury your father, as he made you promise,” he said."
        },
        {
          "version": "ESV",
          "text": "And Pharaoh answered, “Go up, and bury your father, as he made you swear.”"
        },
        {
          "version": "NKJV",
          "text": "And Pharaoh said, “Go up and bury your father, as he made you swear.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:18",
          "text": "The elders of Israel will listen to what you say, and you must go with them to the king of Egypt and tell him, ‘The LORD, the God of the Hebrews, has met with us. Now please let us take a three-day journey into the wilderness, so that we may sacrifice to the LORD our God.’"
        },
        {
          "reference": "Exodus 5:1-3",
          "text": "After that, Moses and Aaron went to Pharaoh and said, “This is what the LORD, the God of Israel, says: ‘Let My people go, so that they may hold a feast to Me in the wilderness.’” / But Pharaoh replied, “Who is the LORD that I should obey His voice and let Israel go? I do not know the LORD, and I will not let Israel go.” / “The God of the Hebrews has met with us,” they answered. “Please let us go on a three-day journey into the wilderness to sacrifice to the LORD our God, or He may strike us with plagues or with the sword.”"
        },
        {
          "reference": "Exodus 12:31-32",
          "text": "Then Pharaoh summoned Moses and Aaron by night and said, “Get up, leave my people, both you and the Israelites! Go, worship the LORD as you have requested. / Take your flocks and herds as well, just as you have said, and depart! And bless me also.”"
        },
        {
          "reference": "Nehemiah 2:5-6",
          "text": "and answered the king, “If it pleases the king, and if your servant has found favor in your sight, I ask that you send me to Judah, to the city where my fathers are buried, so that I may rebuild it.” / Then the king, with the queen seated beside him, asked me, “How long will your journey take, and when will you return?” So it pleased the king to send me, and I set a time."
        },
        {
          "reference": "1 Kings 2:6",
          "text": "So act according to your wisdom, and do not let his gray head go down to Sheol in peace."
        },
        {
          "reference": "1 Kings 2:9",
          "text": "Now therefore, do not hold him guiltless, for you are a wise man. You know what you ought to do to him to bring his gray head down to Sheol in blood.”"
        },
        {
          "reference": "2 Samuel 15:7-9",
          "text": "After four years had passed, Absalom said to the king, “Please let me go to Hebron to fulfill a vow I have made to the LORD. / For your servant made a vow while dwelling in Geshur of Aram, saying: ‘If indeed the LORD brings me back to Jerusalem, I will worship the LORD in Hebron.’” / “Go in peace,” said the king. So Absalom got up and went to Hebron."
        },
        {
          "reference": "Numbers 20:17",
          "text": "Please let us pass through your land. We will not go through any field or vineyard, or drink water from any well. We will stay on the King’s Highway; we will not turn to the right or to the left until we have passed through your territory.”"
        },
        {
          "reference": "Numbers 21:22",
          "text": "“Let us pass through your land. We will not turn aside into any field or vineyard, or drink water from any well. We will stay on the King’s Highway until we have passed through your territory.”"
        },
        {
          "reference": "Deuteronomy 34:5-6",
          "text": "So Moses the servant of the LORD died there in the land of Moab, as the LORD had said. / And He buried him in a valley in the land of Moab facing Beth-peor, and no one to this day knows the location of his grave."
        },
        {
          "reference": "Matthew 27:58",
          "text": "He went to Pilate to ask for the body of Jesus, and Pilate ordered that it be given to him."
        },
        {
          "reference": "Mark 15:43",
          "text": "Joseph of Arimathea, a prominent Council member who himself was waiting for the kingdom of God, boldly went to Pilate to ask for the body of Jesus."
        },
        {
          "reference": "Luke 23:52",
          "text": "He went to Pilate to ask for the body of Jesus."
        },
        {
          "reference": "John 19:38",
          "text": "Afterward, Joseph of Arimathea, who was a disciple of Jesus (but secretly for fear of the Jews), asked Pilate to let him remove the body of Jesus. Pilate gave him permission, so he came and removed His body."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        }
      ]
    },
    {
      "reference": "Genesis 50:7",
      "book": "Genesis",
      "chapter": 50,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "So Joseph went up to bury his father. All Pharaoh’s officials accompanied him—the dignitaries of his court and all the dignitaries of Egypt—"
        },
        {
          "version": "NLT",
          "text": "So Joseph went up to bury his father. He was accompanied by all of Pharaoh’s officials, all the senior members of Pharaoh’s household, and all the senior officers of Egypt."
        },
        {
          "version": "ESV",
          "text": "So Joseph went up to bury his father. With him went up all the servants of Pharaoh, the elders of his household, and all the elders of the land of Egypt,"
        },
        {
          "version": "NKJV",
          "text": "So Joseph went up to bury his father; and with him went up all the servants of Pharaoh, the elders of his house, and all the elders of the land of Egypt,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Numbers 20:29",
          "text": "When the whole congregation saw that Aaron had died, the entire house of Israel mourned for him thirty days."
        },
        {
          "reference": "Deuteronomy 34:8",
          "text": "The Israelites grieved for Moses in the plains of Moab thirty days, until the time of weeping and mourning for Moses came to an end."
        },
        {
          "reference": "2 Samuel 3:31",
          "text": "Then David ordered Joab and all the people with him, “Tear your clothes, put on sackcloth, and mourn before Abner.” And King David himself walked behind the funeral bier."
        },
        {
          "reference": "2 Chronicles 35:24-25",
          "text": "So his servants took him out of his chariot, put him in his second chariot, and brought him to Jerusalem, where he died. And Josiah was buried in the tomb of his fathers, and all Judah and Jerusalem mourned for him. / Then Jeremiah lamented over Josiah, and to this day all the male and female singers recite laments over Josiah. They established them as a statute for Israel, and indeed they are written in the Book of Laments."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "John 11:31",
          "text": "When the Jews who were in the house consoling Mary saw how quickly she got up and went out, they followed her, supposing she was going to the tomb to mourn there."
        },
        {
          "reference": "Matthew 9:23",
          "text": "When Jesus entered the house of the synagogue leader, He saw the flute players and the noisy crowd."
        },
        {
          "reference": "Luke 7:12",
          "text": "As He approached the town gate, He saw a dead man being carried out, the only son of his mother, and she was a widow. And a large crowd from the town was with her."
        },
        {
          "reference": "Acts 8:2",
          "text": "God-fearing men buried Stephen and mourned deeply over him."
        },
        {
          "reference": "1 Thessalonians 4:13",
          "text": "Brothers, we do not want you to be uninformed about those who sleep in death, so that you will not grieve like the rest, who are without hope."
        },
        {
          "reference": "1 Corinthians 15:55-57",
          "text": "“Where, O Death, is your victory? Where, O Death, is your sting?” / The sting of death is sin, and the power of sin is the law. / But thanks be to God, who gives us the victory through our Lord Jesus Christ!"
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Revelation 21:4",
          "text": "‘He will wipe away every tear from their eyes,’ and there will be no more death or mourning or crying or pain, for the former things have passed away.”"
        },
        {
          "reference": "Genesis 23:2",
          "text": "She died in Kiriath-arba (that is, Hebron) in the land of Canaan, and Abraham went out to mourn and to weep for her."
        }
      ]
    },
    {
      "reference": "Genesis 50:8",
      "book": "Genesis",
      "chapter": 50,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "besides all the members of Joseph’s household and his brothers and those belonging to his father’s household. Only their children and their flocks and herds were left in Goshen."
        },
        {
          "version": "NLT",
          "text": "Joseph also took his entire household and his brothers and their households. But they left their little children and flocks and herds in the land of Goshen."
        },
        {
          "version": "ESV",
          "text": "as well as all the household of Joseph, his brothers, and his father’s household. Only their children, their flocks, and their herds were left in the land of Goshen."
        },
        {
          "version": "NKJV",
          "text": "as well as all the house of Joseph, his brothers, and his father’s house. Only their little ones, their flocks, and their herds they left in the land of Goshen."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 46:29-30",
          "text": "Joseph prepared his chariot and went there to meet his father Israel. Joseph presented himself to him, embraced him, and wept profusely. / Then Israel said to Joseph, “Finally I can die, now that I have seen your face and know that you are still alive!”"
        },
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Genesis 48:21",
          "text": "Then Israel said to Joseph, “Look, I am about to die, but God will be with you and bring you back to the land of your fathers."
        },
        {
          "reference": "Genesis 49:29-33",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah. ..."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Genesis 45:7-9",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt. / Now return quickly to my father and tell him, ‘This is what your son Joseph says: God has made me lord of all Egypt. Come down to me without delay."
        },
        {
          "reference": "Genesis 46:1-7",
          "text": "So Israel set out with all that he had, and when he came to Beersheba, he offered sacrifices to the God of his father Isaac. / And that night God spoke to Israel in a vision: “Jacob, Jacob!” He said. “Here I am,” replied Jacob. / “I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. ..."
        },
        {
          "reference": "Genesis 47:11-12",
          "text": "So Joseph settled his father and brothers in the land of Egypt and gave them property in the best part of the land, the district of Rameses, as Pharaoh had commanded. / Joseph also provided his father and brothers and all his father’s household with food for their families."
        },
        {
          "reference": "Genesis 47:27",
          "text": "Now the Israelites settled in the land of Egypt, in the region of Goshen. They acquired property there and became fruitful and increased greatly in number."
        },
        {
          "reference": "Genesis 48:5-6",
          "text": "And now your two sons born to you in Egypt before I came to you here shall be reckoned as mine; Ephraim and Manasseh shall be mine, just as Reuben and Simeon are mine. / Any children born to you after them shall be yours, and they shall be called by the names of their brothers in the territory they inherit."
        },
        {
          "reference": "Genesis 49:1-2",
          "text": "Then Jacob called for his sons and said, “Gather around so that I can tell you what will happen to you in the days to come: / Come together and listen, O sons of Jacob; listen to your father Israel."
        },
        {
          "reference": "Genesis 49:28",
          "text": "These are the tribes of Israel, twelve in all, and this was what their father said to them. He blessed them, and he blessed each one with a suitable blessing."
        }
      ]
    },
    {
      "reference": "Genesis 50:9",
      "book": "Genesis",
      "chapter": 50,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "Chariots and horsemen also went up with him. It was a very large company."
        },
        {
          "version": "NLT",
          "text": "A great number of chariots and charioteers accompanied Joseph."
        },
        {
          "version": "ESV",
          "text": "And there went up with him both chariots and horsemen. It was a very great company."
        },
        {
          "version": "NKJV",
          "text": "And there went up with him both chariots and horsemen, and it was a very great gathering."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 14:7",
          "text": "He took 600 of the best chariots, and all the other chariots of Egypt, with officers over all of them."
        },
        {
          "reference": "2 Samuel 15:1",
          "text": "Some time later, Absalom provided for himself a chariot with horses and fifty men to run ahead of him."
        },
        {
          "reference": "1 Kings 1:5",
          "text": "At that time Adonijah, David’s son by Haggith, began to exalt himself, saying, “I will be king!” And he acquired chariots and horsemen and fifty men to run ahead of him."
        },
        {
          "reference": "2 Kings 9:17-20",
          "text": "Now the watchman standing on the tower in Jezreel saw Jehu’s troops approaching, and he called out, “I see a company of troops!” “Choose a rider,” Joram commanded. “Send him out to meet them and ask, ‘Have you come in peace?’” / So a horseman rode off to meet Jehu and said, “This is what the king asks: ‘Have you come in peace?’” “What do you know about peace?” Jehu replied. “Fall in behind me.” And the watchman reported, “The messenger reached them, but he is not coming back.” / So the king sent out a second horseman, who went to them and said, “This is what the king asks: ‘Have you come in peace?’” “What do you know about peace?” Jehu replied. “Fall in behind me.” ..."
        },
        {
          "reference": "1 Chronicles 12:23-38",
          "text": "Now these are the numbers of men armed for battle who came to David at Hebron to turn Saul’s kingdom over to him, in accordance with the word of the LORD: / From Judah: 6,800 armed troops bearing shields and spears. / From Simeon: 7,100 mighty men of valor, ready for battle. ..."
        },
        {
          "reference": "2 Chronicles 1:14",
          "text": "Solomon accumulated 1,400 chariots and 12,000 horses, which he stationed in the chariot cities and also with him in Jerusalem."
        },
        {
          "reference": "Isaiah 66:20",
          "text": "And they will bring all your brothers from all the nations as a gift to the LORD on horses and chariots and wagons, on mules and camels, to My holy mountain Jerusalem,” says the LORD, “just as the Israelites bring an offering in a clean vessel to the house of the LORD.”"
        },
        {
          "reference": "Jeremiah 17:25",
          "text": "then kings and princes will enter through the gates of this city. They will sit on the throne of David, riding in chariots and on horses with their officials, along with the men of Judah and the residents of Jerusalem, and this city will be inhabited forever."
        },
        {
          "reference": "Ezekiel 23:23-24",
          "text": "the Babylonians and all the Chaldeans, the men of Pekod, Shoa, and Koa, and all the Assyrians with them—all desirable young men, governors and commanders, officers and men of renown, mounted on horses. / They will come against you with a host of peoples, with weapons, chariots, and wagons. They will array themselves against you on every side with buckler and shield and helmet. I will delegate judgment to them, and they will punish you according to their own standards."
        },
        {
          "reference": "Nahum 2:3-4",
          "text": "The shields of his mighty men are red; the valiant warriors are dressed in scarlet. The fittings of the chariots flash like fire on the day they are prepared, and the spears of cypress have been brandished. / The chariots dash through the streets; they rush around the plazas, appearing like torches, darting about like lightning."
        },
        {
          "reference": "Matthew 8:9",
          "text": "For I myself am a man under authority, with soldiers under me. I tell one to go, and he goes, and another to come, and he comes. I tell my servant to do something, and he does it.”"
        },
        {
          "reference": "Matthew 27:27",
          "text": "Then the governor’s soldiers took Jesus into the Praetorium and gathered the whole company around Him."
        },
        {
          "reference": "Mark 15:16",
          "text": "Then the soldiers led Jesus away into the palace (that is, the Praetorium) and called the whole company together."
        },
        {
          "reference": "Luke 7:8",
          "text": "For I myself am a man under authority, with soldiers under me. I tell one to go, and he goes, and another to come, and he comes. I tell my servant to do something, and he does it.”"
        },
        {
          "reference": "Luke 23:11",
          "text": "And even Herod and his soldiers ridiculed and mocked Him. Dressing Him in a fine robe, they sent Him back to Pilate."
        }
      ]
    },
    {
      "reference": "Genesis 50:10",
      "book": "Genesis",
      "chapter": 50,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "When they reached the threshing floor of Atad, near the Jordan, they lamented loudly and bitterly; and there Joseph observed a seven-day period of mourning for his father."
        },
        {
          "version": "NLT",
          "text": "When they arrived at the threshing floor of Atad, near the Jordan River, they held a very great and solemn memorial service, with a seven-day period of mourning for Joseph’s father."
        },
        {
          "version": "ESV",
          "text": "When they came to the threshing floor of Atad, which is beyond the Jordan, they lamented there with a very great and grievous lamentation, and he made a mourning for his father seven days."
        },
        {
          "version": "NKJV",
          "text": "Then they came to the threshing floor of Atad, which is beyond the Jordan, and they mourned there with a great and very solemn lamentation. He observed seven days of mourning for his father."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "2 Samuel 1:12",
          "text": "They mourned and wept and fasted until evening for Saul and his son Jonathan, and for the people of the LORD and the house of Israel, because they had fallen by the sword."
        },
        {
          "reference": "Numbers 20:29",
          "text": "When the whole congregation saw that Aaron had died, the entire house of Israel mourned for him thirty days."
        },
        {
          "reference": "Deuteronomy 34:8",
          "text": "The Israelites grieved for Moses in the plains of Moab thirty days, until the time of weeping and mourning for Moses came to an end."
        },
        {
          "reference": "1 Samuel 31:13",
          "text": "Then they took their bones and buried them under the tamarisk tree in Jabesh, and they fasted seven days."
        },
        {
          "reference": "2 Chronicles 35:24-25",
          "text": "So his servants took him out of his chariot, put him in his second chariot, and brought him to Jerusalem, where he died. And Josiah was buried in the tomb of his fathers, and all Judah and Jerusalem mourned for him. / Then Jeremiah lamented over Josiah, and to this day all the male and female singers recite laments over Josiah. They established them as a statute for Israel, and indeed they are written in the Book of Laments."
        },
        {
          "reference": "Job 2:13",
          "text": "Then they sat on the ground with him for seven days and seven nights, but no one spoke a word to him because they saw how intense his suffering was."
        },
        {
          "reference": "Ezekiel 24:16-17",
          "text": "“Son of man, behold, I am about to take away the desire of your eyes with a fatal blow. But you must not mourn or weep or let your tears flow. / Groan quietly; do not mourn for the dead. Put on your turban and strap your sandals on your feet; do not cover your lips or eat the bread of mourners.”"
        },
        {
          "reference": "Jeremiah 22:18",
          "text": "Therefore this is what the LORD says concerning Jehoiakim son of Josiah king of Judah: “They will not mourn for him: ‘Alas, my brother! Alas, my sister!’ They will not mourn for him: ‘Alas, my master! Alas, his splendor!’"
        },
        {
          "reference": "Amos 5:16-17",
          "text": "Therefore this is what the LORD, the God of Hosts, the Lord, says: “There will be wailing in all the public squares and cries of ‘Alas! Alas!’ in all the streets. The farmer will be summoned to mourn, and the mourners to wail. / There will be wailing in all the vineyards, for I will pass through your midst,” says the LORD."
        },
        {
          "reference": "Matthew 5:4",
          "text": "Blessed are those who mourn, for they will be comforted."
        },
        {
          "reference": "John 11:31-35",
          "text": "When the Jews who were in the house consoling Mary saw how quickly she got up and went out, they followed her, supposing she was going to the tomb to mourn there. / When Mary came to Jesus and saw Him, she fell at His feet and said, “Lord, if You had been here, my brother would not have died.” / When Jesus saw her weeping, and the Jews who had come with her also weeping, He was deeply moved in spirit and troubled. ..."
        },
        {
          "reference": "Acts 8:2",
          "text": "God-fearing men buried Stephen and mourned deeply over him."
        },
        {
          "reference": "1 Thessalonians 4:13",
          "text": "Brothers, we do not want you to be uninformed about those who sleep in death, so that you will not grieve like the rest, who are without hope."
        },
        {
          "reference": "Revelation 21:4",
          "text": "‘He will wipe away every tear from their eyes,’ and there will be no more death or mourning or crying or pain, for the former things have passed away.”"
        },
        {
          "reference": "Isaiah 22:12",
          "text": "On that day the Lord GOD of Hosts called for weeping and wailing, for shaven heads and the wearing of sackcloth."
        }
      ]
    },
    {
      "reference": "Genesis 50:11",
      "book": "Genesis",
      "chapter": 50,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "When the Canaanites who lived there saw the mourning at the threshing floor of Atad, they said, “The Egyptians are holding a solemn ceremony of mourning.” That is why that place near the Jordan is called Abel Mizraim."
        },
        {
          "version": "NLT",
          "text": "The local residents, the Canaanites, watched them mourning at the threshing floor of Atad. Then they renamed that place (which is near the Jordan) Abel-mizraim, for they said, “This is a place of deep mourning for these Egyptians.”"
        },
        {
          "version": "ESV",
          "text": "When the inhabitants of the land, the Canaanites, saw the mourning on the threshing floor of Atad, they said, “This is a grievous mourning by the Egyptians.” Therefore the place was named Abel-mizraim; it is beyond the Jordan."
        },
        {
          "version": "NKJV",
          "text": "And when the inhabitants of the land, the Canaanites, saw the mourning at the threshing floor of Atad, they said, “This is a deep mourning of the Egyptians.” Therefore its name was called Abel Mizraim, which is beyond the Jordan."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:1-5",
          "text": "These are the names of the sons of Israel who went to Egypt with Jacob, each with his family: / Reuben, Simeon, Levi, and Judah; / Issachar, Zebulun, and Benjamin; ..."
        },
        {
          "reference": "Numbers 20:29",
          "text": "When the whole congregation saw that Aaron had died, the entire house of Israel mourned for him thirty days."
        },
        {
          "reference": "2 Samuel 1:17-27",
          "text": "Then David took up this lament for Saul and his son Jonathan, / and he ordered that the sons of Judah be taught the Song of the Bow. It is written in the Book of Jashar: / “Your glory, O Israel, lies slain on your heights. How the mighty have fallen! ..."
        },
        {
          "reference": "2 Chronicles 35:24-25",
          "text": "So his servants took him out of his chariot, put him in his second chariot, and brought him to Jerusalem, where he died. And Josiah was buried in the tomb of his fathers, and all Judah and Jerusalem mourned for him. / Then Jeremiah lamented over Josiah, and to this day all the male and female singers recite laments over Josiah. They established them as a statute for Israel, and indeed they are written in the Book of Laments."
        },
        {
          "reference": "Job 2:11-13",
          "text": "Now when Job’s three friends—Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite—heard about all this adversity that had come upon him, each of them came from his home, and they met together to go and sympathize with Job and comfort him. / When they lifted up their eyes from afar, they could barely recognize Job. They began to weep aloud, and each man tore his robe and threw dust in the air over his head. / Then they sat on the ground with him for seven days and seven nights, but no one spoke a word to him because they saw how intense his suffering was."
        },
        {
          "reference": "Psalm 106:37-38",
          "text": "They sacrificed their sons and their daughters to demons. / They shed innocent blood—the blood of their sons and daughters, whom they sacrificed to the idols of Canaan, and the land was polluted with blood."
        },
        {
          "reference": "Isaiah 19:11-13",
          "text": "The princes of Zoan are mere fools; Pharaoh’s wise counselors give senseless advice. How can you say to Pharaoh, “I am one of the wise, a son of eastern kings”? / Where are your wise men now? Let them tell you and reveal what the LORD of Hosts has planned against Egypt. / The princes of Zoan have become fools; the princes of Memphis are deceived. The cornerstones of her tribes have led Egypt astray."
        },
        {
          "reference": "Jeremiah 9:17-20",
          "text": "This is what the LORD of Hosts says: “Take note, and summon the wailing women; send for the most skillful among them. / Let them come quickly and take up a lament over us, that our eyes may overflow with tears, and our eyelids may gush with water. / For the sound of wailing is heard from Zion: ‘How devastated we are! How great is our shame! For we have abandoned the land because our dwellings have been torn down.’” ..."
        },
        {
          "reference": "Lamentations 2:5",
          "text": "The Lord is like an enemy; He has swallowed up Israel. He has swallowed up all her palaces and destroyed her strongholds. He has multiplied mourning and lamentation for the Daughter of Judah."
        },
        {
          "reference": "Ezekiel 24:16-18",
          "text": "“Son of man, behold, I am about to take away the desire of your eyes with a fatal blow. But you must not mourn or weep or let your tears flow. / Groan quietly; do not mourn for the dead. Put on your turban and strap your sandals on your feet; do not cover your lips or eat the bread of mourners.” / So I spoke to the people in the morning, and in the evening my wife died. And the next morning I did as I had been commanded."
        },
        {
          "reference": "Matthew 2:18",
          "text": "“A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
        },
        {
          "reference": "Matthew 9:23-24",
          "text": "When Jesus entered the house of the synagogue leader, He saw the flute players and the noisy crowd. / “Go away,” He told them. “The girl is not dead, but asleep.” And they laughed at Him."
        },
        {
          "reference": "Mark 5:38-39",
          "text": "When they arrived at the house of the synagogue leader, Jesus saw the commotion and the people weeping and wailing loudly. / He went inside and asked, “Why all this commotion and weeping? The child is not dead, but asleep.”"
        },
        {
          "reference": "Luke 7:12-13",
          "text": "As He approached the town gate, He saw a dead man being carried out, the only son of his mother, and she was a widow. And a large crowd from the town was with her. / When the Lord saw her, He had compassion on her and said, “Do not weep.”"
        },
        {
          "reference": "Luke 23:27-28",
          "text": "A great number of people followed Him, including women who kept mourning and wailing for Him. / But Jesus turned to them and said, “Daughters of Jerusalem, do not weep for Me, but weep for yourselves and for your children."
        }
      ]
    },
    {
      "reference": "Genesis 50:12",
      "book": "Genesis",
      "chapter": 50,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "So Jacob’s sons did as he had commanded them:"
        },
        {
          "version": "NLT",
          "text": "So Jacob’s sons did as he had commanded them."
        },
        {
          "version": "ESV",
          "text": "Thus his sons did for him as he had commanded them,"
        },
        {
          "version": "NKJV",
          "text": "So his sons did for him just as he had commanded them."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Genesis 49:29-33",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah. ..."
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Genesis 23:16-20",
          "text": "Abraham agreed to Ephron’s terms and weighed out for him the price he had named in the hearing of the Hittites: four hundred shekels of silver, according to the standard of the merchants. / So Ephron’s field at Machpelah near Mamre, the cave that was in it, and all the trees within the boundaries of the field were deeded over / to Abraham’s possession in the presence of all the Hittites who had come to the gate of his city. ..."
        },
        {
          "reference": "Genesis 25:9-10",
          "text": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite. / This was the field that Abraham had bought from the Hittites. Abraham was buried there with his wife Sarah."
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 48:21",
          "text": "Then Israel said to Joseph, “Look, I am about to die, but God will be with you and bring you back to the land of your fathers."
        },
        {
          "reference": "Genesis 15:13-16",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions. / You, however, will go to your fathers in peace and be buried at a ripe old age. ..."
        },
        {
          "reference": "Genesis 46:4",
          "text": "I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        }
      ]
    },
    {
      "reference": "Genesis 50:13",
      "book": "Genesis",
      "chapter": 50,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "They carried him to the land of Canaan and buried him in the cave in the field of Machpelah, near Mamre, which Abraham had bought along with the field as a burial place from Ephron the Hittite."
        },
        {
          "version": "NLT",
          "text": "They carried his body to the land of Canaan and buried him in the cave in the field of Machpelah, near Mamre. This is the cave that Abraham had bought as a permanent burial site from Ephron the Hittite."
        },
        {
          "version": "ESV",
          "text": "for his sons carried him to the land of Canaan and buried him in the cave of the field at Machpelah, to the east of Mamre, which Abraham bought with the field from Ephron the Hittite to possess as a burying place."
        },
        {
          "version": "NKJV",
          "text": "For his sons carried him to the land of Canaan, and buried him in the cave of the field of Machpelah, before Mamre, which Abraham bought with the field from Ephron the Hittite as property for a burial place."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 23:19",
          "text": "After this, Abraham buried his wife Sarah in the cave of the field at Machpelah near Mamre (that is, Hebron) in the land of Canaan."
        },
        {
          "reference": "Genesis 25:9",
          "text": "His sons Isaac and Ishmael buried him in the cave of Machpelah near Mamre, in the field of Ephron son of Zohar the Hittite."
        },
        {
          "reference": "Genesis 35:29",
          "text": "Then he breathed his last and died and was gathered to his people, old and full of years. And his sons Esau and Jacob buried him."
        },
        {
          "reference": "Genesis 49:29-32",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah. ..."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "John 19:40-42",
          "text": "So they took the body of Jesus and wrapped it in linen cloths with the spices, according to the Jewish burial custom. / Now there was a garden in the place where Jesus was crucified, and in the garden a new tomb in which no one had yet been laid. / And because it was the Jewish day of Preparation and the tomb was nearby, they placed Jesus there."
        },
        {
          "reference": "Matthew 27:59-60",
          "text": "So Joseph took the body, wrapped it in a clean linen cloth, / and placed it in his own new tomb that he had cut into the rock. Then he rolled a great stone across the entrance to the tomb and went away."
        },
        {
          "reference": "Mark 15:46",
          "text": "So Joseph bought a linen cloth, took down the body of Jesus, wrapped it in the cloth, and placed it in a tomb that had been cut out of the rock. Then he rolled a stone against the entrance to the tomb."
        },
        {
          "reference": "Luke 23:53",
          "text": "Then he took it down, wrapped it in a linen cloth, and placed it in a tomb cut into the rock, where no one had yet been laid."
        },
        {
          "reference": "Acts 2:29",
          "text": "Brothers, I can tell you with confidence that the patriarch David died and was buried, and his tomb is with us to this day."
        },
        {
          "reference": "1 Kings 2:10",
          "text": "Then David rested with his fathers and was buried in the City of David."
        },
        {
          "reference": "2 Samuel 2:32",
          "text": "And they took Asahel and buried him in his father’s tomb in Bethlehem. Then Joab and his men marched all night and reached Hebron at daybreak."
        }
      ]
    },
    {
      "reference": "Genesis 50:14",
      "book": "Genesis",
      "chapter": 50,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "After burying his father, Joseph returned to Egypt, together with his brothers and all the others who had gone with him to bury his father."
        },
        {
          "version": "NLT",
          "text": "After burying Jacob, Joseph returned to Egypt with his brothers and all who had accompanied him to his father’s burial."
        },
        {
          "version": "ESV",
          "text": "After he had buried his father, Joseph returned to Egypt with his brothers and all who had gone up with him to bury his father."
        },
        {
          "version": "NKJV",
          "text": "And after he had buried his father, Joseph returned to Egypt, he and his brothers and all who went up with him to bury his father."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:7-8",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. / Therefore it was not you who sent me here, but God, who has made me a father to Pharaoh—lord of all his household and ruler over all the land of Egypt."
        },
        {
          "reference": "Genesis 46:4",
          "text": "I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Genesis 47:29-31",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.” / “Swear to me,” Jacob said. So Joseph swore to him, and Israel bowed in worship at the head of his bed."
        },
        {
          "reference": "Genesis 48:21",
          "text": "Then Israel said to Joseph, “Look, I am about to die, but God will be with you and bring you back to the land of your fathers."
        },
        {
          "reference": "Genesis 49:29-33",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah. ..."
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Exodus 20:12",
          "text": "Honor your father and mother, so that your days may be long in the land that the LORD your God is giving you."
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Ruth 1:16-17",
          "text": "But Ruth replied: “Do not urge me to leave you or to turn from following you. For wherever you go, I will go, and wherever you live, I will live; your people will be my people, and your God will be my God. / Where you die, I will die, and there I will be buried. May the LORD punish me, and ever so severely, if anything but death separates you and me.”"
        },
        {
          "reference": "1 Kings 2:1-2",
          "text": "As the time drew near for David to die, he charged his son Solomon, / “I am about to go the way of all the earth. So be strong and prove yourself a man."
        },
        {
          "reference": "1 Chronicles 29:28",
          "text": "He died at a ripe old age, full of years, riches, and honor, and his son Solomon reigned in his place."
        },
        {
          "reference": "Nehemiah 9:7-8",
          "text": "You are the LORD, the God who chose Abram, who brought him out of Ur of the Chaldeans and gave him the name Abraham. / You found his heart faithful before You, and made a covenant with him to give the land of the Canaanites and Hittites, of the Amorites and Perizzites, of the Jebusites and Girgashites—to give it to his descendants. You have kept Your promise, because You are righteous."
        },
        {
          "reference": "Psalm 105:17-22",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right. ..."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        }
      ]
    },
    {
      "reference": "Genesis 50:15",
      "book": "Genesis",
      "chapter": 50,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “What if Joseph holds a grudge against us and pays us back for all the wrongs we did to him?”"
        },
        {
          "version": "NLT",
          "text": "But now that their father was dead, Joseph’s brothers became fearful. “Now Joseph will show his anger and pay us back for all the wrong we did to him,” they said."
        },
        {
          "version": "ESV",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “It may be that Joseph will hate us and pay us back for all the evil that we did to him.”"
        },
        {
          "version": "NKJV",
          "text": "When Joseph’s brothers saw that their father was dead, they said, “Perhaps Joseph will hate us, and may actually repay us for all the evil which we did to him.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:18-28",
          "text": "Now Joseph’s brothers saw him in the distance, and before he arrived, they plotted to kill him. / “Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!” ..."
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 45:15",
          "text": "Joseph kissed each of his brothers as he wept over them. And afterward his brothers talked with him."
        },
        {
          "reference": "Genesis 50:17-21",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!” / But Joseph replied, “Do not be afraid. Am I in the place of God? ..."
        },
        {
          "reference": "Matthew 6:14-15",
          "text": "For if you forgive men their trespasses, your heavenly Father will also forgive you. / But if you do not forgive men their trespasses, neither will your Father forgive yours."
        },
        {
          "reference": "Luke 17:3-4",
          "text": "Watch yourselves. If your brother sins, rebuke him; and if he repents, forgive him. / Even if he sins against you seven times in a day, and seven times returns to say, ‘I repent,’ you must forgive him.”"
        },
        {
          "reference": "Ephesians 4:31-32",
          "text": "Get rid of all bitterness, rage and anger, outcry and slander, along with every form of malice. / Be kind and tenderhearted to one another, forgiving each other just as in Christ God forgave you."
        },
        {
          "reference": "Colossians 3:13",
          "text": "Bear with one another and forgive any complaint you may have against someone else. Forgive as the Lord forgave you."
        },
        {
          "reference": "Romans 12:19-21",
          "text": "Do not avenge yourselves, beloved, but leave room for God’s wrath. For it is written: “Vengeance is Mine; I will repay, says the Lord.” / On the contrary, “If your enemy is hungry, feed him; if he is thirsty, give him a drink. For in so doing, you will heap burning coals on his head.” / Do not be overcome by evil, but overcome evil with good."
        },
        {
          "reference": "Matthew 18:21-22",
          "text": "Then Peter came to Jesus and asked, “Lord, how many times shall I forgive my brother who sins against me? Up to seven times?” / Jesus answered, “I tell you, not just seven times, but seventy-seven times!"
        },
        {
          "reference": "1 John 1:9",
          "text": "If we confess our sins, He is faithful and just to forgive us our sins and to cleanse us from all unrighteousness."
        },
        {
          "reference": "Luke 6:37",
          "text": "Do not judge, and you will not be judged. Do not condemn, and you will not be condemned. Forgive, and you will be forgiven."
        },
        {
          "reference": "Mark 11:25",
          "text": "And when you stand to pray, if you hold anything against another, forgive it, so that your Father in heaven will forgive your trespasses as well.”"
        }
      ]
    },
    {
      "reference": "Genesis 50:16",
      "book": "Genesis",
      "chapter": 50,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "So they sent word to Joseph, saying, “Your father left these instructions before he died:"
        },
        {
          "version": "NLT",
          "text": "So they sent this message to Joseph: “Before your father died, he instructed us"
        },
        {
          "version": "ESV",
          "text": "So they sent a message to Joseph, saying, “Your father gave this command before he died:"
        },
        {
          "version": "NKJV",
          "text": "So they sent messengers to Joseph, saying, “Before your father died he commanded, saying,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 45:4-5",
          "text": "Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 42:21-22",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!”"
        },
        {
          "reference": "Genesis 44:18-34",
          "text": "Then Judah approached Joseph and said, “Sir, please let your servant speak personally to my lord. Do not be angry with your servant, for you are equal to Pharaoh himself. / My lord asked his servants, ‘Do you have a father or a brother?’ / And we answered, ‘We have an elderly father and a younger brother, the child of his old age. The boy’s brother is dead. He is the only one of his mother’s sons left, and his father loves him.’ ..."
        },
        {
          "reference": "Genesis 45:3",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence."
        },
        {
          "reference": "Genesis 50:17-18",
          "text": "‘This is what you are to say to Joseph: I beg you, please forgive the transgression and sin of your brothers, for they did you wrong.’ So now, Joseph, please forgive the transgression of the servants of the God of your father.” When their message came to him, Joseph wept. / His brothers also came to him, bowed down before him, and said, “We are your slaves!”"
        },
        {
          "reference": "Exodus 10:16-17",
          "text": "Pharaoh quickly summoned Moses and Aaron and said, “I have sinned against the LORD your God and against you. / Now please forgive my sin once more and appeal to the LORD your God, that He may remove this death from me.”"
        },
        {
          "reference": "1 Samuel 24:17-19",
          "text": "and said to David, “You are more righteous than I, for you have rewarded me with good, though I have rewarded you with evil. / And you have declared this day how you have treated me well, for when the LORD delivered me into your hand, you did not kill me. / When a man finds his enemy, does he let him go away unharmed? May the LORD reward you with good for what you have done for me this day."
        },
        {
          "reference": "1 Samuel 26:21",
          "text": "Then Saul replied, “I have sinned. Come back, David my son. I will never harm you again, because today you considered my life precious. I have played the fool and have committed a grave error!”"
        },
        {
          "reference": "2 Samuel 19:19-20",
          "text": "and said, “My lord, do not hold me guilty, and do not remember your servant’s wrongdoing on the day my lord the king left Jerusalem. May the king not take it to heart. / For your servant knows that I have sinned, so here I am today as the first of all the house of Joseph to come down to meet my lord the king.”"
        },
        {
          "reference": "Matthew 18:21-22",
          "text": "Then Peter came to Jesus and asked, “Lord, how many times shall I forgive my brother who sins against me? Up to seven times?” / Jesus answered, “I tell you, not just seven times, but seventy-seven times!"
        },
        {
          "reference": "Matthew 5:23-24",
          "text": "So if you are offering your gift at the altar and there remember that your brother has something against you, / leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        },
        {
          "reference": "Luke 17:3-4",
          "text": "Watch yourselves. If your brother sins, rebuke him; and if he repents, forgive him. / Even if he sins against you seven times in a day, and seven times returns to say, ‘I repent,’ you must forgive him.”"
        },
        {
          "reference": "Luke 23:34",
          "text": "Then Jesus said, “Father, forgive them, for they do not know what they are doing.” And they divided up His garments by casting lots."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        }
      ]
    },
    {
      "reference": "Genesis 50:17",
      "book": "Genesis",
      "chapter": 50,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "This is what you are to say to Joseph: I ask you to forgive your brothers the sins and the wrongs they committed in treating you so badly.’ Now please forgive the sins of the servants of the God of your father.” When their message came to him, Joseph wept."
        },
        {
          "version": "NLT",
          "text": "to say to you: ‘Please forgive your brothers for the great wrong they did to you—for their sin in treating you so cruelly.’ So we, the servants of the God of your father, beg you to forgive our sin.” When Joseph received the message, he broke down and wept."
        },
        {
          "version": "ESV",
          "text": "‘Say to Joseph, “Please forgive the transgression of your brothers and their sin, because they did evil to you.”’ And now, please forgive the transgression of the servants of the God of your father.” Joseph wept when they spoke to him."
        },
        {
          "version": "NKJV",
          "text": "‘Thus you shall say to Joseph: “I beg you, please forgive the trespass of your brothers and their sin; for they did evil to you.” ’ Now, please, forgive the trespass of the servants of the God of your father.” And Joseph wept when they spoke to him."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 6:14-15",
          "text": "For if you forgive men their trespasses, your heavenly Father will also forgive you. / But if you do not forgive men their trespasses, neither will your Father forgive yours."
        },
        {
          "reference": "Ephesians 4:32",
          "text": "Be kind and tenderhearted to one another, forgiving each other just as in Christ God forgave you."
        },
        {
          "reference": "Colossians 3:13",
          "text": "Bear with one another and forgive any complaint you may have against someone else. Forgive as the Lord forgave you."
        },
        {
          "reference": "Luke 17:3-4",
          "text": "Watch yourselves. If your brother sins, rebuke him; and if he repents, forgive him. / Even if he sins against you seven times in a day, and seven times returns to say, ‘I repent,’ you must forgive him.”"
        },
        {
          "reference": "Mark 11:25",
          "text": "And when you stand to pray, if you hold anything against another, forgive it, so that your Father in heaven will forgive your trespasses as well.”"
        },
        {
          "reference": "Matthew 18:21-22",
          "text": "Then Peter came to Jesus and asked, “Lord, how many times shall I forgive my brother who sins against me? Up to seven times?” / Jesus answered, “I tell you, not just seven times, but seventy-seven times!"
        },
        {
          "reference": "2 Corinthians 2:10",
          "text": "If you forgive anyone, I also forgive him. And if I have forgiven anything, I have forgiven it in the presence of Christ for your sake,"
        },
        {
          "reference": "Luke 6:37",
          "text": "Do not judge, and you will not be judged. Do not condemn, and you will not be condemned. Forgive, and you will be forgiven."
        },
        {
          "reference": "Romans 12:19",
          "text": "Do not avenge yourselves, beloved, but leave room for God’s wrath. For it is written: “Vengeance is Mine; I will repay, says the Lord.”"
        },
        {
          "reference": "Proverbs 19:11",
          "text": "A man’s insight gives him patience, and his virtue is to overlook an offense."
        },
        {
          "reference": "Psalm 32:1-2",
          "text": "Of David. A Maskil. Blessed is he whose transgressions are forgiven, whose sins are covered. / Blessed is the man whose iniquity the LORD does not count against him, in whose spirit there is no deceit."
        },
        {
          "reference": "Isaiah 43:25",
          "text": "I, yes I, am He who blots out your transgressions for My own sake and remembers your sins no more."
        },
        {
          "reference": "Micah 7:18-19",
          "text": "Who is a God like You, who pardons iniquity and passes over the transgression of the remnant of His inheritance—who does not retain His anger forever, because He delights in loving devotion? / He will again have compassion on us; He will vanquish our iniquities. You will cast out all our sins into the depths of the sea."
        },
        {
          "reference": "Psalm 86:5",
          "text": "For You, O Lord, are kind and forgiving, rich in loving devotion to all who call on You."
        },
        {
          "reference": "Daniel 9:9",
          "text": "To the Lord our God belong compassion and forgiveness, even though we have rebelled against Him"
        }
      ]
    },
    {
      "reference": "Genesis 50:18",
      "book": "Genesis",
      "chapter": 50,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "His brothers then came and threw themselves down before him. “We are your slaves,” they said."
        },
        {
          "version": "NLT",
          "text": "Then his brothers came and threw themselves down before Joseph. “Look, we are your slaves!” they said."
        },
        {
          "version": "ESV",
          "text": "His brothers also came and fell down before him and said, “Behold, we are your servants.”"
        },
        {
          "version": "NKJV",
          "text": "Then his brothers also went and fell down before his face, and they said, “Behold, we are your servants.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 37:7-9",
          "text": "We were binding sheaves of grain in the field, and suddenly my sheaf rose and stood upright, while your sheaves gathered around and bowed down to mine.” / “Do you intend to reign over us?” his brothers asked. “Will you actually rule us?” So they hated him even more because of his dream and his statements. / Then Joseph had another dream and told it to his brothers. “Look,” he said, “I had another dream, and this time the sun and moon and eleven stars were bowing down to me.”"
        },
        {
          "reference": "Genesis 45:3-5",
          "text": "Joseph said to his brothers, “I am Joseph! Is my father still alive?” But they were unable to answer him, because they were terrified in his presence. / Then Joseph said to his brothers, “Please come near me.” And they did so. “I am Joseph, your brother,” he said, “the one you sold into Egypt! / And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you."
        },
        {
          "reference": "Genesis 44:14-18",
          "text": "When Judah and his brothers arrived at Joseph’s house, he was still there, and they fell to the ground before him. / “What is this deed you have done?” Joseph declared. “Do you not know that a man like me can surely divine the truth?” / “What can we say to my lord?” Judah replied. “How can we plead? How can we justify ourselves? God has exposed the iniquity of your servants. We are now my lord’s slaves—both we and the one who was found with the cup.” ..."
        },
        {
          "reference": "Genesis 42:6-9",
          "text": "Now Joseph was the ruler of the land; he was the one who sold grain to all its people. So when his brothers arrived, they bowed down before him with their faces to the ground. / And when Joseph saw his brothers, he recognized them, but he treated them as strangers and spoke harshly to them. “Where have you come from?” he asked. “From the land of Canaan,” they replied. “We are here to buy food.” / Although Joseph recognized his brothers, they did not recognize him. ..."
        },
        {
          "reference": "Genesis 41:39-44",
          "text": "Then Pharaoh said to Joseph, “Since God has made all this known to you, there is no one as discerning and wise as you. / You shall be in charge of my house, and all my people are to obey your commands. Only with regard to the throne will I be greater than you.” / Pharaoh also told Joseph, “I hereby place you over all the land of Egypt.” ..."
        },
        {
          "reference": "Genesis 37:19-20",
          "text": "“Here comes that dreamer!” they said to one another. / “Come now, let us kill him and throw him into one of the pits. We can say that a vicious animal has devoured him. Then we shall see what becomes of his dreams!”"
        },
        {
          "reference": "Genesis 45:14-15",
          "text": "Then Joseph threw his arms around his brother Benjamin and wept, and Benjamin wept as they embraced. / Joseph kissed each of his brothers as he wept over them. And afterward his brothers talked with him."
        },
        {
          "reference": "Genesis 42:21-24",
          "text": "Then they said to one another, “Surely we are being punished because of our brother. We saw his anguish when he pleaded with us, but we would not listen. That is why this distress has come upon us.” / And Reuben responded, “Didn’t I tell you not to sin against the boy? But you would not listen. Now we must account for his blood!” / They did not realize that Joseph understood them, since there was an interpreter between them. ..."
        },
        {
          "reference": "Genesis 45:1-2",
          "text": "Then Joseph could no longer control himself before all his attendants, and he cried out, “Send everyone away from me!” So none of them were with Joseph when he made himself known to his brothers. / But he wept so loudly that the Egyptians heard him, and Pharaoh’s household soon heard of it."
        },
        {
          "reference": "Genesis 37:26-28",
          "text": "Then Judah said to his brothers, “What profit will we gain if we kill our brother and cover up his blood? / Come, let us sell him to the Ishmaelites and not lay a hand on him; for he is our brother, our own flesh.” And they agreed. / So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Matthew 18:21-22",
          "text": "Then Peter came to Jesus and asked, “Lord, how many times shall I forgive my brother who sins against me? Up to seven times?” / Jesus answered, “I tell you, not just seven times, but seventy-seven times!"
        },
        {
          "reference": "Luke 17:3-4",
          "text": "Watch yourselves. If your brother sins, rebuke him; and if he repents, forgive him. / Even if he sins against you seven times in a day, and seven times returns to say, ‘I repent,’ you must forgive him.”"
        },
        {
          "reference": "Ephesians 4:32",
          "text": "Be kind and tenderhearted to one another, forgiving each other just as in Christ God forgave you."
        },
        {
          "reference": "Colossians 3:13",
          "text": "Bear with one another and forgive any complaint you may have against someone else. Forgive as the Lord forgave you."
        },
        {
          "reference": "Matthew 5:23-24",
          "text": "So if you are offering your gift at the altar and there remember that your brother has something against you, / leave your gift there before the altar. First go and be reconciled to your brother; then come and offer your gift."
        }
      ]
    },
    {
      "reference": "Genesis 50:19",
      "book": "Genesis",
      "chapter": 50,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "But Joseph said to them, &#8220Don’t be afraid. Am I in the place of God?"
        },
        {
          "version": "NLT",
          "text": "But Joseph replied, “Don’t be afraid of me. Am I God, that I can punish you?"
        },
        {
          "version": "ESV",
          "text": "But Joseph said to them, “Do not fear, for am I in the place of God?"
        },
        {
          "version": "NKJV",
          "text": "Joseph said to them, “Do not be afraid, for am I in the place of God?"
        }
      ],
      "greek_words": [],
      "cross_references": []
    },
    {
      "reference": "Genesis 50:20",
      "book": "Genesis",
      "chapter": 50,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "You intended to harm me, but God intended it for good to accomplish what is now being done, the saving of many lives."
        },
        {
          "version": "NLT",
          "text": "You intended to harm me, but God intended it all for good. He brought me to this position so I could save the lives of many people."
        },
        {
          "version": "ESV",
          "text": "As for you, you meant evil against me, but God meant it for good, to bring it about that many people should be kept alive, as they are today."
        },
        {
          "version": "NKJV",
          "text": "But as for you, you meant evil against me; but God meant it for good, in order to bring it about as it is this day, to save many people alive."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Acts 2:23-24",
          "text": "He was delivered up by God’s set plan and foreknowledge, and you, by the hands of the lawless, put Him to death by nailing Him to the cross. / But God raised Him from the dead, releasing Him from the agony of death, because it was impossible for death to keep Him in its grip."
        },
        {
          "reference": "Acts 4:27-28",
          "text": "In fact, this is the very city where Herod and Pontius Pilate conspired with the Gentiles and the people of Israel against Your holy servant Jesus, whom You anointed. / They carried out what Your hand and will had decided beforehand would happen."
        },
        {
          "reference": "Psalm 105:16-22",
          "text": "He called down famine on the land and cut off all their supplies of food. / He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, ..."
        },
        {
          "reference": "Isaiah 55:8-9",
          "text": "“For My thoughts are not your thoughts, neither are your ways My ways,” declares the LORD. / “For as the heavens are higher than the earth, so My ways are higher than your ways and My thoughts than your thoughts."
        },
        {
          "reference": "Proverbs 16:9",
          "text": "A man’s heart plans his course, but the LORD determines his steps."
        },
        {
          "reference": "Jeremiah 29:11",
          "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, to give you a future and a hope."
        },
        {
          "reference": "1 Peter 3:17",
          "text": "For it is better, if it is God’s will, to suffer for doing good than for doing evil."
        },
        {
          "reference": "1 Peter 4:19",
          "text": "So then, those who suffer according to God’s will should entrust their souls to their faithful Creator and continue to do good."
        },
        {
          "reference": "Job 42:2",
          "text": "“I know that You can do all things and that no plan of Yours can be thwarted."
        },
        {
          "reference": "Isaiah 46:10",
          "text": "I declare the end from the beginning, and from ancient times what is still to come. I say, ‘My purpose will stand, and all My good pleasure I will accomplish.’"
        },
        {
          "reference": "Ephesians 1:11",
          "text": "In Him we were also chosen as God’s own, having been predestined according to the plan of Him who works out everything by the counsel of His will,"
        },
        {
          "reference": "2 Corinthians 4:17",
          "text": "For our light and momentary affliction is producing for us an eternal weight of glory that is far beyond comparison."
        },
        {
          "reference": "James 1:2-4",
          "text": "Consider it pure joy, my brothers, when you encounter trials of many kinds, / because you know that the testing of your faith develops perseverance. / Allow perseverance to finish its work, so that you may be mature and complete, not lacking anything."
        },
        {
          "reference": "Philippians 1:12",
          "text": "Now I want you to know, brothers, that my circumstances have actually served to advance the gospel."
        }
      ]
    },
    {
      "reference": "Genesis 50:21",
      "book": "Genesis",
      "chapter": 50,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "So then, don’t be afraid. I will provide for you and your children.” And he reassured them and spoke kindly to them."
        },
        {
          "version": "NLT",
          "text": "No, don’t be afraid. I will continue to take care of you and your children.” So he reassured them by speaking kindly to them."
        },
        {
          "version": "ESV",
          "text": "So do not fear; I will provide for you and your little ones.” Thus he comforted them and spoke kindly to them."
        },
        {
          "version": "NKJV",
          "text": "Now therefore, do not be afraid; I will provide for you and your little ones.” And he comforted them and spoke kindly to them."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        },
        {
          "reference": "Genesis 45:5-8",
          "text": "And now, do not be distressed or angry with yourselves that you sold me into this place, because it was to save lives that God sent me before you. / For the famine has covered the land these two years, and there will be five more years without plowing or harvesting. / God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance. ..."
        },
        {
          "reference": "Matthew 5:44",
          "text": "But I tell you, love your enemies and pray for those who persecute you,"
        },
        {
          "reference": "1 Peter 3:9",
          "text": "Do not repay evil with evil or insult with insult, but with blessing, because to this you were called so that you may inherit a blessing."
        },
        {
          "reference": "Ephesians 4:32",
          "text": "Be kind and tenderhearted to one another, forgiving each other just as in Christ God forgave you."
        },
        {
          "reference": "Luke 6:27-28",
          "text": "But to those of you who will listen, I say: Love your enemies, do good to those who hate you, / bless those who curse you, pray for those who mistreat you."
        },
        {
          "reference": "Proverbs 19:11",
          "text": "A man’s insight gives him patience, and his virtue is to overlook an offense."
        },
        {
          "reference": "1 Thessalonians 5:15",
          "text": "Make sure that no one repays evil for evil. Always pursue what is good for one another and for all people."
        },
        {
          "reference": "Colossians 3:13",
          "text": "Bear with one another and forgive any complaint you may have against someone else. Forgive as the Lord forgave you."
        },
        {
          "reference": "1 John 3:18",
          "text": "Little children, let us love not in word and speech, but in action and truth."
        },
        {
          "reference": "2 Corinthians 2:7",
          "text": "So instead, you ought to forgive and comfort him, so that he will not be overwhelmed by excessive sorrow."
        },
        {
          "reference": "Exodus 14:13-14",
          "text": "But Moses told the people, “Do not be afraid. Stand firm and you will see the LORD’s salvation, which He will accomplish for you today; for the Egyptians you see today, you will never see again. / The LORD will fight for you; you need only to be still.”"
        },
        {
          "reference": "Deuteronomy 31:6",
          "text": "Be strong and courageous; do not be afraid or terrified of them, for it is the LORD your God who goes with you; He will never leave you nor forsake you.”"
        },
        {
          "reference": "Isaiah 41:10",
          "text": "Do not fear, for I am with you; do not be afraid, for I am your God. I will strengthen you; I will surely help you; I will uphold you with My righteous right hand."
        },
        {
          "reference": "Psalm 37:3",
          "text": "Trust in the LORD and do good; dwell in the land and cultivate faithfulness."
        }
      ]
    },
    {
      "reference": "Genesis 50:22",
      "book": "Genesis",
      "chapter": 50,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "Joseph stayed in Egypt, along with all his father’s family. He lived a hundred and ten years"
        },
        {
          "version": "NLT",
          "text": "So Joseph and his brothers and their families continued to live in Egypt. Joseph lived to the age of 110."
        },
        {
          "version": "ESV",
          "text": "So Joseph remained in Egypt, he and his father’s house. Joseph lived 110 years."
        },
        {
          "version": "NKJV",
          "text": "So Joseph dwelt in Egypt, he and his father’s household. And Joseph lived one hundred and ten years."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 47:28",
          "text": "And Jacob lived in the land of Egypt seventeen years, and the length of his life was 147 years."
        },
        {
          "reference": "Exodus 1:6",
          "text": "Now Joseph and all his brothers and all that generation died,"
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 15:13-16",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions. / You, however, will go to your fathers in peace and be buried at a ripe old age. ..."
        },
        {
          "reference": "Genesis 37:28",
          "text": "So when the Midianite traders passed by, his brothers pulled Joseph out of the pit and sold him for twenty shekels of silver to the Ishmaelites, who took him to Egypt."
        },
        {
          "reference": "Genesis 41:46",
          "text": "Now Joseph was thirty years old when he entered the service of Pharaoh king of Egypt. And Joseph left Pharaoh’s presence and traveled throughout the land of Egypt."
        },
        {
          "reference": "Genesis 45:7",
          "text": "God sent me before you to preserve you as a remnant on the earth and to save your lives by a great deliverance."
        },
        {
          "reference": "Genesis 46:3-4",
          "text": "“I am God,” He said, “the God of your father. Do not be afraid to go down to Egypt, for I will make you into a great nation there. / I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Genesis 48:21",
          "text": "Then Israel said to Joseph, “Look, I am about to die, but God will be with you and bring you back to the land of your fathers."
        },
        {
          "reference": "Genesis 49:33",
          "text": "When Jacob had finished instructing his sons, he pulled his feet into the bed and breathed his last, and he was gathered to his people."
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Psalm 105:17-22",
          "text": "He sent a man before them—Joseph, sold as a slave. / They bruised his feet with shackles and placed his neck in irons, / until his prediction came true and the word of the LORD proved him right. ..."
        },
        {
          "reference": "Acts 7:9-10",
          "text": "Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him / and rescued him from all his troubles. He granted Joseph favor and wisdom in the sight of Pharaoh king of Egypt, who appointed him ruler over Egypt and all his household."
        },
        {
          "reference": "Romans 8:28",
          "text": "And we know that God works all things together for the good of those who love Him, who are called according to His purpose."
        }
      ]
    },
    {
      "reference": "Genesis 50:23",
      "book": "Genesis",
      "chapter": 50,
      "verse": 23,
      "translations": [
        {
          "version": "NIV",
          "text": "and saw the third generation of Ephraim’s children. Also the children of Makir son of Manasseh were placed at birth on Joseph’s knees."
        },
        {
          "version": "NLT",
          "text": "He lived to see three generations of descendants of his son Ephraim, and he lived to see the birth of the children of Manasseh’s son Makir, whom he claimed as his own."
        },
        {
          "version": "ESV",
          "text": "And Joseph saw Ephraim’s children of the third generation. The children also of Machir the son of Manasseh were counted as Joseph’s own."
        },
        {
          "version": "NKJV",
          "text": "Joseph saw Ephraim’s children to the third generation. The children of Machir, the son of Manasseh, were also brought up on Joseph’s knees."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:7",
          "text": "but the Israelites were fruitful and increased rapidly; they multiplied and became exceedingly numerous, so that the land was filled with them."
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 1:12",
          "text": "But the more they were oppressed, the more they multiplied and flourished; so the Egyptians came to dread the Israelites."
        },
        {
          "reference": "Exodus 1:20",
          "text": "So God was good to the midwives, and the people multiplied and became even more numerous."
        },
        {
          "reference": "Exodus 1:22",
          "text": "Then Pharaoh commanded all his people: “Every son born to the Hebrews you must throw into the Nile, but every daughter you may allow to live.”"
        },
        {
          "reference": "Exodus 2:1-2",
          "text": "Now a man of the house of Levi married a Levite woman, / and she conceived and gave birth to a son. When she saw that he was a beautiful child, she hid him for three months."
        },
        {
          "reference": "Exodus 2:10",
          "text": "When the child had grown older, she brought him to Pharaoh’s daughter, and he became her son. She named him Moses and explained, “I drew him out of the water.”"
        },
        {
          "reference": "Exodus 2:23-25",
          "text": "After a long time, the king of Egypt died. The Israelites groaned and cried out under their burden of slavery, and their cry for deliverance from bondage ascended to God. / So God heard their groaning, and He remembered His covenant with Abraham, Isaac, and Jacob. / God saw the Israelites and took notice."
        },
        {
          "reference": "Exodus 3:6",
          "text": "Then He said, “I am the God of your father, the God of Abraham, the God of Isaac, and the God of Jacob.” At this, Moses hid his face, for he was afraid to look at God."
        },
        {
          "reference": "Exodus 3:16",
          "text": "Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt."
        },
        {
          "reference": "Exodus 6:16-20",
          "text": "These were the names of the sons of Levi according to their records: Gershon, Kohath, and Merari. Levi lived 137 years. / The sons of Gershon were Libni and Shimei, by their clans. / The sons of Kohath were Amram, Izhar, Hebron, and Uzziel. Kohath lived 133 years. ..."
        },
        {
          "reference": "Exodus 12:37",
          "text": "The Israelites journeyed from Rameses to Succoth with about 600,000 men on foot, besides women and children."
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Acts 7:17",
          "text": "As the time drew near for God to fulfill His promise to Abraham, our people in Egypt increased greatly in number."
        },
        {
          "reference": "Acts 7:18-19",
          "text": "Then another king, who knew nothing of Joseph, arose over Egypt. / He exploited our people and oppressed our fathers, forcing them to abandon their infants so they would die."
        }
      ]
    },
    {
      "reference": "Genesis 50:24",
      "book": "Genesis",
      "chapter": 50,
      "verse": 24,
      "translations": [
        {
          "version": "NIV",
          "text": "Then Joseph said to his brothers, “I am about to die. But God will surely come to your aid and take you up out of this land to the land he promised on oath to Abraham, Isaac and Jacob.”"
        },
        {
          "version": "NLT",
          "text": "“Soon I will die,” Joseph told his brothers, “but God will surely come to help you and lead you out of this land of Egypt. He will bring you back to the land he solemnly promised to give to Abraham, to Isaac, and to Jacob.”"
        },
        {
          "version": "ESV",
          "text": "And Joseph said to his brothers, “I am about to die, but God will visit you and bring you up out of this land to the land that he swore to Abraham, to Isaac, and to Jacob.”"
        },
        {
          "version": "NKJV",
          "text": "And Joseph said to his brethren, “I am dying; but God will surely visit you, and bring you out of this land to the land of which He swore to Abraham, to Isaac, and to Jacob.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 3:16-17",
          "text": "Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt. / And I have promised to bring you up out of your affliction in Egypt, into the land of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites—a land flowing with milk and honey.’"
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Genesis 46:4",
          "text": "I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 28:13",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie."
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Exodus 6:8",
          "text": "And I will bring you into the land that I swore to give to Abraham, Isaac, and Jacob. I will give it to you as a possession. I am the LORD!’”"
        },
        {
          "reference": "Deuteronomy 34:4",
          "text": "And the LORD said to him, “This is the land that I swore to give Abraham, Isaac, and Jacob when I said, ‘I will give it to your descendants.’ I have let you see it with your own eyes, but you will not cross into it.”"
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 26:3",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham."
        },
        {
          "reference": "Genesis 48:21",
          "text": "Then Israel said to Joseph, “Look, I am about to die, but God will be with you and bring you back to the land of your fathers."
        }
      ]
    },
    {
      "reference": "Genesis 50:25",
      "book": "Genesis",
      "chapter": 50,
      "verse": 25,
      "translations": [
        {
          "version": "NIV",
          "text": "And Joseph made the Israelites swear an oath and said, “God will surely come to your aid, and then you must carry my bones up from this place.”"
        },
        {
          "version": "NLT",
          "text": "Then Joseph made the sons of Israel swear an oath, and he said, “When God comes to help you and lead you back, you must take my bones with you.”"
        },
        {
          "version": "ESV",
          "text": "Then Joseph made the sons of Israel swear, saying, “God will surely visit you, and you shall carry up my bones from here.”"
        },
        {
          "version": "NKJV",
          "text": "Then Joseph took an oath from the children of Israel, saying, “God will surely visit you, and you shall carry up my bones from here.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Genesis 46:4",
          "text": "I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Genesis 48:21",
          "text": "Then Israel said to Joseph, “Look, I am about to die, but God will be with you and bring you back to the land of your fathers."
        },
        {
          "reference": "Exodus 3:16-17",
          "text": "Go, assemble the elders of Israel and say to them, ‘The LORD, the God of your fathers—the God of Abraham, Isaac, and Jacob—has appeared to me and said: I have surely attended to you and have seen what has been done to you in Egypt. / And I have promised to bring you up out of your affliction in Egypt, into the land of the Canaanites, Hittites, Amorites, Perizzites, Hivites, and Jebusites—a land flowing with milk and honey.’"
        },
        {
          "reference": "Exodus 1:8-10",
          "text": "Then a new king, who did not know Joseph, came to power in Egypt. / “Look,” he said to his people, “the Israelites have become too numerous and too powerful for us. / Come, let us deal shrewdly with them, or they will increase even more; and if a war breaks out, they may join our enemies, fight against us, and leave the country.”"
        },
        {
          "reference": "Exodus 6:8",
          "text": "And I will bring you into the land that I swore to give to Abraham, Isaac, and Jacob. I will give it to you as a possession. I am the LORD!’”"
        },
        {
          "reference": "Genesis 12:7",
          "text": "Then the LORD appeared to Abram and said, “I will give this land to your offspring.” So Abram built an altar there to the LORD, who had appeared to him."
        },
        {
          "reference": "Genesis 28:13",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie."
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 26:3",
          "text": "Stay in this land as a foreigner, and I will be with you and bless you. For I will give all these lands to you and your offspring, and I will confirm the oath that I swore to your father Abraham."
        }
      ]
    },
    {
      "reference": "Genesis 50:26",
      "book": "Genesis",
      "chapter": 50,
      "verse": 26,
      "translations": [
        {
          "version": "NIV",
          "text": "So Joseph died at the age of a hundred and ten. And after they embalmed him, he was placed in a coffin in Egypt."
        },
        {
          "version": "NLT",
          "text": "So Joseph died at the age of 110. The Egyptians embalmed him, and his body was placed in a coffin in Egypt."
        },
        {
          "version": "ESV",
          "text": "So Joseph died, being 110 years old. They embalmed him, and he was put in a coffin in Egypt."
        },
        {
          "version": "NKJV",
          "text": "So Joseph died, being one hundred and ten years old; and they embalmed him, and he was put in a coffin in Egypt."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 1:6",
          "text": "Now Joseph and all his brothers and all that generation died,"
        },
        {
          "reference": "Hebrews 11:22",
          "text": "By faith Joseph, when his end was near, spoke about the exodus of the Israelites and gave instructions about his bones."
        },
        {
          "reference": "Joshua 24:32",
          "text": "And the bones of Joseph, which the Israelites had brought up out of Egypt, were buried at Shechem in the plot of land that Jacob had purchased from the sons of Hamor, Shechem’s father, for a hundred pieces of silver. So it became an inheritance for Joseph’s descendants."
        },
        {
          "reference": "Acts 7:15-16",
          "text": "So Jacob went down to Egypt, where he and our fathers died. / Their bones were carried back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a price he paid in silver."
        },
        {
          "reference": "Genesis 15:13-14",
          "text": "Then the LORD said to Abram, “Know for certain that your descendants will be strangers in a land that is not their own, and they will be enslaved and mistreated four hundred years. / But I will judge the nation they serve as slaves, and afterward they will depart with many possessions."
        },
        {
          "reference": "Exodus 13:19",
          "text": "Moses took the bones of Joseph with him because Joseph had made the sons of Israel swear a solemn oath when he said, “God will surely attend to you, and then you must carry my bones with you from this place.”"
        },
        {
          "reference": "Genesis 47:29-30",
          "text": "When the time drew near for Israel to die, he called his son Joseph and said to him, “If I have found favor in your eyes, put your hand under my thigh and promise to show me kindness and faithfulness. Do not bury me in Egypt, / but when I lie down with my fathers, carry me out of Egypt and bury me with them.” Joseph answered, “I will do as you have requested.”"
        },
        {
          "reference": "Genesis 49:29-33",
          "text": "Then Jacob instructed them, “I am about to be gathered to my people. Bury me with my fathers in the cave in the field of Ephron the Hittite. / The cave is in the field of Machpelah near Mamre, in the land of Canaan. This is the field Abraham purchased from Ephron the Hittite as a burial site. / There Abraham and his wife Sarah are buried, there Isaac and his wife Rebekah are buried, and there I buried Leah. ..."
        },
        {
          "reference": "Genesis 15:16",
          "text": "In the fourth generation your descendants will return here, for the iniquity of the Amorites is not yet complete.”"
        },
        {
          "reference": "Genesis 46:4",
          "text": "I will go down with you to Egypt, and I will surely bring you back. And Joseph’s own hands will close your eyes.”"
        },
        {
          "reference": "Genesis 12:1-3",
          "text": "Then the LORD said to Abram, “Leave your country, your kindred, and your father’s household, and go to the land I will show you. / I will make you into a great nation, and I will bless you; I will make your name great, so that you will be a blessing. / I will bless those who bless you and curse those who curse you; and all the families of the earth will be blessed through you.”"
        },
        {
          "reference": "Genesis 17:8",
          "text": "And to you and your descendants I will give the land where you are residing—all the land of Canaan—as an eternal possession; and I will be their God.”"
        },
        {
          "reference": "Genesis 28:13-15",
          "text": "And there at the top the LORD was standing and saying, “I am the LORD, the God of your father Abraham and the God of Isaac. I will give you and your descendants the land on which you now lie. / Your descendants will be like the dust of the earth, and you will spread out to the west and east and north and south. All the families of the earth will be blessed through you and your offspring. / Look, I am with you, and I will watch over you wherever you go, and I will bring you back to this land. For I will not leave you until I have done what I have promised you.”"
        },
        {
          "reference": "Genesis 35:12",
          "text": "The land that I gave to Abraham and Isaac I will give to you, and I will give this land to your descendants after you.”"
        },
        {
          "reference": "Genesis 45:25-28",
          "text": "So the brothers went up out of Egypt and came to their father Jacob in the land of Canaan. / “Joseph is still alive,” they said, “and he is ruler over all the land of Egypt!” But Jacob was stunned, for he did not believe them. / However, when they relayed all that Joseph had told them, and when he saw the wagons that Joseph had sent to carry him back, the spirit of their father Jacob was revived. ..."
        }
      ]
    }
  ]
}