{
  "book": "genesis",
  "chapter": 6,
  "verses": [
    {
      "reference": "Genesis 6:1",
      "book": "Genesis",
      "chapter": 6,
      "verse": 1,
      "translations": [
        {
          "version": "NIV",
          "text": "When human beings began to increase in number on the earth and daughters were born to them,"
        },
        {
          "version": "NLT",
          "text": "Then the people began to multiply on the earth, and daughters were born to them."
        },
        {
          "version": "ESV",
          "text": "When man began to multiply on the face of the land and daughters were born to them,"
        },
        {
          "version": "NKJV",
          "text": "Now it came to pass, when men began to multiply on the face of the earth, and daughters were born to them,"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "1 Peter 3:19-20",
          "text": "in whom He also went and preached to the spirits in prison / who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "2 Peter 2:4-5",
          "text": "For if God did not spare the angels when they sinned, but cast them deep into hell, placing them in chains of darkness to be held for judgment; / if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Jude 1:6-7",
          "text": "And the angels who did not stay within their own domain but abandoned their proper dwelling—these He has kept in eternal chains under darkness, bound for judgment on that great day. / In like manner, Sodom and Gomorrah and the cities around them, who indulged in sexual immorality and pursued strange flesh, are on display as an example of those who sustain the punishment of eternal fire."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "Job 22:15-16",
          "text": "Will you stay on the ancient path that wicked men have trod? / They were snatched away before their time, and their foundations were swept away by a flood."
        },
        {
          "reference": "1 Corinthians 11:10",
          "text": "For this reason a woman ought to have a sign of authority on her head, because of the angels."
        },
        {
          "reference": "1 Peter 4:6",
          "text": "That is why the gospel was preached even to those who are now dead, so that they might be judged as men in the flesh, but live according to God in the spirit."
        },
        {
          "reference": "Romans 5:12-14",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned. / For sin was in the world before the law was given; but sin is not taken into account when there is no law. / Nevertheless, death reigned from Adam until Moses, even over those who did not sin in the way that Adam transgressed. He is a pattern of the One to come."
        },
        {
          "reference": "2 Peter 3:5-6",
          "text": "But they deliberately overlook the fact that long ago by God’s word the heavens existed and the earth was formed out of water and by water, / through which the world of that time perished in the flood."
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        },
        {
          "reference": "Ezekiel 14:14",
          "text": "then even if these three men—Noah, Daniel, and Job—were in it, their righteousness could deliver only themselves, declares the Lord GOD."
        },
        {
          "reference": "Job 15:14-16",
          "text": "What is man, that he should be pure, or one born of woman, that he should be righteous? / If God puts no trust in His holy ones, if even the heavens are not pure in His eyes, / how much less man, who is vile and corrupt, who drinks injustice like water?"
        },
        {
          "reference": "Psalm 14:2-3",
          "text": "The LORD looks down from heaven upon the sons of men to see if any understand, if any seek God. / All have turned away, they have together become corrupt; there is no one who does good, not even one."
        }
      ]
    },
    {
      "reference": "Genesis 6:2",
      "book": "Genesis",
      "chapter": 6,
      "verse": 2,
      "translations": [
        {
          "version": "NIV",
          "text": "the sons of God saw that the daughters of humans were beautiful, and they married any of them they chose."
        },
        {
          "version": "NLT",
          "text": "The sons of God saw the beautiful women and took any they wanted as their wives."
        },
        {
          "version": "ESV",
          "text": "the sons of God saw that the daughters of man were attractive. And they took as their wives any they chose."
        },
        {
          "version": "NKJV",
          "text": "that the sons of God saw the daughters of men, that they were beautiful; and they took wives for themselves of all whom they chose."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Job 1:6",
          "text": "One day the sons of God came to present themselves before the LORD, and Satan also came with them."
        },
        {
          "reference": "Job 2:1",
          "text": "On another day the sons of God came to present themselves before the LORD, and Satan also came with them to present himself before Him."
        },
        {
          "reference": "Job 38:7",
          "text": "while the morning stars sang together and all the sons of God shouted for joy?"
        },
        {
          "reference": "Jude 1:6",
          "text": "And the angels who did not stay within their own domain but abandoned their proper dwelling—these He has kept in eternal chains under darkness, bound for judgment on that great day."
        },
        {
          "reference": "2 Peter 2:4",
          "text": "For if God did not spare the angels when they sinned, but cast them deep into hell, placing them in chains of darkness to be held for judgment;"
        },
        {
          "reference": "Matthew 22:30",
          "text": "In the resurrection, people will neither marry nor be given in marriage. Instead, they will be like the angels in heaven."
        },
        {
          "reference": "Luke 20:34-36",
          "text": "Jesus answered, “The sons of this age marry and are given in marriage. / But those who are considered worthy to share in the age to come and in the resurrection from the dead will neither marry nor be given in marriage. / In fact, they can no longer die, because they are like the angels. And since they are sons of the resurrection, they are sons of God."
        },
        {
          "reference": "1 Peter 3:19-20",
          "text": "in whom He also went and preached to the spirits in prison / who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Numbers 13:33",
          "text": "We even saw the Nephilim there—the descendants of Anak that come from the Nephilim! We seemed like grasshoppers in our own sight, and we must have seemed the same to them!”"
        },
        {
          "reference": "Deuteronomy 7:1-3",
          "text": "When the LORD your God brings you into the land that you are entering to possess, and He drives out before you many nations—the Hittites, Girgashites, Amorites, Canaanites, Perizzites, Hivites, and Jebusites, seven nations larger and stronger than you— / and when the LORD your God has delivered them over to you to defeat them, then you must devote them to complete destruction. Make no treaty with them and show them no mercy. / Do not intermarry with them. Do not give your daughters to their sons or take their daughters for your sons,"
        },
        {
          "reference": "1 Corinthians 11:10",
          "text": "For this reason a woman ought to have a sign of authority on her head, because of the angels."
        },
        {
          "reference": "Daniel 3:25",
          "text": "“Look!” he exclaimed. “I see four men, unbound and unharmed, walking around in the fire—and the fourth looks like a son of the gods!”"
        },
        {
          "reference": "Daniel 3:28",
          "text": "Nebuchadnezzar declared, “Blessed be the God of Shadrach, Meshach, and Abednego, who has sent His angel and delivered His servants who trusted in Him. They violated the king’s command and risked their lives rather than serve or worship any god except their own God."
        },
        {
          "reference": "Hebrews 1:5",
          "text": "For to which of the angels did God ever say: “You are My Son; today I have become Your Father”? Or again: “I will be His Father, and He will be My Son”?"
        },
        {
          "reference": "Hebrews 1:14",
          "text": "Are not the angels ministering spirits sent to serve those who will inherit salvation?"
        }
      ]
    },
    {
      "reference": "Genesis 6:3",
      "book": "Genesis",
      "chapter": 6,
      "verse": 3,
      "translations": [
        {
          "version": "NIV",
          "text": "Then the LORD said, “My Spirit will not contend with humans forever, for they are mortal; their days will be a hundred and twenty years.”"
        },
        {
          "version": "NLT",
          "text": "Then the LORD said, “My Spirit will not put up with humans for such a long time, for they are only mortal flesh. In the future, their normal lifespan will be no more than 120 years.”"
        },
        {
          "version": "ESV",
          "text": "Then the LORD said, “My Spirit shall not abide in man forever, for he is flesh: his days shall be 120 years.”"
        },
        {
          "version": "NKJV",
          "text": "And the LORD said, “My Spirit shall not strive with man forever, for he is indeed flesh; yet his days shall be one hundred and twenty years.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Psalm 90:10",
          "text": "The length of our days is seventy years—or eighty if we are strong—yet their pride is but labor and sorrow, for they quickly pass, and we fly away."
        },
        {
          "reference": "Isaiah 57:16",
          "text": "For I will not accuse you forever, nor will I always be angry; for then the spirit of man would grow weak before Me—the breath of life I have made."
        },
        {
          "reference": "Job 34:14-15",
          "text": "If He were to set His heart to it and withdraw His Spirit and breath, / all flesh would perish together and mankind would return to the dust."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "Romans 2:4",
          "text": "Or do you disregard the riches of His kindness, tolerance, and patience, not realizing that God’s kindness leads you to repentance?"
        },
        {
          "reference": "1 Corinthians 3:16-17",
          "text": "Do you not know that you yourselves are God’s temple, and that God’s Spirit dwells in you? / If anyone destroys God’s temple, God will destroy him; for God’s temple is holy, and you are that temple."
        },
        {
          "reference": "Galatians 5:16-17",
          "text": "So I say, walk by the Spirit, and you will not gratify the desires of the flesh. / For the flesh craves what is contrary to the Spirit, and the Spirit what is contrary to the flesh. They are opposed to each other, so that you do not do what you want."
        },
        {
          "reference": "Ephesians 4:30",
          "text": "And do not grieve the Holy Spirit of God, in whom you were sealed for the day of redemption."
        },
        {
          "reference": "1 Thessalonians 5:19",
          "text": "Do not extinguish the Spirit."
        },
        {
          "reference": "Hebrews 3:7-11",
          "text": "Therefore, as the Holy Spirit says: “Today, if you hear His voice, / do not harden your hearts, as you did in the rebellion, in the day of testing in the wilderness, / where your fathers tested and tried Me, and for forty years saw My works. ..."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "Jude 1:14-15",
          "text": "Enoch, the seventh from Adam, also prophesied about them: “Behold, the Lord is coming with myriads of His holy ones / to execute judgment on everyone, and to convict all the ungodly of every ungodly act of wickedness and every harsh word spoken against Him by ungodly sinners.”"
        }
      ]
    },
    {
      "reference": "Genesis 6:4",
      "book": "Genesis",
      "chapter": 6,
      "verse": 4,
      "translations": [
        {
          "version": "NIV",
          "text": "The Nephilim were on the earth in those days—and also afterward—when the sons of God went to the daughters of humans and had children by them. They were the heroes of old, men of renown."
        },
        {
          "version": "NLT",
          "text": "In those days, and for some time after, giant Nephilites lived on the earth, for whenever the sons of God had intercourse with women, they gave birth to children who became the heroes and famous warriors of ancient times."
        },
        {
          "version": "ESV",
          "text": "The Nephilim were on the earth in those days, and also afterward, when the sons of God came in to the daughters of man and they bore children to them. These were the mighty men who were of old, the men of renown."
        },
        {
          "version": "NKJV",
          "text": "There were giants on the earth in those days, and also afterward, when the sons of God came in to the daughters of men and they bore children to them. Those were the mighty men who were of old, men of renown."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Numbers 13:33",
          "text": "We even saw the Nephilim there—the descendants of Anak that come from the Nephilim! We seemed like grasshoppers in our own sight, and we must have seemed the same to them!”"
        },
        {
          "reference": "Jude 1:6",
          "text": "And the angels who did not stay within their own domain but abandoned their proper dwelling—these He has kept in eternal chains under darkness, bound for judgment on that great day."
        },
        {
          "reference": "2 Peter 2:4",
          "text": "For if God did not spare the angels when they sinned, but cast them deep into hell, placing them in chains of darkness to be held for judgment;"
        },
        {
          "reference": "Job 1:6",
          "text": "One day the sons of God came to present themselves before the LORD, and Satan also came with them."
        },
        {
          "reference": "Job 38:7",
          "text": "while the morning stars sang together and all the sons of God shouted for joy?"
        },
        {
          "reference": "Deuteronomy 2:10-11",
          "text": "(The Emites used to live there, a people great and many, as tall as the Anakites. / Like the Anakites, they were also regarded as Rephaim, though the Moabites called them Emites."
        },
        {
          "reference": "Deuteronomy 2:20-21",
          "text": "(That too was regarded as the land of the Rephaim, who used to live there, though the Ammonites called them Zamzummites. / They were a people great and many, as tall as the Anakites. But the LORD destroyed them from before the Ammonites, who drove them out and settled in their place,"
        },
        {
          "reference": "1 Samuel 17:4-7",
          "text": "Then a champion named Goliath, who was from Gath, came out from the Philistine camp. He was six cubits and a span in height, / and he had a bronze helmet on his head. He wore a bronze coat of mail weighing five thousand shekels, / and he had armor of bronze on his legs and a javelin of bronze slung between his shoulders. ..."
        },
        {
          "reference": "2 Samuel 21:16-22",
          "text": "Then Ishbi-benob, a descendant of Rapha, whose bronze spear weighed three hundred shekels and who was bearing a new sword, resolved to kill David. / But Abishai son of Zeruiah came to his aid, struck the Philistine, and killed him. Then David’s men swore to him, “You must never again go out with us to battle, so that the lamp of Israel may not be extinguished.” / Some time later at Gob, there was another battle with the Philistines. At that time Sibbecai the Hushathite killed Saph, a descendant of Rapha. ..."
        },
        {
          "reference": "1 Chronicles 20:4-8",
          "text": "Some time later, war broke out with the Philistines at Gezer. At that time Sibbecai the Hushathite killed Sippai, a descendant of the Rephaim, and the Philistines were subdued. / Once again there was a battle with the Philistines, and Elhanan son of Jair killed Lahmi the brother of Goliath the Gittite, the shaft of whose spear was like a weaver’s beam. / And there was also a battle at Gath, where there was a man of great stature with six fingers on each hand and six toes on each foot—twenty-four in all. He too was descended from Rapha, ..."
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:19-20",
          "text": "in whom He also went and preached to the spirits in prison / who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "2 Peter 3:5-6",
          "text": "But they deliberately overlook the fact that long ago by God’s word the heavens existed and the earth was formed out of water and by water, / through which the world of that time perished in the flood."
        }
      ]
    },
    {
      "reference": "Genesis 6:5",
      "book": "Genesis",
      "chapter": 6,
      "verse": 5,
      "translations": [
        {
          "version": "NIV",
          "text": "The LORD saw how great the wickedness of the human race had become on the earth, and that every inclination of the thoughts of the human heart was only evil all the time."
        },
        {
          "version": "NLT",
          "text": "The LORD observed the extent of human wickedness on the earth, and he saw that everything they thought or imagined was consistently and totally evil."
        },
        {
          "version": "ESV",
          "text": "The LORD saw that the wickedness of man was great in the earth, and that every intention of the thoughts of his heart was only evil continually."
        },
        {
          "version": "NKJV",
          "text": "Then the LORD saw that the wickedness of man was great in the earth, and that every intent of the thoughts of his heart was only evil continually."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Jeremiah 17:9",
          "text": "The heart is deceitful above all things and beyond cure. Who can understand it?"
        },
        {
          "reference": "Matthew 15:19",
          "text": "For out of the heart come evil thoughts, murder, adultery, sexual immorality, theft, false testimony, and slander."
        },
        {
          "reference": "Romans 3:10-12",
          "text": "As it is written: “There is no one righteous, not even one. / There is no one who understands, no one who seeks God. / All have turned away, they have together become worthless; there is no one who does good, not even one.”"
        },
        {
          "reference": "Romans 1:21-22",
          "text": "For although they knew God, they neither glorified Him as God nor gave thanks to Him, but they became futile in their thinking and darkened in their foolish hearts. / Although they claimed to be wise, they became fools,"
        },
        {
          "reference": "Psalm 14:1-3",
          "text": "For the choirmaster. Of David. The fool says in his heart, “There is no God.” They are corrupt; their acts are vile. There is no one who does good. / The LORD looks down from heaven upon the sons of men to see if any understand, if any seek God. / All have turned away, they have together become corrupt; there is no one who does good, not even one."
        },
        {
          "reference": "Mark 7:21-23",
          "text": "For from within the hearts of men come evil thoughts, sexual immorality, theft, murder, adultery, / greed, wickedness, deceit, debauchery, envy, slander, arrogance, and foolishness. / All these evils come from within, and these are what defile a man.”"
        },
        {
          "reference": "Romans 8:7",
          "text": "because the mind of the flesh is hostile to God: It does not submit to God’s law, nor can it do so."
        },
        {
          "reference": "Ephesians 2:1-3",
          "text": "And you were dead in your trespasses and sins, / in which you used to walk when you conformed to the ways of this world and of the ruler of the power of the air, the spirit who is now at work in the sons of disobedience. / All of us also lived among them at one time, fulfilling the cravings of our flesh and indulging its desires and thoughts. Like the rest, we were by nature children of wrath."
        },
        {
          "reference": "Ecclesiastes 9:3",
          "text": "This is an evil in everything that is done under the sun: There is one fate for everyone. Furthermore, the hearts of men are full of evil and madness while they are alive, and afterward they join the dead."
        },
        {
          "reference": "Isaiah 64:6",
          "text": "Each of us has become like something unclean, and all our righteous acts are like filthy rags; we all wither like a leaf, and our iniquities carry us away like the wind."
        },
        {
          "reference": "Proverbs 6:18",
          "text": "a heart that devises wicked schemes, feet that run swiftly to evil,"
        },
        {
          "reference": "James 1:14-15",
          "text": "But each one is tempted when by his own evil desires he is lured away and enticed. / Then after desire has conceived, it gives birth to sin; and sin, when it is full-grown, gives birth to death."
        },
        {
          "reference": "1 Corinthians 2:14",
          "text": "The natural man does not accept the things that come from the Spirit of God. For they are foolishness to him, and he cannot understand them, because they are spiritually discerned."
        },
        {
          "reference": "Psalm 53:1-3",
          "text": "For the choirmaster. According to Mahalath. A Maskil of David. The fool says in his heart, “There is no God.” They are corrupt; their ways are vile. There is no one who does good. / God looks down from heaven upon the sons of men to see if any understand, if any seek God. / All have turned away, they have together become corrupt; there is no one who does good, not even one."
        },
        {
          "reference": "2 Timothy 3:2-4",
          "text": "For men will be lovers of themselves, lovers of money, boastful, arrogant, abusive, disobedient to their parents, ungrateful, unholy, / unloving, unforgiving, slanderous, without self-control, brutal, without love of good, / traitorous, reckless, conceited, lovers of pleasure rather than lovers of God,"
        }
      ]
    },
    {
      "reference": "Genesis 6:6",
      "book": "Genesis",
      "chapter": 6,
      "verse": 6,
      "translations": [
        {
          "version": "NIV",
          "text": "The LORD regretted that he had made human beings on the earth, and his heart was deeply troubled."
        },
        {
          "version": "NLT",
          "text": "So the LORD was sorry he had ever made them and put them on the earth. It broke his heart."
        },
        {
          "version": "ESV",
          "text": "And the LORD regretted that he had made man on the earth, and it grieved him to his heart."
        },
        {
          "version": "NKJV",
          "text": "And the LORD was sorry that He had made man on the earth, and He was grieved in His heart."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 32:14",
          "text": "So the LORD relented from the calamity He had threatened to bring on His people."
        },
        {
          "reference": "1 Samuel 15:11",
          "text": "“I regret that I have made Saul king, for he has turned away from following Me and has not carried out My instructions.” And Samuel was distressed and cried out to the LORD all that night."
        },
        {
          "reference": "Jeremiah 18:7-10",
          "text": "At any time I might announce that a nation or kingdom will be uprooted, torn down, and destroyed. / But if that nation I warned turns from its evil, then I will relent of the disaster I had planned to bring. / And if at another time I announce that I will build up and establish a nation or kingdom, ..."
        },
        {
          "reference": "Jonah 3:10",
          "text": "When God saw their actions—that they had turned from their evil ways—He relented from the disaster He had threatened to bring upon them."
        },
        {
          "reference": "Isaiah 63:10",
          "text": "But they rebelled and grieved His Holy Spirit. So He turned and became their enemy, and He Himself fought against them."
        },
        {
          "reference": "Ephesians 4:30",
          "text": "And do not grieve the Holy Spirit of God, in whom you were sealed for the day of redemption."
        },
        {
          "reference": "Numbers 23:19",
          "text": "God is not a man, that He should lie, or a son of man, that He should change His mind. Does He speak and not act? Does He promise and not fulfill?"
        },
        {
          "reference": "1 Samuel 15:29",
          "text": "Moreover, the Glory of Israel does not lie or change His mind, for He is not a man, that He should change His mind.”"
        },
        {
          "reference": "Psalm 78:40",
          "text": "How often they disobeyed Him in the wilderness and grieved Him in the desert!"
        },
        {
          "reference": "Psalm 95:10",
          "text": "For forty years I was angry with that generation, and I said, “They are a people whose hearts go astray, and they have not known My ways.”"
        },
        {
          "reference": "Hosea 11:8",
          "text": "How could I give you up, O Ephraim? How could I surrender you, O Israel? How could I make you like Admah? How could I treat you like Zeboiim? My heart is turned within Me; My compassion is stirred!"
        },
        {
          "reference": "Malachi 3:6",
          "text": "“Because I, the LORD, do not change, you descendants of Jacob have not been destroyed."
        },
        {
          "reference": "James 1:17",
          "text": "Every good and perfect gift is from above, coming down from the Father of the heavenly lights, with whom there is no change or shifting shadow."
        },
        {
          "reference": "Luke 19:41-44",
          "text": "As Jesus approached Jerusalem and saw the city, He wept over it / and said, “If only you had known on this day what would bring you peace! But now it is hidden from your eyes. / For the days will come upon you when your enemies will barricade you and surround you and hem you in on every side. ..."
        },
        {
          "reference": "Matthew 23:37",
          "text": "O Jerusalem, Jerusalem, who kills the prophets and stones those sent to her, how often I have longed to gather your children together, as a hen gathers her chicks under her wings, but you were unwilling!"
        }
      ]
    },
    {
      "reference": "Genesis 6:7",
      "book": "Genesis",
      "chapter": 6,
      "verse": 7,
      "translations": [
        {
          "version": "NIV",
          "text": "So the LORD said, “I will wipe from the face of the earth the human race I have created—and with them the animals, the birds and the creatures that move along the ground—for I regret that I have made them.”"
        },
        {
          "version": "NLT",
          "text": "And the LORD said, “I will wipe this human race I have created from the face of the earth. Yes, and I will destroy every living thing—all the people, the large animals, the small animals that scurry along the ground, and even the birds of the sky. I am sorry I ever made them.”"
        },
        {
          "version": "ESV",
          "text": "So the LORD said, “I will blot out man whom I have created from the face of the land, man and animals and creeping things and birds of the heavens, for I am sorry that I have made them.”"
        },
        {
          "version": "NKJV",
          "text": "So the LORD said, “I will destroy man whom I have created from the face of the earth, both man and beast, creeping thing and birds of the air, for I am sorry that I have made them.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        },
        {
          "reference": "Ezekiel 14:14",
          "text": "then even if these three men—Noah, Daniel, and Job—were in it, their righteousness could deliver only themselves, declares the Lord GOD."
        },
        {
          "reference": "Ezekiel 14:20",
          "text": "then as surely as I live, declares the Lord GOD, even if Noah, Daniel, and Job were in it, they could not deliver their own sons or daughters. Their righteousness could deliver only themselves."
        },
        {
          "reference": "Job 22:15-17",
          "text": "Will you stay on the ancient path that wicked men have trod? / They were snatched away before their time, and their foundations were swept away by a flood. / They said to God, ‘Depart from us. What can the Almighty do to us?’"
        },
        {
          "reference": "2 Peter 3:6",
          "text": "through which the world of that time perished in the flood."
        },
        {
          "reference": "Romans 5:12",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned."
        },
        {
          "reference": "Romans 5:14",
          "text": "Nevertheless, death reigned from Adam until Moses, even over those who did not sin in the way that Adam transgressed. He is a pattern of the One to come."
        },
        {
          "reference": "1 Corinthians 15:22",
          "text": "For as in Adam all die, so in Christ all will be made alive."
        },
        {
          "reference": "1 Corinthians 15:45",
          "text": "So it is written: “The first man Adam became a living being”; the last Adam a life-giving spirit."
        },
        {
          "reference": "Psalm 104:29",
          "text": "When You hide Your face, they are terrified; when You take away their breath, they die and return to dust."
        }
      ]
    },
    {
      "reference": "Genesis 6:8",
      "book": "Genesis",
      "chapter": 6,
      "verse": 8,
      "translations": [
        {
          "version": "NIV",
          "text": "But Noah found favor in the eyes of the LORD."
        },
        {
          "version": "NLT",
          "text": "But Noah found favor with the LORD."
        },
        {
          "version": "ESV",
          "text": "But Noah found favor in the eyes of the LORD."
        },
        {
          "version": "NKJV",
          "text": "But Noah found grace in the eyes of the LORD."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Genesis 7:1",
          "text": "Then the LORD said to Noah, “Go into the ark, you and all your family, because I have found you righteous in this generation."
        },
        {
          "reference": "Genesis 8:1",
          "text": "But God remembered Noah and all the animals and livestock that were with him in the ark. And God sent a wind over the earth, and the waters began to subside."
        },
        {
          "reference": "Genesis 9:1",
          "text": "And God blessed Noah and his sons and said to them, “Be fruitful and multiply and fill the earth."
        },
        {
          "reference": "Genesis 5:29",
          "text": "And he named him Noah, saying, “May this one comfort us in the labor and toil of our hands caused by the ground that the LORD has cursed.”"
        },
        {
          "reference": "Genesis 19:19",
          "text": "Your servant has indeed found favor in your sight, and you have shown me great kindness by sparing my life. But I cannot run to the mountains; the disaster will overtake me, and I will die."
        },
        {
          "reference": "Exodus 33:17",
          "text": "So the LORD said to Moses, “I will do this very thing you have asked, for you have found favor in My sight, and I know you by name.”"
        },
        {
          "reference": "Numbers 14:8",
          "text": "If the LORD delights in us, He will bring us into this land, a land flowing with milk and honey, and He will give it to us."
        },
        {
          "reference": "Psalm 84:11",
          "text": "For the LORD God is a sun and a shield; the LORD gives grace and glory; He withholds no good thing from those who walk with integrity."
        },
        {
          "reference": "Proverbs 3:4",
          "text": "Then you will find favor and high regard in the sight of God and man."
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        }
      ]
    },
    {
      "reference": "Genesis 6:9",
      "book": "Genesis",
      "chapter": 6,
      "verse": 9,
      "translations": [
        {
          "version": "NIV",
          "text": "This is the account of Noah and his family. Noah was a righteous man, blameless among the people of his time, and he walked faithfully with God."
        },
        {
          "version": "NLT",
          "text": "This is the account of Noah and his family. Noah was a righteous man, the only blameless person living on earth at the time, and he walked in close fellowship with God."
        },
        {
          "version": "ESV",
          "text": "These are the generations of Noah. Noah was a righteous man, blameless in his generation. Noah walked with God."
        },
        {
          "version": "NKJV",
          "text": "This is the genealogy of Noah. Noah was a just man, perfect in his generations. Noah walked with God."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Ezekiel 14:14",
          "text": "then even if these three men—Noah, Daniel, and Job—were in it, their righteousness could deliver only themselves, declares the Lord GOD."
        },
        {
          "reference": "Ezekiel 14:20",
          "text": "then as surely as I live, declares the Lord GOD, even if Noah, Daniel, and Job were in it, they could not deliver their own sons or daughters. Their righteousness could deliver only themselves."
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Job 1:1",
          "text": "There was a man in the land of Uz whose name was Job. And this man was blameless and upright, fearing God and shunning evil."
        },
        {
          "reference": "Job 1:8",
          "text": "Then the LORD said to Satan, “Have you considered My servant Job? For there is no one on earth like him, a man who is blameless and upright, who fears God and shuns evil.”"
        },
        {
          "reference": "Job 2:3",
          "text": "Then the LORD said to Satan, “Have you considered My servant Job? For there is no one on earth like him, a man who is blameless and upright, who fears God and shuns evil. He still retains his integrity, even though you incited Me against him to ruin him without cause.”"
        },
        {
          "reference": "Genesis 5:22-24",
          "text": "And after he had become the father of Methuselah, Enoch walked with God 300 years and had other sons and daughters. / So Enoch lived a total of 365 years. / Enoch walked with God, and then he was no more, because God had taken him away."
        },
        {
          "reference": "Genesis 7:1",
          "text": "Then the LORD said to Noah, “Go into the ark, you and all your family, because I have found you righteous in this generation."
        },
        {
          "reference": "Genesis 17:1",
          "text": "When Abram was ninety-nine years old, the LORD appeared to him and said, “I am God Almighty. Walk before Me and be blameless."
        },
        {
          "reference": "Genesis 18:19",
          "text": "For I have chosen him, so that he will command his children and his household after him to keep the way of the LORD by doing what is right and just, in order that the LORD may bring upon Abraham what He has promised.”"
        },
        {
          "reference": "Genesis 19:29",
          "text": "So when God destroyed the cities of the plain, He remembered Abraham, and He brought Lot out of the catastrophe that destroyed the cities where he had lived."
        }
      ]
    },
    {
      "reference": "Genesis 6:10",
      "book": "Genesis",
      "chapter": 6,
      "verse": 10,
      "translations": [
        {
          "version": "NIV",
          "text": "Noah had three sons: Shem, Ham and Japheth."
        },
        {
          "version": "NLT",
          "text": "Noah was the father of three sons: Shem, Ham, and Japheth."
        },
        {
          "version": "ESV",
          "text": "And Noah had three sons, Shem, Ham, and Japheth."
        },
        {
          "version": "NKJV",
          "text": "And Noah begot three sons: Shem, Ham, and Japheth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 5:32",
          "text": "After Noah was 500 years old, he became the father of Shem, Ham, and Japheth."
        },
        {
          "reference": "Genesis 7:13",
          "text": "On that very day Noah entered the ark, along with his sons Shem, Ham, and Japheth, and his wife, and the three wives of his sons—"
        },
        {
          "reference": "Genesis 9:18-19",
          "text": "The sons of Noah who came out of the ark were Shem, Ham, and Japheth. And Ham was the father of Canaan. / These three were the sons of Noah, and from them the whole earth was populated."
        },
        {
          "reference": "1 Chronicles 1:4",
          "text": "The sons of Noah: Shem, Ham, and Japheth."
        },
        {
          "reference": "Luke 3:36",
          "text": "the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,"
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "Genesis 10:1",
          "text": "This is the account of Noah’s sons Shem, Ham, and Japheth, who also had sons after the flood."
        },
        {
          "reference": "Genesis 10:32",
          "text": "All these are the clans of Noah’s sons, according to their generations and nations. From these the nations of the earth spread out after the flood."
        },
        {
          "reference": "Genesis 11:10",
          "text": "This is the account of Shem. Two years after the flood, when Shem was 100 years old, he became the father of Arphaxad."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Genesis 8:18",
          "text": "So Noah came out, along with his sons and his wife and his sons’ wives."
        },
        {
          "reference": "Genesis 9:1",
          "text": "And God blessed Noah and his sons and said to them, “Be fruitful and multiply and fill the earth."
        },
        {
          "reference": "Genesis 9:28-29",
          "text": "After the flood, Noah lived 350 years. / So Noah lived a total of 950 years, and then he died."
        }
      ]
    },
    {
      "reference": "Genesis 6:11",
      "book": "Genesis",
      "chapter": 6,
      "verse": 11,
      "translations": [
        {
          "version": "NIV",
          "text": "Now the earth was corrupt in God’s sight and was full of violence."
        },
        {
          "version": "NLT",
          "text": "Now God saw that the earth had become corrupt and was filled with violence."
        },
        {
          "version": "ESV",
          "text": "Now the earth was corrupt in God’s sight, and the earth was filled with violence."
        },
        {
          "version": "NKJV",
          "text": "The earth also was corrupt before God, and the earth was filled with violence."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Romans 1:29-32",
          "text": "They have become filled with every kind of wickedness, evil, greed, and depravity. They are full of envy, murder, strife, deceit, and malice. They are gossips, / slanderers, God-haters, insolent, arrogant, and boastful. They invent new forms of evil; they disobey their parents. / They are senseless, faithless, heartless, merciless. ..."
        },
        {
          "reference": "Isaiah 24:5-6",
          "text": "The earth is defiled by its people; they have transgressed the laws; they have overstepped the decrees and broken the everlasting covenant. / Therefore a curse has consumed the earth, and its inhabitants must bear the guilt; the earth’s dwellers have been burned, and only a few survive."
        },
        {
          "reference": "Ezekiel 7:23",
          "text": "Forge the chain, for the land is full of crimes of bloodshed, and the city is full of violence."
        },
        {
          "reference": "Hosea 4:1-3",
          "text": "Hear the word of the LORD, O children of Israel, for the LORD has a case against the people of the land: “There is no truth, no loving devotion, and no knowledge of God in the land! / Cursing and lying, murder and stealing, and adultery are rampant; one act of bloodshed follows another. / Therefore the land mourns, and all who dwell in it will waste away with the beasts of the field and the birds of the air; even the fish of the sea disappear."
        },
        {
          "reference": "Jeremiah 51:25-26",
          "text": "“Behold, I am against you, O destroying mountain, you who devastate the whole earth, declares the LORD. I will stretch out My hand against you; I will roll you over the cliffs and turn you into a charred mountain. / No one shall retrieve from you a cornerstone or a foundation stone, because you will become desolate forever,” declares the LORD."
        },
        {
          "reference": "Psalm 14:1-3",
          "text": "For the choirmaster. Of David. The fool says in his heart, “There is no God.” They are corrupt; their acts are vile. There is no one who does good. / The LORD looks down from heaven upon the sons of men to see if any understand, if any seek God. / All have turned away, they have together become corrupt; there is no one who does good, not even one."
        },
        {
          "reference": "Psalm 53:1-3",
          "text": "For the choirmaster. According to Mahalath. A Maskil of David. The fool says in his heart, “There is no God.” They are corrupt; their ways are vile. There is no one who does good. / God looks down from heaven upon the sons of men to see if any understand, if any seek God. / All have turned away, they have together become corrupt; there is no one who does good, not even one."
        },
        {
          "reference": "Job 22:15-17",
          "text": "Will you stay on the ancient path that wicked men have trod? / They were snatched away before their time, and their foundations were swept away by a flood. / They said to God, ‘Depart from us. What can the Almighty do to us?’"
        },
        {
          "reference": "2 Timothy 3:1-5",
          "text": "But understand this: In the last days terrible times will come. / For men will be lovers of themselves, lovers of money, boastful, arrogant, abusive, disobedient to their parents, ungrateful, unholy, / unloving, unforgiving, slanderous, without self-control, brutal, without love of good, ..."
        },
        {
          "reference": "Jude 1:14-15",
          "text": "Enoch, the seventh from Adam, also prophesied about them: “Behold, the Lord is coming with myriads of His holy ones / to execute judgment on everyone, and to convict all the ungodly of every ungodly act of wickedness and every harsh word spoken against Him by ungodly sinners.”"
        }
      ]
    },
    {
      "reference": "Genesis 6:12",
      "book": "Genesis",
      "chapter": 6,
      "verse": 12,
      "translations": [
        {
          "version": "NIV",
          "text": "God saw how corrupt the earth had become, for all the people on earth had corrupted their ways."
        },
        {
          "version": "NLT",
          "text": "God observed all this corruption in the world, for everyone on earth was corrupt."
        },
        {
          "version": "ESV",
          "text": "And God saw the earth, and behold, it was corrupt, for all flesh had corrupted their way on the earth."
        },
        {
          "version": "NKJV",
          "text": "So God looked upon the earth, and indeed it was corrupt; for all flesh had corrupted their way on the earth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Romans 3:23",
          "text": "for all have sinned and fall short of the glory of God,"
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Isaiah 53:6",
          "text": "We all like sheep have gone astray, each one has turned to his own way; and the LORD has laid upon Him the iniquity of us all."
        },
        {
          "reference": "Jeremiah 17:9",
          "text": "The heart is deceitful above all things and beyond cure. Who can understand it?"
        },
        {
          "reference": "Psalm 14:1-3",
          "text": "For the choirmaster. Of David. The fool says in his heart, “There is no God.” They are corrupt; their acts are vile. There is no one who does good. / The LORD looks down from heaven upon the sons of men to see if any understand, if any seek God. / All have turned away, they have together become corrupt; there is no one who does good, not even one."
        },
        {
          "reference": "Psalm 53:1-3",
          "text": "For the choirmaster. According to Mahalath. A Maskil of David. The fool says in his heart, “There is no God.” They are corrupt; their ways are vile. There is no one who does good. / God looks down from heaven upon the sons of men to see if any understand, if any seek God. / All have turned away, they have together become corrupt; there is no one who does good, not even one."
        },
        {
          "reference": "Romans 1:28-32",
          "text": "Furthermore, since they did not see fit to acknowledge God, He gave them up to a depraved mind, to do what ought not to be done. / They have become filled with every kind of wickedness, evil, greed, and depravity. They are full of envy, murder, strife, deceit, and malice. They are gossips, / slanderers, God-haters, insolent, arrogant, and boastful. They invent new forms of evil; they disobey their parents. ..."
        },
        {
          "reference": "Romans 5:12",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned."
        },
        {
          "reference": "Ephesians 2:1-3",
          "text": "And you were dead in your trespasses and sins, / in which you used to walk when you conformed to the ways of this world and of the ruler of the power of the air, the spirit who is now at work in the sons of disobedience. / All of us also lived among them at one time, fulfilling the cravings of our flesh and indulging its desires and thoughts. Like the rest, we were by nature children of wrath."
        },
        {
          "reference": "2 Timothy 3:1-5",
          "text": "But understand this: In the last days terrible times will come. / For men will be lovers of themselves, lovers of money, boastful, arrogant, abusive, disobedient to their parents, ungrateful, unholy, / unloving, unforgiving, slanderous, without self-control, brutal, without love of good, ..."
        },
        {
          "reference": "Job 15:16",
          "text": "how much less man, who is vile and corrupt, who drinks injustice like water?"
        },
        {
          "reference": "Hosea 6:7",
          "text": "But they, like Adam, have transgressed the covenant; there they were unfaithful to Me."
        }
      ]
    },
    {
      "reference": "Genesis 6:13",
      "book": "Genesis",
      "chapter": 6,
      "verse": 13,
      "translations": [
        {
          "version": "NIV",
          "text": "So God said to Noah, “I am going to put an end to all people, for the earth is filled with violence because of them. I am surely going to destroy both them and the earth."
        },
        {
          "version": "NLT",
          "text": "So God said to Noah, “I have decided to destroy all living creatures, for they have filled the earth with violence. Yes, I will wipe them all out along with the earth!"
        },
        {
          "version": "ESV",
          "text": "And God said to Noah, “I have determined to make an end of all flesh, for the earth is filled with violence through them. Behold, I will destroy them with the earth."
        },
        {
          "version": "NKJV",
          "text": "And God said to Noah, “The end of all flesh has come before Me, for the earth is filled with violence through them; and behold, I will destroy them with the earth."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        },
        {
          "reference": "Ezekiel 7:2-3",
          "text": "“O son of man, this is what the Lord GOD says to the land of Israel: ‘The end! The end has come upon the four corners of the land. / The end is now upon you, and I will unleash My anger against you. I will judge you according to your ways and repay you for all your abominations."
        },
        {
          "reference": "Job 22:15-17",
          "text": "Will you stay on the ancient path that wicked men have trod? / They were snatched away before their time, and their foundations were swept away by a flood. / They said to God, ‘Depart from us. What can the Almighty do to us?’"
        },
        {
          "reference": "2 Peter 3:6",
          "text": "through which the world of that time perished in the flood."
        },
        {
          "reference": "Romans 1:18",
          "text": "The wrath of God is being revealed from heaven against all the godlessness and wickedness of men who suppress the truth by their wickedness."
        },
        {
          "reference": "Amos 3:7",
          "text": "Surely the Lord GOD does nothing without revealing His plan to His servants the prophets."
        },
        {
          "reference": "Jeremiah 4:23-27",
          "text": "I looked at the earth, and it was formless and void; I looked to the heavens, and they had no light. / I looked at the mountains, and behold, they were quaking; all the hills were swaying. / I looked, and no man was left; all the birds of the air had fled. ..."
        },
        {
          "reference": "Isaiah 24:1-6",
          "text": "Behold, the LORD lays waste the earth and leaves it in ruins. He will twist its surface and scatter its inhabitants— / people and priest alike, servant and master, maid and mistress, buyer and seller, lender and borrower, creditor and debtor. / The earth will be utterly laid waste and thoroughly plundered. For the LORD has spoken this word. ..."
        },
        {
          "reference": "Revelation 11:18",
          "text": "The nations were enraged, and Your wrath has come. The time has come to judge the dead and to reward Your servants the prophets, as well as the saints and those who fear Your name, both small and great—and to destroy those who destroy the earth.”"
        },
        {
          "reference": "Hosea 4:1-3",
          "text": "Hear the word of the LORD, O children of Israel, for the LORD has a case against the people of the land: “There is no truth, no loving devotion, and no knowledge of God in the land! / Cursing and lying, murder and stealing, and adultery are rampant; one act of bloodshed follows another. / Therefore the land mourns, and all who dwell in it will waste away with the beasts of the field and the birds of the air; even the fish of the sea disappear."
        }
      ]
    },
    {
      "reference": "Genesis 6:14",
      "book": "Genesis",
      "chapter": 6,
      "verse": 14,
      "translations": [
        {
          "version": "NIV",
          "text": "So make yourself an ark of cypress wood; make rooms in it and coat it with pitch inside and out."
        },
        {
          "version": "NLT",
          "text": "“Build a large boat from cypress wood and waterproof it with tar, inside and out. Then construct decks and stalls throughout its interior."
        },
        {
          "version": "ESV",
          "text": "Make yourself an ark of gopher wood. Make rooms in the ark, and cover it inside and out with pitch."
        },
        {
          "version": "NKJV",
          "text": "Make yourself an ark of gopherwood; make rooms in the ark, and cover it inside and outside with pitch."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 2:3",
          "text": "But when she could no longer hide him, she got him a papyrus basket and coated it with tar and pitch. Then she placed the child in the basket and set it among the reeds along the bank of the Nile."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Job 22:15-17",
          "text": "Will you stay on the ancient path that wicked men have trod? / They were snatched away before their time, and their foundations were swept away by a flood. / They said to God, ‘Depart from us. What can the Almighty do to us?’"
        },
        {
          "reference": "Ezekiel 14:14",
          "text": "then even if these three men—Noah, Daniel, and Job—were in it, their righteousness could deliver only themselves, declares the Lord GOD."
        },
        {
          "reference": "Ezekiel 14:20",
          "text": "then as surely as I live, declares the Lord GOD, even if Noah, Daniel, and Job were in it, they could not deliver their own sons or daughters. Their righteousness could deliver only themselves."
        },
        {
          "reference": "1 Chronicles 1:4",
          "text": "The sons of Noah: Shem, Ham, and Japheth."
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        },
        {
          "reference": "2 Peter 3:6",
          "text": "through which the world of that time perished in the flood."
        },
        {
          "reference": "Romans 1:20",
          "text": "For since the creation of the world God’s invisible qualities, His eternal power and divine nature, have been clearly seen, being understood from His workmanship, so that men are without excuse."
        },
        {
          "reference": "Psalm 29:10",
          "text": "The LORD sits enthroned over the flood; the LORD is enthroned as King forever."
        }
      ]
    },
    {
      "reference": "Genesis 6:15",
      "book": "Genesis",
      "chapter": 6,
      "verse": 15,
      "translations": [
        {
          "version": "NIV",
          "text": "This is how you are to build it: The ark is to be three hundred cubits long, fifty cubits wide and thirty cubits high."
        },
        {
          "version": "NLT",
          "text": "Make the boat 450 feet long, 75 feet wide, and 45 feet high."
        },
        {
          "version": "ESV",
          "text": "This is how you are to make it: the length of the ark 300 cubits, its breadth 50 cubits, and its height 30 cubits."
        },
        {
          "version": "NKJV",
          "text": "And this is how you shall make it: The length of the ark shall be three hundred cubits, its width fifty cubits, and its height thirty cubits."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        },
        {
          "reference": "Job 22:15-17",
          "text": "Will you stay on the ancient path that wicked men have trod? / They were snatched away before their time, and their foundations were swept away by a flood. / They said to God, ‘Depart from us. What can the Almighty do to us?’"
        },
        {
          "reference": "Ezekiel 14:14",
          "text": "then even if these three men—Noah, Daniel, and Job—were in it, their righteousness could deliver only themselves, declares the Lord GOD."
        },
        {
          "reference": "Ezekiel 14:20",
          "text": "then as surely as I live, declares the Lord GOD, even if Noah, Daniel, and Job were in it, they could not deliver their own sons or daughters. Their righteousness could deliver only themselves."
        },
        {
          "reference": "1 Chronicles 22:15-16",
          "text": "You also have many workers: stonecutters, masons, carpenters, and men skilled in every kind of work— / in gold and silver, bronze and iron—craftsmen beyond number. Now begin the work, and may the LORD be with you.”"
        },
        {
          "reference": "Exodus 25:10-11",
          "text": "And they are to construct an ark of acacia wood, two and a half cubits long, a cubit and a half wide, and a cubit and a half high. / Overlay it with pure gold both inside and out, and make a gold molding around it."
        },
        {
          "reference": "Exodus 37:1-2",
          "text": "Bezalel went on to construct the ark of acacia wood, two and a half cubits long, a cubit and a half wide, and a cubit and a half high. / He overlaid it with pure gold, both inside and out, and made a gold molding around it."
        },
        {
          "reference": "1 Kings 6:2",
          "text": "The house that King Solomon built for the LORD was sixty cubits long, twenty cubits wide, and thirty cubits high."
        },
        {
          "reference": "1 Kings 6:19-20",
          "text": "Solomon also prepared the inner sanctuary within the temple to set the ark of the covenant of the LORD there. / The inner sanctuary was twenty cubits long, twenty cubits wide, and twenty cubits high. He overlaid the inside with pure gold, and he also overlaid the altar of cedar."
        },
        {
          "reference": "1 Kings 6:23-28",
          "text": "In the inner sanctuary he made two cherubim, each ten cubits high, out of olive wood. / One wing of the first cherub was five cubits long, and the other wing was five cubits long as well. So the full wingspan was ten cubits. / The second cherub also measured ten cubits; both cherubim had the same size and shape, ..."
        }
      ]
    },
    {
      "reference": "Genesis 6:16",
      "book": "Genesis",
      "chapter": 6,
      "verse": 16,
      "translations": [
        {
          "version": "NIV",
          "text": "Make a roof for it, leaving below the roof an opening one cubit high all around. Put a door in the side of the ark and make lower, middle and upper decks."
        },
        {
          "version": "NLT",
          "text": "Leave an 18-inch opening below the roof all the way around the boat. Put the door on the side, and build three decks inside the boat—lower, middle, and upper."
        },
        {
          "version": "ESV",
          "text": "Make a roof for the ark, and finish it to a cubit above, and set the door of the ark in its side. Make it with lower, second, and third decks."
        },
        {
          "version": "NKJV",
          "text": "You shall make a window for the ark, and you shall finish it to a cubit from above; and set the door of the ark in its side. You shall make it with lower, second, and third decks."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 25:8-9",
          "text": "And they are to make a sanctuary for Me, so that I may dwell among them. / You must make the tabernacle and design all its furnishings according to the pattern I show you."
        },
        {
          "reference": "Exodus 26:33",
          "text": "And hang the veil from the clasps and place the ark of the Testimony behind the veil. So the veil will separate the Holy Place from the Most Holy Place."
        },
        {
          "reference": "1 Kings 6:16",
          "text": "He partitioned off the twenty cubits at the rear of the temple with cedar boards from floor to ceiling to form within the temple an inner sanctuary, the Most Holy Place."
        },
        {
          "reference": "Ezekiel 41:16",
          "text": "as well as the thresholds and the beveled windows and the galleries all around with their three levels opposite the threshold, were overlaid with wood on all sides. They were paneled from the ground to the windows, and the windows were covered."
        },
        {
          "reference": "Ezekiel 42:3",
          "text": "Gallery faced gallery in three levels opposite the twenty cubits that belonged to the inner court and opposite the pavement that belonged to the outer court."
        },
        {
          "reference": "Hebrews 9:2-5",
          "text": "A tabernacle was prepared. In its first room were the lampstand, the table, and the consecrated bread. This was called the Holy Place. / Behind the second curtain was a room called the Most Holy Place, / containing the golden altar of incense and the gold-covered ark of the covenant. Inside the ark were the gold jar of manna, Aaron’s staff that had budded, and the stone tablets of the covenant. ..."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Matthew 24:38-39",
          "text": "For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "Revelation 21:12-13",
          "text": "The city had a great and high wall with twelve gates inscribed with the names of the twelve tribes of Israel, and twelve angels at the gates. / There were three gates on the east, three on the north, three on the south, and three on the west."
        },
        {
          "reference": "Revelation 21:21",
          "text": "And the twelve gates were twelve pearls, with each gate consisting of a single pearl. The main street of the city was pure gold, as clear as glass."
        },
        {
          "reference": "Exodus 27:21",
          "text": "In the Tent of Meeting, outside the veil that is in front of the Testimony, Aaron and his sons are to tend the lamps before the LORD from evening until morning. This is to be a permanent statute for the Israelites for the generations to come."
        },
        {
          "reference": "Exodus 40:3",
          "text": "Put the ark of the Testimony in it and screen off the ark with the veil."
        }
      ]
    },
    {
      "reference": "Genesis 6:17",
      "book": "Genesis",
      "chapter": 6,
      "verse": 17,
      "translations": [
        {
          "version": "NIV",
          "text": "I am going to bring floodwaters on the earth to destroy all life under the heavens, every creature that has the breath of life in it. Everything on earth will perish."
        },
        {
          "version": "NLT",
          "text": "“Look! I am about to cover the earth with a flood that will destroy every living thing that breathes. Everything on earth will die."
        },
        {
          "version": "ESV",
          "text": "For behold, I will bring a flood of waters upon the earth to destroy all flesh in which is the breath of life under heaven. Everything that is on the earth shall die."
        },
        {
          "version": "NKJV",
          "text": "And behold, I Myself am bringing floodwaters on the earth, to destroy from under heaven all flesh in which is the breath of life; everything that is on the earth shall die."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "2 Peter 3:6",
          "text": "through which the world of that time perished in the flood."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        },
        {
          "reference": "Job 22:15-17",
          "text": "Will you stay on the ancient path that wicked men have trod? / They were snatched away before their time, and their foundations were swept away by a flood. / They said to God, ‘Depart from us. What can the Almighty do to us?’"
        },
        {
          "reference": "Ezekiel 14:14",
          "text": "then even if these three men—Noah, Daniel, and Job—were in it, their righteousness could deliver only themselves, declares the Lord GOD."
        },
        {
          "reference": "1 Corinthians 10:1-2",
          "text": "I do not want you to be unaware, brothers, that our forefathers were all under the cloud, and that they all passed through the sea. / They were all baptized into Moses in the cloud and in the sea."
        },
        {
          "reference": "Romans 5:12-14",
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so also death was passed on to all men, because all sinned. / For sin was in the world before the law was given; but sin is not taken into account when there is no law. / Nevertheless, death reigned from Adam until Moses, even over those who did not sin in the way that Adam transgressed. He is a pattern of the One to come."
        },
        {
          "reference": "Psalm 29:10",
          "text": "The LORD sits enthroned over the flood; the LORD is enthroned as King forever."
        },
        {
          "reference": "Isaiah 24:18",
          "text": "Whoever flees the sound of panic will fall into the pit, and whoever climbs from the pit will be caught in the snare. For the windows of heaven are open, and the foundations of the earth are shaken."
        },
        {
          "reference": "Amos 9:6",
          "text": "He builds His upper rooms in the heavens and founds His vault upon the earth. He summons the waters of the sea and pours them over the face of the earth. The LORD is His name."
        },
        {
          "reference": "Revelation 11:19",
          "text": "Then the temple of God in heaven was opened, and the ark of His covenant appeared in His temple. And there were flashes of lightning, rumblings, peals of thunder, an earthquake, and a great hailstorm."
        }
      ]
    },
    {
      "reference": "Genesis 6:18",
      "book": "Genesis",
      "chapter": 6,
      "verse": 18,
      "translations": [
        {
          "version": "NIV",
          "text": "But I will establish my covenant with you, and you will enter the ark—you and your sons and your wife and your sons’ wives with you."
        },
        {
          "version": "NLT",
          "text": "But I will confirm my covenant with you. So enter the boat—you and your wife and your sons and their wives."
        },
        {
          "version": "ESV",
          "text": "But I will establish my covenant with you, and you shall come into the ark, you, your sons, your wife, and your sons’ wives with you."
        },
        {
          "version": "NKJV",
          "text": "But I will establish My covenant with you; and you shall go into the ark—you, your sons, your wife, and your sons’ wives with you."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Genesis 9:9-11",
          "text": "“Behold, I now establish My covenant with you and your descendants after you, / and with every living creature that was with you—the birds, the livestock, and every beast of the earth—every living thing that came out of the ark. / And I establish My covenant with you: Never again will all life be cut off by the waters of a flood; never again will there be a flood to destroy the earth.”"
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "Romans 4:13",
          "text": "For the promise to Abraham and his offspring that he would be heir of the world was not given through the law, but through the righteousness that comes by faith."
        },
        {
          "reference": "Exodus 6:4",
          "text": "I also established My covenant with them to give them the land of Canaan, the land where they lived as foreigners."
        },
        {
          "reference": "Genesis 17:7",
          "text": "I will establish My covenant as an everlasting covenant between Me and you and your descendants after you, to be your God and the God of your descendants after you."
        },
        {
          "reference": "Genesis 17:19",
          "text": "But God replied, “Your wife Sarah will indeed bear you a son, and you are to name him Isaac. I will establish My covenant with him as an everlasting covenant for his descendants after him."
        },
        {
          "reference": "Genesis 9:12-17",
          "text": "And God said, “This is the sign of the covenant I am making between Me and you and every living creature with you, a covenant for all generations to come: / I have set My rainbow in the clouds, and it will be a sign of the covenant between Me and the earth. / Whenever I form clouds over the earth and the rainbow appears in the clouds, ..."
        },
        {
          "reference": "Genesis 15:18",
          "text": "On that day the LORD made a covenant with Abram, saying, “To your descendants I have given this land—from the river of Egypt to the great River Euphrates—"
        },
        {
          "reference": "Genesis 17:21",
          "text": "But I will establish My covenant with Isaac, whom Sarah will bear to you at this time next year.”"
        },
        {
          "reference": "Genesis 22:16-18",
          "text": "saying, “By Myself I have sworn, declares the LORD, that because you have done this and have not withheld your only son, / I will surely bless you, and I will multiply your descendants like the stars in the sky and the sand on the seashore. Your descendants will possess the gates of their enemies. / And through your offspring all nations of the earth will be blessed, because you have obeyed My voice.”"
        }
      ]
    },
    {
      "reference": "Genesis 6:19",
      "book": "Genesis",
      "chapter": 6,
      "verse": 19,
      "translations": [
        {
          "version": "NIV",
          "text": "You are to bring into the ark two of all living creatures, male and female, to keep them alive with you."
        },
        {
          "version": "NLT",
          "text": "Bring a pair of every kind of animal—a male and a female—into the boat with you to keep them alive during the flood."
        },
        {
          "version": "ESV",
          "text": "And of every living thing of all flesh, you shall bring two of every sort into the ark to keep them alive with you. They shall be male and female."
        },
        {
          "version": "NKJV",
          "text": "And of every living thing of all flesh you shall bring two of every sort into the ark, to keep them alive with you; they shall be male and female."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 7:2-3",
          "text": "You are to take with you seven pairs of every kind of clean animal, a male and its mate; a pair of every kind of unclean animal, a male and its mate; / and seven pairs of every kind of bird of the air, male and female, to preserve their offspring on the face of all the earth."
        },
        {
          "reference": "Genesis 7:8-9",
          "text": "The clean and unclean animals, the birds, and everything that crawls along the ground / came to Noah to enter the ark, two by two, male and female, as God had commanded Noah."
        },
        {
          "reference": "Genesis 7:15-16",
          "text": "They came to Noah to enter the ark, two by two of every creature with the breath of life. / And they entered, the male and female of every living thing, as God had commanded Noah. Then the LORD shut him in."
        },
        {
          "reference": "Genesis 8:17",
          "text": "Bring out all the living creatures that are with you—birds, livestock, and everything that crawls upon the ground—so that they can spread out over the earth and be fruitful and multiply upon it.”"
        },
        {
          "reference": "Genesis 9:1-2",
          "text": "And God blessed Noah and his sons and said to them, “Be fruitful and multiply and fill the earth. / The fear and dread of you will fall on every living creature on the earth, every bird of the air, every creature that crawls on the ground, and all the fish of the sea. They are delivered into your hand."
        },
        {
          "reference": "Genesis 1:20-22",
          "text": "And God said, “Let the waters teem with living creatures, and let birds fly above the earth in the open expanse of the sky.” / So God created the great sea creatures and every living thing that moves, with which the waters teemed according to their kinds, and every winged bird after its kind. And God saw that it was good. / Then God blessed them and said, “Be fruitful and multiply and fill the waters of the seas, and let birds multiply on the earth.”"
        },
        {
          "reference": "Genesis 1:24-25",
          "text": "And God said, “Let the earth bring forth living creatures according to their kinds: livestock, land crawlers, and beasts of the earth according to their kinds.” And it was so. / God made the beasts of the earth according to their kinds, the livestock according to their kinds, and everything that crawls upon the earth according to its kind. And God saw that it was good."
        },
        {
          "reference": "Genesis 2:19-20",
          "text": "And out of the ground the LORD God formed every beast of the field and every bird of the air, and He brought them to the man to see what he would name each one. And whatever the man called each living creature, that was its name. / The man gave names to all the livestock, to the birds of the air, and to every beast of the field. But for Adam no suitable helper was found."
        },
        {
          "reference": "Genesis 9:10",
          "text": "and with every living creature that was with you—the birds, the livestock, and every beast of the earth—every living thing that came out of the ark."
        },
        {
          "reference": "Genesis 9:12-13",
          "text": "And God said, “This is the sign of the covenant I am making between Me and you and every living creature with you, a covenant for all generations to come: / I have set My rainbow in the clouds, and it will be a sign of the covenant between Me and the earth."
        },
        {
          "reference": "Isaiah 54:9",
          "text": "“For to Me this is like the days of Noah, when I swore that the waters of Noah would never again cover the earth. So I have sworn that I will not be angry with you or rebuke you."
        },
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        }
      ]
    },
    {
      "reference": "Genesis 6:20",
      "book": "Genesis",
      "chapter": 6,
      "verse": 20,
      "translations": [
        {
          "version": "NIV",
          "text": "Two of every kind of bird, of every kind of animal and of every kind of creature that moves along the ground will come to you to be kept alive."
        },
        {
          "version": "NLT",
          "text": "Pairs of every kind of bird, and every kind of animal, and every kind of small animal that scurries along the ground, will come to you to be kept alive."
        },
        {
          "version": "ESV",
          "text": "Of the birds according to their kinds, and of the animals according to their kinds, of every creeping thing of the ground, according to its kind, two of every sort shall come in to you to keep them alive."
        },
        {
          "version": "NKJV",
          "text": "Of the birds after their kind, of animals after their kind, and of every creeping thing of the earth after its kind, two of every kind will come to you to keep them alive."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Genesis 7:14-16",
          "text": "they and every kind of wild animal, livestock, crawling creature, bird, and winged creature. / They came to Noah to enter the ark, two by two of every creature with the breath of life. / And they entered, the male and female of every living thing, as God had commanded Noah. Then the LORD shut him in."
        },
        {
          "reference": "Genesis 1:24-25",
          "text": "And God said, “Let the earth bring forth living creatures according to their kinds: livestock, land crawlers, and beasts of the earth according to their kinds.” And it was so. / God made the beasts of the earth according to their kinds, the livestock according to their kinds, and everything that crawls upon the earth according to its kind. And God saw that it was good."
        },
        {
          "reference": "Genesis 2:19-20",
          "text": "And out of the ground the LORD God formed every beast of the field and every bird of the air, and He brought them to the man to see what he would name each one. And whatever the man called each living creature, that was its name. / The man gave names to all the livestock, to the birds of the air, and to every beast of the field. But for Adam no suitable helper was found."
        },
        {
          "reference": "Genesis 7:2-3",
          "text": "You are to take with you seven pairs of every kind of clean animal, a male and its mate; a pair of every kind of unclean animal, a male and its mate; / and seven pairs of every kind of bird of the air, male and female, to preserve their offspring on the face of all the earth."
        },
        {
          "reference": "Genesis 8:17-19",
          "text": "Bring out all the living creatures that are with you—birds, livestock, and everything that crawls upon the ground—so that they can spread out over the earth and be fruitful and multiply upon it.” / So Noah came out, along with his sons and his wife and his sons’ wives. / Every living creature, every creeping thing, and every bird—everything that moves upon the earth—came out of the ark, kind by kind."
        },
        {
          "reference": "Leviticus 11:14-19",
          "text": "the kite, any kind of falcon, / any kind of raven, / the ostrich, the screech owl, the gull, any kind of hawk, ..."
        },
        {
          "reference": "Job 12:7-10",
          "text": "But ask the animals, and they will instruct you; ask the birds of the air, and they will tell you. / Or speak to the earth, and it will teach you; let the fish of the sea inform you. / Which of all these does not know that the hand of the LORD has done this? ..."
        },
        {
          "reference": "Psalm 50:10-11",
          "text": "for every beast of the forest is Mine—the cattle on a thousand hills. / I know every bird in the mountains, and the creatures of the field are Mine."
        },
        {
          "reference": "Psalm 104:24-25",
          "text": "How many are Your works, O LORD! In wisdom You have made them all; the earth is full of Your creatures. / Here is the sea, vast and wide, teeming with creatures beyond number, living things both great and small."
        },
        {
          "reference": "Isaiah 11:6-9",
          "text": "The wolf will live with the lamb, and the leopard will lie down with the goat; the calf and young lion and fatling will be together, and a little child will lead them. / The cow will graze with the bear, their young will lie down together, and the lion will eat straw like the ox. / The infant will play by the cobra’s den, and the toddler will reach into the viper’s nest. ..."
        },
        {
          "reference": "Jeremiah 8:7",
          "text": "Even the stork in the sky knows her appointed seasons. The turtledove, the swift, and the thrush keep their time of migration, but My people do not know the requirements of the LORD."
        },
        {
          "reference": "Ezekiel 47:9",
          "text": "Wherever the river flows, there will be swarms of living creatures and a great number of fish, because it flows there and makes the waters fresh; so wherever the river flows, everything will flourish."
        },
        {
          "reference": "Matthew 6:26",
          "text": "Look at the birds of the air: They do not sow or reap or gather into barns, and yet your heavenly Father feeds them. Are you not much more valuable than they?"
        },
        {
          "reference": "Matthew 10:29-31",
          "text": "Are not two sparrows sold for a penny? Yet not one of them will fall to the ground apart from the will of your Father. / And even the very hairs of your head are all numbered. / So do not be afraid; you are worth more than many sparrows."
        },
        {
          "reference": "Luke 12:24",
          "text": "Consider the ravens: They do not sow or reap, they have no storehouse or barn; yet God feeds them. How much more valuable you are than the birds!"
        }
      ]
    },
    {
      "reference": "Genesis 6:21",
      "book": "Genesis",
      "chapter": 6,
      "verse": 21,
      "translations": [
        {
          "version": "NIV",
          "text": "You are to take every kind of food that is to be eaten and store it away as food for you and for them.”"
        },
        {
          "version": "NLT",
          "text": "And be sure to take on board enough food for your family and for all the animals.”"
        },
        {
          "version": "ESV",
          "text": "Also take with you every sort of food that is eaten, and store it up. It shall serve as food for you and for them.”"
        },
        {
          "version": "NKJV",
          "text": "And you shall take for yourself of all food that is eaten, and you shall gather it to yourself; and it shall be food for you and for them.”"
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Exodus 16:4",
          "text": "Then the LORD said to Moses, “Behold, I will rain down bread from heaven for you. Each day the people are to go out and gather enough for that day. In this way I will test whether or not they will follow My instructions."
        },
        {
          "reference": "Exodus 12:39",
          "text": "Since their dough had no leaven, the people baked what they had brought out of Egypt into unleavened loaves. For when they had been driven out of Egypt, they could not delay and had not prepared any provisions for themselves."
        },
        {
          "reference": "Exodus 16:31-35",
          "text": "Now the house of Israel called the bread manna. It was white like coriander seed and tasted like wafers made with honey. / Moses said, “This is what the LORD has commanded: ‘Keep an omer of manna for the generations to come, so that they may see the bread I fed you in the wilderness when I brought you out of the land of Egypt.’” / So Moses told Aaron, “Take a jar and fill it with an omer of manna. Then place it before the LORD to be preserved for the generations to come.” ..."
        },
        {
          "reference": "Exodus 12:17",
          "text": "So you are to keep the Feast of Unleavened Bread, for on this very day I brought your divisions out of the land of Egypt. You must keep this day as a permanent statute for the generations to come."
        },
        {
          "reference": "Exodus 16:23",
          "text": "He told them, “This is what the LORD has said: ‘Tomorrow is to be a day of complete rest, a holy Sabbath to the LORD. So bake what you want to bake, and boil what you want to boil. Then set aside whatever remains and keep it until morning.’”"
        },
        {
          "reference": "Exodus 12:24-25",
          "text": "And you are to keep this command as a permanent statute for you and your descendants. / When you enter the land that the LORD will give you as He promised, you are to keep this service."
        },
        {
          "reference": "Exodus 16:32-34",
          "text": "Moses said, “This is what the LORD has commanded: ‘Keep an omer of manna for the generations to come, so that they may see the bread I fed you in the wilderness when I brought you out of the land of Egypt.’” / So Moses told Aaron, “Take a jar and fill it with an omer of manna. Then place it before the LORD to be preserved for the generations to come.” / And Aaron placed it in front of the Testimony, to be preserved just as the LORD had commanded Moses."
        },
        {
          "reference": "Exodus 12:3-4",
          "text": "Tell the whole congregation of Israel that on the tenth day of this month each man must select a lamb for his family, one per household. / If the household is too small for a whole lamb, they are to share with the nearest neighbor based on the number of people, and apportion the lamb accordingly."
        },
        {
          "reference": "Exodus 16:19-20",
          "text": "Then Moses said to them, “No one may keep any of it until morning.” / But they did not listen to Moses; some people left part of it until morning, and it became infested with maggots and began to smell. So Moses was angry with them."
        },
        {
          "reference": "Exodus 12:8-10",
          "text": "They are to eat the meat that night, roasted over the fire, along with unleavened bread and bitter herbs. / Do not eat any of the meat raw or cooked in boiling water, but only roasted over the fire—its head and legs and inner parts. / Do not leave any of it until morning; before the morning you must burn up any part that is left over."
        },
        {
          "reference": "Matthew 6:11",
          "text": "Give us this day our daily bread."
        },
        {
          "reference": "Matthew 6:25-26",
          "text": "Therefore I tell you, do not worry about your life, what you will eat or drink; or about your body, what you will wear. Is not life more than food, and the body more than clothes? / Look at the birds of the air: They do not sow or reap or gather into barns, and yet your heavenly Father feeds them. Are you not much more valuable than they?"
        },
        {
          "reference": "Matthew 6:31-32",
          "text": "Therefore do not worry, saying, ‘What shall we eat?’ or ‘What shall we drink?’ or ‘What shall we wear?’ / For the Gentiles strive after all these things, and your heavenly Father knows that you need them."
        },
        {
          "reference": "Matthew 4:4",
          "text": "But Jesus answered, “It is written: ‘Man shall not live on bread alone, but on every word that comes from the mouth of God.’”"
        },
        {
          "reference": "Matthew 6:19-21",
          "text": "Do not store up for yourselves treasures on earth, where moth and rust destroy, and where thieves break in and steal. / But store up for yourselves treasures in heaven, where moth and rust do not destroy, and where thieves do not break in and steal. / For where your treasure is, there your heart will be also."
        }
      ]
    },
    {
      "reference": "Genesis 6:22",
      "book": "Genesis",
      "chapter": 6,
      "verse": 22,
      "translations": [
        {
          "version": "NIV",
          "text": "Noah did everything just as God commanded him."
        },
        {
          "version": "NLT",
          "text": "So Noah did everything exactly as God had commanded him."
        },
        {
          "version": "ESV",
          "text": "Noah did this; he did all that God commanded him."
        },
        {
          "version": "NKJV",
          "text": "Thus Noah did; according to all that God commanded him, so he did."
        }
      ],
      "greek_words": [],
      "cross_references": [
        {
          "reference": "Hebrews 11:7",
          "text": "By faith Noah, when warned about things not yet seen, in godly fear built an ark to save his family. By faith he condemned the world and became heir of the righteousness that comes by faith."
        },
        {
          "reference": "1 Peter 3:20",
          "text": "who disobeyed long ago when God waited patiently in the days of Noah while the ark was being built. In the ark a few people, only eight souls, were saved through water."
        },
        {
          "reference": "Matthew 24:37-39",
          "text": "As it was in the days of Noah, so will it be at the coming of the Son of Man. / For in the days before the flood, people were eating and drinking, marrying and giving in marriage, up to the day Noah entered the ark. / And they were oblivious until the flood came and swept them all away. So will it be at the coming of the Son of Man."
        },
        {
          "reference": "Luke 17:26-27",
          "text": "Just as it was in the days of Noah, so also will it be in the days of the Son of Man: / People were eating and drinking, marrying and being given in marriage, up to the day Noah entered the ark. Then the flood came and destroyed them all."
        },
        {
          "reference": "2 Peter 2:5",
          "text": "if He did not spare the ancient world when He brought the flood on its ungodly people, but preserved Noah, a preacher of righteousness, among the eight;"
        },
        {
          "reference": "Genesis 7:5",
          "text": "And Noah did all that the LORD had commanded him."
        },
        {
          "reference": "Genesis 7:9",
          "text": "came to Noah to enter the ark, two by two, male and female, as God had commanded Noah."
        },
        {
          "reference": "Genesis 7:16",
          "text": "And they entered, the male and female of every living thing, as God had commanded Noah. Then the LORD shut him in."
        },
        {
          "reference": "Exodus 40:16",
          "text": "Moses did everything just as the LORD had commanded him."
        },
        {
          "reference": "Numbers 12:7",
          "text": "But this is not so with My servant Moses; he is faithful in all My house."
        },
        {
          "reference": "Joshua 11:15",
          "text": "As the LORD had commanded His servant Moses, so Moses commanded Joshua. That is what Joshua did, leaving nothing undone of all that the LORD had commanded Moses."
        },
        {
          "reference": "1 Chronicles 22:13",
          "text": "Then you will succeed, if you carefully follow the statutes and ordinances that the LORD commanded Moses for Israel. Be strong and courageous. Do not be afraid or discouraged."
        },
        {
          "reference": "2 Chronicles 31:21",
          "text": "He acted with all his heart in every work that he began in the service of the house of God, and in the law and the commandments, in order to seek his God. And so he prospered."
        },
        {
          "reference": "Nehemiah 9:8",
          "text": "You found his heart faithful before You, and made a covenant with him to give the land of the Canaanites and Hittites, of the Amorites and Perizzites, of the Jebusites and Girgashites—to give it to his descendants. You have kept Your promise, because You are righteous."
        },
        {
          "reference": "Psalm 119:4",
          "text": "You have ordained Your precepts, that we should keep them diligently."
        }
      ]
    }
  ]
}